[
    {
        "id": 2505,
        "title": "Exploring Deep Learning Capabilities for Coastal Image Segmentation on Edge Devices",
        "authors": "Jonay Suárez-Ramírez, Alejandro Betancor-Del-Rosario, Daniel Santana-Cedrés, Nelson Monzón",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011615400003417"
    },
    {
        "id": 2506,
        "title": "Deep learning for edge devices",
        "authors": "Luiz Zaniolo, Christian Garbin, Oge Marques",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mpot.2022.3182519"
    },
    {
        "id": 2507,
        "title": "Deep Learning Model Compression for Resource Efficient Activity Recognition on Edge Devices: A Case Study",
        "authors": "Dieter Balemans, Benjamin Vandersmissen, Jan Steckel, Siegfried Mercelis, Phil Reiter, José Oramas",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012423300003660"
    },
    {
        "id": 2508,
        "title": "UAV 5G: enabled wireless communications using enhanced deep learning for edge devices",
        "authors": "Derong Tang, Qianbin Zhang",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11276-023-03589-x"
    },
    {
        "id": 2509,
        "title": "A fully automated framework for accelerating Deep Learning deployment for edge devices",
        "authors": "Federico Fontana, Francesco Tosetti, Mattia Varile",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/edhpc59100.2023.10395949"
    },
    {
        "id": 2510,
        "title": "Deep reinforcement learning-based pairwise DNA sequence alignment method compatible with embedded edge devices",
        "authors": "Aryan Lall, Siddharth Tallur",
        "published": "2023-2-16",
        "citations": 6,
        "abstract": "AbstractSequence alignment is an essential component of bioinformatics, for identifying regions of similarity that may indicate functional, structural, or evolutionary relationships between the sequences. Genome-based diagnostics relying on DNA sequencing have benefited hugely from the boom in computing power in recent decades, particularly due to cloud-computing and the rise of graphics processing units (GPUs) and other advanced computing platforms for running advanced algorithms. Translating the success of such breakthroughs in diagnostics to affordable solutions for low-cost healthcare requires development of algorithms that can operate on the edge instead of in the cloud, using low-cost and low-power electronic systems such as microcontrollers and field programmable gate arrays (FPGAs). In this work, we present EdgeAlign, a deep reinforcement learning based method for performing pairwise DNA sequence alignment on stand-alone edge devices. EdgeAlign uses deep reinforcement learning to train a deep Q-network (DQN) agent for performing sequence alignment on fixed length sub-sequences, using a sliding window that is scanned over the length of the entire sequence. The hardware resource-consumption for implementing this scheme is thus independent of the lengths of the sequences to be aligned, and is further optimized using a novel AutoML based method for neural network model size reduction. Unlike other algorithms for sequence alignment reported in literature, the model demonstrated in this work is highly compact and deployed on two edge devices (NVIDIA Jetson Nano Developer Kit and Digilent Arty A7-100T, containing Xilinx XC7A35T Artix-7 FPGA) for demonstration of alignment for sequences from the publicly available Influenza sequences at the National Center for Biotechnology Information (NCBI) Virus Data Hub.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-29277-6"
    },
    {
        "id": 2511,
        "title": "A Dynamic Deep Learning Ecosystem for Real-Time Cognitive Data Processing on Industrial Edge Devices",
        "authors": "Sidhant Das",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictbig59752.2023.10455984"
    },
    {
        "id": 2512,
        "title": "FedNets: Federated Learning on Edge Devices Using Ensembles of Pruned Deep Neural Networks",
        "authors": "Besher Alhalabi, Shadi Basurra, Mohamed Medhat Gaber",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3261266"
    },
    {
        "id": 2513,
        "title": "Applications of deep learning and artificial intelligence methods to smart edge devices and stereo cameras",
        "authors": "Cosmo Capodiferro, Mauro Mazzei",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/splitech58164.2023.10193298"
    },
    {
        "id": 2514,
        "title": "Optimizing data processing for edge-enabled IoT devices using deep learning based heterogeneous data clustering approach",
        "authors": "Majjari Sudhakar, Koteswara Rao Anne",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.101013"
    },
    {
        "id": 2515,
        "title": "Real-Time Mastitis Detection in Livestock using Deep Learning and Machine Learning Leveraging Edge Devices",
        "authors": "Kawshik Kumar Ghosh, Md. Fahim Ul Islam, Abrar Ahsan Efaz, Amitabha Chakrabarty, Shahriar Hossain",
        "published": "2023-5-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ismict58261.2023.10152110"
    },
    {
        "id": 2516,
        "title": "Efficient Hierarchical Federated Learning for Unlabeled Edge Devices",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/autml.2024.050103"
    },
    {
        "id": 2517,
        "title": "Hybrid Lightweight Deep Learning-Based Error Detection Model on Edge Computing Devices",
        "authors": "Arman Aghaei Attar, Tagir Fabarisov, Andrey Morozov, Maurice Artelt, Ilshat Mamaev",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/etfa54631.2023.10275725"
    },
    {
        "id": 2518,
        "title": "Compensation Method of Quantized Deep Learning Models for Edge Devices",
        "authors": "Xiu-Zhi Chen, Jhen-Hao Li, Yen-Lin Chen, Chieh-Sheng Huang",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226977"
    },
    {
        "id": 2519,
        "title": "Deep Learning for Attack Detection in Industrial IoT Edge Devices",
        "authors": "Yatish S J, Viji Vinod, Soumitra Subodh Pande, V Lakshmi Narayana, Neerav Nishant, Sivagurunathan P T",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192890"
    },
    {
        "id": 2520,
        "title": "DeepEdgeSoC: End-to-end deep learning framework for edge IoT devices",
        "authors": "Mhd Rashed Al Koutayni, Gerd Reis, Didier Stricker",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iot.2022.100665"
    },
    {
        "id": 2521,
        "title": "Decentralized computation offloading via multi-agent deep reinforcement learning for NOMA-assisted mobile edge computing with energy harvesting devices",
        "authors": "Atousa Daghayeghi, Mohsen Nickray",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sysarc.2024.103139"
    },
    {
        "id": 2522,
        "title": "Deep Learning Based Intrusion Detection for Internet of Things and Edge Devices",
        "authors": "Mohamad Moawad, Vong Wan Tze, Patrick Then Hang Hui, Jason Yong Hsien Ming",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csde59766.2023.10487146"
    },
    {
        "id": 2523,
        "title": "Quantitative comparison and performance evaluation of deep learning-based object detection models on edge computing devices",
        "authors": "Darío G. Lema, Rubén Usamentiaga, Daniel F. García",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.vlsi.2023.102127"
    },
    {
        "id": 2524,
        "title": "Deep Reinforcement Learning (DRL) based data analytics framework for Edge based IoT devices latency and resource optimization",
        "authors": "Sudhakar Majjari, Koteswara Rao Anne, Joseph George",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access57397.2023.10200511"
    },
    {
        "id": 2525,
        "title": "Detection of Acrimonious Attacks using Deep Learning Techniques and Edge Computing Devices",
        "authors": "Pradeep Kumar, Cheng-Yang Li, Bo-Lin Guo, Yibeltal Chanie Manie, Chen-Kai Yao, Peng-Chun Peng",
        "published": "2023-7-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226915"
    },
    {
        "id": 2526,
        "title": "Deep Learning-Based Classification of Wheat Leaf Diseases for Edge Devices",
        "authors": "Aqeel Ahmed Khan, Sabtain Raza, Muhammad Farrukh Qureshi, Zohaib Mushtaq, Muhammad Taha, Faisal Amin",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/etecte59617.2023.10396676"
    },
    {
        "id": 2527,
        "title": "Lightweight and Energy-Efficient Deep Learning Accelerator for Real-Time Object Detection on Edge Devices",
        "authors": "Kyungho Kim, Sung-Joon Jang, Jonghee Park, Eunchong Lee, Sang-Seol Lee",
        "published": "2023-1-20",
        "citations": 3,
        "abstract": "Tiny machine learning (TinyML) has become an emerging field according to the rapid growth in the area of the internet of things (IoT). However, most deep learning algorithms are too complex, require a lot of memory to store data, and consume an enormous amount of energy for calculation/data movement; therefore, the algorithms are not suitable for IoT devices such as various sensors and imaging systems. Furthermore, typical hardware accelerators cannot be embedded in these resource-constrained edge devices, and they are difficult to drive real-time inference processing as well. To perform the real-time processing on these battery-operated devices, deep learning models should be compact and hardware-optimized, and hardware accelerator designs also have to be lightweight and consume extremely low energy. Therefore, we present an optimized network model through model simplification and compression for the hardware to be implemented, and propose a hardware architecture for a lightweight and energy-efficient deep learning accelerator. The experimental results demonstrate that our optimized model successfully performs object detection, and the proposed hardware design achieves 1.25× and 4.27× smaller logic and BRAM size, respectively, and its energy consumption is approximately 10.37× lower than previous similar works with 43.95 fps as a real-time process under an operating frequency of 100 MHz on a Xilinx ZC702 FPGA.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031185"
    },
    {
        "id": 2528,
        "title": "Performance Analysis of Deep Learning Model-Compression Techniques for Audio Classification on Edge Devices",
        "authors": "Afsana Mou, Mariofanna Milanova",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "Audio classification using deep learning models, which is essential for applications like voice assistants and music analysis, faces challenges when deployed on edge devices due to their limited computational resources and memory. Achieving a balance between performance, efficiency, and accuracy is a significant obstacle to optimizing these models for such constrained environments. In this investigation, we evaluate diverse deep learning architectures, including Convolutional Neural Networks (CNN) and Long Short-Term Memory (LSTM), for audio classification tasks on the ESC 50, UrbanSound8k, and Audio Set datasets. Our empirical findings indicate that Mel spectrograms outperform raw audio data, attributing this enhancement to their synergistic alignment with advanced image classification algorithms and their congruence with human auditory perception. To address the constraints of model size, we apply model-compression techniques, notably magnitude pruning, Taylor pruning, and 8-bit quantization. The research demonstrates that a hybrid pruned model achieves a commendable accuracy rate of 89 percent, which, although marginally lower than the 92 percent accuracy of the uncompressed CNN, strikingly illustrates an equilibrium between efficiency and performance. Subsequently, we deploy the optimized model on the Raspberry Pi 4 and NVIDIA Jetson Nano platforms for audio classification tasks. These findings highlight the significant potential of model-compression strategies in enabling effective deep learning applications on resource-limited devices, with minimal compromise on accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sci6020021"
    },
    {
        "id": 2529,
        "title": "Efficient Fire Detection with E-EFNet: A Lightweight Deep Learning-Based Approach for Edge Devices",
        "authors": "Haleem Farman, Moustafa M. Nasralla, Sohaib Bin Altaf Khattak, Bilal Jan",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "Fire detection employing vision sensors has drawn significant attention within the computer vision community, primarily due to its practicality and utility. Previous research predominantly relied on basic color features, a methodology that has since been surpassed by adopting deep learning models for enhanced accuracy. Nevertheless, the persistence of false alarms and increased computational demands remains challenging. Furthermore, contemporary feed-forward neural networks face difficulties stemming from their initialization and weight allocation processes, often resulting in vanishing-gradient issues that hinder convergence. This investigation recognizes the considerable challenges and introduces the cost-effective Encoded EfficientNet (E-EFNet) model. This model demonstrates exceptional proficiency in fire recognition while concurrently mitigating the incidence of false alarms. E-EFNet leverages the lightweight EfficientNetB0 as a foundational feature extractor, augmented by a series of stacked autoencoders for refined feature extraction before the final classification phase. In contrast to conventional linear connections, E-EFNet adopts dense connections, significantly enhancing its effectiveness in identifying fire-related scenes. We employ a randomized weight initialization strategy to mitigate the vexing problem of vanishing gradients and expedite convergence. Comprehensive evaluation against contemporary state-of-the-art benchmarks reaffirms E-EFNet’s superior recognition capabilities. The proposed model outperformed state-of-the-art approaches in accuracy over the Foggia and Yar datasets by achieving a higher accuracy of 0.31 and 0.40, respectively, and its adaptability for efficient inferencing on edge devices. Our study thoroughly assesses various deep models before ultimately selecting E-EFNet as the optimal solution for these pressing challenges in fire detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app132312941"
    },
    {
        "id": 2530,
        "title": "Trace-Based Performance Analysis for Deep Learning in Edge Container Environments",
        "authors": "Soyeon Park, Hyokyung Bahn",
        "published": "2023-9-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/fmec59375.2023.10306027"
    },
    {
        "id": 2531,
        "title": "Deep Reinforcement Learning Edge Workload Orchestrator for Vehicular Edge Computing",
        "authors": "Eliana Neuza Silva, Fernando Mira Da Silva",
        "published": "2023-6-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/netsoft57336.2023.10175484"
    },
    {
        "id": 2532,
        "title": "Distributed Deep Learning Based Framework to Optimize Real-Time Offloading in Mobile Edge Computing Networks",
        "authors": "Mourita Mozib",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr23603125305"
    },
    {
        "id": 2533,
        "title": "Deep Learning-Powered System for Real-Time Digital Meter Reading on Edge Devices",
        "authors": "Rafaela Carvalho, Jorge Melo, Ricardo Graça, Gonçalo Santos, Maria João M. Vasconcelos",
        "published": "2023-2-10",
        "citations": 4,
        "abstract": "The ongoing reading process of digital meters is time-consuming and prone to errors, as operators capture images and manually update the system with the new readings. This work proposes to automate this operation through a deep learning-powered solution for universal controllers and flow meters that can be seamlessly incorporated into operators’ existing workflow. Firstly, the digital display area of the equipment is extracted with a screen detection module, and a perspective correction step is performed. Subsequently, the text regions are identified with a fine-tuned EAST text detector, and the important readings are selected through template matching based on the expected graphical structure. Finally, a fine-tuned convolutional recurrent neural network model recognizes the text and registers it. Evaluation experiments confirm the robustness and potential for workload reduction of the proposed system, which correctly extracts 55.47% and 63.70% of the values for reading in universal controllers, and 73.08% of the values from flow meters. Furthermore, this pipeline performs in real time in a low-end mobile device, with an average execution time in preview of under 250 ms for screen detection and on an acquired photo of 1500 ms for the entire pipeline.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13042315"
    },
    {
        "id": 2534,
        "title": "A Heuristic Deep Q Learning for Offloading in Edge Devices in 5 g Networks",
        "authors": "YanRu Dong, Ahmed M. Alwakeel, Mohammed M. Alwakeel, Lubna A. Alharbi, Sara A Althubiti",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10723-023-09667-w"
    },
    {
        "id": 2535,
        "title": "Using Continual Learning on Edge Devices for Cost-Effective, Efficient License Plate Detection",
        "authors": "Reshawn Ramjattan, Rajeev Ratan, Shiva Ramoudith, Patrick Hosein, Daniele Mazzei",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011656300003417"
    },
    {
        "id": 2536,
        "title": "A Data and Model Parallelism based Distributed Deep Learning System in a Network of Edge Devices",
        "authors": "Tanmoy Sen, Haiying Shen",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccn58024.2023.10230190"
    },
    {
        "id": 2537,
        "title": "Optimizing Deep Learning Networks for Edge Devices with an Instance of Skin Cancer and Corn Leaf Disease Dataset",
        "authors": "B. S. Sharmila, H. S. Santhosh, S. Parameshwara, M. S. Swamy, Wahid Hussain Baig, S. V. Nanditha",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-02239-5"
    },
    {
        "id": 2538,
        "title": "Deep-Learning Based Super-Resolution of Aeolianite Images on the Purpose of Edge Detection and Pattern Extraction",
        "authors": "Antigoni Panagiotopoulou, Lemonia Ragia, Niki Evelpidou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012038600003473"
    },
    {
        "id": 2539,
        "title": "A Survey on Mobile Edge Computing for Deep Learning",
        "authors": "Pyeongjun Choi, Jeongho Kwak",
        "published": "2023-1-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoin56518.2023.10048953"
    },
    {
        "id": 2540,
        "title": "Lightning Talk: Efficient Embedded Machine Learning Deployment on Edge and IoT Devices",
        "authors": "Sudeep Pasricha",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dac56929.2023.10247845"
    },
    {
        "id": 2541,
        "title": "Research process on deep learning methods for heart sounds classification",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Cardiovascular diseases are still the primary threats to people’s health around the world. Automatic heart sound classification technology, as a fast and efficient means for diagnosis and treatment, is of great clinical significance. With the rapid development of artificial intelligence technology, deep learning algorithms are widely used in automatic heart sound classification. This paper reviewed the key technologies related to the automatic classification of heart sounds in recent years, including heart sound denoising, segmentation, feature extraction, and classification recognition. The classification and recognition technologies related to deep learning are presented in detail, with a focus on the application and development of convolutional neural network and recurrent neural network, as well as various combination models for heart sound classification in the past five years.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61189/473511cbaive"
    },
    {
        "id": 2542,
        "title": "Deep Learning Algorithms in Mobile Edge with Real-Time Abnormal Event Detection for 5G-IoT Devices",
        "authors": "J. Praveenchandar, S. Vinoth Kumar, A. Christopher Paul, M. A Mukunthan, K. Maharajan",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "IoT is becoming increasingly popular due to its quick expansion and variety of applications. In addition, 5G technology helps with communication and network connectivity. This work integrates C-RAN with IoT networks to provide an experimental 5G testbed. In a 5G IoT environment, this experience is utilized to enhance both perpendicular and flat localization (3D localization). DRCaG, an acronym for the proposed model, stands for a deep, complicated network with a gated layer on top. The performance of the proposed model has been demonstrated through extensive simulations in terms of learning reduction, accuracy, and matrix disorientation, with a variable signal-to-noise ratio (SNR) spanning from 20 dB to + 20 dB, which illustrates the superiority of DRCaG compared to others. An online, end-to-end solution based on deep learning techniques is presented in this study for the fast, precise, reliable, and automatic detection of diverse petty crime types. By detecting tiny crimes like hostility, bag snatching, and vandalism, the suggested system may not only identify unusual passenger behavior like vandalism and accidents but also improve passenger security. The solution performs admirably in a variety of use cases and environmental settings. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3991/ijim.v17i17.42805"
    },
    {
        "id": 2543,
        "title": "A deep-learning framework running on edge devices for handgun and knife detection from indoor video-surveillance cameras",
        "authors": "Daniele Berardini, Lucia Migliorelli, Alessandro Galdelli, Emanuele Frontoni, Adriano Mancini, Sara Moccia",
        "published": "2023-7-26",
        "citations": 3,
        "abstract": "AbstractThe early detection of handguns and knives from surveillance videos is crucial to enhance people’s safety. Despite the increasing development of Deep Learning (DL) methods for general object detection, weapon detection from surveillance videos still presents open challenges. Among these, the most significant are: (i) the very small size of the weapons with respect to the camera field of view and (ii) the need of a real-time feedback, even when using low-cost edge devices for computation. Complex and recently-developed DL architectures could mitigate the former challenge but do not satisfy the latter one. To tackle such limitation, the proposed work addresses the weapon-detection task from an edge perspective. A double-step DL approach was developed and evaluated against other state-of-the-art methods on a custom indoor surveillance dataset. The approach is based on a first Convolutional Neural Network (CNN) for people detection which guides a second CNN to identify handguns and knives. To evaluate the performance in a real-world indoor environment, the approach was deployed on a NVIDIA Jetson Nano edge device which was connected to an IP camera. The system achieved near real-time performance without relying on expensive hardware. The results in terms of both COCO Average Precision (AP = 79.30) and Frames per Second (FPS = 5.10) on the low-power NVIDIA Jetson Nano pointed out the goodness of the proposed approach compared with the others, encouraging the spread of automated video surveillance systems affordable to everyone.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16231-x"
    },
    {
        "id": 2544,
        "title": "Efficient Acceleration of Deep Learning Inference on Resource-Constrained Edge Devices: A Review",
        "authors": "Md. Maruf Hossain Shuvo, Syed Kamrul Islam, Jianlin Cheng, Bashir I. Morshed",
        "published": "2023-1",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jproc.2022.3226481"
    },
    {
        "id": 2545,
        "title": "Deep learning inference time guarantee in near future edge computing",
        "authors": "Kouichi Genda",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnc57223.2023.10074015"
    },
    {
        "id": 2546,
        "title": "Wildlife Species Classification on the Edge: A Deep Learning Perspective",
        "authors": "Subodh Ingaleshwar, Farid Thasharofi, Mateo Pava, Harshit Vaishya, Yazan Tabak, Juergen Ernst, Ruben Portas, Wanja Rast, Joerg Melzheimer, Ortwin Aschenborn, Theresa Goetz, Stephan Goeb",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012376700003636"
    },
    {
        "id": 2547,
        "title": "Research on Deep Learning Model and Optimization Algorithm in Edge Computing",
        "authors": "Xin Liu, Yue Zhang, Zenghai Wang, Jie Yang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00054"
    },
    {
        "id": 2548,
        "title": "A Hybrid Deep IoT Network-Driven Anomaly Detection using Multi-Scale Deep Representation Learning",
        "authors": "M.S. Minu, KolanuMallikarjun Reddy,  DouleNithishkumar,  AmbadasRithvikBhargav",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212368"
    },
    {
        "id": 2549,
        "title": "Deep reinforcement learning for energy-efficient edge caching in mobile edge networks",
        "authors": "Meng Deng, Zhou Huan, Jiang Kai, Zheng Hantong, Cao Yue, Chen Peng",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/jcc.ea.2022-0591.202401"
    },
    {
        "id": 2550,
        "title": "Edge Controller Based Deep Learning Deep Learning Framework for Data Driven View in 5G Cellular Network",
        "authors": "Praveetha Gopinathan, Anjali Appukuttan, Anne Anoop, Shermin Shamsudheen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijenm.2024.10055936"
    },
    {
        "id": 2551,
        "title": "Training A Deep Reinforcement Learning Agent for Microgrid Control using PSCAD Environment",
        "authors": "Arash Farokhi Soofi, Reza Bayani, Mehrdad Yazdanibiouki, Saeed D. Manshadi",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gridedge54130.2023.10102740"
    },
    {
        "id": 2552,
        "title": "Characterizing the Performance of Accelerated Jetson Edge Devices for Training Deep Learning Models",
        "authors": "Prashanthi S.K, Sai Anuroop Kesanapalli, Yogesh Simmhan",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Deep Neural Network (DNN) models are becoming ubiquitous in a variety of contemporary domains such as Autonomous Vehicles, Smart cities and Healthcare. They help drones to navigate, identify suspicious activities from safety cameras, and perform diagnostics over medical imaging. Fast DNN inferencing close to the data source is enabled by a growing class of accelerated edge devices such as NVIDIA Jetson and Google Coral which host low-power Graphics Processing Units (GPUs) and Tensor Processing Units (TPUs) along with ARM CPUs in a compact form-factor to offer a superior performance-to-energy ratio. E.g., the NVIDIA Jetson AGX Xavier kit has a 512-core Volta GPU, an 8-core ARM CPU and 32GB LPDDR4x memory, that operates within 65W of power, costs US999 and is smaller than a paperback novel.\nRecently, there has been a push towards training DNN models on the edge [2]. This is driven by the massive growth in data collected from edge devices in Cyber-Physical Systems (CPS) and Internet of Things (IoT), the need to refresh the models periodically, the bandwidth constraints in moving all this data to Cloud data centers for training, and a heightened emphasis on privacy by retaining data on the edge. This has led to techniques like federated and geo-distributed learning that train DNN models locally on data on an edge device and aggregate them centrally. In this abstract, we summarise and highlight key results from our full paper [5].",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3606376.3593530"
    },
    {
        "id": 2553,
        "title": "Edge device resource optimization (EDRO): evaluating the impact of reinforcement learning and deep reinforcement learning methods",
        "authors": "Rahul P, Hitaishi Roy, Sanglagna Khakhlary",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2024.0942"
    },
    {
        "id": 2554,
        "title": "Carriageway Edge Detection for Unmarked Urban Roads using Deep Learning Techniques",
        "authors": "Vasudha E, Bhargava Rama Chilukuri",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scsp58044.2023.10146209"
    },
    {
        "id": 2555,
        "title": "EdgePC: Efficient Deep Learning Analytics for Point Clouds on Edge Devices",
        "authors": "Ziyu Ying, Sandeepa Bhuyan, Yan Kang, Yingtian Zhang, Mahmut T. Kandemir, Chita R. Das",
        "published": "2023-6-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3579371.3589113"
    },
    {
        "id": 2556,
        "title": "DDoS-FOCUS: A Distributed DoS Attacks Mitigation using Deep Learning Approach for a Secure IoT Network",
        "authors": "Mohammed Al-Khafajiy, Ghaith Al-Tameemi, Thar Baker",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edge60047.2023.00062"
    },
    {
        "id": 2557,
        "title": "Deep Learning-Based Droplet Menisci Recognition for Digital Microfluidic Devices",
        "authors": "Negar Danesh, Matin Torabinia, Hyejin Moon",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sensors56945.2023.10324903"
    },
    {
        "id": 2558,
        "title": "Dynamic and Intelligent Edge Server Placement Based on Deep Reinforcement Learning in Mobile Edge Computing",
        "authors": "Xiaohan Jiang, Peng Hou, Hongbin Zhu, Bo Li, Zongshan Wang, Hongwei Ding",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4356514"
    },
    {
        "id": 2559,
        "title": "Joint Edge Association and Aggregation Frequency for Energy-Efficient Hierarchical Federated Learning by Deep Reinforcement Learning",
        "authors": "Yijing Ren, Changxiang Wu, Daniel K.C. So",
        "published": "2023-5-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10279332"
    },
    {
        "id": 2560,
        "title": "A Graph-Based Spatial-Temporal Deep Reinforcement Learning Model for Edge Caching",
        "authors": "Jiacheng Hou, Amiya Nayak",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10436966"
    },
    {
        "id": 2561,
        "title": "Energy-Efficient Machine Learning for IoT Edge Devices: A Federated Learning Approach",
        "authors": "Elena Rosemaro, Pragati Vijayakumar Pandit",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "In the realm of modern-day IoT (Internet of Things) deployments, the quest for energy-efficient solutions stands paramount for different use cases. As the IoT ecosystem continues to burgeon, there arises an exigency for resource-conscious algorithms that can effectively navigate the intricacies of data routing while minimizing energy consumption levels. This paper illuminates a pivotal advancement in this domain, introducing a novel paradigm for different scenarios. Existing methodologies have long grappled with the challenge of balancing the ever-increasing computational demands of IoT devices with their constrained power resources. Conventional routing strategies often lack the depth required to optimize energy consumption, resulting in inefficiencies that hamper overall system performance. Prior research has primarily focused on rudimentary routing techniques that fall short in addressing the multifaceted demands of contemporary IoT ecosystems. In response to these limitations, this paper propounds a breakthrough model that leverages the power of Deep Dyna Q integrated with a Long Short-Term Memory (LSTM) based Recurrent Neural Network (RNN). This fusion of cutting-edge technologies not only enhances energy efficiency but also ushers in a new era of intelligent data routing within IoT deployments. The chosen methodology is deliberate; Deep Dyna Q harnesses the power of reinforcement learning to dynamically adapt routing decisions, while the LSTM-based RNN augments the model's ability to capture contextual dependencies crucial in IoT scenarios. This synergy engenders superior energy optimization, transforming the way data is routed in IoT edge devices & samples. The results are resoundingly positive, with empirical evidence showcasing the model's prowess. Tested across multiple contextual datasets, our approach exhibits a remarkable 10.5% improvement in energy efficiency, a commendable 8.5% boost in speed, a 3.9% uptick in throughput, a 4.5% surge in packet delivery ratio, and a notable 4.9% enhancement in consistency when compared against existing methods. Such substantial improvements underscore the transformative impact of our work, setting new standards for energy-efficient data routing in IoT deployments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52710/rjcse.57"
    },
    {
        "id": 2562,
        "title": "Reaching for the Sky: Maximizing Deep Learning Inference Throughput on Edge Devices with AI Multi-Tenancy",
        "authors": "Jianwei Hao, Piyush Subedi, Lakshmish Ramaswamy, In Kee Kim",
        "published": "2023-2-28",
        "citations": 5,
        "abstract": "The wide adoption of smart devices and Internet-of-Things (IoT) sensors has led to massive growth in data generation at the edge of the Internet over the past decade. Intelligent real-time analysis of such a high volume of data, particularly leveraging highly accurate deep learning (DL) models, often requires the data to be processed as close to the data sources (or at the edge of the Internet) to minimize the network and processing latency. The advent of specialized, low-cost, and power-efficient edge devices has greatly facilitated DL inference tasks at the edge. However, limited research has been done to improve the inference throughput (e.g., number of inferences per second) by exploiting various system techniques. This study investigates system techniques, such as batched inferencing, AI multi-tenancy, and cluster of AI accelerators, which can significantly enhance the overall inference throughput on edge devices with DL models for image classification tasks. In particular, AI multi-tenancy enables collective utilization of edge devices’ system resources (CPU, GPU) and AI accelerators (e.g., Edge Tensor Processing Units; EdgeTPUs). The evaluation results show that batched inferencing results in more than 2.4× throughput improvement on devices equipped with high-performance GPUs like Jetson Xavier NX. Moreover, with multi-tenancy approaches, e.g., concurrent model executions (CME) and dynamic model placements (DMP), the DL inference throughput on edge devices (with GPUs) and EdgeTPU can be further improved by up to 3× and 10×, respectively. Furthermore, we present a detailed analysis of hardware and software factors that change the DL inference throughput on edge devices and EdgeTPUs, thereby shedding light on areas that could be further improved to achieve high-performance DL inference at the edge.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3546192"
    },
    {
        "id": 2563,
        "title": "Characterizing the Performance of Accelerated Jetson Edge Devices for Training Deep Learning Models",
        "authors": "Prashanthi S.K, Sai Anuroop Kesanapalli, Yogesh Simmhan",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3578338.3593530"
    },
    {
        "id": 2564,
        "title": "Convergence of Deep Learning and Edge Computing using Model Optimization",
        "authors": "Peyman Babaei",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mvip62238.2024.10491145"
    },
    {
        "id": 2565,
        "title": "Implementation of Machine Learning and Deep Learning for Securing the Devices in IOT Systems",
        "authors": "Salunkhe Madhav Jagannath,  , Rajendra B Mohite, Mukesh Kumar Gupta, Onkar S Lamba",
        "published": "2023-5-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i9.99"
    },
    {
        "id": 2566,
        "title": "Assessment of Human Blastocyst using Deep Learning Algorithm",
        "authors": "Malathi Eswaran, Balasubramanie P, Pradeepa V",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212175"
    },
    {
        "id": 2567,
        "title": "A Novel Deep Learning-Based Malware Detection Scheme Considering Packers and Encryption",
        "authors": "Weixiang Cai",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212205"
    },
    {
        "id": 2568,
        "title": "A Novel Survey on Panoptic Segmentation using Deep Learning Approaches",
        "authors": "Pulipati Nagaraju, S.V. Sudha",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212173"
    },
    {
        "id": 2569,
        "title": "Deep Reinforcement Learning for Edge Caching with Mobility Prediction in Vehicular Networks",
        "authors": "Yoonjeong Choi, Yujin Lim",
        "published": "2023-2-3",
        "citations": 2,
        "abstract": "As vehicles are connected to the Internet, various services can be provided to users. However, if the requests of vehicle users are concentrated on the remote server, the transmission delay increases, and there is a high possibility that the delay constraint cannot be satisfied. To solve this problem, caching can be performed at a closer proximity to the user which in turn would reduce the latency by distributing requests. The road side unit (RSU) and vehicle can serve as caching nodes by providing storage space closer to users through a mobile edge computing (MEC) server and an on-board unit (OBU), respectively. In this paper, we propose a caching strategy for both RSUs and vehicles with the goal of maximizing the caching node throughput. The vehicles move at a greater speed; thus, if positions of the vehicles are predictable in advance, this helps to determine the location and type of content that has to be cached. By using the temporal and spatial characteristics of vehicles, we adopted a long short-term memory (LSTM) to predict the locations of the vehicles. To respond to time-varying content popularity, a deep deterministic policy gradient (DDPG) was used to determine the size of each piece of content to be stored in the caching nodes. Experiments in various environments have proven that the proposed algorithm performs better when compared to other caching methods in terms of the throughput of caching nodes, delay constraint satisfaction, and update cost.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031732"
    },
    {
        "id": 2570,
        "title": "Multimodal Deep Learning with Boosted Trees for Edge Inference",
        "authors": "Penny Chong, Laura Wynter, Bharathi Chaudhury",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdmw60847.2023.00021"
    },
    {
        "id": 2571,
        "title": "Brain Tumor Classification using Deep learning based Novel Hybrid Approach",
        "authors": "Sachin Jain, Preeti Jaidka",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212365"
    },
    {
        "id": 2572,
        "title": "Facial Emotion Detection using Machine Learning and Deep Learning Algorithms",
        "authors": "Snehal Bhogan, Kedar Sawant, Nidhi Gondalekar, Rachel Carvalho, Vassant Kalangutkar, Alleena Mathew",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212261"
    },
    {
        "id": 2573,
        "title": "Deep Learning-designed Diffractive Materials for Optical Computing and Computational Imaging",
        "authors": "Aydogan Ozcan",
        "published": "2023-10-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmdc57951.2023.10344078"
    },
    {
        "id": 2574,
        "title": "Evaluation of Federated Learning Techniques on Edge Devices Using Synthetic Medical Imaging Datasets",
        "authors": "Ahmad Alhonainy, Praveen Rao",
        "published": "2023-9-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aipr60534.2023.10440687"
    },
    {
        "id": 2575,
        "title": "Communication-Efficient Federated Learning for Heterogeneous Edge Devices Based on Adaptive Gradient Quantization",
        "authors": "Heting Liu, Fang He, Guohong Cao",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/infocom53939.2023.10228970"
    },
    {
        "id": 2576,
        "title": "Deep Learning based Opinion Mining on Throat Cancer Social Media Posts",
        "authors": "Anuj Mangal, Anuj Kumar",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212362"
    },
    {
        "id": 2577,
        "title": "Systematic Review on Deep Learning-based Heart Disease Diagnosis",
        "authors": "Vidya C A, V. Baby Shalini",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212392"
    },
    {
        "id": 2578,
        "title": "Edge Caching Based on Deep Reinforcement Learning",
        "authors": "Farnaz Niknia, Ping Wang, Aakash Agarwal, Zixu Wang",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccc57788.2023.10233394"
    },
    {
        "id": 2579,
        "title": "Lithofacies prediction from seismic data using deep learning: A case study from North West Shelf Australia",
        "authors": "Takashi Yamatani, Shuichi Desaki",
        "published": "2023-11",
        "citations": 0,
        "abstract": " A fully convolutional neural network was applied to prestack 3D seismic data to predict lithofacies. A key challenge was to segregate volcanics and shale, which have similar elastic properties. We achieved reasonable lithofacies prediction by using pseudowells as labeled data, which could incorporate geologic information into the model (i.e., vertical distribution patterns). In particular, the addition of stratigraphic information as input to the neural network enabled effective learning. In addition, multiple networks were separately trained to evaluate prediction uncertainty. Even in such cases, the number of pseudowells required for the robust training was much smaller than the number of traces in the 3D seismic data. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1190/tle42110773.1"
    },
    {
        "id": 2580,
        "title": "A Memory-Efficient Federated Kernel Support Vector Machine for Edge Devices",
        "authors": "Xiaochen Zhou, Xudong Wang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2023.3302802"
    },
    {
        "id": 2581,
        "title": "Deep Reinforcement Learning algorithms for Low Latency Edge Computing Systems",
        "authors": "K. Kumaran, E. Sasikala",
        "published": "2023-3-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp57993.2023.10134928"
    },
    {
        "id": 2582,
        "title": "Hierarchical fuzzy deep learning system for various classes of images",
        "authors": "Shashank Kamthan, Harpreet Singh",
        "published": "2023-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.memori.2022.100023"
    },
    {
        "id": 2583,
        "title": "Deep Learning-Based Attack Detection and Classification in Android Devices",
        "authors": "Alfonso Gómez, Antonio Muñoz",
        "published": "2023-7-28",
        "citations": 10,
        "abstract": "The increasing proliferation of Androidbased devices, which currently dominate the market with a staggering 72% global market share, has made them a prime target for attackers. Consequently, the detection of Android malware has emerged as a critical research area. Both academia and industry have explored various approaches to develop robust and efficient solutions for Android malware detection and classification, yet it remains an ongoing challenge. In this study, we present a supervised learning technique that demonstrates promising results in Android malware detection. The key to our approach lies in the creation of a comprehensive labeled dataset, comprising over 18,000 samples classified into five distinct categories: Adware, Banking, SMS, Riskware, and Benign applications. The effectiveness of our proposed model is validated using well-established datasets such as CICMalDroid2020, CICMalDroid2017, and CICAndMal2017. Comparing our results with state-of-the-art techniques in terms of precision, recall, efficiency, and other relevant factors, our approach outperforms other semi-supervised methods in specific parameters. However, we acknowledge that our model does not exhibit significant deviations when compared to alternative approaches concerning certain aspects. Overall, our research contributes to the ongoing efforts in the development of advanced techniques for Android malware detection and classification. We believe that our findings will inspire further investigations, leading to enhanced security measures and protection for Android devices in the face of evolving threats.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics12153253"
    },
    {
        "id": 2584,
        "title": "Deep reinforcement learning based resource allocation in edge-cloud gaming",
        "authors": "Iryanto Jaya, Yusen Li, Wentong Cai",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18337-2"
    },
    {
        "id": 2585,
        "title": "Multi-agent Deep Reinforcement Learning-based Trajectory Design for UAV-aided Edge Computing System",
        "authors": "Gengyuan Lu, Zheng Chang",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wcnc55385.2023.10118895"
    },
    {
        "id": 2586,
        "title": "The 5G Edge Computing using Deep Reinforcement Learning for Data Processing",
        "authors": "Manish Nagpal",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442493"
    },
    {
        "id": 2587,
        "title": "Deep Learning Based Vehicle Speed Estimation on Highways",
        "authors": "",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "Traffic management always is a matter requiring the attention of highway system managers in terms of vehicle monitoring and speed estimation. This paper proposes an efficient deep learning-based vehicle speed estimation on highway lanes in the Vietnam transport system. The input videos are recorded by fixed surveillance cameras. An optimized single shot multibox detector network, called SSD, is utilized for vehicle license plate detection (LPD). The deep SORT (simple online and real-time tracking) model is first applied to video vehicle tracking and performed in the detected license plate area. This tracking process investigates the traveling distance of a vehicle to estimate its speed. In this study, the dataset has been normalized to improve the efficiency of vehicle localization and tracking to improve the time elapsing in the estimation of the distance traveled by vehicles on highways. The results showed that the proposed system has achieved better accuracy in terms of the determined speeds with errors ranging between [-1.5, +1.1] km/h, equivalent to 98% of the error limit by the regulation in Viet Nam.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51316/jst.163.ssad.2023.33.1.6"
    },
    {
        "id": 2588,
        "title": "Cyber Security on the Edge: Efficient Enabling of Machine Learning on IoT Devices",
        "authors": "Swati Kumari, Vatsal Tulshyan, Hitesh Tewari",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "Due to rising cyber threats, IoT devices’ security vulnerabilities are expanding. However, these devices cannot run complicated security algorithms locally due to hardware restrictions. Data must be transferred to cloud nodes for processing, giving attackers an entry point. This research investigates distributed computing on the edge, using AI-enabled IoT devices and container orchestration tools to process data in real time at the network edge. The purpose is to identify and mitigate DDoS assaults while minimizing CPU usage to improve security. It compares typical IoT devices with and without AI-enabled chips, container orchestration, and assesses their performance in running machine learning models with different cluster settings. The proposed architecture aims to empower IoT devices to process data locally, minimizing the reliance on cloud transmission and bolstering security in IoT environments. The results correlate with the update in the architecture. With the addition of AI-enabled IoT device and container orchestration, there is a difference of 60% between the new architecture and traditional architecture where only Raspberry Pi were being used.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info15030126"
    },
    {
        "id": 2589,
        "title": "Deep learning acceleration at the resource-constrained tactical edge",
        "authors": "Billy Geerhart, Venkat R. Dasari, Peng Wang, Brian Rapp",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386886"
    },
    {
        "id": 2590,
        "title": "Computing Task Offloading in Vehicular Edge Network via Deep Reinforcement Learning",
        "authors": "Beibei He, Shengchao Su, Yiwang Wang",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "\nBackground:\nIn recent years, with the development of the Internet of Vehicles, a variety\nof novel in-vehicle application devices have surfaced, exhibiting increasingly stringent requirements\nfor time delay. Vehicular edge networks (VEN) can fully use network edge devices, such as roadside\nunits (RSUs), for collaborative processing, which can effectively reduce latency.\n\n\nbackground:\nIn recent years, with the development of the field of internet of vehicles, a variety of novel in-vehicle application devices have surfaced, exhibiting increasingly stringent requirements for time delay. Vehicular edge network (VEN) can make full use of network edge devices, such as road side unit (RSU) for collaborative processing, which can effectively reduce the latency.\n\n\nObjective:\nMost extant studies, including patents, assume that RSU has sufficient computing resources\nto provide unlimited services. But in fact, its computing resources will be limited with the\nincrease in processing tasks, which will restrict the delay-sensitive vehicular applications. To solve\nthis problem, a vehicle-to-vehicle computing task offloading method based on deep reinforcement\nlearning is proposed in this paper, which fully considers the remaining available computational resources\nof neighboring vehicles to minimize the total task processing latency and enhance the offloading\nsuccess rate.\n\n\nobjective:\nA vehicle-to-vehicle computing task offloading method based on deep reinforce-ment learning is proposed in this paper, which fully considers the remaining available computa-tional resources of neighboring vehicles with the objective of minimizing the total task processing latency and enhancing the offloading success rate.\n\n\nMethods:\nIn the multi-service vehicle scenario, the analytic hierarchy process (AHP) was first used\nto prioritize the computing tasks of user vehicles. Next, an improved sequence-to-sequence\n(Seq2Seq) computing task scheduling model combined with an attention mechanism was designed,\nand the model was trained by an actor-critic (AC) reinforcement learning algorithm with the optimization\ngoal of reducing the processing delay of computing tasks and improving the success rate of\noffloading. A task offloading strategy optimization model based on AHP-AC was obtained on this\nbasis.\n\n\nResults:\nThe average latency and execution success rate are used as performance metrics to compare\nthe proposed method with three other task offloading methods: only-local processing, greedy strategy-\nbased algorithm, and random algorithm. In addition, experimental validation in terms of CPU\nfrequency and the number of SVs is carried out to demonstrate the excellent generalization ability of\nthe proposed method.\n\n\nresult:\nThe average latency and execution success rate are used as performance metrics to compare the proposed method with three other task offloading methods: only-local processing, greedy strate-gy-based algorithm and random algorithm. In addition, experimental validation in terms of both CPU frequency and the number of SVs is carried out to demonstrate the good generalization abil-ity of the proposed method.\n\n\nConclusion:\nThe simulation results reveal that the proposed method outperforms other methods in\nreducing the processing delay of tasks and improving the success rate of task offloading, which\nsolves the problem of limited execution of delay-sensitive tasks caused by insufficient computational\nresources.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/0118722121283037231231064521"
    },
    {
        "id": 2591,
        "title": "Chameleon: Dual Memory Replay for Online Continual Learning on Edge Devices",
        "authors": "Shivam Aggarwal, Kuluhan Binici, Tulika Mitra",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/date56975.2023.10137046"
    },
    {
        "id": 2592,
        "title": "Deep-Learning-Based Edge Detection for Improving Building Footprint Extraction from Satellite Images",
        "authors": "Nima Ahmadian, Amin Sedaghat, Nazila Mohammadi, Mohammad Aghdami-Nia",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ecrs2023-16615"
    },
    {
        "id": 2593,
        "title": "Enhancing inverse design of nanophotonic devices through generative deep learning, Bayesian latent optimization, and transfer learning",
        "authors": "Keisuke Kojima",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3001999"
    },
    {
        "id": 2594,
        "title": "Probabilistic Error Reasoning on IoT Edge Devices",
        "authors": "Charles Qing Cao, Yunhe Feng",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edge60047.2023.00031"
    },
    {
        "id": 2595,
        "title": "A comprehensive review on ReRAM-based accelerators for deep learning",
        "authors": "Pooja Joshi, Hafizur Rahaman",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdcs58735.2023.10153519"
    },
    {
        "id": 2596,
        "title": "Edge Machine Learning to Detect Malicious Activity in IoT Devices through System Calls and Traffic Analysis",
        "authors": "Nathan Pape, Christopher Mansour",
        "published": "2023-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cymaen57228.2023.10051091"
    },
    {
        "id": 2597,
        "title": "A Lightweight Concept Drift Detection Method for On-Device Learning on Resource-Limited Edge Devices",
        "authors": "Takeya Yamada, Hiroki Matsutani",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipdpsw59300.2023.00128"
    },
    {
        "id": 2598,
        "title": "Decentralized Federated Learning for Agricultural Plant Diseases Identification on Edge Devices",
        "authors": "Kundjanasith Thonglek, Prapaporn Rattanatamrong",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354694"
    },
    {
        "id": 2599,
        "title": "Communication-Efficient Federated Learning for Resource-Constrained Edge Devices",
        "authors": "Guangchen Lan, Xiao-Yang Liu, Yijing Zhang, Xiaodong Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmlcn.2023.3309773"
    },
    {
        "id": 2600,
        "title": "DEVELOPMENT OF LEARNING ASSISTANCE ENVIRONMENT WITH MULTI EDGE DEVICES FOR THE ERA OF COMPLEX MASSIVE NATURAL DISASTERS",
        "authors": "Satoshi Togawa, Akiko Kondo, Kazuhide Kanenishi",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2023.2354"
    },
    {
        "id": 2601,
        "title": "Machine Learning Enabled Intrusion Detection for Edge Devices in the Internet of Things",
        "authors": "Maram Alsharif, Danda B. Rawat",
        "published": "2023-3-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccwc57344.2023.10099276"
    },
    {
        "id": 2602,
        "title": "Pre-Trained Lightweight Deep Learning Models for Surgical Instrument Detection: Performance Evaluation for Edge Inference",
        "authors": "Md Sabbir Ahmed, Stefano Giordano",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437676"
    },
    {
        "id": 2603,
        "title": "Deep Learning based Task Scheduling in Edge Computing",
        "authors": "BantupalliI Nagalaskshmi, Sumathy S",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijwet.2024.10061935"
    },
    {
        "id": 2604,
        "title": "Online Digital Cheque Signature Verification using Deep Learning Approach",
        "authors": "Ashwin Shenoy M, Saritha Suvarna, Rajgopal K T",
        "published": "2023-7-19",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212410"
    },
    {
        "id": 2605,
        "title": "EDGE-Net: Efficient Deep-Learning Gradients Extraction Network",
        "authors": "Nasrin Akbari, Amirali Baniasadi",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Deep Convolutional Neural Networks (CNNs) have achieved impressive performance in edge detection tasks, but their large number of parameters often leads to high memory and energy costs for implementation on lightweight devices. In this paper, we propose a new architecture, called Efficient Deep-learning Gradients Extraction Network (EDGE-Net), that integrates the advantages of Depthwise Separable Convolutions and deformable convolutional networks (DeformableConvNet) to address these inefficiencies. By carefully selecting proper components and utilizing network pruning techniques, our proposed EDGE-Net achieves state-of-the-art accuracy in edge detection while significantly reducing complexity. Experimental results on BSDS500 and NYUDv2 datasets demonstrate that EDGE-Net outperforms current lightweight edge detectors with only 500k parameters, without relying on pre-trained weights.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/ijaia.2023.14207"
    },
    {
        "id": 2606,
        "title": "IoT- Edge Deep Learning EHealth Monitoring System",
        "authors": "Aruna M, Baby Shalini V",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47392/irjash.2023.042"
    },
    {
        "id": 2607,
        "title": "A Comprehensive Analysis on Unconstraint Video Analysis Using Deep Learning Approaches",
        "authors": "P. Naga Bhushanam, Selva Kumar S",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212227"
    },
    {
        "id": 2608,
        "title": "Resource Allocation in IoT-based Edge Computing using Deep Learning with Optimization Model",
        "authors": "Yousef Methkal Abd Algani",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icears56392.2023.10085263"
    },
    {
        "id": 2609,
        "title": "Optimization of news dissemination push mode by intelligent edge computing technology for deep learning",
        "authors": "JiLe DeGe, Sina Sang",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "AbstractThe Internet era is an era of information explosion. By 2022, the global Internet users have reached more than 4 billion, and the social media users have exceeded 3 billion. People face a lot of news content every day, and it is almost impossible to get interesting information by browsing all the news content. Under this background, personalized news recommendation technology has been widely used, but it still needs to be further optimized and improved. In order to better push the news content of interest to different readers, users' satisfaction with major news websites should be further improved. This study proposes a new recommendation algorithm based on deep learning and reinforcement learning. Firstly, the RL algorithm is introduced based on deep learning. Deep learning is excellent in processing large-scale data and complex pattern recognition, but it often faces the challenge of low sample efficiency when it comes to complex decision-making and sequential tasks. While reinforcement learning (RL) emphasizes learning optimization strategies through continuous trial and error through interactive learning with the environment. Compared with deep learning, RL is more suitable for scenes that need long-term decision-making and trial-and-error learning. By feeding back the reward signal of the action, the system can better adapt to the unknown environment and complex tasks, which makes up for the relative shortcomings of deep learning in these aspects. A scenario is applied to an action to solve the sequential decision problem in the news dissemination process. In order to enable the news recommendation system to consider the dynamic changes in users' interest in news content, the Deep Deterministic Policy Gradient algorithm is applied to the news recommendation scenario. Opposing learning complements and combines Deep Q-network with the strategic network. On the basis of fully summarizing and thinking, this paper puts forward the mode of intelligent news dissemination and push. The push process of news communication information based on edge computing technology is proposed. Finally, based on Area Under Curve a Q-Leaning Area Under Curve for RL models is proposed. This indicator can measure the strengths and weaknesses of RL models efficiently and facilitates comparing models and evaluating offline experiments. The results show that the DDPG algorithm improves the click-through rate by 2.586% compared with the conventional recommendation algorithm. It shows that the algorithm designed in this paper has more obvious advantages in accurate recommendation by users. This paper effectively improves the efficiency of news dissemination by optimizing the push mode of intelligent news dissemination. In addition, the paper also deeply studies the innovative application of intelligent edge technology in news communication, which brings new ideas and practices to promote the development of news communication methods. Optimizing the push mode of intelligent news dissemination not only improves the user experience, but also provides strong support for the application of intelligent edge technology in this field, which has important practical application prospects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-53859-7"
    },
    {
        "id": 2610,
        "title": "Deep Knowledge Distillation Learning for Efficient Wearable Data Mining on the Edge",
        "authors": "Junhua Wong, Qingxue Zhang",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce56470.2023.10043546"
    },
    {
        "id": 2611,
        "title": "In-Memory Computing for Machine Learning and Deep Learning",
        "authors": "N. Lepri, A. Glukhov, L. Cattaneo, M. Farronato, P. Mannocci, D. Ielmini",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jeds.2023.3265875"
    },
    {
        "id": 2612,
        "title": "Flet-Edge: A Full Life-cycle Evaluation Tool for deep learning framework on the Edge",
        "authors": "Xiaoyang Jiang, Xingzhou Zhang, Xiaohui Peng",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpads56603.2022.00094"
    },
    {
        "id": 2613,
        "title": "Power Efficient Machine Learning Models Deployment on Edge IoT Devices",
        "authors": "Anastasios Fanariotis, Theofanis Orphanoudakis, Konstantinos Kotrotsios, Vassilis Fotopoulos, George Keramidas, Panagiotis Karkazis",
        "published": "2023-2-1",
        "citations": 8,
        "abstract": "Computing has undergone a significant transformation over the past two decades, shifting from a machine-based approach to a human-centric, virtually invisible service known as ubiquitous or pervasive computing. This change has been achieved by incorporating small embedded devices into a larger computational system, connected through networking and referred to as edge devices. When these devices are also connected to the Internet, they are generally named Internet-of-Thing (IoT) devices. Developing Machine Learning (ML) algorithms on these types of devices allows them to provide Artificial Intelligence (AI) inference functions such as computer vision, pattern recognition, etc. However, this capability is severely limited by the device’s resource scarcity. Embedded devices have limited computational and power resources available while they must maintain a high degree of autonomy. While there are several published studies that address the computational weakness of these small systems-mostly through optimization and compression of neural networks- they often neglect the power consumption and efficiency implications of these techniques. This study presents power efficiency experimental results from the application of well-known and proven optimization methods using a set of well-known ML models. The results are presented in a meaningful manner considering the “real world” functionality of devices and the provided results are compared with the basic “idle” power consumption of each of the selected systems. Two different systems with completely different architectures and capabilities were used providing us with results that led to interesting conclusions related to the power efficiency of each architecture.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23031595"
    },
    {
        "id": 2614,
        "title": "Review on Deep Learning Based Biomedical Waste Detection and Classification",
        "authors": "Srushti Bobe, Priyanka Adhav, Omkar Bhalerao, Sandeep Chaware",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212343"
    },
    {
        "id": 2615,
        "title": "Environmental Sound Classiﬁcation on the Edge: A Pipeline for Deep Acoustic Networks on Extremely Resource-Constrained Devices",
        "authors": "Md Mohaimenuzzaman, Christoph Bergmeir, Ian West, Bernd Meyer",
        "published": "2023-1",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109025"
    },
    {
        "id": 2616,
        "title": "Research on Transformer Fault Diagnosis Method Based on Deep Learning Algorithm Optimization",
        "authors": "Yiling Fan",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00056"
    },
    {
        "id": 2617,
        "title": "Deep Learning Based Real Time Face Recognition For University Attendance System",
        "authors": "Mansi Singhal, Gufran Ahmad",
        "published": "2023-5-29",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdcs58735.2023.10153549"
    },
    {
        "id": 2618,
        "title": "Drone based Potholes detection using Machine Learning on various Edge AI devices in Real-Time",
        "authors": "Aniruddhsinh Parmar, Ruchi Gaiiar, Nagendra Gajjar",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ises58672.2023.00016"
    },
    {
        "id": 2619,
        "title": "Ed-Fed: A generic federated learning framework with resource-aware client selection for edge devices",
        "authors": "Zitha Sasindran, Harsha Yelchuri, T. V. Prabhakar",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191316"
    },
    {
        "id": 2620,
        "title": "Detection of Traffic Control Devices during Bridge Construction Projects Using Deep Learning",
        "authors": "M. Parvathi -",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Recent days during the time of road construction so many accidents may occur due to the objects in the construction area cannot capture during travel.  Some method must be implemented to classify and locate instances in the image. In deep learning area it extends its application to this field for object detection. Even though a method is identified it has risk factors such as real-time detection, changeable weather, and complex lighting conditions. In this paper we are discussing the algorithm used for detection and a next version of that algorithm to detect the object with more precision. And also the number frames capture during driving is also more than other algorithm. Here we discussed about YOLO algorithm, and which is the best algorithm that applies different aspects such as key generic object detection frameworks, categorized object detection applications in traffic scenario, evaluation metrics, and classified datasets are included. The idea in YOLO v7 is to avoid that there is an identity connection when a convolutional layer with residual or concatenation is replaced by re-parameterized convolution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i01.11878"
    },
    {
        "id": 2621,
        "title": "Scene Style Conversion Algorithm of AI Digital Host: A Deep Learning Approach",
        "authors": "Xinli Lyu, Fangli Ying, Pintusorn Onpium",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212269"
    },
    {
        "id": 2622,
        "title": "Deep learning inference time guarantee for aggregated images at the edge of the network",
        "authors": "Kouichi Genda",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1587/comex.2023xbl0036"
    },
    {
        "id": 2623,
        "title": "Edge Computing-Based Crime Scene Object Detection from Surveillance Video Using Deep Learning Algorithms",
        "authors": "R J Anandhi",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220800"
    },
    {
        "id": 2624,
        "title": "Securing Mobile Edge Computing Using Hybrid Deep Learning Method",
        "authors": "Olusola Adeniyi, Ali Safaa Sadiq, Prashant Pillai, Mohammad Aljaidi, Omprakash Kaiwartya",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "In recent years, Mobile Edge Computing (MEC) has revolutionized the landscape of the telecommunication industry by offering low-latency, high-bandwidth, and real-time processing. With this advancement comes a broad range of security challenges, the most prominent of which is Distributed Denial of Service (DDoS) attacks, which threaten the availability and performance of MEC’s services. In most cases, Intrusion Detection Systems (IDSs), a security tool that monitors networks and systems for suspicious activity and notify administrators in real time of potential cyber threats, have relied on shallow Machine Learning (ML) models that are limited in their abilities to identify and mitigate DDoS attacks. This article highlights the drawbacks of current IDS solutions, primarily their reliance on shallow ML techniques, and proposes a novel hybrid Autoencoder–Multi-Layer Perceptron (AE–MLP) model for intrusion detection as a solution against DDoS attacks in the MEC environment. The proposed hybrid AE–MLP model leverages autoencoders’ feature extraction capabilities to capture intricate patterns and anomalies within network traffic data. This extracted knowledge is then fed into a Multi-Layer Perceptron (MLP) network, enabling deep learning techniques to further analyze and classify potential threats. By integrating both AE and MLP, the hybrid model achieves higher accuracy and robustness in identifying DDoS attacks while minimizing false positives. As a result of extensive experiments using the recently released NF-UQ-NIDS-V2 dataset, which contains a wide range of DDoS attacks, our results demonstrate that the proposed hybrid AE–MLP model achieves a high accuracy of 99.98%. Based on the results, the hybrid approach performs better than several similar techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computers13010025"
    },
    {
        "id": 2625,
        "title": "Convnext-Eesnn: An effective deep learning based malware detection in edge based IIOT",
        "authors": "Deepika Maddali",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "A rising number of edge devices, like controllers, sensors, and robots, are crucial for Industrial Internet of Things (IIoT) networks for collecting data for communication, storage, and processing. The security of the IIoT could be compromised by any malicious or unusual behavior on the part of any of these devices. They may also make it possible for malicious software placed on end nodes to enter the network and perform unauthorized activities. Existing anomaly detection techniques are less effective due to the increasing diversity of the network and the complexity of cyberattacks. In addition, most strategies are ineffective for devices with limited resources. Therefore, this work presents an effective deep learning based Malware Detection framework to make the edge based IIoT network more secure. This multi-stage system begins with the Deep Convolutional Generative Adversarial Networks (DCGAN) based data augmentation method to overcome the issue of data imbalance. Next, a ConvNeXt-based method extracts the features from the input data. Finally, an optimized Enhanced Elman Spike Neural Network (EESNN) based deep learning is utilized for malware recognition and classification. Using two distinct datasets— MaleVis and Malimg— the generalizability of the suggested model is clearly demonstrated. With an accuracy of 99.24% for MaleVis and 99.31% for the Malimg dataset, the suggested strategy demonstrated excellent results and surpassed all other existing methods. It illustrates how the suggested strategy outperforms alternative models and offers numerous benefits.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-234897"
    },
    {
        "id": 2626,
        "title": "Orographic Rainfall Prediction by Soft Computing-A Comparison of Machine Learning and Deep Learning",
        "authors": "S. K. Mondal, S. Dolui, S. Chakraborty",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codec60112.2023.10465922"
    },
    {
        "id": 2627,
        "title": "A fusion-based approach to deep-learning and edge-cutting algorithms for identification and color recognition of traffic lights",
        "authors": "Yunqian Xu",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "Abstract\nThe detection and color recognition of traffic lights should be the foundation for the capture of illegal driving practices. However, it may be difficult to recognize lights of different colors in intricate and unpredictable surroundings. This study implements a traffic light detection and recognition scheme that can be used for intelligent traffic. First, the images obtained from the speed camera should be pre-segmented. Then the traffic lights with colors are detected by the YOLOv5 model trained based on the image-enhancement dataset. Next, the candidate boxes of traffic lights are edge detected and clipped out of multiple lamp panels in missing video frames. Finally, the color of the candidate boxes will be determined by the lamp panel with the greatest number of bright pixels. This finding shows that the fusion-based approach performs better than a single-based algorithm for identification and color recognition of traffic lights under varying illumination and weather circumstances.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/iti/liad007"
    },
    {
        "id": 2628,
        "title": "Mobile Edge Adversarial Detection for Digital Twinning to the Metaverse with Deep Reinforcement Learning",
        "authors": "Terence Jie Chua, Wenhan Yu, Jun Zhao",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10279064"
    },
    {
        "id": 2629,
        "title": "Deep Reinforcement Learning for Energy-Efficient Task Offloading in Cooperative Vehicular Edge Networks",
        "authors": "Paul Agbaje, Ebelechukwu Nwafor, Habeeb Olufowobi",
        "published": "2023-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/indin51400.2023.10218113"
    },
    {
        "id": 2630,
        "title": "Multi-user edge service orchestration based on Deep Reinforcement Learning",
        "authors": "Christian Quadri, Alberto Ceselli, Gian Paolo Rossi",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comcom.2023.02.027"
    },
    {
        "id": 2631,
        "title": "Accurate Breast Tumor Identification Using Cutting-Edge Deep Learning",
        "authors": "Kalyan Acharjya, Manikandan M, Adlin Jebakumari S",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icraset59632.2023.10420410"
    },
    {
        "id": 2632,
        "title": "Optimizing Total Service Time for Incoming Parallel Requests Using a Hybrid Deep Q-Learning Algorithm in Mobile Edge Computing",
        "authors": "Önem Yıldız, Radosveta Sokullu",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/telfor59449.2023.10372821"
    },
    {
        "id": 2633,
        "title": "Routing Optimization using Deep Reinforcement Learning in Wireless Software-Defined Edge Network",
        "authors": "Shashi Dhanasekar, Meignanamoorthi D, V. Vetriselvi",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icercs57948.2023.10434088"
    },
    {
        "id": 2634,
        "title": "Federated Learning for Sleep Stage Classification on Edge Devices via a Model-Agnostic Meta-Learning-Based Pre-Trained Model",
        "authors": "SungHwan Moon, Tae Seong Kim, Jihye Ryu, Won Hee Lee",
        "published": "2023-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-berlin58801.2023.10375664"
    },
    {
        "id": 2635,
        "title": "MADDPG: A task offloading algorithm based on multi-agent deep reinforcement learning in vehicle-edge computing",
        "authors": "Xiaoer Wang, Shuang Ding, Guoqing Zhang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640912.3640992"
    },
    {
        "id": 2636,
        "title": "Containerized Computer Vision Applications on Edge Devices",
        "authors": "Osamah I. Alqaisi, Ali Şaman Tosun, Turgay Korkmaz",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edge60047.2023.00014"
    },
    {
        "id": 2637,
        "title": "Performance Comparison of Deep Learning Networks for Runway Recognition in Small Edge Computing Environment",
        "authors": "Hyunjee Ryu, Hongju Lee, Kyunam Kim",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasc58513.2023.10311305"
    },
    {
        "id": 2638,
        "title": "Evaluation of Membership Inference Attack Against Federated Learning With Differential Privacy on Edge Devices",
        "authors": "Rei Ueda, Tsunato Nakai, Kota Yoshida, Takeshi Fujino",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcce59613.2023.10315549"
    },
    {
        "id": 2639,
        "title": "Robust Offloading for Edge Computing-Assisted Sensing and Communication Systems: A Deep Reinforcement Learning Approach",
        "authors": "Li Shen, Bin Li, Xiaojie Zhu",
        "published": "2024-4-12",
        "citations": 0,
        "abstract": "In this paper, we consider an integrated sensing, communication, and computation (ISCC) system to alleviate the spectrum congestion and computation burden problem. Specifically, while serving communication users, a base station (BS) actively engages in sensing targets and collaborates seamlessly with the edge server to concurrently process the acquired sensing data for efficient target recognition. A significant challenge in edge computing systems arises from the inherent uncertainty in computations, mainly stemming from the unpredictable complexity of tasks. With this consideration, we address the computation uncertainty by formulating a robust communication and computing resource allocation problem in ISCC systems. The primary goal of the system is to minimize total energy consumption while adhering to perception and delay constraints. This is achieved through the optimization of transmit beamforming, offloading ratio, and computing resource allocation, effectively managing the trade-offs between local execution and edge computing. To overcome this challenge, we employ a Markov decision process (MDP) in conjunction with the proximal policy optimization (PPO) algorithm, establishing an adaptive learning strategy. The proposed algorithm stands out for its rapid training speed, ensuring compliance with latency requirements for perception and computation in applications. Simulation results highlight its robustness and effectiveness within ISCC systems compared to baseline approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24082489"
    },
    {
        "id": 2640,
        "title": "An Edge Visual Incremental Perception Framework Based on Deep Semi-supervised Learning for Monitoring Power Transmission Lines",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17775/cseejpes.2022.03120"
    },
    {
        "id": 2641,
        "title": "Deep Reinforcement Learning Based on Parked Vehicles-Assisted for Task Offloading in Vehicle Edge Computing",
        "authors": "Bingxin Wang, Lei Liu, Jie Wang",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwcmc58020.2023.10183330"
    },
    {
        "id": 2642,
        "title": "Speech-to-Text and Text-to-Speech Recognition Using Deep Learning",
        "authors": "V. Madhusudhana Reddy, T. Vaishnavi, K. Pavan Kumar",
        "published": "2023-7-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212222"
    },
    {
        "id": 2643,
        "title": "Intelligent Traffic Scheduling for Mobile Edge Computing in IoT via Deep Learning",
        "authors": "Shaoxuan Yun, Ying Chen",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmes.2022.022797"
    },
    {
        "id": 2644,
        "title": "Overcoming phase-change material non-idealities by meta-learning for adaptation on the edge",
        "authors": "Yigit Demirag, Regina Dittmann, Giacomo Indiveri, Emre Neftci",
        "published": "2023-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29363/nanoge.neumatdecas.2023.043"
    },
    {
        "id": 2645,
        "title": "Federated learning by employing knowledge distillation on edge devices with limited hardware resources",
        "authors": "Ehsan Tanghatari, Mehdi Kamal, Ali Afzali-Kusha, Massoud Pedram",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.02.011"
    },
    {
        "id": 2646,
        "title": "Multi-Agent Deep Reinforcement Learning for Task Offloading in Vehicle Edge Computing",
        "authors": "Bingxin Wang, Lei Liu, Jie Wang",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bmsb58369.2023.10211225"
    },
    {
        "id": 2647,
        "title": "Insomnia Forecasting using Cutting-Edge Deep Learning Techniques",
        "authors": "Pritha Singha Roy, Vinay Kukreja, S. Nisha Chandran, Ankur Choudhary",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486745"
    },
    {
        "id": 2648,
        "title": "High Accuracy Silent Speech BCI Using Compact Deep Learning Model for Edge Computing",
        "authors": "Nobuaki Kobayashi, Tomoya Nemoto, Takahiro Morooka",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bci57258.2023.10078589"
    },
    {
        "id": 2649,
        "title": "Edge-Centric Security Framework for Electric Vehicle Connectivity: A Deep Learning Approach",
        "authors": "Koustav Kumar Mondal, Divya Mahendia, Debasis Das, Sumit Kalra",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apcc60132.2023.10460656"
    },
    {
        "id": 2650,
        "title": "Multi-Agent Deep Reinforcement Learning for Cooperative Edge Caching via Hybrid Communication",
        "authors": "Fei Wang, Salma Emara, Isidor Kaplan, Baochun Li, Timothy Zeyl",
        "published": "2023-5-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icc45041.2023.10278827"
    },
    {
        "id": 2651,
        "title": "Deep Learning based Sentiment Analysis on Images",
        "authors": "Nimitha N, Saroj Bala, V Satheeswaran, M Janani, S. Selvanayaki, S. Ramasami",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212171"
    },
    {
        "id": 2652,
        "title": "Research on Image Edge Distortion Correction Algorithm Based on Improved Deep Learning Self-Coding",
        "authors": "Xinying Lan, Ningning Yang",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsece58870.2023.10263560"
    },
    {
        "id": 2653,
        "title": "Malicious traffic detection for cloud-edge-end networks: A deep learning approach",
        "authors": "Hanbing Liu, Fang Han, Yajuan Zhang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comcom.2023.12.024"
    },
    {
        "id": 2654,
        "title": "Integrated Model for Covid 19 Disease Diagnosis using Deep Learning Approach",
        "authors": "Suganyadevi S, Seethalakshmi V, Anandan P, Renu K",
        "published": "2023-7-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212181"
    },
    {
        "id": 2655,
        "title": "Deep Reinforcement Learning-Based Resource Allocation for UAV-Enabled Federated Edge Learning",
        "authors": "Tianze Liu, Tiankui Zhang, Jonathan Loo, Yapeng Wang",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/jcin.2023.10087243"
    },
    {
        "id": 2656,
        "title": "Catalysing assistive solutions by deploying light-weight deep learning model on edge devices",
        "authors": "Kanak Manjari, Madhushi Verma, Gaurav Singal, Vinay Chamola",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0952813x.2023.2219286"
    },
    {
        "id": 2657,
        "title": "Leveraging Deep Learning for Climate Change Prediction Models : A Dive into Cutting-Edge Techniques",
        "authors": "Gowrisankar Krishnamoorthy, Sai Mani Krishna Sistla",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "In recent years, deep learning has emerged as a promising approach for statistical downscaling, which involves generating high-resolution climate data from coarse low-resolution variables. However, concerns persist regarding the ability of these models to generalize to future climate change scenarios, primarily due to the assumption of stationarity. In this study, we propose the use of deep ensembles as a straightforward method to enhance the uncertainty quantification of statistical downscaling models. By improving the representation of uncertainty, these models offer superior planning capabilities against extreme weather events, which can have significant negative social and economic impacts. Given the absence of observational future data, we rely on pseudo-reality experiments to evaluate the effectiveness of deep ensembles in quantifying the uncertainty of climate change projections. The adoption of deep ensembles facilitates more robust risk assessment, addressing critical needs in various sectors for adapting to climate change challenges.",
        "keywords": "",
        "link": "http://dx.doi.org/10.60087/jklst.vol2.n2.p113"
    },
    {
        "id": 2658,
        "title": "Deep Learning Based Multi-Modal Data Fusion for Car Crash Detection",
        "authors": "Tanima Bhowmik, Roshan Rateria",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/codec60112.2023.10466222"
    },
    {
        "id": 2659,
        "title": "Efficient Deep Learning-Based Cyber-Attack Detection for Internet of Medical Things Devices",
        "authors": "Abigail Judith, G. Jaspher W. Kathrine, Salaja Silas, Andrew J",
        "published": "2023-12-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059139"
    },
    {
        "id": 2660,
        "title": "Recognition Algorithm of Transaction Risk Events in Automobile Financial Market Based on Deep Learning",
        "authors": "Xiaodan Wan",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00127"
    },
    {
        "id": 2661,
        "title": "Appropriate Graph-Algorithm Selection for Edge Devices Using Machine Learning",
        "authors": "Yusuke Fukasawa, Kazuhiko Komatsu, Masayuki Sato, Hiroaki Kobayashi",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mcsoc60832.2023.00086"
    },
    {
        "id": 2662,
        "title": "Application of wearable devices based on deep learning algorithm in basketball posture recognition",
        "authors": "Gang Liu, Yang Liu",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09085-w"
    },
    {
        "id": 2663,
        "title": "Cell Image Segmentation Method Based on Edge Feature Residual Fusion",
        "authors": "Yanqiu Zhang, Jinlian Du, Xueyun Jin, Xiao Zhang",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvidl58838.2023.10165736"
    },
    {
        "id": 2664,
        "title": "Deep reinforcement learning enabled UAV-IRS-assisted secure mobile edge computing network",
        "authors": "Yingzheng Zhang, Jufang Li, Guangchen Mu, Xiaoyu Chen",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.phycom.2023.102173"
    },
    {
        "id": 2665,
        "title": "Opportunistic Task Offloading in UAV-assisted Mobile Edge Computing: A Deep Reinforcement Learning Approach",
        "authors": "Taewon Song",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictc58733.2023.10392829"
    },
    {
        "id": 2666,
        "title": "Federated Deep Reinforcement Learning-Based Task Offloading System in Edge Computing Environment",
        "authors": "Hiba Merakchi, Miloud Bagaa, Ahmed Ouameur Messaoud, Adlen Ksentini, Abdenour Sehad",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10436761"
    },
    {
        "id": 2667,
        "title": "Face Mask Detection and Social Distancing using Deep Learning",
        "authors": "Arunima Jaiswal, Khushboo Kem, Aruna Ippli, Lydia Nenghoithem Haokip, Nitin Sachdeva",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212278"
    },
    {
        "id": 2668,
        "title": "Compact optimized deep learning model for edge: a review",
        "authors": "Soumyalatha Naveen, Manjunath R. Kounte",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "<p>Most real-time computer vision applications, such as pedestrian detection, augmented reality, and virtual reality, heavily rely on convolutional neural networks (CNN) for real-time decision support. In addition, edge intelligence is becoming necessary for low-latency real-time applications to process the data at the source device. Therefore, processing massive amounts of data impact memory footprint, prediction time, and energy consumption, essential performance metrics in machine learning based internet of things (IoT) edge clusters. However, deploying deeper, dense, and hefty weighted CNN models on resource-constraint embedded systems and limited edge computing resources, such as memory, and battery constraints, poses significant challenges in developing the compact optimized model. Reducing the energy consumption in edge IoT networks is possible by reducing the computation and data transmission between IoT devices and gateway devices. Hence there is a high demand for making energy-efficient deep learning models for deploying on edge devices. Furthermore, recent studies show that smaller compressed models achieve significant performance compared to larger deep-learning models. This review article focuses on state-of-the-art techniques of edge intelligence, and we propose a new research framework for designing a compact optimized deep learning (DL) model deployment on edge devices.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i6.pp6904-6912"
    },
    {
        "id": 2669,
        "title": "Design and Research of Mask Recognition System Based on Deep Learning and Edge Processor",
        "authors": "Xia Gao, Chen Chen",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ainit59027.2023.10212702"
    },
    {
        "id": 2670,
        "title": "Intelligent transformation of financial services of agricultural cooperatives based on edge computing and deep learning",
        "authors": "Ge Zhongchen, Han Jie, Cai Chen",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08538-6"
    },
    {
        "id": 2671,
        "title": "Using Edge-based Deep Learning Model for Early Detection of Cancer",
        "authors": "Luca Barillaro, Giuseppe Agapito, Mario Cannataro",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pdp59025.2023.00046"
    },
    {
        "id": 2672,
        "title": "A Deep Reinforcement Learning Approach for the Placement of Scalable Microservices in the Edge-to-Cloud Continuum",
        "authors": "Adyson Magalhães Maia, Yacine Ghamri-Doudane",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10437143"
    },
    {
        "id": 2673,
        "title": "A Distributed Deep Learning Approach with Mobile Edge Computing for Next Generation IoT Networks Security",
        "authors": "Shailendra Rathore, Pradip Kumar Sharma, Heena Rathore",
        "published": "2023-7-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wconf58270.2023.10235095"
    },
    {
        "id": 2674,
        "title": "Deep Learning-Driven Extraction of Superluminescent Diodes Parameters",
        "authors": "Andrea Marchisio, Vittorio Curri, Andrea Carena, Paolo Bardella",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nusod59562.2023.10273512"
    },
    {
        "id": 2675,
        "title": "Anomaly Detection in Smart Agriculture Systems on Network Edge Using Deep Learning Technique",
        "authors": "Bandar Alanazi, Ibrahim Alrashdi",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "With the widespread adoption of Internet of Things (IoT) technologies across various domains, including smart agriculture, urban environments, and homes, the threat of zero-day attacks has surged. This research delves into the application of deep learning techniques to detect anomalies in smart agricultural systems at the network edge, with a specific focus on safeguarding them against Distributed Denial of Service (DDoS) attacks. In this study, we propose an anomaly detection model based on CNN-LSTM to analyze sensor data collected from IoT devices. We rigorously train and test our model using two distinct datasets of sensor readings, simulating potential DDoS attack scenarios. The model's performance is assessed using key metrics such as detection accuracy, recall, and F1-score. Our results demonstrate the effectiveness of our approach, achieving an impressive anomaly detection accuracy of 99.7%. This research contributes significantly to the development of robust and efficient attack and anomaly detection techniques for smart agriculture systems at the network edge, ultimately enhancing the reliability and sustainability of agricultural practices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61185/smij.2023.33104"
    },
    {
        "id": 2676,
        "title": "Complexity-Driven Model Compression for Resource-constrained Deep Learning on Edge",
        "authors": "Muhammad Zawish, Steven Davy, Lizy Abraham",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tai.2024.3353157"
    },
    {
        "id": 2677,
        "title": "Detection of Image Splicing Forgeries Based on Deep Learning with Edge Detector",
        "authors": " Irmawati, Melissa Indah Fianty, Dwinanda Hafid Wicaksana",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicyta60173.2023.10429021"
    },
    {
        "id": 2678,
        "title": "Coffee disease classification at the edge using deep learning",
        "authors": "João Vitor Yukio Bordin Yamashita, João Paulo R.R. Leite",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.atech.2023.100183"
    },
    {
        "id": 2679,
        "title": "Resource allocation with edge computing in IoT networks via machine learning and deep learning",
        "authors": "Hemkant Sahu, Pallavi Biswas, Shiva Kumar, Deepika Agrawal, Sudhakar Pandey",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0148082"
    },
    {
        "id": 2680,
        "title": "Application Of Mobile Edge Computing &amp; Deep Learning In Mobile Blockchain For Security And Safty",
        "authors": "Amanveer Singh",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10183155"
    },
    {
        "id": 2681,
        "title": "Smart City Surveillance: Edge Technology Face Recognition Robot Deep Learning Based",
        "authors": "A. Medjdoubi, M. Meddeber, K. Yahyaoui",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5829/ije.2024.37.01a.03"
    },
    {
        "id": 2682,
        "title": "Bearing Fruit: Deep Apple Therapeutics Launches to Screen AI-Generated Virtual Libraries",
        "authors": "Jonathan D Grinstein",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1089/genedge.5.1.165"
    },
    {
        "id": 2683,
        "title": "Thermal inspection of photovoltaic modules with deep convolutional neural networks on edge devices in AUV",
        "authors": "Minhhuy Le, DucVu Le, Hong Ha Thi Vu",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2023.113135"
    },
    {
        "id": 2684,
        "title": "Federated Learning for Online Resource Allocation in Mobile Edge Computing: A Deep Reinforcement Learning Approach",
        "authors": "Jingjing Zheng, Kai Li, Naram Mhaisen, Wei Ni, Eduardo Tovar, Mohsen Guizani",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wcnc55385.2023.10118940"
    },
    {
        "id": 2685,
        "title": "A Novel Survey on Medical Image Segmentation and Reconstruction Approaches based on Deep Learning Methodologies",
        "authors": "Koppagiri Jyothsna Devi, S V Sudha",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212370"
    },
    {
        "id": 2686,
        "title": "Hybrid Encryption Model to Enhance the Storage Security in Edge Cloud Server Based on Deep Learning",
        "authors": "Ahamed Ali, Ezhil Arasu, Hritik S, Surya M",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4365258"
    },
    {
        "id": 2687,
        "title": "Deep Reinforcement Learning Based on Actor-Critic for Task Offloading in Vehicle Edge Computing",
        "authors": "Bingxin Wang, Lei Liu, Jie Wang",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bmsb58369.2023.10211217"
    },
    {
        "id": 2688,
        "title": "Rewriting Deep Learning Models for Maximizing Edge TPU Utilization",
        "authors": "Kung-Fu Chen, Ding-Yong Hong",
        "published": "2023-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpads56603.2022.00091"
    },
    {
        "id": 2689,
        "title": "Ensuring data integrity in deep learning-assisted IoT-Cloud environments: Blockchain-assisted data edge verification with consensus algorithms",
        "authors": "Fahad F. Alruwaili",
        "published": "2024",
        "citations": 0,
        "abstract": "<abstract>\n\n<p>Ensuring the reliability and trustworthiness of massive IoT-generated data processed in cloud-based systems is paramount for data integrity in IoT-Cloud platforms. The integration of Blockchain (BC) technology, particularly through BC-assisted data Edge Verification combined with a consensus system, utilizes BC's decentralized and immutable nature to secure data at the IoT network's edge. BC has garnered attention across diverse domains like smart agriculture, intellectual property, and finance, where its security features complement technologies such as SDN, AI, and IoT. The choice of a consensus algorithm in BC plays a crucial role and significantly impacts the overall effectiveness of BC solutions, with considerations including PBFT, PoW, PoS, and Ripple in recent years. In this study, I developed a Football Game Algorithm with Deep learning-based Data Edge Verification with a Consensus Approach (FGADL-DEVCA) for BC assisted IoT-cloud platforms. The major drive of the FGADL-DEVCA algorithm was to incorporate BC technology to enable security in the IoT cloud environment, and the DL model could be applied for fault detection efficiently. In the FGADL-DEVCA technique, the IoT devices encompassed considerable decentralized decision-making abilities for reaching an agreement based on the performance of the intrablock transactions. Besides, the FGADL-DEVCA technique exploited deep autoencoder (DAE) for the recognition and classification of faults in the IoT-cloud platform. To boost the fault detection performance of the DAE approach, the FGADL-DEVCA technique applied FGA-based hyperparameter tuning. The experimental result analysis of the FGADL-DEVCA technique was performed concerning distinct metrics. The experimental values demonstrated the betterment of the FGADL-DEVCA approach with other existing methods concerning various aspects.</p>\n\n</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024432"
    },
    {
        "id": 2690,
        "title": "A-Eye: Computer vision and Deep learning based Smart-Glasses with Edge computing for Visually Impaired",
        "authors": "Sanjay Rajaraman, Ps Shivapriya",
        "published": "2023-3-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp57993.2023.10134901"
    },
    {
        "id": 2691,
        "title": "Computation Offloading in Mobile Edge Computing for Next Generation Networks: A deep reinforcement learning approach",
        "authors": "Shrey Dhiman, Amita Chauhan, Sakshi Kasuhal, Harish Kumar",
        "published": "2023-1-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080439"
    },
    {
        "id": 2692,
        "title": "Application of Physics-Informed Deep Learning in Electrostatic Field Analysis",
        "authors": "Fan Liu, Jiahao Liu, Guang Yang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asemd59061.2023.10369952"
    },
    {
        "id": 2693,
        "title": "Research and application of talent training evaluation model based on deep learning",
        "authors": "Hong Wang",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2682979"
    },
    {
        "id": 2694,
        "title": "Hyperspectral imaging and deep learning for precision surgical intervention",
        "authors": "Baowei Fei",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3009170"
    },
    {
        "id": 2695,
        "title": "Meta-surface lens and deep learning process toward practical LWIR imaging devices",
        "authors": "Wontaek Seo, Duhyun Lee, Yongseop Yoon, Soonkeun Chang, Jangwoo You, Byungkyu Lee, Seyoon Kim",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2674111"
    },
    {
        "id": 2696,
        "title": "Collaborative cloud-edge-end task offloading with task dependency based on deep reinforcement learning",
        "authors": "Tiantian Tang, Chao Li, Fagui Liu",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.comcom.2023.06.021"
    },
    {
        "id": 2697,
        "title": "FCN Based Deep Learning Architecture for Medical Image Segmentation",
        "authors": "Bindu Neelam, Pavan Kumar Palakayala, Kusiyo Mbangweta, Karthik Raparla, S Anjali Devi",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212108"
    },
    {
        "id": 2698,
        "title": "Deep Learning for Semiconductor Materials and Devices Design",
        "authors": "Changwook Jeong, Sanghoon Myung, Byungseon Choi, Jinwoo Kim, Wonik Jang, In Huh, Jae Myung Choe, Young-Gu Kim, Dae Sin Kim",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/edtm55494.2023.10103098"
    },
    {
        "id": 2699,
        "title": "Edge computing-based internet of medical things for healthcare using deep learning",
        "authors": "Himabindu Sathyaveti, C. Gomathy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijes.2023.10061929"
    },
    {
        "id": 2700,
        "title": "Dynamic task scheduling in edge cloud systems using deep recurrent neural networks and environment learning approaches",
        "authors": "S.K. Ammavasai",
        "published": "2024-3-23",
        "citations": 0,
        "abstract": "The rapid growth of the cloud computing landscape has created significant challenges in managing the escalating volume of data and diverse resources within the cloud environment, catering to a broad spectrum of users ranging from individuals to large corporations. Ineffectual resource allocation in cloud systems poses a threat to overall performance, necessitating the equitable distribution of resources among stakeholders to ensure profitability and customer satisfaction. This paper addresses the critical issue of resource management in cloud computing through the introduction of a Dynamic Task Scheduling with Virtual Machine allocation (DTS-VM) strategy, incorporating Edge-Cloud computing for the Internet of Things (IoT). The proposed approach begins by employing a Recurrent Neural Network (RNN) algorithm to classify user tasks into Low Priority, Mid Priority, and High Priority categories. Tasks are then assigned to Edge nodes based on their priority, optimizing efficiency through the application of the Spotted Hyena Optimization (SHO) algorithm for selecting the most suitable edge node. To address potential overloads on the edge, a Fuzzy approach evaluates offloading decisions using multiple metrics. Finally, optimal Virtual Machine allocation is achieved through the application of the Stable Matching algorithm. The seamless integration of these components ensures a dynamic and efficient allocation of resources, preventing the prolonged withholding of customer requests due to the absence of essential resources. The proposed system aims to enhance overall cloud system performance and user satisfaction while maintaining organizational profitability. The effectiveness of the DTS-VM strategy is validated through comprehensive testing and evaluation, showcasing its potential to address the challenges posed by the diverse and expanding cloud computing landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-236838"
    },
    {
        "id": 2701,
        "title": "E2D2: Elephant Emotion and Distraction Detection Framework using Edge-Enabled YOLOv5 Deep Learning Algorithm",
        "authors": "Yu-Ju Chiu, Shajulin Benedict, Michael Gerndt",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inc457730.2023.10262860"
    },
    {
        "id": 2702,
        "title": "Edge computing-based internet of medical things for healthcare using deep learning",
        "authors": "Himabindu Sathyaveti, C. Gomathy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijes.2023.136374"
    },
    {
        "id": 2703,
        "title": "Bringing intelligence to Edge/Fog in Internet of Things‐based healthcare applications: Machine learning/deep learning‐based use cases",
        "authors": "Hela Makina, Asma Ben Letaifa",
        "published": "2023-6",
        "citations": 3,
        "abstract": "SummaryInternet of things and smart medical applications are deeply changing the way healthcare is delivered worldwide. A typical Internet of Things (IoT)‐based eHealth system includes medical sensors for data collection, access network to transmit data, and Cloud servers for data processing and storage. Machine learning/deep learning (ML/DL) have proven to be a powerful tool for data classification, disease prognosis, and diagnosis and even medication prescription. ML/DL models need a large amount of data and significant computational and storage capacities especially for the training phase. Deploying ML/DL algorithms in the Cloud can be effectively done due to the processing and storage power of Cloud data centers. However, it raises many issues related to the availability, latency, energy consumption, bandwidth, security, and privacy. Recently, there is a growing interest to run as much processing as possible nearer the data sources, in the Edge, to compensate the Cloud‐based solutions limitations. In this paper, we propose to investigate the benefits of using IoT, ML/DL, and Edge Computing to enhance healthcare applications. Then, we are going to review the main approaches and trends for executing ML/DL in the Edge, to give their benefits and limitations, and draw finally conclusions about existing research issues.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/dac.5484"
    },
    {
        "id": 2704,
        "title": "Blockchain-Enabled Federated Learning with Neuromorphic Edge Devices for Drone Identification and Flight Mode Detection",
        "authors": "Alex Henderson, Chris Yakopcic, Jamison Colter, Steven Harbour, Tarek Taha",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dasc58513.2023.10311304"
    }
]