[
    {
        "id": 9305,
        "title": "Design of thermal tomography Image Segmentation Algorithm Based on Fuzzy C-means Clustering",
        "authors": "Kui Zhang",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaml60083.2023.00073"
    },
    {
        "id": 9306,
        "title": "MR Brain Image Segmentation Using Spatial Fuzzy C- Means Clustering Algorithm",
        "authors": "Safa Soud Mahdi, Reem Shakir Mahmood",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "conventional FCM algorithm does not fully utilize the spatial information in the image. In this research, we use a FCM algorithm that incorporates spatial information into the membership function for clustering. The spatial function is the summation of the membership functions in the neighborhood of each pixel under consideration. The advantages of the method are that it is less sensitive to noise than other techniques, and it yields regions more homogeneous than those of other methods. This technique is a powerful method for noisy image segmentation. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.31026/j.eng.2014.09.06"
    },
    {
        "id": 9307,
        "title": "Robust joint learning of superpixel generation and superpixel-based image segmentation using fuzzy C-multiple-means clustering",
        "authors": "Chengmao Wu, Jingtian Zhao",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11760-023-02911-6"
    },
    {
        "id": 9308,
        "title": "Metal Abrasive Image Segmentation Algorithm Based on K-means Clustering",
        "authors": "Pengpeng Zhang, Wei Wu, Yu Li, Yukun Wang",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "Metal abrasive image segmentation is one of the important image processing tasks in the industrial field. However, due to the complex color and texture characteristics of metal abrasive images, as well as difficult factors such as noise and lighting changes, traditional image segmentation methods often fail to achieve high accuracy and stability. In order to solve this problem, a metal abrasive image segmentation algorithm based on K-means clustering is proposed. The algorithm applies the K-means clustering algorithm to the image segmentation of metal abrasive particles, and realizes the separation of metal abrasive grains from the background by clustering the color features of image pixels. Experimental results show that our algorithm shows good accuracy and stability in the metal abrasive image segmentation task, and has high efficiency. Therefore, the algorithm provides an accurate and efficient method for metal abrasive image segmentation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/ajst.v7i2.12328"
    },
    {
        "id": 9309,
        "title": "A Robust Contextual Fuzzy C-Means Clustering Algorithm for Noisy Image Segmentation",
        "authors": "Karim Kalti, Asma Touil",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00357-023-09443-1"
    },
    {
        "id": 9310,
        "title": "Interval type-2 possibilistic picture C-means clustering incorporating local information for noisy image segmentation",
        "authors": "Chengmao Wu, Tairong Liu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dsp.2024.104492"
    },
    {
        "id": 9311,
        "title": "Novel Improved Fuzzy C-means Clustering for MR Image Brain Tissue Segmentation to Detect Alzheimer’s Disease",
        "authors": "Esraa H. Ali, Sawsan Sadek, Zaid F. Makki",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca59364.2023.10401833"
    },
    {
        "id": 9312,
        "title": "Master-slave hierarchy local information driven fuzzy C-means clustering for noisy image segmentation",
        "authors": "Chengmao Wu, Wen Wu",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00371-023-02821-1"
    },
    {
        "id": 9313,
        "title": "Research and improvement of C-means clustering algorithm based on Image segmentation application",
        "authors": "Chunying Wang, Jiahui Zhang, Qi Yang",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "The traditional fuzzy C-means clustering technology only considers one performance Angle of image segmentation process when processing data, resulting in low accuracy of image segmentation. In this paper, the traditional FCM algorithm is analyzed, and the low clustering accuracy, noise interference and lack of flexibility and other problems are fully considered from the relationship between parameter components, non-local spatial information elements and noise sensitivity. Firstly, a distance calculation method based on robust statistics theory is proposed, which can deal with abnormal noise stably. Secondly, based on the extreme learning machine theory, the non-local spatial information coefficient is introduced to improve the identification ability of the influence factors. This method not only guarantees the anti-noise performance of the algorithm, but also preserves the image data, improving the iteration efficiency and segmentation accuracy of the algorithm. The test results show that the accuracy of the improved C-means clustering algorithm for image segmentation is 95.5%, which is compared with the traditional C-means clustering technique and other optimization algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-222912"
    },
    {
        "id": 9314,
        "title": "Nonparametric K-means clustering-based adaptive unsupervised colour image segmentation",
        "authors": "Zubair Khan, Jie Yang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-024-01228-5"
    },
    {
        "id": 9315,
        "title": "Mahalanobis Fuzzy C-Means Clustering with Spatial Information for Image Segmentation",
        "authors": "Wawan Gunawan, Nurul Latifah",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "A fuzzy C-Means segmentation algorithm can be implemented in an image segmentationbased on the Mahalanobis distance; However, this method only needs to consider the colorspace situation, not the neighborhood system of the image. It was an effective edge detectionprocess unwell performed and generated less accuracy in segmentation results. In this article,we propose a new method for image segmentation with Mahalanobis fuzzy C-means Spatialinformation (MFCMS). The proposed method combines feature space and images of theinformation of the neighborhood (spatial information) to improve the accuracy of the result ofsegmentation on the image. The MFCMS consists of two steps, the histogram threshold modulefor the first step and the MFCMS module for the second step. The Histogram Threshold moduleis used to get the MFCMS initialization conditions for the cluster centroid and the number ofcentroids. Test results show that this method provides better segmentation performance thanclassification errors (ME) and relative foreground area errors (RAE) of 1.61 and 3.48,respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22146/ijccs.81521"
    },
    {
        "id": 9316,
        "title": "Enhanced hyperspectral image segmentation and classification using K-means clustering with connectedness theorem and swarm intelligent-BiLSTM",
        "authors": "A. Josephine Christilda, R. Manoharan",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compeleceng.2023.108897"
    },
    {
        "id": 9317,
        "title": "Cardiac CT Image Segmentation for Deep Learning–Based Coronary Calcium Detection Using K-Means Clustering and Grabcut Algorithm",
        "authors": "Sungjin Lee, Ahyoung Lee, Min Hong",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.037055"
    },
    {
        "id": 9318,
        "title": "Development of a Medical Image Segmentation Algorithm based on Fuzzy C-Means Clustering",
        "authors": "El Fahssi Khalid, Ounasser Saida, Mohamed Taj Bennani, Abenaou Abdenbi",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Breast mass segmentation in mammography plays a very important role in computer-aided diagnosis (CAD) systems. In this article, we propose a mammography image segmentation method based on a combined approach. The fuzzy clustering method and thresholding segmentation. Subsequently, we use the wavelet transform and the Canny filter for edge detection.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/232014.2023.19.23"
    },
    {
        "id": 9319,
        "title": "Improving the quality of handwritten image segmentation using k-means clustering algorithms with spatial filters",
        "authors": "Muhammad Munsarif, Muhammad Saman",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "One of the ways to predict human characters is by using handwritten patterns. Graphologists have analyzed handwriting to determine a writer's personality by considering several parameters: writing slopes, spacing, inclination, and writing size. The results of the analysis have been widely used as a reference for psychologists to assess an individual's personality. Moreover, researchers have applied techniques to identify human characters using image processing techniques. However, different styles of handwriting require more research to develop. The process of separating objects from backgrounds needs a segmentation process. This research improves the quality of handwritten image segmentation using k-means clustering algorithms with the spatial filter. This spatial filter consisted of the median and mean filters. This research created various k values to gain the best segmentation results. The results showed that the median filter with a kernel size of 3×3 and the k value = 2 was the best segmentation result because the value of silhouette coefficient was the highest compared to the value of filter type and other k values which reach 99.22%. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/csit.v5i1.p32-39"
    },
    {
        "id": 9320,
        "title": "Multiview Type-2 kernelized fuzzy C-means clustering with local information for noisy color image segmentation",
        "authors": "Xiumei Cai, Xi Yang, Chengmao Wu, Rui Zhang",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "Focusing on the currently available multi-view fuzzy clustering algorithms, many of which frequently lack robustness and are hence less frequently used in image segmentation. We present a multi-view fuzzy clustering image segmentation algorithm in this research, along with an autonomous view-weight learning mechanism. Firstly, to ensure that each view has the best view weight, the algorithm adds a view weight factor. Secondly, it introduces the weighted fuzzy factor and the kernel distance metric, the role of the weighted fuzzy factor is to collect the local spatial information and local grey scale information to preserve as much of the image’s detailed information as feasible during segmentation. The role of the kernel distance metric is to lessen the influence of outliers and noisy points on image segmentation. Finally, the technique for resolving the issue of image uncertainty and fuzzy factor selection introduces the concept of interval type-2 fuzzy c-means clustering. Numerous experiments on different images demonstrate that the proposed algorithm in this paper is more robust than previous multi-view fuzzy clustering algorithms for solving noise image segmentation problems. It is also more effective at segmenting images contaminated by noise and can better retain the detailed information in the image.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-235967"
    },
    {
        "id": 9321,
        "title": "Multi-view fuzzy C-means clustering with kernel metric and local information for color image segmentation",
        "authors": "Xiumei Cai, Xi Yang, Chengmao Wu",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "PurposeMulti-view fuzzy clustering algorithms are not widely used in image segmentation, and many of these algorithms are lacking in robustness. The purpose of this paper is to investigate a new algorithm that can segment the image better and retain as much detailed information about the image as possible when segmenting noisy images.Design/methodology/approachThe authors present a novel multi-view fuzzy c-means (FCM) clustering algorithm that includes an automatic view-weight learning mechanism. Firstly, this algorithm introduces a view-weight factor that can automatically adjust the weight of different views, thereby allowing each view to obtain the best possible weight. Secondly, the algorithm incorporates a weighted fuzzy factor, which serves to obtain local spatial information and local grayscale information to preserve image details as much as possible. Finally, in order to weaken the effects of noise and outliers in image segmentation, this algorithm employs the kernel distance measure instead of the Euclidean distance.FindingsThe authors added different kinds of noise to images and conducted a large number of experimental tests. The results show that the proposed algorithm performs better and is more accurate than previous multi-view fuzzy clustering algorithms in solving the problem of noisy image segmentation.Originality/valueMost of the existing multi-view clustering algorithms are for multi-view datasets, and the multi-view fuzzy clustering algorithms are unable to eliminate noise points and outliers when dealing with noisy images. The algorithm proposed in this paper has stronger noise immunity and can better preserve the details of the original image.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ec-08-2023-0403"
    },
    {
        "id": 9322,
        "title": "CUSTOMER SEGMENTATION WITH K-MEANS CLUSTERING",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets44609"
    },
    {
        "id": 9323,
        "title": "Adaptive Kernelized Evidence C-Means Clustering Combining Spatial Information for Noisy Image Segmentation",
        "authors": "Lan Rong, Mi Haowen, Qu Na, Zhao Feng, Yu Haiyan, Zhang Lu",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00016"
    },
    {
        "id": 9324,
        "title": "Image segmentation in Diagnosing the Ground Bud Necrosis Virus in Tomatoes using K-Means Clustering",
        "authors": "K. U. Kadam, R. B. Dhumale, N. R. Dhumale, S. S. Nikam, P. B. Mane",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "Early-stage fruit disease detection will ensure the natural product quality for the organic agriculture business. The potential of using K-Means segmentation for diagnosing tomatoes fruit disease was intended to be explored by this proposed method. The main goal of paper is to increase classification accuracy by locating tomatoes with Ground Bud Necrosis Virus in Tomatoes disease using an image segmentation approach. The K-means clustering algorithm is intended to boost segmentation effectiveness. In the end product, the images are divided into three classes: Grade 0—00-15%; Grade 1—16-35%; Grade 2—36-65%; Grade 3—66-85%; and Class 4—86-100%. Moreover, the tested results of the proposed approach explore a variety of unhealthy images and disease Tomatoes and demonstrate that, when compared to existing methods, the proposed method has the highest accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37391/ijeer.110306"
    },
    {
        "id": 9325,
        "title": "Customer Personality Segmentation Using K-Means Clustering",
        "authors": "Lana Al-Dabbas, Hassan Al-Tarawneh, Thamer A Al-Rawashdeh",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icit58056.2023.10225996"
    },
    {
        "id": 9326,
        "title": "Local feature driven fuzzy local information C-means clustering with kernel metric for blurred and noisy image segmentation",
        "authors": "Chengmao Wu, Xiao Qi",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11554-023-01371-y"
    },
    {
        "id": 9327,
        "title": "Unsupervised Few-Shot Image Segmentation with Dense Feature Learning and Sparse Clustering",
        "authors": "Kuangdai Leng, Robert Atwood, Winfried Kockelmann, Deniza Chekrygina, Jeyan Thiyagalingam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012380700003660"
    },
    {
        "id": 9328,
        "title": "Clustering of Tuberculosis and Normal Lungs Based on Image Segmentation Results of Chan-Vese and Canny with K-Means",
        "authors": "Fayza Nayla Riyana Putri, Nur Cahyo Hendro Wibowo, Hery Mustofa",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "The lungs are a vital organ in the human body. If there is interference with lung function, the health of the human body as a whole can be affected. Examination by medical workers needs to be done when there is interference with lung function. This examination can usually be done in various ways, one of which is through a chest X-ray radiographic examination procedure. The application of Artificial Intelligence is growing rapidly in the medical field, especially in diagnostics and treatment management. Artificial intelligence in the medical world can also be applied in processing image data in radiology to analyze X-ray results as supporting diagnostic information. Operators Chan-Vese and Canny are two edge detection operators in digital image processing in an effort to obtain the necessary information based on the shape and size of the object. This study was conducted for clustering of normal and tuberculosis lung conditions based on the results of chest X-ray image segmentation from Chan-Vese and Canny using K-Means Clustering. The results of clustering using K-Means obtained an accuracy value of 77.1%, a precision value of 88%, and a specificity value of 97.2%",
        "keywords": "",
        "link": "http://dx.doi.org/10.24014/ijaidm.v6i1.21835"
    },
    {
        "id": 9329,
        "title": "Center-free intuitionistic fuzzy c-means clustering algorithm based on similarity of hybrid spatial membership for image segmentation",
        "authors": "Lan Rong, Wang Shumin, He Hu, Zhao Feng, Yu Haiyan, Zhang Lu",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00019"
    },
    {
        "id": 9330,
        "title": "An improved GABOR wavelet transform and rough k-means clustering algorithm for MRI BRAIN tumor image segmentation",
        "authors": "B. Chinna Rao, K. Raju, G. Ramesh Babu, Chandra Sekhar Pittala",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14485-z"
    },
    {
        "id": 9331,
        "title": "Automated Thalassemia cell image segmentation using hybrid Fuzzy C-Means and K-Means",
        "authors": "",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21271/zjpas.35.4.03"
    },
    {
        "id": 9332,
        "title": "Analysis of the Influence of Number of Segments on Similarity Level in Wound Image Segmentation Using K-Means Clustering Algorithm",
        "authors": "Furizal Furizal, Syifa’ah Setya Mawarni, Son Ali Akbar, Anton Yudhana, Murinto Kusno",
        "published": "2023-9-18",
        "citations": 0,
        "abstract": "This study underscores the importance of wound image segmentation in the medical world to speed up first aid for victims and increase the efficiency of medical personnel in providing appropriate treatment. Although the body has a protective function from external threats, the skin can be easily damaged and cause injuries that require rapid detection and treatment. This study used the K-Means clustering algorithm to segment the external wound image dataset consisting of three types of wounds, namely abrasion, puncture, and laceration. The results showed that K-Means clustering is an effective method for segmenting wound images. The greater the number of segments used, the better the quality of the resulting segmentation. However, it is necessary to take into account the specific characteristics of each type of wound and the number of segments used in order to choose the most suitable segmentation method. Evaluation using various metrics, such as VOI, GCE, MSE, and PSNR, provides an objective assessment of the quality of segmentation. The results showed that abrasion wounds were easier to segment compared to puncture wounds and lacerations. In addition, the size of the image file also affects the speed of program execution, although it is not always absolute depending on the characteristics of the image.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59247/csol.v1i3.33"
    },
    {
        "id": 9333,
        "title": "An active contour model driven by K-means clustering for image segmentation",
        "authors": "Pengqiang Ge, Yiyang Chen, Guina Wang, Guirong Weng, Hongtian Chen",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326533"
    },
    {
        "id": 9334,
        "title": "Exploratory Data Analysis and Data Segmentation using K means Clustering",
        "authors": "Devaghi. P, S. Sudha",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10183143"
    },
    {
        "id": 9335,
        "title": "Customer Segmentation Model using K-means Clustering on E-commerce",
        "authors": "Anshika Agrawal, Puneet Kaur, Monika Singh",
        "published": "2023-3-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscds56580.2023.10105070"
    },
    {
        "id": 9336,
        "title": "Web Usability Segmentation - Applying K-Means Clustering to the System Usability Scale",
        "authors": "Ebenezer Agbozo",
        "published": "2023-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/usbereit58508.2023.10158893"
    },
    {
        "id": 9337,
        "title": "MRI Image Segmentation using Fuzzy C-Means in MATLAB",
        "authors": "Brisaac Johnson, Chris Crawford",
        "published": "2023",
        "citations": 0,
        "abstract": "Image segmentation is challenging because an image has to be partitioned into regions with pixels that contain similar attributes. To accomplish this task, many use MATLAB, Python, or other environments that allow them to set thresholds for the image, to group similar pixels together, or remove undesirable pixels from the image. When approaching the image segmentation problem, many use the fuzzy c-means algorithm to group similar pixels with the same features in an image. Hence, it makes it easier to analyze specific areas in the image, such as a tumor that may be present. This paper presents a tutorial on performing image segmentation using MATLAB and Fuzzy C-Means. Through this tutorial, we examine how fuzzy c-mean is used to solve the image segmentation problem and the methodologies used to properly cluster data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1003026"
    },
    {
        "id": 9338,
        "title": "Customer Segmentation of E-commerce data using K-means Clustering Algorithm",
        "authors": "Lucky Rajput, Shailendra Narayan Singh",
        "published": "2023-1-19",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/confluence56041.2023.10048834"
    },
    {
        "id": 9339,
        "title": "Improved Self-Sparse Fuzzy Clustering Algorithm for Image Segmentation",
        "authors": "Tunirani Nayak, Nilamani Bhoi",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3s57698.2023.10169750"
    },
    {
        "id": 9340,
        "title": "Background Clustering Pre-Training for Few-Shot Segmentation",
        "authors": "Zhimiao Yu, Tiancheng Lin, Yi Xu",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10222055"
    },
    {
        "id": 9341,
        "title": "Enhancing Car Showroom Profitability through K-Means Clustering for Customer Segmentation",
        "authors": "Muhammad Rizky Satya Bhaskara,  , Meditya Wasesa,  ",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "Indonesia is known to be one of Southeast Asia’s largest markets for used cars. Used car showrooms in Indonesia are numerous and varied, some focus on one car brand, some focus on the lower middle class, some focus on the upper middle class, and some provide all types of cars. One of them is PQR Showroom, Even though PQR Showroom was able to generate such a great amount of sales, the profits generated by the PQR showroom are not proportional to the amount of capital invested.  To increase the profit, we proposed the solution using descriptive analytics and prescriptive analytics using K-Means. We also carry out simulations by comparing sales in existing years with the results of the descriptive and prescriptive analytics that have been made for the expected profit.  The results show that the simulation comparison with the data we have obtained from descriptive and prescriptive analysis gives the best-expected profit compared to the initial sales results at the PQR Showroom.  It shows that the data using descriptive and K-Means is great than before. The fastest cars that have been sold is LCGC and the most wanted car is MPY Toyota Avanza and the best profit that can generate is SUV Toyota Fortuner.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijcsrr/v6-i7-106"
    },
    {
        "id": 9342,
        "title": "Retracted: Unsupervised Hyperspectral Microscopic Image Segmentation Using Deep Embedded Clustering Algorithm",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9890786"
    },
    {
        "id": 9343,
        "title": "Customer Segmentation With K-Means Clustering Suzuki Mobil Bandung Customer Case Study",
        "authors": "Dedi Kadarsah, Jerry Heikal",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "In the city of Bandung, it is recorded that until February 2023 as many as 500 thousand private cars crowded the streets in the city of Bandung. People's needs for private cars are met through the purchase of new cars from dealers or used purchases. As a dealer, the main task is to meet car sales targets every month and year. Suzuki dealers, especially in Bandung, do not have solid information about what type of car is most liked by the people of Bandung, what is the background of the customers and what marketing efforts are most optimal to increase sales. Suzuki car sales data for the June-October 2023 period was analyzed as many as 165 sales from various types of cars, customer domicile, customer's proffesion and marketing efforts carried out until the purchase occurred and the choice of payment method. In this paper, a clustering analysis of the K-means method with 4 clusters with car type, customer domicile location, marketing effort, customer profession, transmission type and payment method is made. Analysis performed with IBM SPSS v.29 program.The type of Carry passenger vehicle is the choice of many Suzuki customers in Bandung and Suzuki customers mostly come from the people of Bandung and around Bandung who work as entrepreneurs and traders. Suzuki Bandung needs to maintain and improve Canvansing as an effort to acquire customers as can be seen from the analysis of customer segmentation data in this paper",
        "keywords": "",
        "link": "http://dx.doi.org/10.59141/jist.v5i3.935"
    },
    {
        "id": 9344,
        "title": "Used Car Customer Segmentation Using K-Means Clustering Model With SPSS Program: Case Study Caroline.Id",
        "authors": "Muhammad Farhan, Jerry Heikal",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "This study discusses the use of K-Means clustering algorithm to determine market segmentation and prepare targeted marketing strategies. The process involves grouping customer data based on various factors such as transmission type, customer satisfaction, payment method, and branches. After grouping the data, the initialization stage is carried out by providing an initial number, and then the clustering process is carried out. The resulting clusters are analyzed to identify different customer profiles and needs. With an in-depth understanding of each segmentation, companies can develop specific and targeted marketing strategies for each customer group. Additionally, this study discusses the construction of a brand persona by identifying the target audience, understanding their needs and wants, creating a character profile, and compiling a brand persona document that includes all the important information. The customized brand persona can then be used in the development of online value proposition and marketing strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59141/jiss.v5i03.1042"
    },
    {
        "id": 9345,
        "title": "MAMMOGRAM IMAGE TO DETECT BREAST CANCER USING K-MEANS CLUSTERING ALGORITHM",
        "authors": "",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets34959"
    },
    {
        "id": 9346,
        "title": "Microscopic image segmentation approach based on modified affinity propagation-based clustering",
        "authors": "Shouvik Chakraborty, Kalyani Mali",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18486-4"
    },
    {
        "id": 9347,
        "title": "Customer segmentation of car retails using regularized logistic regression compared with K means clustering",
        "authors": "Upendra Reddy Vagalla, John Justin Thangaraj Selvaraj",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0118059"
    },
    {
        "id": 9348,
        "title": "Micro‐segmentation of retinal image lesions in diabetic retinopathy using energy‐based fuzzy C‐Means clustering (<scp>EFM‐FCM</scp>)",
        "authors": "Huma Naz, Rahul Nijhawan, Neelu Jyothi Ahuja, Tanzila Saba, Faten S. Alamri, Amjad Rehman",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractDiabetic retinopathy (DR) is a prevalent cause of global visual impairment, contributing to approximately 4.8% of blindness cases worldwide as reported by the World Health Organization (WHO). The condition is characterized by pathological abnormalities in the retinal layer, including microaneurysms, vitreous hemorrhages, and exudates. Microscopic analysis of retinal images is crucial in diagnosing and treating DR. This article proposes a novel method for early DR screening using segmentation and unsupervised learning techniques. The approach integrates a neural network energy‐based model into the Fuzzy C‐Means (FCM) algorithm to enhance convergence criteria, aiming to improve the accuracy and efficiency of automated DR screening tools. The evaluation of results includes the primary dataset from the Shiva Netralaya Centre, IDRiD, and DIARETDB1. The performance of the proposed method is compared against FCM, EFCM, FLICM, and M‐FLICM techniques, utilizing metrics such as accuracy in noiseless and noisy conditions and average execution time. The results showcase auspicious performance on both primary and secondary datasets, achieving accuracy rates of 99.03% in noiseless conditions and 93.13% in noisy images, with an average execution time of 16.1 s. The proposed method holds significant potential in medical image analysis and could pave the way for future advancements in automated DR diagnosis and management.Research Highlights\nA novel approach is proposed in the article, integrating a neural network energy‐based model into the FCM algorithm to enhance the convergence criteria and the accuracy of automated DR screening tools.\nBy leveraging the microscopic characteristics of retinal images, the proposed method significantly improves the accuracy of lesion segmentation, facilitating early detection and monitoring of DR.\nThe evaluation of the method's performance includes primary datasets from reputable sources such as the Shiva Netralaya Centre, IDRiD, and DIARETDB1, demonstrating its effectiveness in comparison to other techniques (FCM, EFCM, FLICM, and M‐FLICM) in terms of accuracy in both noiseless and noisy conditions. It achieves impressive accuracy rates of 99.03% in noiseless conditions and 93.13% in noisy images, with an average execution time of 16.1 s.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/jemt.24413"
    },
    {
        "id": 9349,
        "title": "K-CAE: Image Classification Using Convolutional AutoEncoder Pre-Training and K-means Clustering",
        "authors": "Aida Chefrour, Samia Drissi",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31449/inf.v47i7.4499"
    },
    {
        "id": 9350,
        "title": "Customer Segmentation Using K-Means Clustering Algorithm and RFM Model",
        "authors": "Gözde ASLANTAŞ, Mustafacan GENÇGÜL, Merve RUMELLİ, Mustafa ÖZSARAÇ, Gözde BAKIRLI",
        "published": "2023-5-15",
        "citations": 1,
        "abstract": "The key points in customer segmentation are determining target customer groups and satisfying their needs. Recency-Frequency-Monetary (RFM) analysis and K-Means clustering algorithm are the popular methods for customer segmentation when analyzing customer behavior. In our study, we adapt the K-means clustering algorithm to RFM model by extracting features that represent RFM aspects of home appliances. Customers with similar RFM-oriented features are assigned to the same clusters, while customers with non-similar RFM-oriented features are assigned to different clusters. In the experiments, clustering achieved the determined threshold for Silhouette Score. The resulting clusters were ranked and named by Customer Lifetime Value (CLV) metric, which measures how valuable a customer is to the business.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21205/deufmd.2023257418"
    },
    {
        "id": 9351,
        "title": "An Unsupervised Learning Based System Employing K-Means Clustering to Perform Customer Segmentation",
        "authors": "Atharva Gupta",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "Abstract: The job of marketers is to get the right product in front of the right consumer at the moment that they’re most likely to buy that product. The ability for marketers to do just that and to drill down to more and more specific niches of customers has grown exponentially over time. AI technology is now being used to help marketers get even more specific with predictive targeting and personalization. Targeted advertising is a form of online advertising which micro-targets its customers. It is based on the traits and behavioral patterns of different people. Nowadays, people, knowingly or unknowingly, are churning out personal data at an unprecedented scale because of the use of all electronic devices.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.53911"
    },
    {
        "id": 9352,
        "title": "Improved Segmentation Model for Melanoma Lesion Detection Using Normalized Cross-Correlation-Based <i>k</i>-Means Clustering",
        "authors": "Muhammad Imran Faizi, Syed Muhammad Adnan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3360223"
    },
    {
        "id": 9353,
        "title": "PuzzleNN: A Neural Network for Image Segmentation Based on Clustering",
        "authors": "Ada-Astrid Mocanu, Adrian Iftene",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inista59065.2023.10310461"
    },
    {
        "id": 9354,
        "title": "Customer segmentation with K-means clustering algorithm for E-commerce sales visualization",
        "authors": "Rama Putra Kuswidyawan, Dedi Trisnawarman, Janson Hendryli",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0126981"
    },
    {
        "id": 9355,
        "title": "Adaptive cuckoo search algorithm based fuzzy C means clustering with random walker algorithm for liver segmentation using CT images",
        "authors": "S. Subha,  Kumaran",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-024-18708-9"
    },
    {
        "id": 9356,
        "title": "Sedimentary Analysis Via Automatic Image Segmentation and Clustering with the LWD OBM Resistivity Image: A Case Study from Gulf of Mexico",
        "authors": "S. Yang, Y. Wang, C. Shrivastava",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Abstract\nMicrofacies analysis is the first step for depositional environment interpretation and sand body prediction. Textural details from borehole images are building blocks for facies analysis, representing different paleo sediimentation conditions. Associated workflows have been applied on high resolution borehole images by geologists and log analysts manually. Automation via machine learning solutions provides an opportunity to improve the working efficiency and accuracy. Such an approach has given satisfactory results with post-drilling wireline images. In this paper, the improved workflow for sedimentary analysis was applied and validated with a logging-while-drilling (LWD) resistivity imager in oil-based mud environment (OBM).\nThe OBM LWD resistivity image in oil-based mud provides 72 data points at single depth from 4 different frequencies of electromagnetic measurements with a patented processing. The non-gap resistivity image gives more confident texture characterization. The continuous histogram and correlogram derived from image data were used for image segmentation. In each image segmentation, multiple vector properties were extracted from image data representing different texture features including adoptive variogram horizontally. Agglomerative clustering was selected for its stability and repeatability. The internally built dendrogram allows to automatically determine the number of clusters by finding a stable distance between the clusters’ hierarchy branches. In addition to the features extracted from image data, optional petrophysical logs with variable weights may be fed to the algorithm for a better classification.\nA case study from Gulf of Mexico is being used to demonstrate this workflow with Hi-Res LWD image. More than 10 different sedimentary geometries were classified automatically from image and petrophysical logs. The microfacies were named manually from sedimentary geometries with the related geological concept accordingly. The fluvial channel and delta sedimentary environment were interpretated finally from microfacies association. The interpretation results were compared and validated with published dips-based solution as well.\nThis is the first time for the automatic borehole image segmentation with LWD OBM images. The working efficiency was improved a lot through this workflow and the accuracy of microfacies interpretation was guaranteed by machine learning solution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/214908-ms"
    },
    {
        "id": 9357,
        "title": "Biomedical Image Segmentation Using Integrated FCM Clustering Modified with Regularized Level Set Method",
        "authors": "Annu Mishra, Pankaj Gupta, Peeyush Tewari",
        "published": "2023-5-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt57929.2023.10150542"
    },
    {
        "id": 9358,
        "title": "Lossless Image Compression using K-Means Clustering in Color Pixel Domain",
        "authors": "Rimjhim Kumari, Srinivasan Sriramulu",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic2pct60090.2024.10486602"
    },
    {
        "id": 9359,
        "title": "A survey on the utilization of Superpixel image for clustering based image segmentation",
        "authors": "Buddhadev Sasmal, Krishna Gopal Dhal",
        "published": "2023-9",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14861-9"
    },
    {
        "id": 9360,
        "title": "A single plant segmentation method of maize point cloud based on Euclidean clustering and K-means clustering",
        "authors": "Yanlong Miao, Shuai Li, Liuyang Wang, Han Li, Ruicheng Qiu, Man Zhang",
        "published": "2023-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compag.2023.107951"
    },
    {
        "id": 9361,
        "title": "Foreground-Back ground Segmentation using K-Means Clustering Algorithm\n                        and Support Vector Machine",
        "authors": "Masoumeh Rezaei, mansoureh rezaei, Masoud Rezaei",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52547/jist.16507.11.41.65"
    },
    {
        "id": 9362,
        "title": "Plant Leaf Diseases Classification Using Improved K-Means Clustering and SVM Algorithm for Segmentation",
        "authors": "Mona Jamjoom, Ahmed Elhadad, Hussein Abulkasim, Safia Abbas",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.037310"
    },
    {
        "id": 9363,
        "title": "Image Segmentation and Filtering of Anaerobic Lagoon Floating Cover in Digital Elevation Model and Orthomosaics Using Unsupervised k-Means Clustering for Scum Association Analysis",
        "authors": "Benjamin Steven Vien, Thomas Kuen, Louis Raymond Francis Rose, Wing Kong Chiu",
        "published": "2023-11-14",
        "citations": 1,
        "abstract": "In various engineering applications, remote sensing images such as digital elevation models (DEMs) and orthomosaics provide a convenient means of generating 3D representations of physical assets, enabling the discovery of new insights and analyses. However, the presence of noise and artefacts, particularly unwanted natural features, poses significant challenges, and their removal requires the application of filtering techniques prior to conducting analysis. Unmanned aerial vehicle-based photogrammetry is used at Melbourne Water’s Western Treatment Plant as a cost-effective and efficient method of inspecting the floating covers on the anaerobic lagoons. The focus of interest is the elevation profile of the floating covers for these sewage-processing lagoons and its implications for sub-surface scum accumulation, which can compromise the structural integrity of the engineered assets. However, unwanted artefacts due to trapped rainwater, debris, dirt, and other irrelevant structures can significantly distort the elevation profile. In this study, a machine learning algorithm is utilised to group distinct features on the floating cover based on an image segmentation process. An unsupervised k-means clustering algorithm is employed, which operates on a stacked 4D array composed of the elevation of the DEM and the RGB channels of the associated orthomosaic. In the cluster validation process, seven cluster groups were considered optimal based on the Calinski–Harabasz criterion. Furthermore, by utilising the k-means method as a filtering technique, three clusters contain features related to the elevations associated with the floating cover membrane, collectively representing 84% of the asset, with each cluster contributing at least 19% of the asset. The artefact groups constitute less than 6% of the asset and exhibit significantly different features, colour characteristics, and statistical measurements from those of the membrane groups. The study found notable improvements using the k-means filtering method, including a 59.4% average reduction in outliers and a 36.3% decrease in standard deviation compared to raw data. Additionally, employing the proposed method in the scum hardness analysis improved correlation strength by 13.1%, removing approximately 16% of the artefacts in total assets, in contrast to a 3.6% improvement with the median filtering method. This improved imaging will lead to significant benefits when integrating imagery into deep learning models for structural health monitoring and asset performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs15225357"
    },
    {
        "id": 9364,
        "title": "Colour‐based segmentation using <scp>FCM</scp> and <scp>K‐means</scp> clustering for <scp>3D</scp> thyroid gland state image classification using deep convolutional neural network structure",
        "authors": "Devanand Ongole, S. Saravanan",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractThyroid cancer is a rare disease that often goes undetected until it reaches advanced stages. This study presents a novel approach for identifying Thyroid Imaging Reporting and Data System (TI‐RADS) stages of thyroid nodules using a deep convolutional neural network (Deep‐CNN) model. Our method incorporates pre‐processing, segmentation and feature extraction using colour based fuzzy‐c‐means and K‐means clustering, followed by deep learning classification. We demonstrate the efficacy of our proposed approach by achieving a success rate of 87% for classifying TI‐RADS1, TI‐RADS2, TI‐RADS3, TI‐RADS4 and TI‐RADS5 stages, outperforming other state‐of‐the‐art models. Our study fills an important gap in the literature, as previous studies have mainly focused on the margins of thyroid nodules rather than their calcium flecks. Our results offer promise for improving the accuracy and efficiency of thyroid cancer detection and management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ima.22900"
    },
    {
        "id": 9365,
        "title": "Segmentation Analysis Using K-Means Clustering Model with SPSS Case Study of Backpacker Jakarta Community Members",
        "authors": "Asti Apriani, Jerry Heikal",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "The development of the world of tourism is currently experiencing high growth. With repairs and increasing the quality of tourist spots, it has succeeded in encouraging and increasing public interest in visiting. Traveling at this time has also been carried out in various ways both by individuals and groups. One of the quite existing tourist groups in Jakarta is the Backpacker Jakarta Community (BPJ), which offers low-cost travel packages with the Backpacker pattern. In this study, the authors conducted a survey of BPJ’s members/members by distributing questionnaires containing personal data and also regarding the interest of the members in the trips or trips they had participated in so far. From this process the researcher obtained feedback and analyzed the answers from 96 respondents, using the clustering method with K-means clustering analysis, and then determined 7 clusters to get an overview of the variations in the interest of BPJ’s members. Of the 7 clusters, the researcher chose one of the potential clusters to develop travel tour package products, namely BPJ’s Member Mountaineering Lover Cluster which contains quite young groups between 22-35 years old. Furthermore, the researcher determines the Value Proposition of the cluster to determine the strategic steps for the marketing mix strategy with the 8P.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.59141/jiss.v5i03.1031"
    },
    {
        "id": 9366,
        "title": "Robust superpixel-based fuzzy possibilistic clustering method incorporating local information for image segmentation",
        "authors": "Chengmao Wu, Jingtian Zhao",
        "published": "2023-12-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00371-023-03218-w"
    },
    {
        "id": 9367,
        "title": "A defect detection method for lithium batteries based on shear wave threshold and K-means clustering segmentation",
        "authors": "Xiyang Pan, Linsheng Li",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3025970"
    },
    {
        "id": 9368,
        "title": "Data Segmentation with Improved K-Means Clustering Algorithm",
        "authors": "Emam Hasan, Md. Abdur Rahman, MD. Shojib Talukder, Md Farnas Utsho, Md. Shakhan, Dewan Md. Farid",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441078"
    },
    {
        "id": 9369,
        "title": "Adaptive Clustering Algorithm Applied towards Robust Image Segmentation of Hyper Spectral Scans",
        "authors": "Murugan R, Madhav Solanki, Arun Gupta",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470676"
    },
    {
        "id": 9370,
        "title": "Selecting optimal k for K-means in image segmentation using GLCM",
        "authors": "Muath Sabha, Muhammed Saffarini",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17615-9"
    },
    {
        "id": 9371,
        "title": "Research on Application Method of Image Segmentation Based on Fuzzy Clustering",
        "authors": "Youli Ren, Shunyou Liu, Mian Huang",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/scout58937.2023.00052"
    },
    {
        "id": 9372,
        "title": "Combining Color and Spatial Image Features for Unsupervised Image Segmentation with Mixture Modelling and Spectral Clustering",
        "authors": "Branislav Panić, Marko Nagode, Jernej Klemenc, Simon Oman",
        "published": "2023-11-28",
        "citations": 1,
        "abstract": "The demand for accurate and reliable unsupervised image segmentation methods is high. Regardless of whether we are faced with a problem for which we do not have a usable training dataset, or whether it is not possible to obtain one, we still need to be able to extract the desired information from images. In such cases, we are usually gently pushed towards the best possible clustering method, as it is often more robust than simple traditional image processing methods. We investigate the usefulness of combining two clustering methods for unsupervised image segmentation. We use the mixture models to extract the color and spatial image features based on the obtained output segments. Then we construct a similarity matrix (adjacency matrix) based on these features to perform spectral clustering. In between, we propose a label noise correction using Markov random fields. We investigate the usefulness of our method on many hand-crafted images of different objects with different shapes, colorization, and noise. Compared to other clustering methods, our proposal performs better, with 10% higher accuracy. Compared to state-of-the-art supervised image segmentation methods based on deep convolutional neural networks, our proposal proves to be competitive.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11234800"
    },
    {
        "id": 9373,
        "title": "Unveiling Purchasing Patterns in Grocery Store Consumer Segmentation Insight From K - Means Clustering",
        "authors": "Ivan Diryana Sudirman, Iston Dwija Utama, Ronny Samsul Bahri, Robertus Hery Susanto",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ice-smartech59237.2023.10461973"
    },
    {
        "id": 9374,
        "title": "Research on Base Station Siting Based on K-Means Clustering Algorithm",
        "authors": "Xiyuan Miao, Jiazhen Zhang, Han Xiao",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257904"
    },
    {
        "id": 9375,
        "title": "Donor Segmentation in Indonesia Based on Recency, Frequency, Monetary, and Age (RFMA) Using the K-Means Clustering Algorithm",
        "authors": "Achmad Solichin, Jenar Suseno, Hari Soetanto",
        "published": "2023-11-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icimcis60089.2023.10349025"
    },
    {
        "id": 9376,
        "title": "A novel NAM‐based image segmentation using hierarchical density‐based spatial clustering",
        "authors": "Yunping Zheng, Dilong Wen, Mudar Sarem",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractThis paper proposes a new method for hierarchical image segmentation based on the nonsymetry and anti‐packing pattern representation model (NAM) and the hierarchical density‐based spatial clustering of application with noise (HDBSCAN). The proposed framework consists of two phases. In the first phase, a super‐pixel generation algorithm base on NAM is proposed. In the second phase, instead of defining an affinity matrix to merge similar regions using spatial clustering, the distance matrix defined by different region features is directly fitted into an HDBSCAN clustering module in order to merge similar regions efficiently. Similar adjacent regions can be merged into larger ones progressively and form a segmentation dendrogram for image segmentation with the clustering module. The experiments show that the proposed algorithm has a comparable or even better performance compared to the state‐of‐the‐art hierarchical image segmentation algorithms while having much less time and memory consumption.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ipr2.13023"
    },
    {
        "id": 9377,
        "title": "Automated Tongue Diagnosis: A Deep Autoencoder Neural Network and Clustering-Based Image Segmentation Approach",
        "authors": "Abisha L, Sindhu K.",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "Automatic tongue image segmentation and tongue image classification are two crucial tongue characterization tasks in traditional Chinese medicine (TCM). Due to the complexity of tongue segmentation and fine-grained traits of tongue image classification, both tasks are challenging. Fortunately, from the perspective of computer vision, these two Tasks are highly interrelated, making them compatible with the idea of Multi-Task Joint learning (MTL).By sharing the underlying parameters and adding two different task loss functions, an MTL method for segmenting and classifying tongue images is proposed in this paper. Moreover, two state-of-the-art deep neural network variants (UNET and Discriminative Filter Learning (DFL)) are foused into the MTL to perform these two tasks. To the best of our knowledge, our method is the first attempt to manage both tasks simultaneously with MTL. We conducted extensive experiments with the proposed method. The experimental results show that our joint method out performs the existing tongue characterization methods. The process of tongue diagnosis by extracting meaningful features from tongue images and segmenting the relevant regions for analysis. The deep auto encoder neural network is employed to learn a compact representation of tongue images by encoding and decoding the input data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59544/boae2576/ngcesi23p119"
    },
    {
        "id": 9378,
        "title": "Unsupervised hyperspectral image segmentation of films: a hierarchical clustering-based approach",
        "authors": "Lingxi Liu, Giovanni Delnevo, Silvia Mirri",
        "published": "2023-3-11",
        "citations": 2,
        "abstract": "AbstractHyperspectral imaging (HSI) has been drastically applied in recent years to cultural heritage (CH) analysis, conservation, and also digital restoration. However, the efficient processing of the large datasets registered remains challenging and still in development. In this paper, we propose to use the hierarchical clustering algorithm (HCA) as an alternative machine learning approach to the most common practices, such as principal component analysis(PCA). HCA has shown its potential in the past decades for spectral data classification and segmentation in many other fields, maximizing the information to be extracted from the high-dimensional spectral dataset via the formation of the agglomerative hierarchical tree. However, to date, there has been very limited implementation of HCA in the field of cultural heritage. Data used in this experiment were acquired on real historic film samples with various degradation degrees, using a custom-made push-broom VNIR hyperspectral camera (380–780nm). With the proposed HCA workflow, multiple samples in the entire dataset were processed simultaneously and the degradation areas with distinctive characteristics were successfully segmented into clusters with various hierarchies. A range of algorithmic parameters was tested, including the grid sizes, metrics, and agglomeration methods, and the best combinations were proposed at the end. This novel application of the semi-automating and unsupervised HCA could provide a basis for future digital unfading, and show the potential to solve other CH problems such as pigment mapping.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40537-023-00713-8"
    },
    {
        "id": 9379,
        "title": "Differentiable double clustering with edge-aware superpixel fitting for unsupervised image segmentation",
        "authors": "Xin Li, Xiaoying Chen, Yuanbo Qiu, Chunfeng Tao, Pan Zheng",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.displa.2024.102721"
    },
    {
        "id": 9380,
        "title": "Dynamic image segmentation and recognition measurement of axial compression experiment based on image clustering and semantic segmentation in RC column with FRP tubes",
        "authors": "Yankang Zhai, Alex Hay-Man Ng, Zhenpeng Luo, Jiahui Wang, Lijuan Li, Zhe Xiong, Hua Wang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measurement.2024.114207"
    },
    {
        "id": 9381,
        "title": "Audio-Visual Emotion Recognition Using K-Means Clustering and Spatio-Temporal CNN",
        "authors": "Masoumeh Sharafi, Mohammadreza Yazdchi, Javad Rasti",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipria59240.2023.10147192"
    },
    {
        "id": 9382,
        "title": "Penentuan Segmentation, Targeting, dan Positioning pada wisatawan desa wisata Lon Malang Madura menggunakan K-means Clustering",
        "authors": "Putri Rahma Maulida, Fitri Agustina Semnasti, Bain Khusnul Khotimah Semnasti",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "Pandemi COVID-19 telah menyebabkan penurunan perekonomian dan perdagangan negara-negara di dunia, termasuk Indonesia. Sektor pariwisata merupakan sektor yang terdampak cukup signifikan sebagai akibat adanya pembatasan kegiatan masal (lockdown). Kini sektor pariwisata mulai bangkit dan menjadi sektor alternatif dalam pertumbuhan perekonomian di Indonesia. Namun, pengembangan pariwisata khususnya di Madura masih sangat konvensional dan berorientasi jangka pendek. Oleh karena itu, diperlukan suatu usaha untuk memetakan wisatawan menurut variabel-variabel demografi, geografi, psikografi dan perilaku sehingga dapat dirumuskan strategi pengembangan yang tepat dan berorientasi pada wisatawan. Metode yang digunakan adalah K-means clustering dan menghasilkan tiga cluster wisatawan pada desa wisata Lon Malang. Selain segmentasi, maka akan ditentukan target pasar yaitu segmen 2 dan segmen 3 hasil dari prioritas uji K-means clustering yang menjadi target segmen karena memiliki persentase anggota cluster tertinggi dan memetakan posisi destinasi wisata ini dengan kompetitornya sesuai dengan low priority, concentrate hare, keep up the good work, dan possible overkill.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33005/wj.v16i1.49"
    },
    {
        "id": 9383,
        "title": "Image and object encryption using multiplicative\ncipher and K-means clustering algorithm",
        "authors": "Maroti Deshmukh, Arjun Rawat",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijact.2023.10060005"
    },
    {
        "id": 9384,
        "title": "Optimizing Marketing Strategies with RFM Method and K-Means Clustering-Based AI Customer Segmentation Analysis",
        "authors": "Malay Sarkar, Aisharyja Roy Puja, Faiaz Rahat Chowdhury",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "Retrospectively, an organization’s capacity to comprehend the distinct needs of its clients will undoubtedly provide it with a competitive advantage in terms of delivering targeted client services and tailoring personalized marketing initiatives. This research investigated the efficiency of the k-means clustering algorithm as a technique for efficient consumer segmentation. The k-Means algorithm consolidated with RFM analysis is globally accredited as a profound partitioning clustering technique that has proven to be highly efficient in various business settings. The experimental outcomes provided persuasive evidence of the algorithm's performance in terms of consumer segmentation. The overall cluster purity evaluation was computed to be 0.95. This value demonstrated that the k-Means clustering algorithm incorporated with the RFM analysis attained a relatively high accuracy rate of 95% in terms of precisely and accurately segmenting the consumers based on their shared behaviors and characteristics. The high purity value of 0.95 illustrated the efficiency of the k-Means clustering algorithm in terms of accurately segmenting and categorizing the clients. This showcased that the algorithm efficiently organized and pinpointed consumers into distinct clusters based on their similarities, facilitating targeted marketing strategies and personalized approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/jbms.2024.6.2.5"
    },
    {
        "id": 9385,
        "title": "Customer Segmentation Based on RFM Value on the Sale of Electronic Kopmen BMI Using K-Means Clustering Algorithm",
        "authors": "Zainul Hakim, Detin Sofia, Annida Rosna Fadhilah",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "At present, the development of information technology is increasing rapidly. The need for information and data processing in various aspects of human life is critical, as well as customer data processing in BMI Consumer Cooperatives. This situation can impact information providers in an organization or company that requires fast, precise, and accurate data processing. The customer segmentation clustering system at the BMI Consumer Cooperative has yet to be implemented. A K-means clustering system is needed to increase customer loyalty, which can simplify the process of grouping customer segmentation. In this thesis, researchers use a descriptive method as a research methodology, which is used to get an overview and explanation of the state of the research object based on facts. As for the data collection method, researchers used interviews, observation, and literature study. In developing the system, researchers use prototyping. The customer segmentation information system application prototype describes the implementation of Astah's UML (Unified Modeling Language) and program planning used by Python. The conclusion of this prototype application can make it easier for managers to get information about customer segmentation data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38101/sisfotek.v13i2.9693"
    },
    {
        "id": 9386,
        "title": "A feature-weighted suppressed possibilistic fuzzy c-means clustering algorithm and its application on color image segmentation",
        "authors": "Haiyan Yu, Lerong Jiang, Jiulun Fan, Shuang Xie, Rong Lan",
        "published": "2024-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122270"
    },
    {
        "id": 9387,
        "title": "Clustering-based image segmentation for optimal image fusion using CT and MRI images",
        "authors": "N. Thenmoezhi, B. Perumal, A. Lakshmi",
        "published": "2023-2-24",
        "citations": 0,
        "abstract": " As opposed to using many unrelated photographs to depict the same scene, image fusions combine multiple, similar images to generate a single, unified image with greater detail. Imaging sensors and the need for a wideband signal to transmit most source images limit their resolution. This study suggests new methods of fusing medical pictures from different modalities in order to increase image quality and, by extension, the accuracy with which brain tumors can be detected and identified. Improved convolutional neural network (ICNN) and region growth-based [Formula: see text]-means clustering (RKMC) are used in the suggested strategy to boost the quality of brain image fusions obtained from Computed tomography scanned image (CTSI) and magnetic resonance imaging (MRI) in this study. The first stages of this task consist of eliminating noise, segmenting images, extracting and selecting features, and fusing images. AMF (Adaptive Median Filtering) are first used to eliminate noise from MRI images and CTSI of the brain, improving the image quality. With the help of the RKMC algorithm, MRI image and CTSI scans can be segmented into their constituent pieces, which can then be seen either as grayscale images or as pictures of objects. The RKMC algorithm is able to adequately account for the possibility of tumors in white images. More useful image features can be extracted with the use of MPCA (Modified Principal Component Analysis). Afterward, features with the highest fitness values are chosen by using AFO (Adaptive Firefly Optimization). Image fusions of multimodal images are carried out using ICNN, which generates the image’s lower-, middle-, and higher-level contents. Incorporating important and relevant image characteristics from all viewpoints and perspectives improves feature training and testing. The results show that the proposed RKMC+ICNNs outperform the state-of-the-art approaches in terms of accuracy, PSNR, RMSE, and runtime. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1793962324410010"
    },
    {
        "id": 9388,
        "title": "Spatial Kernel Fuzzy Clustering Methods for Microarray Image Spot Segmentation",
        "authors": "M. P. Priya, C. K. Roopa, B. S. Harish, Francesco Flammini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3343155"
    },
    {
        "id": 9389,
        "title": "An improved fuzzy c-means-raindrop optimizer for brain magnetic resonance image segmentation",
        "authors": "Bindu Puthentharayil Vikraman, Jabeena Afthab",
        "published": "2023-9-5",
        "citations": 0,
        "abstract": "<p>The performance of healthcare systems, particularly regarding disease diagnosis and treatment planning, depends on the segmentation of medical images. Fuzzy c-means (FCM) is one of the most widely used clustering techniques for image segmentation due to its simplicity and effectiveness. FCM, on the other hand, has the disadvantages of being noise-sensitive, quickly settling on local optimal solutions, and being sensitive to initial values. This paper suggests a fuzzy c-means clustering improved with a nature-inspired raindrop optimizer for lesion extraction in brain magnetic resonance (MR) images to get around this constraint. In the preprocessing stage, the possible noises in a digital image, such as speckles, gaussian, etc., are eliminated by a hybrid filter—A combination of Gaussian, mean, and median filters. This paper presents a comparative analysis of FCM clustering and FCM-raindrop optimization (FCM-RO) approach. The algorithm performance is evaluated for images subjected to various possible noises that may affect an image during transmission and storage. The proposed FCM-RO approach is comparable to other methods now in use. The suggested system detects lesions with a partition coefficient of 0.9505 and a partition entropy of 0.0890. Brain MR images are analyzed using MATLAB software to find and extract malignancies. Image data retrieved from the public data source Kaggle are used to assess the system’s performance.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v6i3.973"
    },
    {
        "id": 9390,
        "title": "Retracted: Efficient COVID-19 CT Scan Image Segmentation by Automatic Clustering Algorithm",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9860812"
    },
    {
        "id": 9391,
        "title": "PSO-based procedure to find number of clusters and better initial centroids for K-means algorithm: Image segmentation as case study",
        "authors": "M. Alizadeh Zarei, A. M. Nickfarjam",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipria59240.2023.10147171"
    },
    {
        "id": 9392,
        "title": "Image segmentation algorithm based on multi-granularity clustering",
        "authors": "Xia Shuyin, Xia Cenjun, Dai Dawei, Ni Jinyuan",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2688915"
    },
    {
        "id": 9393,
        "title": "Automated Tongue Diagnosis: A Deep Autoencoder Neural Network and Clustering-Based Image Segmentation Approach",
        "authors": "Abisha L",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "Automated tongue diagnosis has gained significant attention in recent years as a non-invasive and cost-effective method for disease detection and monitoring. In this project, propose a novel approach for automated tongue diagnosis using a combination of Deep Autoencoder Neural Network (DAENN) and clustering-based image segmentation techniques. The objective is to develop a reliable and efficient system that can accurately analyze tongue images and provide diagnostic information. The proposed methodology involves several key steps. First, high-resolution images of the tongue are acquired using a digital camera. Preprocessing techniques are then applied to enhance image quality and remove noise. Next, a clustering-based image segmentation algorithm is employed to extract the tongue region from the background. This step ensures that subsequent analysis is focused on the relevant area of interest. After tongue region extraction, relevant features are extracted from the segmented image. These features capture important visual characteristics such as color distribution, texture, and shape. The DAENN is then trained using these features to learn an efficient representation of the input data. The network's encoder-decoder architecture enables it to compress the features into a lower-dimensional latent space and reconstruct the original features. By leveraging advanced machine learning techniques, the system can accurately analyze tongue images and assist healthcare professionals in making informed decisions. The evaluation of the proposed system on a diverse dataset demonstrates promising results, showcasing its potential as an effective tool for automated tongue diagnosis. Keywords—deep autoencoder, Tongue segmentation, Pattern recognition, colour intensity",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem24806"
    },
    {
        "id": 9394,
        "title": "Image recognition and position technology based on super-pixel fuzzy C-means clustering in industrial assembly systems",
        "authors": "Hailiang Yuan, Weitao Sun, Hailing Wang",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3001356"
    },
    {
        "id": 9395,
        "title": "Research and Application of LPRL Model Based on TOPSIS and K-Means Clustering",
        "authors": "Shuyang Wang, Yongxiang Zheng, Zihan Chen",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257859"
    },
    {
        "id": 9396,
        "title": "Coarse-to-fine blind image deblurring based on K-means clustering",
        "authors": "Amir Eqtedaei, Alireza Ahmadyfard",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00371-023-02785-2"
    },
    {
        "id": 9397,
        "title": "Improved accuracy of cluster formation for customer segmentation by identification of novel optimal number of clusters using silhouette method over K-means clustering",
        "authors": "Swetha Kariyavula, Kalaivani Anbarasan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0119477"
    },
    {
        "id": 9398,
        "title": "Automatic Skin Cancer Segmentation and Classification using Fuzzy C-means Clustering-based Convolutional Neural Network",
        "authors": "R Ramya, Mohammad Yahya, Myasar Mundher Adnan, R Archana Reddy, J. Velumani",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciics59993.2023.10420899"
    },
    {
        "id": 9399,
        "title": "Retraction Note: Brain Tumor Segmentation Using Deep Learning and Fuzzy K-Means Clustering for Magnetic Resonance Images",
        "authors": "R. Pitchai, P. Supraja, A. Helen Victoria, M. Madhavi",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11063-024-11601-4"
    },
    {
        "id": 9400,
        "title": "Statistical Analysis of the Wave Runup at Walls in a Changing Climate by Means of Image Clustering",
        "authors": "Sara Mizar Formentin, Barbara Zanuttigh",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "This contribution builds on an existing methodology of image clustering analysis, conceived for modelling the wave overtopping at dikes from video records of laboratory experiments. It presents new procedures and algorithms developed to extend this methodology to the representation of the wave runup at crown walls on top of smooth berms. The upgraded methodology overcomes the perspective distortion of the native images and deals with the unsteady, turbulent and bi-phase flow dynamics characterizing the wave impacts at the walls. It accurately reconstructs the free surface along the whole structure profile and allows for a statistical analysis of the wave runup in the time and spatial domain. The effects of different structural configurations are investigated to provide key information for the design of coastal defences. In particular, the effects of increased sea levels in climate change scenarios are analysed. Innovative results, such as profiling of the envelopes of the runup along the wall cross and front sections, and the evidencing of 3D effects on the runup are presented. The extreme runup is estimated for the definition of the design conditions, while the envelopes of the average and minimum runup heights are calculated to assess the normal exercise conditions of existing structures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/w15152729"
    },
    {
        "id": 9401,
        "title": "Retracted: Study of Clustering Algorithms in Object Tracking and Image Segmentation",
        "authors": "",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9769348"
    },
    {
        "id": 9402,
        "title": "Clustering-TinyPointNet for Fast Large-scale Point Cloud Semantic Segmentation",
        "authors": "Zhenglin Wang, Kerry Walsh, Fariza Sabrina, Lasitha Piyathilaka, Yufeng Lin",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicta60407.2023.00039"
    },
    {
        "id": 9403,
        "title": "Full-parameter adaptive fuzzy clustering for noise image segmentation based on non-local and local spatial information",
        "authors": "Jiaxin Wu, Xiaopeng Wang, Tongyi Wei, Chao Fang",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cviu.2023.103765"
    },
    {
        "id": 9404,
        "title": "Segmentation of Avocado Seed Buyers Using K-Means Clustering",
        "authors": "Elok Eka Kartika Putri Lestari, Daniel Swanjaya, Risky Aswi Ramadhani",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "Pesantren Al-Fukaat menerapkan penjualan secara ecer dan grosir dalam melakukan penjualan bibit alpokat. Pesantren Al-Fukaat dalam memasarkan bibit alpokat masih belum merata pada daerah pemasaran yaitu Jawa dan Bali serta kurang tepatnya target pembeli berdasarkan kondisi wilayah yang cocok untuk penanaman bibit alpokat sehingga penjualan belum maksimal sehingga masih ada jenis bibit dengan penjualan yang sangat sedikit. Dalam mengatasi permassalahan tersebut dilakukan penelitian menggunakan metode K-Means Clustering utuk mendapatkan hasil segmentasi pembeli pada Pesantren Al-Fukaat. Keberhasilan dalam penelitian berpacu pada hasil SSE (Sum of  Squared Error). Dengan didapatkan hasil akhir SSE yaitu 39,7852 aplikasi dapat digunakan karena mampu memperoleh hasil SSE yang lebih rendah.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32503/jtecs.v3i2.3886"
    },
    {
        "id": 9405,
        "title": "A Co-Evolutionary Genetic Algorithm Based on Improved K-Means Clustering",
        "authors": "Wenxin Xia, Lianshuan Shi, Rui Zhang, Jiale Zhang, Jiaxing Zhao",
        "published": "2023-7-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icivc58118.2023.10270272"
    },
    {
        "id": 9406,
        "title": "Segmentation K-Means Clustering Model With SPSS Program Case Study Customer the Park Mall Sawangan",
        "authors": "Rynto Mulyono, Ayu Sekar Ndini, Gilang Kharisma, Jerry Heikal",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "In a transitioning word, specially in mall property industry, a winning strategy comes from anticipating with people needs and desires, understanding them in the most holistic way possible. The 7P marketing mix refined by Booms and Bitner in 1981 which consists of elements of Product, Price, Place, Promotion, People, Physical evidence, Processes and additional Partnerships, is a tool for analyzing existing market conditions in more depth. In addition, to meet customer wants, needs, and satisfaction refers to the market environment, both external and internal. This research succeeded in modeling customer segmentation based on clustering data mining techniques with K-Means analysis using the SPSS program. Based on the analysis results obtained, there are 3 clusters, namely clusters: consumptive customer, potential customer, and standard young customer. From the results of this study, we get the personas that emerge as a result of this clustering analysis, and identify the needs, desires, and preferences of the cluster that is formed.  We choose to develop tactic 8Ps marketing mix for cluster potential customer. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36418/syntax-literate.v8i2.11429"
    },
    {
        "id": 9407,
        "title": "K-Means Clustering &amp; Wavelet Based Texture Feature Set For Brain Image Classification",
        "authors": "Rajni Maurya, Sulochana Wadhwani",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ihcsp56702.2023.10127137"
    },
    {
        "id": 9408,
        "title": "Lévy–Cauchy arithmetic optimization algorithm combined with rough K-means for image segmentation",
        "authors": "Arunita Das, Amrita Namtirtha, Animesh Dutta",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110268"
    },
    {
        "id": 9409,
        "title": "Unsupervised cell segmentation by invariant information clustering",
        "authors": "Wessel L. van Nierop, Jan-Niklas Schneider, Peter H. N. de With, Fons van der Sommen",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3001442"
    },
    {
        "id": 9410,
        "title": "Performances of Chimpanzee Leader Election Optimization and K-Means in Multilevel Color Image Segmentation",
        "authors": "Ferry Wahyu Wibowo,  Wihayati",
        "published": "2023-12-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isriti60336.2023.10467845"
    },
    {
        "id": 9411,
        "title": "Quadratic surface center-based possibilistic fuzzy clustering with kernel metric and local information for image segmentation",
        "authors": "Chengmao Wu, Zeren Wang",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15267-3"
    },
    {
        "id": 9412,
        "title": "Multiple Random Feature Superpixel-Based Fuzzy Clustering for Image Segmentation",
        "authors": "Chuanbin Zhang, Long Chen, Yifei Tian, Zhaoyin Shi, Yingxu Wang",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccss58421.2023.10270406"
    },
    {
        "id": 9413,
        "title": "A New Similarity Measure and Hierarchical Clustering Approach to Color Image Segmentation",
        "authors": "Radhwane Gherbaoui, Nacéra Benamrane, Mohammed Ouali",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iri58017.2023.00014"
    },
    {
        "id": 9414,
        "title": "User Segmentation Based on Purchasing Habits and Preferences on the Amazon Platform Using K-Means Clustering",
        "authors": " Al Isra Denk Rimakka, Rezty Amalia Aras",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "As a large company, Amazon operates an online marketplace with a diverse user base exhibiting varied purchasing habits. This diversity challenges Amazon to provide tailored services and marketing strategies for each user with distinct characteristics. Therefore, this research aims to assist Amazon in segmenting its users based on their characteristics, enabling the implementation of targeted marketing strategies and service provision for each user. The study employs the K-Means Clustering method to segment Amazon platform users based on their purchasing behavior, site feature interactions, and preferences. The research process involves Knowledge Data Discovery (KDD) stages, including data processing, attribute selection, and applying the K-Means Clustering algorithm. The analysis results reveal five distinct user clusters, each with unique characteristics reflecting user behavior and preferences. These clusters depict variations in purchasing frequency, interactions with site features, and responses to product recommendations. This user segmentation provides valuable insights for Amazon to develop more focused marketing strategies, enhance personalized services, and improve overall customer satisfaction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35585/inspir.v13i2.63"
    },
    {
        "id": 9415,
        "title": "Analysis of Marketing Segmentation and Its Implementation on 7ps Erha’s Treatment Ultimate Acne Cure Using K-Means Clustering",
        "authors": "Alisa Agustine, Hardiyanti Hardiyanti, Lisye Ira Anne, Jerry Heikal",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "K-Means is a non-hierarchical data grouping method that separates existing data into two or more groups. This method separates existing data into groups so that data with the same character is included in the same group and data with different characters is grouped into other groups. This study aims to produce an analysis that can classify Erha Clinic product/treatment data for March 2022 period using software SPSS 25 IBM to make marketing strategies more targeted. This study divided Erha Clinic product/treatment data with attributes of age group, type of plan, gender, education and total purchase into three clusters (Cluster Metrosexual, Cluster Millenials and Cluster Generation Z). The clustering process is 10 iterations with a minimum distance between clusters of 8,746. The significance value indicates that there is a significant difference between cluster 1, cluster 2 and cluster 3 related to Gender as one of the attributes in the study. The results of clusters show that the marketing target chosen by Erha Clinic is in cluster 3 (Gen-Z Persona) due to acne problems are mostly experienced by young people and although the transaction price is cheap, in the cluster 3 has the most purchased acne products compared to the purchase of the Advance plan and Basic plan bundling in cluster 1 and cluster 2.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36418/syntax-literate.v8i8.13496"
    },
    {
        "id": 9416,
        "title": "Comparative Study of Rough Set-Based FCM and K-Means Clustering for Tumor Segmentation from Brain MRI Images",
        "authors": "Pooja Singh, Neeru Rathee, Sunanda Sharda, Sanoj Kumar",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ria.370412"
    },
    {
        "id": 9417,
        "title": "Unveiling Customer Segmentation Patterns in Credit Card Data using K-Means Clustering: A Machine Learning Approach",
        "authors": "Sakshi Priyadarshni, Rakshan Fathima, Siddhaling Urolagin, Anupkumar M. Bongale, Deepak Sudhakar Dharrao",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mosicom59118.2023.10458783"
    },
    {
        "id": 9418,
        "title": "A novel enhancement-based rapid kernel-induced intuitionistic fuzzy c-means clustering for brain tumor image",
        "authors": "K. G. Lavanya, P. Dhanalakshmi, M. Nandhini",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09533-7"
    },
    {
        "id": 9419,
        "title": "MODELLING WAVE OVERTOPPING AND WAVE IMPACTS BY MEANS OF IMAGE CLUSTERING TECHNIQUES",
        "authors": "Sara Mizar Formentin, Elisa Dallavalle, Barbara Zanuttigh",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "The experimental modelling of the wave-structure interaction processes is a very complicated issue, due to the highly non-linear turbulent flow conditions, including wave breaking and air entrainment (Stringari et al., 2021). Recently, Formentin et al. (2021) demonstrated that videography can provide a reliable representation of the wave breaking, of the wave overtopping and of the wave impact at walls. They filmed laboratory tests of wave overtopping at smooth dikes with crown walls (Formentin et al., 2018; Palma et al., 2020) with a low-cost full-HD camera and compared the results of the video-cluster analysis applied to its records with the measurements obtained through traditional techniques. They derived accurate quantitative estimations of free-surface elevation, wave overtopping discharge, volumes, velocities and celerities. The aim of this paper is to further investigate the possibilities of the videography by focusing on the analysis of the wave impacts at the walls and on the detection of the amount of air entrapped during the impacts themselves.                              ",
        "keywords": "",
        "link": "http://dx.doi.org/10.9753/icce.v37.structures.45"
    },
    {
        "id": 9420,
        "title": "Deteksi Hiperkolesterolemia Melalui Iris Mata Menggunakan Image Processing dengan Metode K-Means Clustering dan Gray Level Co-Occurrence Matrix (GLCM)",
        "authors": "Rofik Lailatul Hasanah",
        "published": "2023-2-26",
        "citations": 0,
        "abstract": "Penelitian ini mengidentifikasi penyakit hiperkolesterolemia melalui iris mata dengan menggunakan image processing dan klasifikasi k-means clustering. Citra yang digunakan terdiri dari 30 citra normal dan 30 citra abnormal. Pengolahan citra dilakukan melalui tahap preprocessing yang meliputi cropping, histogram equalization, deteksi tepi canny, segmentasi dan tahap ekstraksi ciri dengan GLCM yang meliputi penentuan nilai kontras, korelasi, energi dan homogenitas. Nilai parameter kontras, korelasi, energi dan homogenitas menjadi input pada metode k-means clustering untuk pengelompokan. Berdasarkan ekstraksi ciri diperoleh nilai kontras citra yang teridentifikasi normal berkisar antara 0,08 hingga 0,16, nilai korelasi dari 0,23 hingga 0,96, nilai energi dari 0,65 hingga 0,85 dan nilai homogenitas dari 0,92 hingga 0,96. Nilai kontras yang teridentifikasi hiperkolesterolemia berkisar antara 0,11 hingga 0,18, nilai korelasi dari 0,24 hingga 0,31, nilai energi dari 0,60 hingga 0,75 dan nilai homogenitas dari 0,91 hingga 0,94. Hasil pengelompokan ciri citra iris mata normal dan hiperkolesterolemia berdasarkan parameter kontras diperoleh akurasi sebesar 85%, berdasarkan parameter korelasi diperoleh akurasi sebesar 75%, berdasarkan parameter energi diperoleh akurasi sebesar 83,3% dan berdasarkan parameter homogenitas diperoleh akurasi sebesar 83,3%. Sehingga dapat disimpulkan bahwa penggunaan k-means clustering mampu membedakan ciri citra normal dengan ciri citra hiperkolesterolemia dengan akurasi tinggi.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26418/pf.v10i3.58144"
    },
    {
        "id": 9421,
        "title": "Deep expectation-maximization network for unsupervised image segmentation and clustering",
        "authors": "Yannan Pu, Jian Sun, Niansheng Tang, Zongben Xu",
        "published": "2023-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.imavis.2023.104717"
    },
    {
        "id": 9422,
        "title": "Remote sensing image segmentation using feature based fusion on FCM clustering algorithm",
        "authors": "Rajni Sharma, M. Ravinder",
        "published": "2023-12",
        "citations": 2,
        "abstract": "AbstractImage segmentation of heterogeneous comparable objects lying beneath the earth’s surface is a fundamental but challenging research area in remote sensing. Learning approaches are used in remote sensing image segmentation to improve segmentation accuracy at the expense of time and a large amount of data, but their performance need to be finely classified due to information diversity constraints. In this work, we proposed an novel feature based fuzzy C-means-extreme learning machine (FBFCM-ELM) algorithm for remote sensing image segmentation in which the classification based on entropy, intensity, and edge features is performed in such a way that it updates the intensity value to preserve the most local characteristics in the image while still being able to clearly distinguish the image’s boundaries by assigning the pixel values of each cluster to the peak value of the cluster’s sub-histogram. Using FBFCM, features are extracted and used as reliable samples for ELM training. Undetermined segmented pixels are obtained using the trained ELM classifier. Experiments performed over number of images that confirmed the proposed method yields a better segmented RGB image, as evidenced by observable details, edges, and improved appearance that resembles the ground truth image and outperforms state-of-the-art algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40747-023-01129-w"
    },
    {
        "id": 9423,
        "title": "Fuzzy Sparse Subspace Clustering for Infrared Image Segmentation",
        "authors": "Ying Chen, Zihan Wang, Xiangzhi Bai",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tip.2023.3263102"
    },
    {
        "id": 9424,
        "title": "Image Forgery Detection using Block Matching and K-Means Clustering Techniques",
        "authors": "Thanuja Bai B, Tharun Kumar B, Tharun Raj Y, Mahammed Rafi G",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icces57224.2023.10192805"
    },
    {
        "id": 9425,
        "title": "A Coloured Image Watermarking Based on Genetic K-Means Clustering Methodology",
        "authors": "Zainab Falah Hassan, Farah Al-Shareefi, Hadeel Qasem Gheni",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.2.242-249"
    },
    {
        "id": 9426,
        "title": "Synthetic aperture radar image change detection based on image difference denoising and fuzzy local information C-means clustering",
        "authors": "Yuqing Wu, Qing Xu, Xinming Zhu, Tianming Zhao, Bowei Wen, Jingzhen Ma",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jrs.18.024501"
    },
    {
        "id": 9427,
        "title": "Automated segmentation of meningioma from contrast-enhanced T1-weighted MRI images in a case series using a marker-controlled watershed segmentation and fuzzy C-means clustering machine learning algorithm",
        "authors": "Sana Mohammadi, Sadegh Ghaderi, Kayvan Ghaderi, Mahdi Mohammadi, Masoud Hoseini Pourasl",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijscr.2023.108818"
    },
    {
        "id": 9428,
        "title": "An anisotropically diffusible fuzzy clustering based image segmentation methodology for intracranial cyst detection",
        "authors": "R. Reeba Jennifer, A. Albert Raj",
        "published": "2023-7-2",
        "citations": 0,
        "abstract": "An Intracranial cyst is an abnormal growth of mass in the brain that affects functioning of the nervous system and so an early detection of the lesion enables to avoid adverse effects. The processing unit in the Magnetic Resonance Imaging (MRI) system performs reading the images followed by primary image enhancement to suppress distortions thereby enhancing the feature quality in terms of its intensity, augmenting the resolution by image segmentation, post-processing by thresholding based on grayscale values and performing several morphological operations. With the existing methodologies, extracting the Region Of Interest (ROI) with the overlapping intensity values lead to inaccurate results. A novel method in which the input image that is anisotropically diffused and blurred is converted into a sharp image. Further, fuzzy partitioning of pixels deployed on Global Thresholding –Clustering Methodology (GT-CM) based segmentation takes 4 clusters into account hence forth seperating the exterior portion of the skull, the border region of the skull, the ventricles which may include the lesion and the noise. Statistical results based on several metrics such as sensitivity, specificity, F measure, Jaccord Index, Dice Coefficient and precision show that the proposed method is far more effective. An accuracy of 99.26% is obtained in exactly locating and extracting the lesion along with its attributes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-221947"
    },
    {
        "id": 9429,
        "title": "Plant Disease Image Segmentation applying the K-Means Algorithm, Firefly, and Particle Swarm Optimisation",
        "authors": "Mandeep Kaur",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: The process of dividing an image to several pieces with comparable features is known as segmentation of images. A difficult phase in the image segmentation process is to extract the information from the image. Clustering is used to segment photos of a similar type or to assess the relevance of data. In essence, clustering is an unsupervised learning process. The data elements that make up one cluster share the same kinds of characteristics. In other words, each cluster has a minimum difference between its points and a maximum difference from the data points of other clusters. The suggested approach clusters image pixels by combining Particle Swarm Optimization with K-Means. Since combined techniques produce the best results, Kmeans should be thanked. K-means combined with Particle Swarm Optimization performs better than firefly combined with Kmeans. The firefly algorithm is used to tackle optimization issues and has a variety of uses. The Firefly method has been utilized in numerous research and optimization fields. Firefly algorithm and Firefly have been effectively utilized to solve a variety of issues. The firefly algorithm needs to be altered or combined with other algorithms in order to be used to a wide range of problems. Due to their metaheuristic nature, contemporary algorithms are crucial for solving NP-Hard problems",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.51174"
    },
    {
        "id": 9430,
        "title": "Knee Point Guided Competitive Learning Approach to Surrogate Assisted Multi-Objective Rough Fuzzy Clustering for Image Segmentation",
        "authors": "Feng Zhao, Zhilei Xiao, Zihan Tang, Hanqiang Liu, Jiulun Fan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4327143"
    },
    {
        "id": 9431,
        "title": "Clustering LiDAR Data with K-means and DBSCAN",
        "authors": "Mafalda Oliveira, André Marcal",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011667000003411"
    },
    {
        "id": 9432,
        "title": "Stripe segmentation of oceanic internal waves in SAR images based on Gabor transform and K-means clustering",
        "authors": "Kai-Tuo Qi, Hong-Sheng Zhang, Ying-Gang Zheng, Yu Zhang, Long-Yu Ding",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceano.2023.06.006"
    },
    {
        "id": 9433,
        "title": "Detection of Early Blight Tomato Leaf Using k-Means Clustering",
        "authors": "",
        "published": "2023-7-3",
        "citations": 0,
        "abstract": "Early blight is one of the major diseases of tomatoes that affects the leaves and fruit quality. Detection and estimation of the disease severity are performed using the visual observation method. Visual detection requires significant time for visual inspection of a large cultivated area. Thus, image processing techniques have proven to be an effective method as compared to visual analysis. In this study, digital image processing methods and techniques were used to detect early blight of tomato (EBT), estimate the disease severity, and classify tomato leaves. Totally, 198 infected plants were randomly taken from the Haramaya University research site \"Rare\" at four different times. Diseased potato leaf images were captured, resized, and stored for experimentation. The stored images were processed using median filtering to remove noise while preserving useful features in an image and image enhancement. The RGB images were transformed to gray scale and CIELAB color space, and the k-means clustering was applied to estimate the disease severity of the potato leaves, and Otsu’s thresholding algorithm was applied to estimate the disease severity of both the detached and live leaves. MATLAB algorithms will be developed to determine the total area and infected lesion area of the leaf samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/ijdmd.08.03.01"
    },
    {
        "id": 9434,
        "title": "A Study on Segmentation and Feature Extraction of Retinal Images using Fuzzy C-Means Clustering",
        "authors": " Dr. J. Jebathangam,  Dr. K. Sharmila,  Dr. C. Shanthi,  Dr. C. Shanthi",
        "published": "2023-5-30",
        "citations": 0,
        "abstract": "One of the major problem occur due to diabetes is retinopathy. It should be diagnosed earlier for effective treatment. In the initial stage of diabetes, patient may suffer in the earlier stage of diabetic retinopathy which gives the symptoms of starting of vision deteriorate in retina. This symptoms result to the eye deficiency in any one of the type of retinopathy. But the survey of medical refers that many people get affects by non-proliferative retinopathy and proliferative retinopathy. There are many ways to diagnose this eye deficiency. This process uses the digital image processing for filtering the noise in the image and it can be seen at different angle by using digitization method. Each image can be compressed by using Discrete Wavelet Transform method. The blood vessels are segmented using FUZZY C-Means.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-10922"
    },
    {
        "id": 9435,
        "title": "Ant Colony Optimization (ACO) Based Fuzzy C-Means (FCM) Clustering Approach for MRI Images Segmentation",
        "authors": "Mohammed H. Al Aqad,  Luis Miguel Oliveira de Barros Cardoso",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "Thousands of real-life ants have been used to improve the Ant Colony Optimization (ACO) technique. Significant improvement can be noticed in segmented images using ACO-based rather than random initialization. The segmentation quality has improved as a result of the noise reduction. Clustering based on FCM is used to segment medical images. To avoid local optimal results, cluster centres are initially determined using ACO. This paper shows that our approach (ACO-FCM) provides significant improvements. In ACO-FCM, brain tissues are classified more accurately because there are more correctly classified pixels. As a result of our approach, such tissues can be classified more accurately based on spatial information",
        "keywords": "",
        "link": "http://dx.doi.org/10.31185/wjcms.230"
    },
    {
        "id": 9436,
        "title": "Highly accurate blood vessel segmentation using texture‐based modified K‐means clustering with deep learning model",
        "authors": "L. B. Lisha, C. Helen Sulochana",
        "published": "2023-3-25",
        "citations": 1,
        "abstract": "SummaryThis paper suggests a blood vessel segmentation using the Texture‐Based Modified K‐means Clustering (TBMKC) technique to lessen the detrimental effects of light lesions. In the suggested method, the K value is chosen automatically by maximizing the local pixel data of the input image. Utilizing the Gabor Filter and Scale‐Invariant Feature Transform (SIFT), respectively, texture and statistical characteristics are used to extract the local information. The number of pixels present in each class is used to alter the cluster centroid using Particle Swarm Optimization (PSO) methods. Local adaptive thresholding is then used to separate the blood vessel pattern. The proposed method is invariant to scales and rotations due to SIFT features. The thresholding output is given to the modified DCNN (Deep Convolutional Neural Network). Finally, the performance of the (MDCNN+ TBMKC+ PSO) scheme is computed over other extant schemes. The outcomes of the adopted scheme is determined and tested using the retinal image from DRIVE, STARE, HRF, and CHASE_DBI databases. The accuracy of the proposed method is 13.41%, 7.22%, 9.56%, 6.24%, 2.35%, 14.54%, 13.23%, 3.71%, 10.82%, 8.28%, 7.98%, and 54.01% better than the existing method like M‐GAN, MCET‐HHO, CNN, DBN, SVM, RNN, NN, MDCNN+PSO, MDCNN+GA, MCNN+FF, MDCNN+ABC, and MDCNN+LA.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cpe.7590"
    },
    {
        "id": 9437,
        "title": "Application Of K-Means Clustering For Customer Segmentation In Grocery Stores In Kenya",
        "authors": "Edwin Omol, Dorcas Onyangor, Lucy Mburu, Paul Abuonji",
        "published": "2024-1-29",
        "citations": 1,
        "abstract": "The retail industry, particularly in the context of grocery stores, plays a vital role in meeting consumers' daily needs. To optimize marketing strategies and enhance customer satisfaction, understanding customer behavior and preferences is crucial. Customer segmentation, a powerful market research technique, enables businesses to group customers with shared characteristics into distinct segments, allowing targeted and personalized approaches. This article explores the application of the K-means clustering algorithm for customer segmentation in grocery stores within the unique context of Kenya. By leveraging transactional and demographic data from diverse grocery stores across Kenya, the study aims to identify homogeneous customer groups with similar purchasing behaviors and preferences. The data collection process involved obtaining consent from store owners and ensuring data privacy and security. Following data preprocessing, K-means clustering was applied, and various validation techniques were utilized to determine the optimal number of clusters. The results yielded valuable insights into customer segments, aiding the identification of key customer groups and their distinct preferences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46729/ijstm.v5i1.1024"
    },
    {
        "id": 9438,
        "title": "Hyper-Segmentation Lapser MyTelkomsel Apps Using K-Means Clustering to Increase Data Package Purchases in Area 3 - East Java, Central Java - DIY, Bali Nusa Tenggara",
        "authors": "Windy Herlin Ali, Maya Ariyanti",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/na8.20230345"
    },
    {
        "id": 9439,
        "title": "Retraction: Digital image processing technology under backpropagation neural network and K-Means Clustering algorithm on nitrogen utilization rate of Chinese cabbages",
        "authors": " ",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1371/journal.pone.0290865"
    },
    {
        "id": 9440,
        "title": "Parallelized Inter-Image k-Means Clustering Algorithm for Unsupervised Classification of Series of Satellite Images",
        "authors": "Soohee Han, Jeongho Lee",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "As the volume of satellite images increases rapidly, unsupervised classification can be utilized to swiftly investigate land cover distributions without prior knowledge and to generate training data for supervised (or deep learning-based) classification. In this study, an inter-image k-means clustering algorithm (IIkMC), as an improvement of the native k-means clustering algorithm (kMC), was introduced to obtain a single set of class signatures so that the classification results could be compatible among multiple images. Because IIkMC was a computationally intensive algorithm, parallelized approaches were deployed, using multi-cores of a central processing unit (CPU) and a graphics processing unit (GPU), to speed up the process. kMC and IIkMC were applied to a series of images acquired in a PlanetScope mission. In addition to the capability of the inter-image compatibility of the classification results, IIkMC could settle the problem of incomplete segmentation and class canceling revealed in kMC. Based on CPU parallelism, the speed of IIkMC improved, becoming up to 12.83 times better than sequential processing. When using a GPU, the speed improved up to 25.53 times, rising to 39.00 times with parallel reduction. From the results, it was confirmed IIkMC provided more reliable results than kMC, and its parallelism could facilitate the overall inspection of multiple images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/rs16010102"
    },
    {
        "id": 9441,
        "title": "Enhanced Image Quantization Through Hybrid Sine Cosine Optimization and K-Means Clustering",
        "authors": "Vinayakanitesh Pasumurthi, Guna Venkata Ayyappa Ramineni, Ravi Kumar Jatoth",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icefeet59656.2023.10452222"
    },
    {
        "id": 9442,
        "title": "Liver cancer classification via deep hybrid model from CT image with improved texture feature set and fuzzy clustering based segmentation",
        "authors": "Vinnakota Sai Durga Tejaswi, Venubabu Rachapudi",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "One of the leading causes of death for people worldwide is liver cancer. Manually identifying the cancer tissue in the current situation is a challenging and time-consuming task. Assessing the tumor load, planning therapies, making predictions, and tracking the clinical response can all be done using the segmentation of liver lesions in Computed Tomography (CT) scans. In this paper we propose a new technique for liver cancer classification with CT image. This method consists of four stages like pre-processing, segmentation, feature extraction and classification. In the initial stage the input image will be pre processed for the quality enhancement. This preprocessed output will be subjected to the segmentation phase; here improved deep fuzzy clustering technique will be applied for image segmentation. Subsequently, the segmented image will be the input of the feature extraction phase, where the extracted features are named as Improved Gabor Transitional Pattern, Grey-Level Co-occurrence Matrix (GLCM), Statistical features and Convolutional Neural Network (CNN) based feature. Finally the extracted features are subjected to the classification stage, here the two types of classifiers used for classification that is Bi-GRU and Deep Maxout. In this phase we will apply the Crossover mutated COOT optimization (CMCO) for tuning the weights, So that we will improve the quality of the image. This proposed technique, present the best accuracy of disease identification. The CMCO gained the accuracy of 95.58%, which is preferable than AO = 92.16%, COA = 89.38%, TSA = 88.05%, AOA = 92.05% and COOT = 91.95%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/web-230042"
    },
    {
        "id": 9443,
        "title": "Driving Training-Based Optimization- Multitask Fuzzy C-Means (DTBO-MFCM) Image Segmentation and Robust Deep Learning Algorithm for Multicenter Breast Histopathological Images",
        "authors": "Afnan M. Alhassan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3335667"
    },
    {
        "id": 9444,
        "title": "An adaptive density spatial clustering algorithm based on tuna swarm optimization for image segmentation",
        "authors": "Wei Zhou, Limin Wang, Xuming Han, Yizhang Wang",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2668042"
    },
    {
        "id": 9445,
        "title": "Pixel and region level information fusion in membership regularized fuzzy clustering for image segmentation",
        "authors": "Li Guo, Pengfei Shi, Long Chen, Chenglizhao Chen, Weiping Ding",
        "published": "2023-4",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2022.12.008"
    },
    {
        "id": 9446,
        "title": "Patch-Based Fuzzy Local Weighted C-Means Clustering Algorithm with Correntropy Induced Metric for Noise Image Segmentation",
        "authors": "Yunlong Gao, Huidui Li, Jianpeng Li, Chao Cao, Jinyan Pan",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40815-023-01485-2"
    },
    {
        "id": 9447,
        "title": "Thermographic image processing analysis in a solar concentrator with hard C-means clustering",
        "authors": "Marco A. Flores, Fernando E. Serrano, Carlos Cadena, Jose C. Alvarez",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.egyr.2023.05.261"
    },
    {
        "id": 9448,
        "title": "CLUSTERING ANALYSIS OF ADMISSION OF NEW STUDENTS USING K-MEANS CLUSTERING AND K-MEDOIDS ALGORITHMS TO INCREASE CAMPUS MARKETING POTENTIAL",
        "authors": "Hasan Amin",
        "published": "2023-8-29",
        "citations": 1,
        "abstract": "Acceptance of new students is a very important activity for a high school or university. The admissions data has not been utilized by the campus in making strategic decisions, marketing potential, and considering invitations through academic admissions. So, to assist in processing the new student admissions data, in this study the design and analysis of new student admissions data was carried out using stages in data mining. The clustering method approach can be applied in analyzing the potential level of PMB quality produced by utilizing the PMB recording dataset for the 2023 period. 86 data records. The K-Means and K-Medoids algorithm models that are applied have results that show a new insight, namely grouping based on 2 clusters, cluster 1 (C0) is a pass category while cluster 2 (C1) has not been determined. The results of the K-Medoids algorithm which has cluster 1 (C0) 60 results, cluster 2 (C1) has 26 results is a potential pass of 60 and has not yet been determined 26 of the data tested 86 while the results of the K-Means cluster 1 algorithm (C0) 40 , cluster 2 ( C1 ) 46 is a potential pass consisting of 40 and 46 undetermined data from the 86 datasets tested. Testing using the RapidMiner Studio application can also produce similar insights, namely each cluster has Davies Bouldin Index or DBI results from each K-Means and K-Medoids algorithm. K-Means has a Davies Bouldin Index result of -0.533 while K-Medoids has a Davies Bouldin Index result of -0.877",
        "keywords": "",
        "link": "http://dx.doi.org/10.31253/te.v7i1.2264"
    },
    {
        "id": 9449,
        "title": "An active contour model based on Jeffreys divergence and clustering technology for image segmentation",
        "authors": "Pengqiang Ge, Yiyang Chen, Guina Wang, Guirong Weng",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jvcir.2024.104069"
    },
    {
        "id": 9450,
        "title": "A Boosting Fuzzy Clustering Technique for Image Segmentation based on an Initial Low-Class",
        "authors": "C. Ramesh, Dr. T. Venugopal",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Abstract: Image segmentation is a basic problem in medical image analysis and useful for disease diagnosis. However, the complexity of medical images makes image segmentation difficult. In recent decades, fuzzy clustering algorithms have been preferred due to their simplicity and efficiency. However, they are sensitive to noise. To solve this problem, many algorithms using non-local information have been proposed, which perform well but are inefficient. This paper proposes a boosting fuzzy clustering algorithm utilizing non- local self-similarity and a low-class prior for image segmentation. Firstly, cluster centers are initialized based on peak detection. Then, a pixel correlation model between corresponding pixels is constructed, and similar pixel sets are retrieved. To improve efficiency and robustness, the proposed algorithm uses a novel objective function combining non-local information and an initial low-class. The algorithm's ability to achieve satisfactory results while simultaneously significantly increasing efficiency is demonstrated by experiments on medical and synthetic images.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.54549"
    },
    {
        "id": 9451,
        "title": "Carcinoembryonic Antigens Segmentation and Quantitative Analysis from Fluorescent Images using Principal Component Analysis and Adaptive K-means Clustering",
        "authors": "Muhammad Aqeel Aslam, Shahzadi Mahnoor, Muhammad Asif Munir, Saman Cheema, Khawaja Humble Hassan, Abdullah Sajid",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icepecc57281.2023.10209525"
    },
    {
        "id": 9452,
        "title": "Comparison of Hierarchical, K-Means and DBSCAN Clustering Methods for Credit Card Customer Segmentation Analysis Based on Expenditure Level",
        "authors": "Hafid Ramadhan, Mohammad Rizal Abdan Kamaludin, Muhammad Alfan Nasrullah, Dwi Rolliawati",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "The amount of data from credit card users is increasing from year to year. Credit cards are an important need for people to make payments. The increasing number of credit card users is because it is considered more effective and efficient. The third method used today has a function to determine the effective outcome of credit card user scenarios. In this study, a comparison was made using the Hierarchical Clustering, K-Means and DBSCAN methods to determine the results of credit card customer segmentation analysis to be used as a market strategy. The results obtained based on the best silhouette coefficient score method is two cluster hierarchical clustering with 0.82322 score. Based on the best mean value customers are divided into two segments, and it is suggested to develop strategies for both segments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30871/jaic.v7i2.5790"
    },
    {
        "id": 9453,
        "title": "Precise Identification and Segmentation of Brain Tumour in MR Brain Images Using Salp Swarm Optimized K-Means Clustering Technique",
        "authors": "Mahendran N, Muthuvel P, Arunprasath T, Pallikonda Rajasekaran M, Bridget Nirmala J, Kottaimalai R",
        "published": "2023-7-19",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212258"
    },
    {
        "id": 9454,
        "title": "Marker-controlled watershed algorithm and fuzzy C-means clustering machine learning: automated segmentation of glioblastoma from MRI images in a case series",
        "authors": "Sadegh Ghaderi, Sana Mohammadi, Kayvan Ghaderi, Fereshteh Kiasat, Mahdi Mohammadi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "\nIntroduction and importance:\nAutomated segmentation of glioblastoma multiforme (GBM) from MRI images is crucial for accurate diagnosis and treatment planning. This paper presents a new and innovative approach for automating the segmentation of GBM from MRI images using the marker-controlled watershed segmentation (MCWS) algorithm.\n\n\nCase presentation and methods:\nThe technique involves several image processing techniques, including adaptive thresholding, morphological filtering, gradient magnitude calculation, and regional maxima identification. The MCWS algorithm efficiently segments images based on local intensity structures using the watershed transform, and fuzzy c-means (FCM) clustering improves segmentation accuracy. The presented approach achieved improved segmentation accuracy in detecting and segmenting GBM tumours from axial T2-weighted (T2-w) MRI images, as demonstrated by the mean characteristics performance metrics for GBM segmentation (sensitivity: 0.9905, specificity: 0.9483, accuracy: 0.9508, precision: 0.5481, F_measure: 0.7052, and jaccard: 0.9340).\n\n\nClinical discussion:\nThe results of this study underline the importance of reliable and accurate image segmentation for effective diagnosis and treatment planning of GBM tumours.\n\n\nConclusion:\nThe MCWS technique provides an effective and efficient approach for the segmentation of challenging medical images.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/ms9.0000000000001756"
    },
    {
        "id": 9455,
        "title": "Re-Enhancing Fuzzy Clustering for Medical Image Segmentation",
        "authors": "Xin Tan, Cong Wang",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicn59530.2023.10392751"
    },
    {
        "id": 9456,
        "title": "UNSUPERVISED IMAGE SEGMENTATION FOR RUST DEFECT DETECTION BY INVARIANT INFORMATION CLUSTERING",
        "authors": "Daisuke Miki, Seita Tateishi, Yasuhiro Shitara, Yuya Ishida",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1299/jsmeicone.2023.30.1519"
    },
    {
        "id": 9457,
        "title": "COVID-19 ground-glass opacity segmentation based on fuzzy c-means clustering and improved random walk algorithm",
        "authors": "Guowei Wang, Shuli Guo, Lina Han, Zhilei Zhao, Xiaowei Song",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2022.104159"
    },
    {
        "id": 9458,
        "title": "Research on the Characteristics of Wordle Mini-Game Based on GA-BP Neural Network and K-Means Clustering Algorithm",
        "authors": "Fan Ju, Yongwei Ma, Shengjie Yao",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10257840"
    },
    {
        "id": 9459,
        "title": "OCR Based Image Text to Speech Conversion using K-Nearest Neighbors and Comparing with Fuzzy K-Means Clustering Algorithm",
        "authors": "M. Pandu Babu, Anitha G",
        "published": "2023-5-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10200864"
    },
    {
        "id": 9460,
        "title": "K-means ship trajectory clustering algorithm based on trajectory image similarity",
        "authors": "Qi Shi, Yaqiong Fan, Danpu Zhang, Huiming Guo, Jia Liu",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2685502"
    },
    {
        "id": 9461,
        "title": "Brain image segmentation with fuzzy entropy clustering and PSO-GWO optimization techniques",
        "authors": "Gouri Sankar Nayak, Pradeep Kumar Mallick, Neelmadhab Padhi, Manas Ranjan Mohanty, Sachin Kumar, Prasanalakshmi Balaji",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "In the field of brain MRI analysis, image segmentation serves various purposes such as quantifying and visualizing anatomical structures, analyzing brain changes, delineating pathological regions, and aiding in surgical planning and image-guided interventions. Over the past few decades, diverse segmentation techniques with varying degrees of accuracy and complexity have been developed. Real-world brain MRI images often encounter intensity in homogeneity, posing a significant challenge in accurate segmentation. The prevailing image segmentation algorithms, predominantly region-based, typically rely on the homogeneity of image intensities in specific regions of interest. However, these methods often fall short of providing precise segmentation results due to intensity in homogeneity. To address these challenges and enhance segmentation performance, this paper introduce a novel objective function named Fuzzy Entropy Clustering with Local Spatial Information and Bias Correction (FECSB). Additionally, we propose a novel hybrid algorithm that combines Particle Swarm Optimization (PSO) and Grey Wolf Optimization (GWO) to maximize the effectiveness of the FECSB function in MRI brain image segmentation. The proposed algorithm undergoes rigorous evaluation using benchmark MRI brain images, including those from the McConnell Brain Imaging Center (BrainWeb). The experimental results unequivocally demonstrate the superiority of the PSO-GWO clustering method over the traditional Fuzzy C Means (FCM) method. Across various image slices, the PSO-GWO method consistently outperforms FCM in terms of accuracy, showing improvements ranging from 1.28% to 1.46%, approximately achieving 99.37% accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/idt-230773"
    },
    {
        "id": 9462,
        "title": "Fuzzy C‐means clustering algorithm based on superpixel merging and multi‐feature adaptive fusion measurement",
        "authors": "Xie Zeyu, Luo Xiao, Zhao Defang, Chen Xinyu",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractThe fuzzy C‐means clustering (FCM) algorithm is widely used in greyscale and colour image segmentation, especially in real colour images. However, in the process of interested regions extraction, it performs barely satisfactory due to the use of single distance metric in traditional FCM. In order to address the issue, a fuzzy C‐means clustering algorithm based on superpixel merging and multi‐feature adaptive fusion measurement (FCM‐SM) are proposed. First of all, since superpixel image adapts well to irregular image boundaries, the FCM algorithm is elevated to the superpixel level. Moreover, the superpixel merging module based on colour similarity is introduced to improve the traditional watershed transformation by incorporating more gradient and intensity information. Finally, the multi‐feature adaptive fusion measurement is designed in the clustering process to incorporate multiple sources of spatial information, which comprehensively measures the information from different fields to enhance the segmentation capability further. Experiments performed on Berkeley Segmentation Dataset and Brain Tumor Segmentation Dataset demonstrate that the proposed algorithm provides better segmentation results than benchmarks during the object extraction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/ipr2.12939"
    },
    {
        "id": 9463,
        "title": "Analysis of time complexity of K-means and fuzzy C-means clustering algorithm",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/eml/8402"
    },
    {
        "id": 9464,
        "title": "FK-means: automatic atrial fibrosis segmentation using fractal-guided K-means clustering with Voronoi-clipping feature extraction of anatomical structures",
        "authors": "Marjan Firouznia, Markus Henningsson, Carl-Johan Carlhäll",
        "published": "2023-12-15",
        "citations": 2,
        "abstract": "Assessment of left atrial (LA) fibrosis from late gadolinium enhancement (LGE) magnetic resonance imaging (MRI) adds to the management of patients with atrial fibrillation. However, accurate assessment of fibrosis in the LA wall remains challenging. Excluding anatomical structures in the LA proximity using clipping techniques can reduce misclassification of LA fibrosis. A novel FK-means approach for combined automatic clipping and automatic fibrosis segmentation was developed. This approach combines a feature-based Voronoi diagram with a hierarchical 3D K-means fractal-based method. The proposed automatic Voronoi clipping method was applied on LGE-MRI data and achieved a Dice score of 0.75, similar to the score obtained by a deep learning method (3D UNet) for clipping (0.74). The automatic fibrosis segmentation method, which uses the Voronoi clipping method, achieved a Dice score of 0.76. This outperformed a 3D UNet method for clipping and fibrosis classification, which had a Dice score of 0.69. Moreover, the proposed automatic fibrosis segmentation method achieved a Dice score of 0.90, using manual clipping of anatomical structures. The findings suggest that the automatic FK-means analysis approach enables reliable LA fibrosis segmentation and that clipping of anatomical structures in the atrial proximity can add to the assessment of atrial fibrosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1098/rsfs.2023.0033"
    },
    {
        "id": 9465,
        "title": "Modified Fast and Robust Fuzzy C-means Algorithm for Flood Damage Assessment using Optimal Image Segmentation Cluster Number",
        "authors": "Marck Herzon C. Barrion, Argel A. Bandala",
        "published": "2023-1-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imcom56909.2023.10035598"
    },
    {
        "id": 9466,
        "title": "Retracted: Application of Spatial Neighborhood Fuzzy c-Means Algorithm in 3D Image Segmentation of National Clothing",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9839075"
    },
    {
        "id": 9467,
        "title": "Fuzzy C-Means for image segmentation: challenges and solutions",
        "authors": "Krishna Gopal Dhal, Arunita Das, Buddhadev Sasmal, Swarnajit Ray, Rebika Rai, Arpan Garai",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16569-2"
    },
    {
        "id": 9468,
        "title": "Hybrid Fuzzy C-Means Using Particle Swarm Optimization (PSO) and Differential Evolution (DE) for Image Segmentation",
        "authors": "C. H. Tan, P. Rajendran, V. Raja, E. Natarajan",
        "published": "2023-8-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/case56687.2023.10260372"
    },
    {
        "id": 9469,
        "title": "Adaptive Gaussian Regularization Constrained Sparse Subspace Clustering for Image Segmentation",
        "authors": "Sensen Song, Dayong Ren, Zhenhong Jia, Fei Shi",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10446289"
    },
    {
        "id": 9470,
        "title": "Advanced COVID-19 CT Image Segmentation Using a Hybrid Undecimated Wavelet Transform, Fuzzy Clustering, and Anisotropic Diffusion Approach",
        "authors": "Messaouda Larbi, Hilal Naimi, Mohammed Bourennane",
        "published": "2023-6-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ts.400320"
    },
    {
        "id": 9471,
        "title": "Enhanced independent component analysis and fuzzy C-mean clustering based on novel bat algorithm for noisy image segmentation",
        "authors": "Nabil Chetih, Tawfik Thelaidjia, Fatma Zohra Boudani",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nFuzzy c-means clustering is widely recognized as one of the most effective methods for image segmentation and achieving accurate classification. However, this method has two significant drawbacks: its sensitivity to noise and its convergence to local minimum clusters’ centroids. In this paper, we proposed a novel model called EIFCMNB, which incorporates enhanced independent component analysis (EICA), fuzzy c-means clustering (FCMC) and novel bat algorithm (NBA) for noise image segmentation. The suggested model consists of two main phases: image denoising and extraction of the regions of interest (ROIs). In the first phase, the enhanced independent component analysis (EICA) algorithm is used for recovering a good quality image, from a noisy image of poor quality. Several noisy images, with noise variances ranging from 5 to 20, were filtered. The resulting images were then evaluated based on several criteria viz: Peak Signal to Noise Ratio (PSNR), Relative Norm Error (RE), Normalized Cross-Correlation (NCC), and Structural Similarity index measure (SSIM). In the second phase, the fuzzy c-means clustering based on a novel bat algorithm is adopted to calculate optimal clusters’ centroids and extract the ROIs. By incorporating the new bat algorithm, we aim to overcome the problem of converging to local minimums and achieve improved segmentation accuracy. Promising experimental results have been obtained by applying the proposed model to MRI brain images and x-ray welding images. Two criteria viz: VPE end VPC have been employed to evaluate the suggested approach. The experiments clearly demonstrate that our suggested model effectively addresses the sensitivity to noise problem and provides optimal clusters’ centroids. Moreover, it outperforms several FCMC-based algorithms, exhibiting superior performance in terms of image segmentation and classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2631-8695/acffa7"
    },
    {
        "id": 9472,
        "title": "Fast and robust spatial fuzzy bounded k-plane clustering method for human brain MRI image segmentation",
        "authors": "Puneet Kumar, R.K. Agrawal, Dhirendra Kumar",
        "published": "2023-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2022.109939"
    },
    {
        "id": 9473,
        "title": "Mammogram Image to Detect Breast Cancer Using K-Means Clustering Algorithm",
        "authors": "B Gopinathan, M Naveena, M Shreyas, D Charan Rohith",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Breast cancer is the uncontrolled proliferation of a group of cells in the breast and is the second leading cause of death for women in the world. The disease can be cured if detected in the early stages. A lot of research has been done to correctly detect the tumor, but a 100% accurate method has not been found. Research on breast cancer detection using digital image processing is not new, but many new approaches are being considered in this field to accurately predict the tumor area. The current approach consists of detecting the tumor area visually and also finding out in which area the tumor is most concentrated. CC and MLO dualview mammographic screening images are widely used in the diagnostic process. This project presents a method for detecting a tumor area and classifying a normal and oncological patient. Preprocessing operations are performed on the input mammographic image and unwanted parts are removed from the image. Tumor regions are segmented from the image using a morphological operation and are highlighted on the original mammographic image. If the image on the mammogram is normal, it means that the patient is healthy. This work mainly focuses on finding the best algorithms for detecting tumors present in the breast. A number of algorithms were used in the proposed work, but the most suitable for cancer detection is the combination of K-Means clustering algorithm. K-Means classification accuracy is 95% accurate output will be predicted. Keywords: Image Processing, Breast Cancer, K-Means clustering, Dilation, Closing, Edge Detection, Mammography screening images",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/jeae/2/1/1"
    },
    {
        "id": 9474,
        "title": "Remaining useful life prediction via K-means clustering analysis and deep convolutional neural network",
        "authors": "Yuru Zhang, Chun Su, Jiajun Wu",
        "published": "2023-4-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3596286.3596297"
    },
    {
        "id": 9475,
        "title": "Enhanced Color Image Quantization Utilizing Hybrid Glowworm Swarm Optimization and K-Means Clustering: A Case Study with Chandrayaan-3 Images",
        "authors": "Arjun Govind Desur, Ravi Kumar Jatoth",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpc2t60072.2024.10474605"
    },
    {
        "id": 9476,
        "title": "Segmentation of OECD countries on the basis of selected global environmental indicators using k-means non-hierarchical clustering",
        "authors": "Pallavi Kudal, Amitabh Patnaik, Sunny Dawar, Raj Kumar Satankar, Prince Dawar",
        "published": "2023-4-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-023-26679-x"
    },
    {
        "id": 9477,
        "title": "Application of U-Net and Optimized Clustering in Medical Image Segmentation: A Review",
        "authors": "Jiaqi Shao, Shuwen Chen, Jin Zhou, Huisheng Zhu, Ziyi Wang, Mackenzie Brown",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmes.2023.025499"
    },
    {
        "id": 9478,
        "title": "Accuracy Measurement of Hyperspectral Image Classification in Remote Sensing with the Light Spectrum-based Affinity Propagation Clustering-based Segmentation",
        "authors": "A. Josephine Christilda, R. Manoharan",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "The area of remote sensing and computer vision includes the challenge of hyperspectral image classification. It entails grouping pixels in hyperspectral pictures into several classes according to their spectral signature. Hyperspectral photographs are helpful for a variety of applications, including vegetation study, mineral mapping, and mapping urban land use, since they include information on an object's reflectance in hundreds of small, contiguous wavelength bands. This task's objective is to correctly identify and categorize several item categories in the image. Many approaches have been stated by several researchers in this field to enhance the accuracy of the segmentation and accuracy. However, fails to attain the optimal accuracy due to the intricate nature of the images. To tackle these issues, we propose a novel Modified Extreme Learning machine (M-ELM) approach for the credible hyperspectral image classification outcomes with the publicly available Kaggle datasets. Before the classification, the input images are segmented using the Light Spectrum-based modified affinity propagation clustering technique (LSO-MAPC). In the beginning, the images are pre-processed using the non-linear diffusion partial differential equations technique which effectively pre-processed the image spatially. Experiments are effectuated to analyze the performance of the proposed method and compared it with state-of-art works in a quantitative way. The proposed approach ensures a classification accuracy of 96%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37391/ijeer.120105"
    },
    {
        "id": 9479,
        "title": "Image Processing for Automatic Cell Nucleus Segmentation Using Super pixel and Clustering Methods on Histopathological Images",
        "authors": "Firthouse Hassan Ahamed Shibly, Lakshmana Kumar. R",
        "published": "2023-4-20",
        "citations": 5,
        "abstract": "On a daily basis, it appears that the number of cancer cases and cancer-related deaths are increasing. Early detection and treatment of the malignant region are critical for successful treatment. Early detection of sick cells is made possible with the use of computer-assisted programmes, which are then diagnosed by experienced pathologists due to their efforts. Using computer-aided programmes, this research found that cell nuclei could be automatically detected in high-resolution histopathological images using global segmentation methods such as k-Means and Fuzzy C Means and algorithms from superpixel segmentation methods such as SLIC, Quick-shift, Felzenszwalb, Watershed, and ERS. Using high-quality histopathology pictures, the researchers discovered that the k-means and FCM algorithms performed significantly better than the baseline techniques in the study. In terms of precision, the Quickshift and SLIC approaches produced superior outcomes. The K-means and FCM algorithms perform best in the F-M test, and the true negative ratio is more successful in the Quickshift and SLIC methods than in the F-M test.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.59785/tjhest.v1i1.6"
    },
    {
        "id": 9480,
        "title": "Interval type-2 possibilistic fuzzy clustering noisy image segmentation algorithm with adaptive spatial constraints and local feature weighting &amp; clustering weighting",
        "authors": "Tongyi Wei, Xiaopeng Wang, Jiaxin Wu, Shengyang Zhu",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijar.2023.02.013"
    },
    {
        "id": 9481,
        "title": "An Improved Soft Subspace Clustering Algorithm for Brain MR Image Segmentation",
        "authors": "Lei Ling, Lijun Huang, Jie Wang, Li Zhang, Yue Wu, Yizhang Jiang, Kaijian Xia",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmes.2023.028828"
    },
    {
        "id": 9482,
        "title": "A comparison between the fuzzy C-means clustering algorithm and the K-mean clustering algorithm",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/eml/8403"
    },
    {
        "id": 9483,
        "title": "Expanded relative density peak clustering for image segmentation",
        "authors": "Miao Li, Yan Ma, Hui Huang, Bin Wang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10044-023-01195-3"
    },
    {
        "id": 9484,
        "title": "AAPFC-BUSnet: Hierarchical encoder–decoder based CNN with attention aggregation pyramid feature clustering for breast ultrasound image lesion segmentation",
        "authors": "Sushma B., Aparna Pulikala",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bspc.2024.105969"
    },
    {
        "id": 9485,
        "title": "Enhancing Robustness in Multi-modal CT Image Segmentation with a Clustering-based Deep Active Learning Approach",
        "authors": "Aisen Yang, Lulu Xu, Ziyi Liu, Na Qin, Deqing Huang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/safeprocess58597.2023.10295769"
    },
    {
        "id": 9486,
        "title": "A Double Clustering Approach for Color Image Segmentation",
        "authors": "Asma Khazaal Abdulsahib, Siti Sakira Kamaruddin, Mustafa Musa Jabar",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "One of the significant stages in computer vision is image segmentation which is fundamental for different applications, for example, robot control and military target recognition, as well as image analysis of remote sensing applications. Studies have dealt with the process of improving the classification of all types of data, whether text or audio or images, one of the latest studies in which researchers have worked to build a simple, effective, and high-accuracy model capable of classifying emotions from speech data, while several studies dealt with improving textual grouping. In this study, we seek to improve the classification of image division using a novel approach depending on two methods used to segment the images. The first method used the minimum distance, and the second method used the clustering algorithm called DBSCAN. Both methods were tested with and without reclustering using the self-organizing map (SOM). The result from comparing the images after segmenting them and comparing the time taken to implement the segmentation process shows the effectiveness of these methods when used with SOM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/1039870"
    },
    {
        "id": 9487,
        "title": "Improved kernel density peaks clustering for plant image segmentation applications",
        "authors": "Jiaze Bi, Pingzhe Zhang, Yujia Gao, Menglong Dong, Yongzhi Zhuang, Ao Liu, Wei Zhang, Yiqiong Chen",
        "published": "2023-12-2",
        "citations": 0,
        "abstract": "Abstract\nIn order to better solve the shortcomings of the k-means clustering method and density peaks clustering (DPC) method in agricultural image segmentation, this work proposes a method to divide points in a high-dimensional space, and a clustering method is obtained to divide crops and soil. In the process of assigning points in the DPC method, if a point is divided incorrectly, a series of points may be assigned to a cluster that is not related to it. In response to this problem, this study uses the decision graph to select the centroids, and uses Gaussian kernel to map the data to the high-dimensional space, each centroid searches for the most relevant points in the high-dimensional space until a temporary boundary point is found to stop the first assignment strategy, and then the points that are not clustered are assigned to the correct cluster to complete the clustering. The experimental results show that the proposed method has a better clustering effect through experiments on multiple artificial datasets and UCI datasets, compared with other clustering methods, and finally applied to plant image segmentation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jisys-2022-0151"
    },
    {
        "id": 9488,
        "title": "Modified total Bregman divergence driven picture fuzzy clustering with local information for brain MRI image segmentation",
        "authors": "Himanshi Lohit, Dhirendra Kumar",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110460"
    },
    {
        "id": 9489,
        "title": "An Accurate Subspace Clustering Model for Unsupervised Noise-laden Hyperspectral Image Segmentation",
        "authors": "ZX Lin, YH Jiang, CM Wu, JG Wang, S Yan",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "Abstract\nThe hyperspectral image acquisition in realistic situations is accompanied by a lot of noise, which dramatically interferes with the discriminative power of the clustering model. In this paper, a superpixel segmentation 3D regularized subspace clustering model (SS3D-SSC) is provided, which uses a superpixel segmentation method to obtain the most representative pixel in each tiny region and use it as a representative to replace other pixels in the same area, and then use sparse subspace clustering to perform the subsequent image segmentation, the proposed method in this paper is used in Indian Pines.The reliability of the algorithm is confirmed on the Indian Pines, Salinas and Pavia University datasets. Compared with the most advanced SSC-based algorithms, even using graph convolution subspace clustering, SS3D-SSC model has better classification performance and anti-noise ability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2476/1/012023"
    },
    {
        "id": 9490,
        "title": "Estimation of grapevine lateral leaf area (LLA) from RGB imagery using color thresholds and automatic k-means image segmentation",
        "authors": "A. Berry, M.A. Vivier, C. Poblete-Echeverría",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17660/actahortic.2024.1390.30"
    },
    {
        "id": 9491,
        "title": "Illumination-Free Clustering Using Improved Slime Mould Algorithm for Acute Lymphoblastic Leukemia Image Segmentation",
        "authors": "Krishna Gopal Dhal, Swarnajit Ray, Sudip Barik, Arunita Das",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42235-023-00392-4"
    },
    {
        "id": 9492,
        "title": "Otsu and Double-Dimensional Clustering With Wingsuit Flying Search Algorithm (WFSA) For Multi-Level Thresholding In Image Segmentation",
        "authors": "Mr. Machchhindra Jibhau Garde, Dr. Pravin Sahebrao Pati",
        "published": "2023-4-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46335/ijies.2023.8.4.12"
    },
    {
        "id": 9493,
        "title": "Application of K-Means Clustering for Detection Downy Mildew at Madura Corn Plant Using Digital Image Processing",
        "authors": "Imron Rosyadi NR, Erwin Prasetyowati, Badar Said, Syaiful Arifin, Mohammad Syafiir Ridoni",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "The development and cultivation of corn is necessary in line with the increasing consumption of food ingredients and industrial needs, especially food products made from corn. In the development of maize in Indonesia, the main obstacle is the disturbance of Plant Pest Organisms (OPT), especially diseases, one of which is downy mildew. This disease can be identified by a change in color, so we need a way to find out the difference between the color of healthy leaves and the color of leaves that have changed due to downy mildew. One solution that can be used is image processing. Therefore the aim of this study was to detect downy mildew based on leaf color in corn plants based on digital image processing, to produce precise and objective results. The algorithm used is the K-Means Clustering algorithm. This study uses 50 images of training data and 25 images of test data. Based on the simulation of downy mildew disease identification using K-Means Clustering it achieves an accuracy rate of 85%.  ",
        "keywords": "",
        "link": "http://dx.doi.org/10.36456/tibuana.6.2.7845.147-152"
    },
    {
        "id": 9494,
        "title": "DOM-Based Clustering Approach for Web Page Segmentation: A Comparative Study",
        "authors": "Adrian Sterca, Oana Nourescu, Adriana Guran, Camelia Serban",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012184000003584"
    },
    {
        "id": 9495,
        "title": "AENCIC: a method to estimate the number of clusters based on image complexity to be used in fuzzy clustering algorithms for image segmentation",
        "authors": "Luis Madrid-Herrera, Mario I. Chacon-Murguia, Juan A. Ramirez-Quintana",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-08844-z"
    },
    {
        "id": 9496,
        "title": "Automatic Landslide Segmentation Using a Combination of Grad-CAM Visualization and K-Means Clustering Techniques",
        "authors": "Kemal Hacıefendioğlu, Süleyman Adanur, Gökhan Demir",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40996-023-01193-9"
    },
    {
        "id": 9497,
        "title": "A Novel Image Segmentation Technique with N-L Means Filter Using Region Merging Strategy",
        "authors": "Swaroopa H N, Basavaraj N Jagadale, Salma N",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "Image segmentation is a branch of digital image processing which emphases on splitting an image into different fragments according to their features. This work proposes a novel image segmentation technique using fast non local (N-L) means filter with region merging approach. Here, a random noise is added to the original image and discrete wavelet transform (DWT) is applied to separate the low and high frequency bands of the digital image. The low frequency component is subjected to a fast N-L means filter and the filtered image is segmented by graph-based segmentation technique. Here, these segmented image regions are merged to reduce the over segmentation patterns. The detailed coefficients of the image component are treated with soft threshold filter to reduce the residual noise. Finally merged image is combined with preserved edge features at wavelet projection resulting in better segmented image. The results are compared with some of the best methods available in literature and are found to be significantly better.\n\nKeywords: Discrete wavelet transform (DWT), fast NL-means filter, graph-based segmentation, boundary based hierarchical region merging, soft-thresholding, peak signal to noise ratio (PSNR).",
        "keywords": "",
        "link": "http://dx.doi.org/10.52403/ijrr.20231264"
    },
    {
        "id": 9498,
        "title": "Robust Rolling K-Means (R2K-Means): an Updateable Nonlinear K-Means Clustering Methodology for Financial Time Series",
        "authors": "Ryan Holmes, Ali Hirsa, Federico Klinkert, Satyan Malhotra",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4729393"
    },
    {
        "id": 9499,
        "title": "Penerapan Algoritma K-Means Clustering untuk Mengelompokkan Kecamatan di Kabupaten Grobogan Menurut Tingkat Kesejahteraan Keluarga Tahun 2020",
        "authors": "Asa Nugrahaini,  Rahmadi Yotenka",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Kesejahteraan keluarga adalah keadaan di mana kebutuhan dasar, sosial, dan perkembangan keluarga terpenuhi secara maksimal. Kabupaten Grobogan memiliki tingkat kesejahteraan keluarga yang berbeda-beda di setiap kecamatannya. Berbagai upaya dilakukan oleh pemerintah di Kabupaten Grobogan untuk mengatasi masalah-masalah yang berkaitan dengan kesejahteraan keluarga, mulai dari penyaluran bantuan dalam bentuk bantuan konsumtif hingga bantuan yang lebih produktif, namun seringkali terkendala masalah distribusi. Dengan menggunakan analisis k-means clustering, 19 kecamatan di Kabupaten Grobogan diklasifikasi dan ditentukan karakteristiknya guna membantu pemerintah dalam melaksanakan kebijakan yang berkaitan dengan masalah kesejahteraan keluarga di setiap kecamatan. Ada dua kelompok berbeda yang diidentifikasi dalam penelitian ini. Kecamatan pada kelompok 1 memiliki tingkat kesejahteraan keluarga yang tinggi untuk keluarga tahap I, II, III, dan III+. Sementara itu kelompok 2 memiliki tingkat kesejahteraan keluarga rendah untuk keluarga tahap I, II, III, dan III+.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20885/esds.vol1.iss.3.art36"
    },
    {
        "id": 9500,
        "title": "Robust dynamic semi-supervised picture fuzzy local information clustering with kernel metric and spatial information for noisy image segmentation",
        "authors": "Chengmao Wu, Jiajia Zhang, Congcong Huang",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14703-8"
    },
    {
        "id": 9501,
        "title": "Multiple population-based multi-objective evolutionary semi-supervised multi-kernel region fuzzy clustering image segmentation",
        "authors": "Feng Zhao, Mimi Zhang, Hanqiang Liu",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12293-023-00396-x"
    },
    {
        "id": 9502,
        "title": "Aerial image segmentation with minimal annotation effort using clustering of pretrained embeddings",
        "authors": "Sabina van Rooij, Maarten C. Kruithof, Wyke Huizinga, Gertjan Burghouts, Klamer Schutte",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2688450"
    },
    {
        "id": 9503,
        "title": "Fast and automatic hesitant fuzzy clustering applied to image segmentation",
        "authors": "Virna V. Vela-Rincón, Dante Mújica-Vargas, Antonio Luna-Álvarez, Andrés Antonio Arenas Muñiz, Luis A. Cruz-Prospero",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Image segmentation is a very studied area, looking for the best clustering of pixels. However, it is sometimes a complicated task, especially when these pixels are at the edges of regions, where there is a gradient and it is difficult to decide to which region to assign it. Hesitating fuzzy sets (HFS) better describe these situations, allowing to have multiple possible values for each element, giving more flexibility. This type of sets has been mainly applied in decision-making problems, obtaining better results than other types of fuzzy sets. This research proposes a fast and automatic method based on fuzzy hesitant clustering (FAHFC), which does not require parameters since it is capable of determining the number of clusters, using the Calinski-Harabasz index, in which the segmentation is performed, solving the initialization problem in clustering; it also proposes an alternative to construct the HFS through the use of fuzzy relations. The experiments show superiority in terms of clustering quality and convergence over some selected state-of-the-art algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-219370"
    },
    {
        "id": 9504,
        "title": "Evaluating the index of panoramic X-ray image quality using K-means clustering method",
        "authors": "Satoshi Imajo, Yoshinori Tanabe, Nobue Nakamura, Mitsugi Honda, Masahiro Kuroda",
        "published": "2024-1-2",
        "citations": 0,
        "abstract": "Abstract\nBackground\nA panoramic X-ray image is generally considered optimal when the occlusal plane is slightly arched, presenting with a gentle curve. However, the ideal angle of the occlusal plane has not been determined. This study provides a simple evaluation index for panoramic X-ray image quality, built using various image and cluster analyzes, which can be used as a training tool for radiological technologists and as a reference for image quality improvement.\n\nResults\nA reference panoramic X-ray image was acquired using a phantom with the Frankfurt plane positioned horizontally, centered in the middle, and frontal plane centered on the canine teeth. Other images with positioning errors were acquired with anteroposterior shifts, vertical rotations of the Frankfurt plane, and horizontal left/right rotations. The reference and positioning-error images were evaluated with the cross-correlation coefficients for the occlusal plane profile, left/right angle difference, peak signal-to-noise ratio (PSNR), and deformation vector fields (DVF). The results of the image analyzes were scored for positioning-error images using K-means clustering analysis. Next, we analyzed the correlations between the total score, cross-correlation analysis of the occlusal plane curves, left/right angle difference, PSNR, and DVF. In the scoring, the positioning-error images with the highest quality were the ones with posterior shifts of 1 mm. In the analysis of the correlations between each pair of results, the strongest correlations (r = 0.7–0.9) were between all combinations of PSNR, DVF, and total score.\n\nConclusions\nThe scoring of positioning-error images using K-means clustering analysis is a valid evaluation indicator of correct patient positioning for technologists in training.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s43055-023-01176-w"
    }
]