[
    {
        "id": 9505,
        "title": "Hierarchical Clustering Combination Method Using Intuitionistic Fuzzy Similarity in Software Module Clustering",
        "authors": "Hong Xia, Bo Wang, Yongkang Zhang, Yanping Chen",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nana60121.2023.00089"
    },
    {
        "id": 9506,
        "title": "Java Data Structure Optimization of Talent Training Performance Evaluation System Based on Distributed Hierarchical Data Clustering Algorithm",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1208.1017"
    },
    {
        "id": 9507,
        "title": "Supporting weather forecasting performance management at aerodromes through anomaly detection and hierarchical clustering",
        "authors": "Riccardo Patriarca, Francesco Simone, Giulio Di Gravio",
        "published": "2023-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.119210"
    },
    {
        "id": 9508,
        "title": "Hierarchical Clustering Architecture for Metaverse Applications",
        "authors": "Kumar M Santhosh, M Prabhakar, Goutam Sanyal",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccgridw59191.2023.00055"
    },
    {
        "id": 9509,
        "title": "Optimization of hierarchical clustering method using Calinski-Harabasz Pseudo F-statistic for clustering district/city in Central Java Province based on education indicators",
        "authors": "Ali Mahmudan, Di Asih I. Maruddani, Budi Warsito",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0140170"
    },
    {
        "id": 9510,
        "title": "Learning Bayesian networks with heterogeneous agronomic data sets via mixed-effect models and hierarchical clustering",
        "authors": "Lorenzo Valleggi, Marco Scutari, Federico Mattia Stefanini",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.107867"
    },
    {
        "id": 9511,
        "title": "Komparasi Hierarchical Clustering Dan K-Medoid Clustering Terhadap Pengelompokan Satuan Kerja Perangkat Daerah (SKPD) Di Kabupaten Sleman Tahun 2021",
        "authors": " Mifthahul Rahma,  Muhammad Muhajir",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "Aduan masyarakat merupakan suatu laporan yang disampaikan oleh masyarakat kepada pemerintah jika terjadi suatu ketidaksesuaian pelayanan dengan standar pelayanan yang seharusnya. Aduan masyarakat menjadi komponen penting bagi pemerintah dalam mengukur keberhasilan pemerintah dalam melaksanakan kewajiban. Penelitian ini bertujuan untuk melakukan komparasi dari hasil pengelompokan Satuan Kerja Perangkat Daerah (SKPD) berdasarkan jumlah aduan yang sudah ditanggapi dan yang belum ditanggapi pada tahun 2021. Pada penelitian ini digunakan 2 metode yang akan dibandingkan yaitu metode Hierarchical Clustering dan K-Medoid Clustering. Hasil dari pengelompokan ini dapat ditujukan sebagai bahan pertimbangan untuk meningkatkan manajemen pelayanan publik serta meningkatkan pelayanan atau pemenuhan kewajiban yang harus diberikan oleh pemerintah kepada masyarakat. Dari hasil analisis Hierarchical Clustering dan K-Medoid Clustering, diperoleh jumlah cluster yang sama yaitu sebanyak dua cluster untuk mengelompokkan 52 SKPD di Kabupaten Sleman. Untuk anggota cluster pada kedua metode juga mendapatkan hasil yang sama yaitu cluster kesatu terdapat 51 SKPD yang memiliki jumlah aduan relatif rendah dan cluster kedua terdapat 1 SKPD yang memiliki jumlah aduan relatif tinggi. Digunakan nilai Silhouette Cooficient untuk membandingkan metode Hierarchical Clustering dan K-Medoid Clustering, didapatkan nilai Silhouette Cooficient pada kedua metode sebesar 0.9146, yang menandakan bahwa kedua metode merupakan metode yang baik dalam melakukan clustering untuk studi kasus pada penelitian ini, karena nilai Silhouette Cooficient mendekati angka 1.",
        "keywords": "",
        "link": "http://dx.doi.org/10.20885/esds.vol2.iss.1.art5"
    },
    {
        "id": 9512,
        "title": "Mapping Indonesian potential fishing zone using hierarchical and non-hierarchical clustering",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/8088"
    },
    {
        "id": 9513,
        "title": "Clustering Indonesian Provinces on Prevalence of Stunting Toddlers Using Agglomerative Hierarchical Clustering",
        "authors": "Septian Wulandari",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.30998/faktorexacta.v16i2.17186"
    },
    {
        "id": 9514,
        "title": "BIR-AHC: Balanced Iterative Reducing and Agglomerative Hierarchical Clustering for Stair Detection",
        "authors": "Chuansheng Xiao, Nan Ma, Kongjian Qin, Genbao Xu, Mohan Wang",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsa59317.2023.00091"
    },
    {
        "id": 9515,
        "title": "Clustering of Child Nutrition Status using Hierarchical Agglomerative Clustering Algorithm in Bekasi City",
        "authors": " Ozzi ardhiyanto,  Muhammad Salam Asyidqi,  Ajif Yunizar Pratama Yusuf, S.Si, M.Eng,  Dr. Tb. Ai Munandar, S.Kom., MT",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "Clustering infant nutrition based on weight, height, and age is a data analysis method used to group infant nutritional status based on these characteristics. The research on clustering infant nutrition aims to analyze whether there are still many infants in the area with insufficient or excessive nutrition, and to identify groups of infants requiring special attention regarding their nutritional intake. In the analysis of infant nutrition clustering, data on weight, height, and age of infants are collected and then grouped based on similarities in body height and weight at certain ages. The method used in this research is hierarchical clustering, which can help in grouping the data. Clustering analysis can help understand how infants' feeding patterns vary based on their weight, height, and age. The results of research on clustering infant nutrition based on weight, height, and age can provide valuable insights for nutrition experts, pediatricians, and community health workers in developing appropriate intervention programs to improve infant feeding patterns and meet their nutritional needs. Additionally, the results of clustering infant nutrition can also be used to identify groups of infants requiring special attention regarding their nutritional needs, thus minimizing the risk of malnutrition and unhealthy growth in infants.",
        "keywords": "",
        "link": "http://dx.doi.org/10.58776/ijitcsa.v1i3.42"
    },
    {
        "id": 9516,
        "title": "Semi-supervised hierarchical ensemble clustering based on an innovative distance metric and constraint information",
        "authors": "Baohua Shen, Juan Jiang, Feng Qian, Daoguo Li, Yanming Ye, Gholamreza Ahmadi",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106571"
    },
    {
        "id": 9517,
        "title": "Clustering Earthquake Event Points in the Southeast Asia Region using Agglomerative Hierarchical Clustering",
        "authors": "Adi Arifin",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32520/stmsi.v12i3.3150"
    },
    {
        "id": 9518,
        "title": "Comparison of hierarchical clustering and neural network clustering: an analysis on precision dominance",
        "authors": "Nazish Shahid",
        "published": "2023-4-6",
        "citations": 4,
        "abstract": "AbstractA comparison of neural network clustering (NNC) and hierarchical clustering (HC) is conducted to assess computing dominance of two machine learning (ML) methods for classifying a populous data of large number of variables into clusters. An accurate clustering disposition is imperative to investigate assembly-influence of predictors on a system over a course of time. Moreover, categorically designated representation of variables can assist in scaling down a wide data without loss of essential system knowledge. For NNC, a self-organizing map (SOM)-training was used on a local aqua system to learn distribution and topology of variables in an input space. Ternary features of SOM; sample hits, neighbouring weight distances and weight planes were investigated to institute an optical inference of system’s structural attributes. For HC, constitutional partitioning of the data was executed through a coupled dissimilarity-linkage matrix operation. The validation of this approach was established through a higher value of cophenetic coefficient. Additionally, an HC-feature of stem-division was used to determine cluster boundaries. SOM visuals reported two locations’ samples for remarkable concentration analogy and presence of 4 extremely out of range concentration parameter from among 16 samples. NNC analysis also demonstrated that singular conduct of 18 independent components over a period of time can be comparably inquired through aggregate influence of 6 clusters containing these components. However, a precise number of 7 clusters was retrieved through HC analysis for segmentation of the system. Composing elements of each cluster were also distinctly provided. It is concluded that simultaneous categorization of system’s predictors (water components) and inputs (locations) through NNC and HC is valid to the precision probability of 0.8, as compared to data segmentation conducted with either of the methods exclusively. It is also established that cluster genesis through combined HC’s linkage and dissimilarity algorithms and NNC is more reliable than individual optical assessment of NNC, where varying a map size in SOM will alter the association of inputs’ weights to neurons, providing a new consolidation of clusters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-32790-3"
    },
    {
        "id": 9519,
        "title": "Output Curves Based Hierarchical Clustering Screening Method With Static/Dynamic Current Balancing for Paralleled SiC MOSFETs",
        "authors": "Fujun ZHENG,  ",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24295/cpsstpea.2023.00024"
    },
    {
        "id": 9520,
        "title": "Multi-camera trajectory matching based on hierarchical clustering and constraints",
        "authors": "Gábor Szűcs, Regő Borsodi, Dávid Papp",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "AbstractThe fast improvement of deep learning methods resulted in breakthroughs in image classification, object detection, and object tracking. Autonomous driving and traffic monitoring systems, especially the on-premise installed fixed position multi-camera configurations, benefit greatly from recent advances. In this paper, we propose a Multi-Camera Multi-Target (MCMT) vehicle tracking system using a constrained hierarchical clustering solution, which improves trajectory matching, and thus provides a more robust tracking of objects transitioning between cameras. YOLOv5, ByteTrack, and ResNet50-IBN ReID networks are used for vehicle detection and tracking. Static attributes such as vehicle type and vehicle color are determined from ReID features with SVM. The proposed ReID feature-based attribute categorization shows better performance, than its pure CNN counterpart. Single-camera trajectories (SCTs) are combined into multi-camera trajectories (MCTs) using hierarchical agglomerative clustering (HAC) with time and space constraints (our proposed algorithm is denoted by MCT#MAC). Similarities between SCTs are measured by comparing the mean ReID features cumulated on the trajectory. The system was evaluated on more datasets, and our experiments demonstrate that constraining HAC by manipulating the proximity matrix greatly improves the multi-camera IDF1 score.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17397-0"
    },
    {
        "id": 9521,
        "title": "Impact of Dataset Scaling on Hierarchical Clustering: A Comparative Analysis of Distance-Based and Ratio-Based Methods",
        "authors": "Ali Rashash R. Alzahrani",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "In this study, the distance-based agglomerative hierarchical clustering techniques were compared to a ratio-based approach. Two real datasets, which were also used in a prior study by Roux (2018), were considered. Firstly, it was observed that the type of scaling applied to the datasets was found to affect the results of hierarchical clustering. Thus, various scaling methods were employed prior to implementing hierarchical clustering. Furthermore, two rank-based goodness-of-fit measures were used to evaluate the hierarchical clustering methods. In contrast to Roux (2018) findings, it was observed that the distance-based methods, such as Median linkage, Average linkage, and centroid linkage, performed better than the ratio-based method. The ratio-based methods also showed issues with branch crossing in the hierarchical clustering dendrogram. Consequently, this study illustrates that, with appropriate dataset scaling, the distance-based methods outperform ratio-based methods in terms of goodness-of-fit measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.28924/2291-8639-22-2024-36"
    },
    {
        "id": 9522,
        "title": "An Innovative Clustering Hierarchical Protocol for Data Collection from Remote Wireless Sensor Networks Based Internet of Things Applications",
        "authors": "Syed Luqman Shah, Ziaul Haq Abbas, Ghulam Abbas, Fazal Muhammad, Aseel Hussien, Thar Baker",
        "published": "2023-6-19",
        "citations": 3,
        "abstract": "Recently, unmanned aerial vehicles (UAVs) have emerged as a viable solution for data collection from remote Internet of Things (IoT) applications. However, the successful implementation in this regard necessitates the development of a reliable and energy-efficient routing protocol. This paper proposes a reliable and an energy-efficient UAV-assisted clustering hierarchical (EEUCH) protocol designed for remote wireless sensor networks (WSNs) based IoT applications. The proposed EEUCH routing protocol facilitates UAVs to collect data from ground sensor nodes (SNs) that are equipped with wake-up radios (WuRs) and deployed remotely from the base station (BS) in the field of interest (FoI). During each round of the EEUCH protocol, the UAVs arrive at the predefined hovering positions at the FoI, perform clear channel assignment, and broadcast wake-up calls (WuCs) to the SNs. Upon receiving the WuCs by the SNs’ wake-up receivers, the SNs perform carrier sense multiple access/collision avoidance before sending joining requests to ensure reliability and cluster-memberships with the particular UAV whose WuC is received. The cluster-member SNs turn on their main radios (MRs) for data packet transmission. The UAV assigns time division multiple access (TDMA) slots to each of its cluster-member SNs whose joining request is received. Each SN must send the data packets in its assigned TDMA slot. When data packets are successfully received by the UAV, it sends acknowledgments to the SNs, after which the SNs turn off their MRs, completing a single round of the protocol. The proposed EEUCH routing protocol with WuR eliminates the issue of cluster overlapping, improves the overall performance, and increases network stability time by a factor of 8.7. It also improves energy efficiency by a factor of 12.55, resulting in a longer network lifespan compared to Low Energy Adaptive Clustering Hierarchy (LEACH) protocol. Moreover, EEUCH collects 5.05 times more data from the FoI than LEACH. These results are based on simulations in which the EEUCH protocol outperformed the existing six benchmark routing protocols proposed for homogeneous, two-tier, and three-tier heterogeneous WSNs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23125728"
    },
    {
        "id": 9523,
        "title": "Analisis Hierarchical Dan Non-Hierarchical Clustering Untuk Pengelompokkan Potensi Ekonomi Kelautan Indonesia 2021",
        "authors": "Rinald Parulian Butar Butar",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Indonesia merupakan negara dengan wilayah laut yang sangat luas. Hal ini dibuktikan dengan hampir 70% wilayah Indonesia adalah laut dan sisanya daratan. Hal ini membuat pemerintah harus bersiap untuk memanfaatkan kekayaan laut yang dapat membangkitkan industri kelautan dan Perikanan. Sektor kelautan dan Perikanan masuk dalam Program Prioritas nasional yang diharapkan dapat meningkatkan pertumbuhan ekonomi nasional bagi negara. Namun untuk mencapai hal itu, Pemerintah membutuhkan kebijakan di sektor perikanan dan kelautan, tetapi minimnya pengelolaan Klasterisasi potensi perikanan menjadi hambatan bagi pemerintah. Tujuan penelitian yaitu pengelompokkan potensi wilayah produksi perikanan di Indonesia tahun 2021. Penelitian ini membandingkan antara metode klaster hirarki yaitu complete linkage, single linkage, average linkage dan Ward dengan Metode klaster non-hirarki yaitu k-means, k-medoids dan DBSCAN (Density-based Spatial Clustering of Application with Noise). Penentuan metode terbaik klaster hirarki dan jumlah klaster yang paling optimum  yang terdiri dari average linkage, complete linkage, single linkage dan Ward serta metode Non – hierarchical clustering yaitu K-means dan k-medoids adalah dengan Davies-Bouldin Index (DB), Calinski-Harabasz (CH), Silhouette, dan Dunn Index. Kemudian untuk metode DBSCAN adalah dengan membandingkan nilai Silhouette. Setelah ditentukan jumlah klaster terbaik, maka akan dilakukan evaluasi model dengan nilai  Internal Cluster Dispertion Rate. Model clustering terbaik adalah average linkage dengan nilai Internal Cluster Dispertion Rate paling kecil dibandingkan model cluster lainnya. Maka dapat dilihat provinsi dengan potensi ekonomi kelautan yang paling tinggi dan yang paling rendah. Klaster average linkage menghasilkan 2 klaster. Klaster 1 beranggotakan 30 provinsi dengan potensi ekonomi kelautan yang perlu ditingkatkan. Kemudian klaster 2 yang beranggotakan 4 provinsi dengan potensi ekonomi kelautan yang tinggi.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26418/justin.v11i3.67283"
    },
    {
        "id": 9524,
        "title": "Hierarchical++: improving the hierarchical clustering algorithm",
        "authors": "Wallace Anacleto Pinheiro, Ana Bárbara Sapienza Pinheiro",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.132975"
    },
    {
        "id": 9525,
        "title": "Hierarchical++: improving the hierarchical clustering algorithm",
        "authors": "Wallace Anacleto Pinheiro, Ana Bárbara Sapienza Pinheiro",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2023.10058462"
    },
    {
        "id": 9526,
        "title": "Cross-modal Scalable Hyperbolic Hierarchical Clustering",
        "authors": "Teng Long, Nanne van Noord",
        "published": "2023-10-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01527"
    },
    {
        "id": 9527,
        "title": "SHCF: A supervised hierarchical clustering approach to remove high density salt and pepper noise from black and white content digital images",
        "authors": "Paul K. Amalaman, Christoph F. Eick",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-15740-z"
    },
    {
        "id": 9528,
        "title": "Hierarchical Clustering and Calibration Functions",
        "authors": "Dan A. Simovici, Joshua F. Yee",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/cisti58278.2023.10211866"
    },
    {
        "id": 9529,
        "title": "Hybrid Clustering: Combining K-Means and Interval valued data-type Hierarchical Clustering",
        "authors": "Sérgio Mário Lins Galdino, Jornandes Dias da Silva",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12700/aph.21.9.2024.9.12"
    },
    {
        "id": 9530,
        "title": "Parallel Filtered Graphs for Hierarchical Clustering",
        "authors": "Shangdi Yu, Julian Shun",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00153"
    },
    {
        "id": 9531,
        "title": "simplifyEnrichment: A Bioconductor Package for Clustering and Visualizing Functional Enrichment Results",
        "authors": "Zuguang Gu, Daniel Hübschmann",
        "published": "2023-2",
        "citations": 77,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.gpb.2022.04.008"
    },
    {
        "id": 9532,
        "title": "Creating organizing and indexing digital video contents using frame similarity value techniques using hierarchical clustering techniques",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jier.v4i1.580"
    },
    {
        "id": 9533,
        "title": "Constrained Hierarchical Clustering via Graph Coarsening and Optimal Cuts",
        "authors": "Eliabelle Mauduit, Andrea Simonetto",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf59524.2023.10476840"
    },
    {
        "id": 9534,
        "title": "Improved Security for Multimedia Data Visualization Using Hierarchical Clustering Algorithm",
        "authors": "Shitharth S., Hariprasath Manoharan, Alaa O. Khadidos, Achyut Shankar, Carsten Maple, Adil O. Khadidos, Shahid Mumtaz",
        "published": "2023-7-21",
        "citations": 1,
        "abstract": "In this paper, a realization technique is designed with unique analytical model for transmitting multimedia data to appropriate end users. Transmission of multimedia data to all end users through a variety of visualization methods is the foundation of future computer systems. Yet, highly limited system resources prevent the updating of the methods used to manage multimedia data. Hence, a high-end visualization technique where uncertainties are eliminated is required for the visualization process with a multimedia system. As a result, the suggested system incorporates a clustering technique utilizing an analytical framework to ensure a high degree of transmission for all multimedia data. The technical contribution of the proposed method depend on multimedia visualization process that takes place with high security features by including necessary parametric relationships such as occurrence of jitter, data density points, time period, multimedia storage, data smoothness and distance. For the established parametric relationship the validation methodology is integrated with hierarchical clustering algorithm thereby transmitting every clustered data with high security feature thereby the examined outcomes under five scenarios proves that data security which is represented by simulation outcomes is improved to 88% as compared to existing approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3610296"
    },
    {
        "id": 9535,
        "title": "PCA-based hierarchical clustering approach for motion vector estimation in H.265/HEVC video error concealment",
        "authors": "Ali Radmehr, Ali Aghagolzadeh, Seyed Mehdi Hosseini Andargoli",
        "published": "2023-8-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16310-z"
    },
    {
        "id": 9536,
        "title": "Hierarchical co-clustering with augmented matrices from external domains",
        "authors": "Kai Sugahara, Kazushi Okamoto",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109657"
    },
    {
        "id": 9537,
        "title": "Identification of Industrial Process Time Series Events Based on Agglomerative Hierarchical Clustering*",
        "authors": "Tianhe Yuan, Jinglin Zhou, Yan Chen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451693"
    },
    {
        "id": 9538,
        "title": "Research on Clustering of Material Inspection Data for Highway Construction Projects Based on Agglomerative Hierarchical Clustering",
        "authors": "Qun Zhang, Shaohong Fang, Haolong Ye",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Abstract\nIn large-scale highway construction projects, the project implementers will carry out detailed testing of various material indicators used in the project. By processing and analyzing these material testing data, we can reasonably classify large-scale highway construction projects, so that each project implementer can better manage the quality of the materials, which will greatly help all parties to strengthen the quality control of the project and improve the level of project management. This study first preprocesses the material testing data to obtain a structured data set suitable for data analysis. Then statistical features are constructed for the features in the dataset, including maximum, minimum, mean, median and standard deviation, to improve the performance and accuracy of the model. Next, the clustering hierarchical clustering method is applied for classification and the classification results are visualized in the form of dendrograms. Finally, through the comparison of performance analysis and clustering evaluation indexes, it is concluded that the classification of works into 3 or 4 categories according to material performance is in line with the actual level of engineering quality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2706/1/012001"
    },
    {
        "id": 9539,
        "title": "Analysis of Optimal Portfolio Management Using Hierarchical Clustering",
        "authors": "Kapil Panda",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/adacis59737.2023.10424165"
    },
    {
        "id": 9540,
        "title": "Predicting the Accuracy of Fractionation of Patron's Activities in Online Social Networks Using Novel K-Means Clustering Algorithm Comparing with Agglomerative Hierarchical Clustering Algorithm",
        "authors": "V. Venkatesh, A. Shri Vindhya",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397982"
    },
    {
        "id": 9541,
        "title": "Grouping Provinces in Indonesia Based on the Causes of Stunting Variables using Hierarchical Clustering Analysis",
        "authors": "Detia Meilani, Mohammad Masjkur, Farit M Afendi",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Stunting is a condition due to chronic malnutrition that causes children to be shorter in height compared to their age. The prevalence of stunting in Indonesia still exceeds the standards set by WHO. This study aims to classify provinces in Indonesia based on the characteristics of the causes of stunting. Cluster analysis is a statistical method used to group objects with similar characteristics. Province grouping is done using hierarchical cluster analysis consisting of Single Linkage, Complete Linkage, Average Linkage, Ward's method, and Centroid method. The Cophenetic correlation coefficient was used to determine the best cluster method and the optimal number of clusters using the Silhouette coefficient. The results show that the centroid method has the highest Cophenetic correlation coefficient with four clusters. The first cluster consists of 1 province with low stunting characteristics, the second cluster consists of 3 provinces with high stunting characteristics, the third cluster consists of 22 provinces with very high stunting characteristics, and the fourth cluster consists of 8 provinces with moderate stunting characteristics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29244/ijsa.v7i1p32-43"
    },
    {
        "id": 9542,
        "title": "Lightweight Network Delay Segmentation Based on Smoothed Hierarchical Clustering",
        "authors": "Sanaa Ghandi, Alexandre Reiffers-Masson, Sandrine Vaton, Thierry Chonavel",
        "published": "2023-6-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ifipnetworking57963.2023.10186416"
    },
    {
        "id": 9543,
        "title": "An Extended Agglomerative Hierarchical Clustering Techniques",
        "authors": "Maravarman M, Babu S, Pitchai R",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/accai58221.2023.10200398"
    },
    {
        "id": 9544,
        "title": "Correlation-based hierarchical clustering of time series with spatial constraints",
        "authors": "Alessia Benevento, Fabrizio Durante",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.spasta.2023.100797"
    },
    {
        "id": 9545,
        "title": "The Application of Selected Hierarchical Clustering Methods for Classification the Acoustic Emission Signals Generated by Partial Discharges",
        "authors": "",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aoa.2021.138134"
    },
    {
        "id": 9546,
        "title": "Efficient Forecasting of Large-Scale Hierarchical Time Series via Multilevel Clustering",
        "authors": "Xing Han, Tongzheng Ren, Jing Hu, Joydeep Ghosh, Nhat Ho",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023039031"
    },
    {
        "id": 9547,
        "title": "Text Classification of National Anthem using Agglomerative Hierarchical Clustering",
        "authors": "Prajwal Rai, Nirdosh Bista, Kumar Prasun, Gajendra Sharma",
        "published": "2024-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47119/ijrp1001461420246269"
    },
    {
        "id": 9548,
        "title": "HiCARE: Hierarchical Clustering Algorithm for Road Service Routing Enhancement",
        "authors": "Sami Alshammari, Sejun Song, Baek-Young Choi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3342188"
    },
    {
        "id": 9549,
        "title": "Fuzzy similarity based hierarchical clustering for communities in twitter social networks",
        "authors": "R. Suganthi, K. Prabha",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2024.101033"
    },
    {
        "id": 9550,
        "title": "Small Files Problem Resolution via Hierarchical Clustering Algorithm",
        "authors": "Oded Koren, Aviel Shamalov, Nir Perel",
        "published": "2023-5-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1089/big.2022.0181"
    },
    {
        "id": 9551,
        "title": "Radio Frequency Identification Network Planning Using Ascendant Hierarchical Clustering Algorithm",
        "authors": "Lamri Sayad",
        "published": "2024",
        "citations": 0,
        "abstract": "Radio Frequency Identification (RFID) is a suitable technology for several application scenarios. However, it faces many issues that need to be addressed. RFID Network Planning (RNP) is one of these challenges, which is studied in this paper. It consists in defining the optimal placement of RFID readers and their communication range. In this study, the RNP issue is considered as a clustering problem. Therefore, it is solved using Ascendant Hierarchical Clustering algorithm (AHC) such that each cluster head represents a reader. The advantage of our proposed approach is that, in addition to optimizing the RNP, it is capable to determine the optimal number of readers needed to get optimal performances. Simulation results demonstrate that the proposed AHC algorithm performs better than two efficient RNP algorithms from the literature: Particle Swarm Optimization (PSO) and Leaders and Followers (LaF) algorithms. Hence, it is observed that AHC algorithm is more efficient, scalable and runs faster than PSO and LaF.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5455/jjcit.71-1695831743"
    },
    {
        "id": 9552,
        "title": "Clustering Fracture Data in 3D Outcrop Models with Hierarchical Agglomerative Clustering and Fisher Statistics",
        "authors": "Graciela Racolte, Ademir Marques, Vinicius Ferreira Sales, Daniel Capella Zanotta, Delano Menecucci Ibanez, Mauricio Roberto Veronez, Luiz Gonzaga",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282962"
    },
    {
        "id": 9553,
        "title": "Density-based spatial clustering of application with noise approach for regionalisation and its effect on hierarchical clustering",
        "authors": "Ramgopal T. Sahu, Mani Kant Verma, Ishtiyaq Ahmad",
        "published": "2023",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijhst.2023.133143"
    },
    {
        "id": 9554,
        "title": "Enhancing Beer Recommendations through Clustering: A Comparison of Hierarchical and K-means Clustering Methods on Normalized Data",
        "authors": "Tiansheng Zhu, Yina Han",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.26-5-2023.2334332"
    },
    {
        "id": 9555,
        "title": "Agglomerative Hierarchical Clustering (AHC) Method for Data Mining Sales Product Clustering",
        "authors": "Ridha Maya Faza Lubis, Jen-Peng Huang, Pai-Chou Wang, Kiki Khoifin, Yuli Elvina, Dyah Ayu Kusumaningtyas",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "Supermarkets are Indonesian terms that refer to large stores or supermarkets that offer a variety of daily needs such as food, drinks, cleaning products, household appliances, clothing, and so on. In contrast to stalls or small shops, supermarkets have a larger size and provide a variety of products. Because of this, many people prefer to shop for their daily needs at the supermarket rather than at the nearest shop because the existence of the supermarket makes it easier for consumers to buy various products in one place without having to move to another store. However, sales in supermarkets also pose a problem, namely how to sort or group products that are not selling well so they can be replaced with products that are selling better or reduce the number of suppliers. This is where data mining or data analysis techniques that use business intelligence are needed. The research was conducted to classify the best-selling products in supermarkets using the Agglomerative Hierarchical Clustering (AHC) method, in which alternatives with the same matrix or distance are grouped into certain clusters. In applying the AHC method, the number of clusters formed is 3. There are three different clusters, namely cluster 0, cluster 1, and cluster 2, each with a different alternative group. Each cluster has a different number of products and a different percentage. Cluster 0 is the cluster with the highest number of products and the largest percentage, namely 45% with a total of 9 products, followed by cluster 2, and cluster 1 has the smallest number of products and percentage, namely 0.30% with a total of 6 products and 0 .25% with a total of 5 products. In addition, sales data for several products each month are grouped based on certain price ranges",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bits.v5i1.3569"
    },
    {
        "id": 9556,
        "title": "Tangles and Hierarchical Clustering",
        "authors": "Eva Fluck",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1137/22m1484936"
    },
    {
        "id": 9557,
        "title": "HiCAP: Hierarchical Clustering-based Attention Pooling for Graph Representation Learning",
        "authors": "Parsa Haddadian, Rooholah Abedian, Ali Moeini",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccke60553.2023.10326268"
    },
    {
        "id": 9558,
        "title": "Construction and Implementation of Hierarchical Teaching Model based on Fast Clustering Algorithm",
        "authors": "Haijun Shao",
        "published": "2023-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnt57126.2023.10134730"
    },
    {
        "id": 9559,
        "title": "Extracting Patterns of Proximity in Regional Development Inequality Using Hierarchical Agglomerative Clustering",
        "authors": "Tb Ai Munandar, Dwipa Handayani",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "Equitable regional development is still difficult to implement. Many interests in determining regional development priorities make it difficult to realize the main goals of national development. Political interests and the underutilization of regional statistical data are often other obstacles in carrying out regional development. This study aims to classify regional development data to be used to analyse existing development inequalities. Gross regional domestic income (GRDP) data is the main data in this study. The researcher used the hierarchical agglomerative clustering (HAC) technique. The results of the cluster can be used as a consideration for local governments to determine future regional development priorities. In addition, visualized cluster results in the form of a dendrogram can show the proximity of development inequality between regions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18421/tem122-11"
    },
    {
        "id": 9560,
        "title": "Comparison of K-Means, BIRCH and Hierarchical Clustering Algorithms in Clustering OCD Symptom Data",
        "authors": "Alika Rahmarsyarah Rizalde, Haykal Alya Mubarak, Gilang Ramadhan, Mohd. Adzka Fatan",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "The hallmarks of Obsessive-Compulsive Disorder (OCD) are intrusive, anxiety-inducing thoughts (called obsessions) and associated repeated activities (called compulsions). To understand the patterns and relationships between OCD data that have been obtained, data will be grouped (clustering). In clustering using several clustering algorithms, namely K-Means, BIRCH, In this work, hierarchical clustering was used to identify the optimal cluster value comparison, and the Davies Bouldin Index (DBI) was used to confirm the results. Then the results of the best cluster value in processing OCD data are using the BIRCH algorithm in the K10 experiment which gets a value of 1.3. While the K-Means algorithm obtained the best cluster at K10 with a value obtained of 1.36 and the Hierarchical clustering algorithm also at the K10 value of 2.03. Thus in this study, the comparison results of the application of 3 clustering algorithms obtained results, namely the BIRCH algorithm shows the value of the resulting cluster is the best in clustering OCD data. This means that the BIRCH algorithm can be used to cluster OCD data more accurately and efficiently.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/predatecs.v1i2.1106"
    },
    {
        "id": 9561,
        "title": "Information-Exchangeable Hierarchical Clustering for Federated Learning With Non-IID Data",
        "authors": "Chen-Han Shih, Jian-Jhih Kuo, Jang-Ping Sheu",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/globecom54140.2023.10436834"
    },
    {
        "id": 9562,
        "title": "Enhancing Fingerprinting Indoor Positioning Systems Through Hierarchical Clustering and GAN-Based CNN",
        "authors": "Hajer Grira, Ikbal Chammakhi Msadaa, Khaled Grayaa",
        "published": "2023-7-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscc58397.2023.10218031"
    },
    {
        "id": 9563,
        "title": "An Optimized Decision Tree Model for Agricultural Product Placement Using Hierarchical Clustering Algorithm",
        "authors": "Long Jing",
        "published": "2023-7-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpics58376.2023.10235590"
    },
    {
        "id": 9564,
        "title": "A Role of Hierarchical Clustering Algorithms in Wireless Sensor Networks -A Review",
        "authors": "Rachit Manchanda, Shonak Bansal",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cises58720.2023.10183519"
    },
    {
        "id": 9565,
        "title": "Online Level-wise Hierarchical Clustering",
        "authors": "Nicholas Monath, Manzil Zaheer, Andrew McCallum",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3580305.3599455"
    },
    {
        "id": 9566,
        "title": "Composition Analysis and Identification of Glass Products Based on Hierarchical Clustering",
        "authors": "Cunnan Jia, Zhuangwen Gong",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "Ancient glass is an important carrier of the development of Chinese civilization. Affected by the buried environment of cultural relics, ancient glass is very easy to weather. A large number of internal elements of glass exchange with environmental elements, resulting in changes in its composition and appearance, thus affecting the judgment of its correct classification. In this paper, a comprehensive evaluation model was established to analyze the chemical composition of glass. First of all, the chi-square test is used to determine the factors related to surface weathering. Then the chemical composition of different glass was analyzed by mathematical statistics, and the number of clustering categories was determined by the method of system clustering, combined with the determination of square Euclidean distance and elbow rule. Finally, the final classification result is obtained by judging the size of the grey correlation degree of the type classification law and the sub-classification division method obtained in the model. The results show that the comprehensive model can be used to analyze and identify the composition of glass products.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v33i.5306"
    },
    {
        "id": 9567,
        "title": "The novel hierarchical clustering approach using self‐organizing map with optimum dimension selection",
        "authors": "Kshitij Tripathi",
        "published": "2024-4-11",
        "citations": 0,
        "abstract": "AbstractIntroductionData clustering is an important field of machine learning that has applicability in wide areas, like, business analysis, manufacturing, energy, healthcare, traveling, and logistics. A variety of clustering applications have already been developed. Data clustering approaches based on self‐organizing map (SOM) generally use the map dimensions (of the grid) ranging from 2 × 2 to 8 × 8 (4–64 neurons [microclusters]) without any explicit reason for using the particular dimension, and therefore optimized results are not obtained. These algorithms use some secondary approaches to map these microclusters into the lower dimension (actual number of clusters), like, 2, 3, or 4, as the case may be, based on the optimum number of clusters in the specific data set. The secondary approach, observed in most of the works, is not SOM and is an algorithm, like, cut tree or the other.MethodsIn this work, the proposed approach will give an idea of how to select the most optimal higher dimension of SOM for the given data set, and this dimension is again clustered into the lower actual dimension. Primary and secondary, both utilize the SOM to cluster the data and discover that the weight matrix of the SOM is very meaningful. The optimized two‐dimensional configuration of SOM is not the same for every data set, and this work also tries to discover this configuration.ResultsThe adjusted randomized index obtained on the Iris, Wine, Wisconsin diagnostic breast cancer, New Thyroid, Seeds, A1, Imbalance, Dermatology, Ecoli, and Ionosphere is, respectively, 0.7173, 0.9134, 0.7543, 0.8041, 0.7781, 0.8907, 0.8755, 0.7543, 0.5013, and 0.1728, which outperforms all other results available on the web and when no reduction of attributes is done in this work.ConclusionsIt is found that SOM is superior to or on par with other clustering approaches, like, k‐means or the other, and could be used successfully to cluster all types of data sets. Ten benchmark data sets from diverse domains like medical, biological, and chemical are tested in this work, including the synthetic data sets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/hcs2.90"
    },
    {
        "id": 9568,
        "title": "A hierarchical agglomerative clustering for product sales forecasting",
        "authors": "R.E. van Ruitenbeek, G.M. Koole, S. Bhulai",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100318"
    },
    {
        "id": 9569,
        "title": "Enhancing Subcluster Identification in IoT Sensor Networks with Hierarchical Clustering Algorithms and Dendrograms",
        "authors": "Fuad Bajaber",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsecs58457.2023.10256413"
    },
    {
        "id": 9570,
        "title": "Identification of Vulnerable Lines in Smart Grid Systems Based on Improved Agglomerative Hierarchical Clustering",
        "authors": "Liulin Yang, Chao Li",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3243806"
    },
    {
        "id": 9571,
        "title": "The comparison of K-means clustering result with centroid initialization using agglomerative hierarchical clustering (case study in Eastern Indonesia Region)",
        "authors": "Muzdalifa D. Z. Mamu, Lailany Yahya, Muhammad Rezky Friesta Payu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0126087"
    },
    {
        "id": 9572,
        "title": "Multi-attribute hierarchical clustering for product family division of customized wooden doors",
        "authors": "Na Zhang, Wei Xu, Yong Tan",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "To improve the production system for customized wooden doors and to gain research and development efficiency, this paper proposed the feasibility of using hierarchical clustering algorithms to cluster a company’s customized wooden door products and its application to rational product family architecture. The particular use of multi-attribute feature data to locate products and the integration of image data into the database can make the original hierarchical clustering more compatible and adaptable for application to customized wooden doors. The preprocessed data was analyzed by clustering to obtain the clustering results and similarity relationships. Hierarchical clustering results were uneven and not entirely interpreted. However, the internal order structure of clusters and the clustering process could be clearly observed, and the distance hierarchical relationship between the products could be obtained, which was beneficial to the division of the product architecture. The results illustrated that processing using hierarchical clustering of multi-attribute data is feasible for optimizing customized wooden door product systems. In addition, the product architecture, product coding rules, and front-end development process were established to improve standardization and research and development efficiency. There is still great potential for developing the custom wooden door category in custom furniture companies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15376/biores.18.4.7889-7904"
    },
    {
        "id": 9573,
        "title": "HiPart: Hierarchical Divisive Clustering\nToolbox",
        "authors": "Panagiotis Anagnostou, Sotiris Tasoulis, Vassilis P. Plagianakos, Dimitris Tasoulis",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21105/joss.05024"
    },
    {
        "id": 9574,
        "title": "Agglomerative Hierarchical Clustering Applied to Medium Voltage Feeder Hosting Capacity Estimation",
        "authors": "Seddik Yassine Abdelouadoud, Robin Girard, Sébastien Vallet",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isgteurope56780.2023.10407203"
    },
    {
        "id": 9575,
        "title": "KIHCDP: An Incremental Hierarchical Clustering Approach for IoT Data Using Dirichlet Process",
        "authors": "Abishi Chowdhury, Amrit Pal, Ashwin Raut, Manish Kumar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3385628"
    },
    {
        "id": 9576,
        "title": "Hierarchical clustering of constrained dynamic systems using robust positively invariant sets",
        "authors": "Wenqing Wang, Justin P. Koeln",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.automatica.2022.110739"
    },
    {
        "id": 9577,
        "title": "On clustering levels of a hierarchical categorical risk factor",
        "authors": "Bavo D.C. Campo, Katrien Antonio",
        "published": "2024-2-1",
        "citations": 1,
        "abstract": "Abstract\nHandling nominal covariates with a large number of categories is challenging for both statistical and machine learning techniques. This problem is further exacerbated when the nominal variable has a hierarchical structure. We commonly rely on methods such as the random effects approach to incorporate these covariates in a predictive model. Nonetheless, in certain situations, even the random effects approach may encounter estimation problems. We propose the data-driven Partitioning Hierarchical Risk-factors Adaptive Top-down algorithm to reduce the hierarchically structured risk factor to its essence, by grouping similar categories at each level of the hierarchy. We work top-down and engineer several features to characterize the profile of the categories at a specific level in the hierarchy. In our workers’ compensation case study, we characterize the risk profile of an industry via its observed damage rates and claim frequencies. In addition, we use embeddings to encode the textual description of the economic activity of the insured company. These features are then used as input in a clustering algorithm to group similar categories. Our method substantially reduces the number of categories and results in a grouping that is generalizable to out-of-sample data. Moreover, we obtain a better differentiation between high-risk and low-risk companies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1748499523000283"
    },
    {
        "id": 9578,
        "title": "Power Systems Transient Stability Indices: Hierarchical Clustering Based Detection of Coherent Groups Of Generators",
        "authors": "Faycal Znidi, Hamzeh Davarikia, Heena Rathore",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpec60005.2024.10472280"
    },
    {
        "id": 9579,
        "title": "Towards unsupervised radiograph clustering for COVID-19: The use of graph-based multi-view clustering",
        "authors": "F. Dornaika, S. El Hajjar, J. Charafeddine",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108336"
    },
    {
        "id": 9580,
        "title": "Consensus clustering with missing labels (ccml): a consensus clustering tool for multi-omics integrative prediction in cohorts with unequal sample coverage",
        "authors": "Chuan-Xing Li, Hongyan Chen, C. Magnus Sköld, Meng Zhou, Åsa Wheelock",
        "published": "2023-9-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1183/13993003.congress-2023.pa2971"
    },
    {
        "id": 9581,
        "title": "scMEB: a fast and clustering-independent method for detecting differentially expressed genes in single-cell RNA-seq data",
        "authors": "Jiadi Zhu, Youlong Yang",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Abstract\nBackground\nCell clustering is a prerequisite for identifying differentially expressed genes (DEGs) in single-cell RNA sequencing (scRNA-seq) data. Obtaining a perfect clustering result is of central importance for subsequent analyses, but not easy. Additionally, the increase in cell throughput due to the advancement of scRNA-seq protocols exacerbates many computational issues, especially regarding method runtime. To address these difficulties, a new, accurate, and fast method for detecting DEGs in scRNA-seq data is needed.\n\nResults\nHere, we propose single-cell minimum enclosing ball (scMEB), a novel and fast method for detecting single-cell DEGs without prior cell clustering results. The proposed method utilizes a small part of known non-DEGs (stably expressed genes) to build a minimum enclosing ball and defines the DEGs based on the distance of a mapped gene to the center of the hypersphere in a feature space.\n\nConclusions\nWe compared scMEB to two different approaches that could be used to identify DEGs without cell clustering. The investigation of 11 real datasets revealed that scMEB outperformed rival methods in terms of cell clustering, predicting genes with biological functions, and identifying marker genes. Moreover, scMEB was much faster than the other methods, making it particularly effective for finding DEGs in high-throughput scRNA-seq data. We have developed a package scMEB for the proposed method, which could be available at https://github.com/FocusPaka/scMEB.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12864-023-09374-6"
    },
    {
        "id": 9582,
        "title": "Supervised Hierarchical Clustering Using Graph Neural Networks for Speaker Diarization",
        "authors": "Prachi Singh, Amrit Kaul, Sriram Ganapathy",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095372"
    },
    {
        "id": 9583,
        "title": "Proposal of a Visualization System for a Hierarchical Clustering Algorithm: The Visualize Proximity Matrix",
        "authors": "Sulaiman Abdullah Alateyah",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "Visual data mining is a new and effective strategy for dealing with the growing phenomenon of information overload. There is an urgent need for effective visual data mining because the growth of data sets from different domains and sources has made exploring, managing and analyzing vast volumes of data increasingly difficult. Identifying location-based trends and anomalies in data from a numeric output is challenging. The outputs of data mining procedures are often quite difficult to interpret. There is no human input to data exploration or direct involvement in the data mining process. Thus, it is difficult to analyze, explore, understand and view the data. In data mining, massive data sets are clustered using an iterative process that includes human input but data mining algorithms can miss some knowledge and observations. In addition, many users cannot take the appropriate action to address problems or opportunities because the huge amounts of data prevent them from staying aware of what is happening in and around their environments. Visual data mining can help in dealing with information overload and it is effective in analyzing large complex data sets. Visual data mining assists users in gaining a deep visual understanding of data. In the information age, users need to study and observe vast amounts of data to acquire important knowledge, and thus the need for visual and interactive analytical tools is particularly pressing. Visual cluster analysis has long utilized shaded similarity matrices, and this study investigated how they can be used in clustering visualization. We focused on proposing an agglomerative hierarchical clustering method. Ensemble cluster visualization is also presented for handling large data sets. This study proposes the adoption of a shaded similarity matrix to visually cluster knowledge discovered using data mining. Using the technology acceptance model as the measuring tool, we questioned respondents to evaluate the visualization prototype. The findings demonstrated that the visualization was effective and easy to use, and satisfied users.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5539/cis.v16n4p65"
    },
    {
        "id": 9584,
        "title": "Clustering Re-Inference Algorithm for Deep Learning-Based Hierarchical Object Detection System",
        "authors": "Yusei Horikawa, Renpei Yoshida, Seiji Mochizuki, Tetsuya Matsumura",
        "published": "2023-10-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcce59613.2023.10315599"
    },
    {
        "id": 9585,
        "title": "An ensemble hierarchical clustering algorithm based on merits at cluster and partition levels",
        "authors": "Qirui Huang, Rui Gao, Hoda Akhavan",
        "published": "2023-4",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2022.109255"
    },
    {
        "id": 9586,
        "title": "On hierarchical clustering-based approach for RDDBS design",
        "authors": "Hassan I. Abdalla, Ali A. Amer, Sri Devi Ravana",
        "published": "2023-11-18",
        "citations": 1,
        "abstract": "AbstractDistributed database system (DDBS) design is still an open challenge even after decades of research, especially in a dynamic network setting. Hence, to meet the demands of high-speed data gathering and for the management and preservation of huge systems, it is important to construct a distributed database for real-time data storage. Incidentally, some fragmentation schemes, such as horizontal, vertical, and hybrid, are widely used for DDBS design. At the same time, data allocation could not be done without first physically fragmenting the data because the fragmentation process is the foundation of the DDBS design. Extensive research have been conducted to develop effective solutions for DDBS design problems. But the great majority of them barely consider the RDDBS's initial design. Therefore, this work aims at proposing a clustering-based horizontal fragmentation and allocation technique to handle both the early and late stages of the DDBS design. To ensure that each operation flows into the next without any increase in complexity, fragmentation and allocation are done simultaneously. With this approach, the main goals are to minimize communication expenses, response time, and irrelevant data access. Most importantly, it has been observed that the proposed approach may effectively expand RDDBS performance by simultaneously fragmenting and assigning various relations. Through simulations and experiments on synthetic and real databases, we demonstrate the viability of our strategy and how it considerably lowers communication costs for typical access patterns at both the early and late stages of design.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40537-023-00849-7"
    },
    {
        "id": 9587,
        "title": "Perbandingan K-Means dan Hierarchical Clustering dalam Pengelompokan Daerah Beresiko Stunting",
        "authors": "Indra Indra, Nahya Nur, Muh. Iqram, Nurul Inayah",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35314/isi.v8i2.3612"
    },
    {
        "id": 9588,
        "title": "Unsupervised learning towards hierarchical clustering",
        "authors": "Suwarna Gothane, K. Srujan Raju, Saikumar Tara, P. Devika",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0150050"
    },
    {
        "id": 9589,
        "title": "Analysis of glass artifacts based on hierarchical clustering and regression models",
        "authors": "Tao Yun, Bingzhao Chen, Zexin Bi",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "Glass is a valuable evidence of the early friendly trade between China and the Western countries. In this study, the rationality and sensitivity of the developed model were first evaluated by analyzing the definitive and quantitative data of each type of glass artifacts and establishing a model to classify the glass artifact categories into subcategories, as well as categorizing unknown types of glass. Considering the discrete and discontinuous nature of the data, the chi-square test was chosen to investigate the correlation between glass type, decoration and color and surface weathering. Secondly, descriptive statistics of high potassium and lead-barium glass artifacts before and after weathering were conducted to obtain statistical patterns about the chemical composition content, and then the chemical composition content of glass artifacts before weathering was predicted based on the mean rate of change of the chemical composition content of high potassium and lead-barium glass before and after weathering, respectively. Finally, this study further explored the relationship between glass artifacts and the content of each chemical composition using Spearman's correlation coefficient to derive the basis for the classification of glass types, based on the hierarchical clustering method to classify the subclasses of high potassium glass and lead-barium glass with and without weathering, respectively, and used the elbow rule to derive the most appropriate number of subclasses for the above four types of glass, which endowed the model with rationality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v58i.10078"
    },
    {
        "id": 9590,
        "title": "The wind power prediction based on hierarchical clustering method",
        "authors": "Jiaying Zhang, Weiliang Zhai, Qichao Sun",
        "published": "2023-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671659"
    },
    {
        "id": 9591,
        "title": "Research on Online Learning User Classification Based on Hierarchical Clustering",
        "authors": "Jie Yu, Xikun Zhang",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3608218.3608222"
    },
    {
        "id": 9592,
        "title": "Unsupervised hyperspectral image segmentation of films: a hierarchical clustering-based approach",
        "authors": "Lingxi Liu, Giovanni Delnevo, Silvia Mirri",
        "published": "2023-3-11",
        "citations": 2,
        "abstract": "AbstractHyperspectral imaging (HSI) has been drastically applied in recent years to cultural heritage (CH) analysis, conservation, and also digital restoration. However, the efficient processing of the large datasets registered remains challenging and still in development. In this paper, we propose to use the hierarchical clustering algorithm (HCA) as an alternative machine learning approach to the most common practices, such as principal component analysis(PCA). HCA has shown its potential in the past decades for spectral data classification and segmentation in many other fields, maximizing the information to be extracted from the high-dimensional spectral dataset via the formation of the agglomerative hierarchical tree. However, to date, there has been very limited implementation of HCA in the field of cultural heritage. Data used in this experiment were acquired on real historic film samples with various degradation degrees, using a custom-made push-broom VNIR hyperspectral camera (380–780nm). With the proposed HCA workflow, multiple samples in the entire dataset were processed simultaneously and the degradation areas with distinctive characteristics were successfully segmented into clusters with various hierarchies. A range of algorithmic parameters was tested, including the grid sizes, metrics, and agglomeration methods, and the best combinations were proposed at the end. This novel application of the semi-automating and unsupervised HCA could provide a basis for future digital unfading, and show the potential to solve other CH problems such as pigment mapping.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s40537-023-00713-8"
    },
    {
        "id": 9593,
        "title": "Predictive Network Configuration with Hierarchical Spectral Clustering for Software Defined Vehicles",
        "authors": "Pierre Laclau, Stéphane Bonnet, Bertrand Ducourthial, Xiaoting Li, Trista Lin",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-spring57618.2023.10199920"
    },
    {
        "id": 9594,
        "title": "Prioritized Mapping in Bali: Multi-View Hierarchical Agglomerative Clustering (MVHAC) Approach",
        "authors": "Gede Andika, Lincolin Arsyad",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "This study aims to determine which sectors and areas should be prioritized in development in BalI. The data used is panel data from 2010 – 2022 for all districts/cities in Bali. The data analysis technique for mapping sectors and regions is Multi-View Hierarchical Agglomerative Clustering (MVHAC). The results of the analysis of Location Quotient and Dyanmic Location Quotient show that the SARBAGITA area (Denpasar, Badung, Gianyar, and Tabanan) has potential in the secondary and tertiary sectors, while other areas are in the primary sector. MVHAC analysis shows that in quadrant 1 (cluster 1), namely Badung and Denpasar, the sectors that can be developed are agriculture, forestry and fisheries; real estate; manufacturing industry; water supply, waste management and waste recycling and mining and excavation, the area of quadrant 3 (cluster 2) of Tabanan and Gianyar is almost similar to Badung and Tabanan, but the potential sector is also transportation and warehousing, while quadrant 4 (cluster 2) is more on the information and communication; real estate; educational services; health services and social activities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24843/jekt.2023.v16.i01.p05"
    },
    {
        "id": 9595,
        "title": "Enhanced Chaotic Transition Prediction Using Hierarchical Clustering for the Lorenz System",
        "authors": "Solmaz Seyed Monir, Juhua Hu, Ben Tribelhorn, Heather E. Dillon",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "Abstract\nIn this research, we propose a novel way using unsupervised machine learning to improve the accuracy of predicting chaotic transitions in natural convection systems. Previous work has focused on the application of machine learning methods to natural convection systems for understanding turbulent convection transitions. We build on the prior work using the Lorenz system to investigate the potential of unsupervised machine learning models without expert inputs. The Lorenz system was selected due to its relatively simple equations and well-documented chaotic behavior. The Lorenz equations are a dynamic system for natural convection that are represented by a coupled system of ordinary differential equations.\nPrior work had confirmed that clustering can predict transitions for this system, but the accuracy of predicting transitions could be improved. The prior studies had analyzed eight, expert-chosen features focused on descriptive statistics of the spectral density for the raw inputs to a machine learning algorithm. Our research team modified the prior machine learning methods to cover a large range of geometry and fluid parameters with high accuracy using only images of time series plots as the input to the algorithm. The images are phase plots consistent with those commonly used to observe the Lorenz system’s strange attractors. To account for a large range of geometry and fluid parameters, we converted high-dimensional time series data to phase plot images. This allowed us to capture intricate details within the data that might be missed using prior approaches. We then use deep neural networks to extract low-dimensional features for clustering, allowing us to identify hidden patterns and structures within the data.\nThis work builds on prior research that used k-means++ clustering to predict behavior in natural convection systems. The approach for this work goes beyond traditional flat clustering methods by using a convolutional neural network and density-based clustering with varying minimum cluster sizes to improve accuracy. The new method has also reduced the bias associated with selecting Rayleigh ratio values, improving the accuracy and reliability of our results. The improved method does not rely on expert selected statistical features either, a significant advantage for adapting the method to other natural convection systems.\nThe results are visually represented through histograms that show the key transitions in the chaotic system. The research team confirmed that the density-based clustering is a more efficient and accurate machine learning algorithm for this problem. The method presented in this paper also incorporates additional validation steps to ensure the accuracy and reliability of the results. The new method provides more detailed insights into the chaotic behavior of the Lorenz system. This has important implications for a range of fields, including natural convection, meteorology, fluid dynamics, and chaos theory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/imece2023-112433"
    },
    {
        "id": 9596,
        "title": "Application of Agglomerative Hierarchical Clustering (AHC) for Grouping Prospective Scholarship Recipients",
        "authors": "Fakhrian Fadlia Adiwijaya, Arisza Zufar Fathurrahman, Chrismikha Hardyanto",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incitest59455.2023.10395926"
    },
    {
        "id": 9597,
        "title": "ABAC policy mining method based on hierarchical clustering and relationship extraction",
        "authors": "Siyuan Shang, Xiaohan Wang, Aodi Liu",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2024.103717"
    },
    {
        "id": 9598,
        "title": "Bridging drug discovery through hierarchical subtractive genomics against asd, trpG, and secY of pneumonia causing MDR Staphylococcus aureus",
        "authors": "Ayesha Wisal, Nida Saeed, Muhammad Aurongzeb, Muhammad Shafique, Saman Sohail, Waheed Anwar, Zarrin Basharat, Muhammad Irfan, Asad Ullah, Syed S. Hassan",
        "published": "2024-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00438-024-02115-8"
    },
    {
        "id": 9599,
        "title": "K-means Optimization Method Based On Adaptive Parallel Hierarchical Clustering",
        "authors": "Xinchen Ma",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616901.3616922"
    },
    {
        "id": 9600,
        "title": "Enhanced Analysis of Hierarchical Clustering Techniques for Recommendation Systems using Integrated Deep Learning",
        "authors": "Young Jun Park",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "Machine learning is an effective technique for optimizing real-time electronics product data analysis. It can efficiently handle large electronics product datasets, reducing processing time and resource requirements for generating insights. This study assesses the current status of methods and applications for optimizing real-time data analysis by examining existing research in machine learning-based recommendation systems for electronic products. The indicated subjects encompass using machine learning algorithms to discern characteristics and correlations from large datasets, applying machine learning for prognostic analytics and projection, and utilizing machine learning to identify anomalies. The paper provides examples of machine learning-based evaluation optimization solutions that focus on utilizing unorganized data and delivering real-time dashboards. Presented here is a discussion on the complex challenges and potential benefits associated with utilizing machine learning to optimize real-time data processing. Machine learning may efficiently expedite real-time data assessment while delivering precise and timely outcomes",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/7669/jmc202404007"
    },
    {
        "id": 9601,
        "title": "An Approach for Analysing Law Processes based on Hierarchical Activities and Clustering",
        "authors": "Luiz Vercosa, Carmelo Bastos-Filho, Byron Bezerra",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/la-cci58595.2023.10409389"
    },
    {
        "id": 9602,
        "title": "Preparing Big Manuscript Data for Hierarchical Clustering with Minimal HTR Training",
        "authors": "Elpida Perdiki",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "HTR (Handwritten Text Recognition) technologies have progressed enough to offer high-accuracy results in recognising handwritten documents, even on a synchronous level. Despite the state-of-the-art algorithms and software, historical documents (especially those written in Greek) remain a real-world challenge for researchers. A large number of unedited or under-edited works of Greek Literature (ancient or Byzantine, especially the latter) exist to this day due to the complexity of producing critical editions. To critically edit a literary text, scholars need to pinpoint text variations on several manuscripts, which requires fully (or at least partially) transcribed manuscripts. For a large manuscript tradition (i.e., a large number of manuscripts transmitting the same work), such a process can be a painstaking and time-consuming project. To that end, HTR algorithms that train AI models can significantly assist, even when not resulting in entirely accurate transcriptions. Deep learning models, though, require a quantum of data to be effective. This, in turn, intensifies the same problem: big (transcribed) data require heavy loads of manual transcriptions as training sets. In the absence of such transcriptions, this study experiments with training sets of various sizes to determine the minimum amount of manual transcription needed to produce usable results. HTR models are trained through the Transkribus platform on manuscripts from multiple works of a single Byzantine author, John Chrysostom. By gradually reducing the number of manually transcribed texts and by training mixed models from multiple manuscripts, economic transcriptions of large bodies of manuscripts (in the hundreds) can be achieved. Results of these experiments show that if the right combination of manuscripts is selected, and with the transfer-learning tools provided by Transkribus, the required training sets can be reduced by up to 80%. Certain peculiarities of Greek manuscripts, which lead to easy automated cleaning of resulting transcriptions, could further improve these results. The ultimate goal of these experiments is to produce a transcription with the minimum required accuracy (and therefore the minimum manual input) for text clustering. If we can accurately assess HTR learning and outcomes, we may find that less data could be enough. This case study proposes a solution for researching/editing authors and works that were popular enough to survive in hundreds (if not thousands) of manuscripts and are, therefore, unfeasible to be evaluated by humans.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46298/jdmdh.10419"
    },
    {
        "id": 9603,
        "title": "HEADSS: HiErArchical Data Splitting and Stitching software for non-distributed clustering algorithms",
        "authors": "D.A. Crake, N.C. Hambly, R.G. Mann",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ascom.2023.100709"
    },
    {
        "id": 9604,
        "title": "Hierarchical Clustering Analysis of Temporal Dominance of Sensations Tasks",
        "authors": "Hiroharu NATSUME, Shogo OKAMOTO, Hikaru NAGANO",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5057/isase.2023-c000012"
    },
    {
        "id": 9605,
        "title": "Detecting smart meter false data attacks using hierarchical feature clustering and incentive weighted anomaly detection",
        "authors": "Martin Higgins, Bruce Stephen, David Wallom",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractSpot pricing is often suggested as a method of increasing demand‐side flexibility in electrical power load. However, few works have considered the vulnerability of spot pricing to financial fraud via false data injection (FDI) style attacks. The authors consider attacks which aim to alter the consumer load profile to exploit intraday price dips. The authors examine an anomaly detection protocol for cyber‐attacks that seek to leverage spot prices for financial gain. In this way the authors outline a methodology for detecting attacks on industrial load smart meters. The authors first create a feature clustering model of the underlying business, segregated by business type. The authors then use these clusters to create an incentive‐weighted anomaly detection protocol for false data attacks against load profiles. This clustering‐based methodology incorporates both the load profile and spot pricing considerations for the detection of injected load profiles. To reduce false positives, the authors model incentive‐based detection, which includes knowledge of spot prices, into the anomaly tracking, enabling the methodology to account for changes in the load profile which are unlikely to be attacks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/cps2.12057"
    },
    {
        "id": 9606,
        "title": "Research on Glass Classification and Recognition Based on Fisher's Linear Discriminant and Hierarchical Clustering",
        "authors": "Tengyuan Rong, Yu Liang",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "Buried in the ground, the glass cultural relics weathered, and a large number of internal elements were exchanged. In order to classify the types of glass, this paper first uses Fisher linear discriminant analysis to obtain a binary classification model of glass types, and finds that the prediction accuracy of the model has reached 90%. Considering the possible overfitting of the model, this paper also uses the principal component analysis method to reduce the dimension of the data, thus obtaining the model and determining that its accuracy rate is maintained above 90%. In order to identify the types of unknown glass cultural relics, the multi-category Fisher’s Linear Discriminant method based on principal component analysis was used to identify the subcategories they belonged to.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v42i.7091"
    },
    {
        "id": 9607,
        "title": "Study of genetic variability and diversity analysis in maize (Zea mays L.) by agglomerative hierarchical clustering and principal component analysis",
        "authors": "",
        "published": "2023-3-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37992/2023.1401.015"
    },
    {
        "id": 9608,
        "title": "netANOVA: novel graph clustering technique with significance assessment via hierarchical ANOVA",
        "authors": "Diane Duroux, Kristel Van Steen",
        "published": "2023-3-19",
        "citations": 1,
        "abstract": "AbstractMany problems in life sciences can be brought back to a comparison of graphs. Even though a multitude of such techniques exist, often, these assume prior knowledge about the partitioning or the number of clusters and fail to provide statistical significance of observed between-network heterogeneity. Addressing these issues, we developed an unsupervised workflow to identify groups of graphs from reliable network-based statistics. In particular, we first compute the similarity between networks via appropriate distance measures between graphs and use them in an unsupervised hierarchical algorithm to identify classes of similar networks. Then, to determine the optimal number of clusters, we recursively test for distances between two groups of networks. The test itself finds its inspiration in distance-wise ANOVA algorithms. Finally, we assess significance via the permutation of between-object distance matrices. Notably, the approach, which we will call netANOVA, is flexible since users can choose multiple options to adapt to specific contexts and network types. We demonstrate the benefits and pitfalls of our approach via extensive simulations and an application to two real-life datasets. NetANOVA achieved high performance in many simulation scenarios while controlling type I error. On non-synthetic data, comparison against state-of-the-art methods showed that netANOVA is often among the top performers. There are many application fields, including precision medicine, for which identifying disease subtypes via individual-level biological networks improves prevention programs, diagnosis and disease monitoring.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bib/bbad029"
    },
    {
        "id": 9609,
        "title": "IMPLEMENTASI METODE AGGLOMERATIVE HIERARCHICAL CLUSTERING UNTUK SISTEM REKOMENDASI FILM",
        "authors": "Vanesa Nellie, Viny Christanti Mawardi, Novario Jaya Perdana",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "People can now watch movies on their cellphones or other devices using applications, in addition to watching them on television or in theaters. The user's entered keywords are used as the basis for a system that suggests movies from among the many that have appeared over time. Later, similarity between these keywords and text data, such as movie titles and descriptions, will be assessed. This recommendation system will include preprocessing, and the TF-IDF method will be used to determine the weight value. After the weight values have been determined, the grouping calculations will be performed using agglomerative hierarchical clustering. Previously, the Manhattan Distance method will be used to calculate the distance. After that, the distance that is closest can be determined. The data will be clustered according to the shortest distance once the distance calculation is complete. Following that, the system will display the grouping as a dendrogram. The data used was updated as of the date of scraping, which is November 25, 2022, and contains a total of 2467 data. The Agglomerative Hierarchical Clustering method yielded the best silhouette coefficient value, 0.5025559374455285, forming 20 clusters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24912/jiksi.v11i1.24070"
    },
    {
        "id": 9610,
        "title": "An Efficient and Speedy approach for Hierarchical Clustering Using Complete Linkage method",
        "authors": "Payel Banerjee, Amlan Chakrabarti, Tapas Kumar Ballabh",
        "published": "2023-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecct56650.2023.10179708"
    },
    {
        "id": 9611,
        "title": "Anchor-based multi-view subspace clustering with hierarchical feature descent",
        "authors": "Qiyuan Ou, Siwei Wang, Pei Zhang, Sihang Zhou, En Zhu",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.inffus.2024.102225"
    },
    {
        "id": 9612,
        "title": "Pengelompokan Rumah Sakit di Jakarta Menggunakan Model DBSCAN, Gaussian Mixture, dan Hierarchical Clustering",
        "authors": "Karli Eka Setiawan, Afdhal Kurniawan",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "Perlu disadari bahwa setelah mengalami pandemi COVID-19, distribusi persebaran fasilitas rumah sakit harus menjadi perhatian utama dalam memenuhi hak-hak dasar dari masyarakat oleh pemerintah tingkat daerah dan tingkat nasional. Oleh karena itu diperlukan sebuah analisis data yang menggambarkan kondisi terkini mengenai persebaran fasilitas rumah sakit khususnya di Jakarta. Analisis Data dengan pendekatan teknik machine learning mampu memberikan beberapa manfaat seperti mendapatkan manfaat dalam memberikan pemahaman mengenai distribusi tenaga kesehatan, memberikan wawasan dalam rangka perencanaan sumber daya manusia, melakukan pemantauan kinerja rumah sakit, dan bahkan menjadi acuan target di masa ddepan dengan prediksi kebutuhan tenaga kesehatan. Penelitian ini mengajukan tiga buah model unsupervised learning, seperti model Density-based spatial clustering of applications with noise algorithm (DBSCAN), model Gaussian Mixture, dan model Agglomerative Hierarchical untuk melakukan pengelompokan sekumpulan data rumah sakit se-Jakarta, Indonesia yang berisi informasi data jumlah berbagai tenaga kerja medis di rumah sakit tersebut dan fasilitas tempat tidurnya. Dataset ini diperoleh dari proses web scrapping pada website Kementerian Kesehatan Republik Indonesia pada tahun 2022. Dari perbandingan ketiga model unsupervised, diperoleh bahwa model Gaussian Mixture menghasilkan nilai Davies Bouldin terkecil dengan nilai . Penelitian ini merupakan lanjutan dari penelitian kami sebelumnya, dimana penelitian tersebut menurut sepengetahuan kami merupakan penelitian pertama yang membahas  pengelompokan data daftar rumah sakit se-Jakarta berdasarkan informasi data jumlah tenaga medis dan jumlah fasilitas tempat tidur yang menjadikan kontribusi dari penelitian ini.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54914/jit.v9i2.995"
    },
    {
        "id": 9613,
        "title": "Perbandingan Analisis Agglomerative Hierarchical Clustering Berdasarkan Indikator Pendidikan di Provinsi Jawa Barat",
        "authors": "Asma' Khoirunnisa', Firdaus Amruzain Satiranandi Wibowo, Kimiantini Kismiantini",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "Bidang pendidikan pada saat ini merupakan salah satu prioritas yang menjadi urgensi pemerintah. Berdasarkan Badan Pusat Statistik 2021, tercatat bahwa angka putus sekolah di Provinsi Jawa Barat menduduki peringkat pertama dari 34 provinsi di Indonesia. Fenomena ini tentunya menurunkan indeks pendidikan serta bertolak belakang dengan intensi penting yang menjadi fokus pembangunan pemerintah yakni pemerataan pendidikan. Pada penelitian ini akan dilakukan pemetaan wilayah di Provinsi Jawa Barat berdasarkan indeks pendidikan sehingga didapatkan perencanaan dan kebijakan pemerintah yang lebih akurat.  Salah satu algoritma yang dapat digunakan dalam pengelompokan kabupaten berdasarkan indikator pendidikan adalah Agglomerative Hierarchical Clustering (AHC). Beberapa metode pengelompokkan yang digunakan pada penelitian ini adalah AHC dengan metode single linkage, metode complete linkage, metode average linkage, dan metode ward. Hasil dari penelitian ini adalah perbandingan metode yang dilakukan berdasarkan nilai koefisien korelasi cophenetic. Berdasarkan analisis pada penelitian ini, diketahui gambaran pada sektor pendidikan di Provinsi  Jawa Barat tahun 2021, yaitu masih terdapat indikasi belum tercapainya pemerataan pendidikan khususnya pada jenjang sekolah menengah atas hingga perguruan tinggi serta terpusatnya jumlah sekolah dan guru di klaster tertentu. Tinjauan indeks pendidikan ini dibentuk menjadi 4 klaster pada setiap masing-masing metode. Berdasarkan hasil perbandingan nilai koefisien korelasi cophenetic dari keempat metode pada analisis AHC, metode ward adalah metode terbaik dengan koefisien korelasi cophenetic terbesar (0,952).",
        "keywords": "",
        "link": "http://dx.doi.org/10.21831/pspmm.v7i1.273"
    },
    {
        "id": 9614,
        "title": "Predicting User Interest Using Hierarchical-Based Clustering for Recommender Systems",
        "authors": "M. Alizadeh Zarei, F. Hosseini, A. M. Nickfarjam, T. Xiao",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosnikom60230.2023.10364498"
    },
    {
        "id": 9615,
        "title": "Transformer-Based Hierarchical Clustering for Brain Network Analysis",
        "authors": "Wei Dai, Hejie Cui, Xuan Kan, Ying Guo, Sanne van Rooij, Carl Yang",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230606"
    },
    {
        "id": 9616,
        "title": "Semi-automated Hierarchical Clustering Model for 4D-STEM Datasets",
        "authors": "Chuqiao Shi, Nannan Mao, Yao Yang, Jing Kong, Yimo Han",
        "published": "2023-7-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/micmic/ozad067.349"
    },
    {
        "id": 9617,
        "title": "An approach to detect IoT botnet attacks based on hierarchical clustering",
        "authors": "Xiaodong Li, Yuanfeng Song, Yuqiang Y. Li",
        "published": "2023-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671154"
    },
    {
        "id": 9618,
        "title": "Information Technology Job Profile Using Average-Linkage Hierarchical Clustering Analysis",
        "authors": "Puji Catur Siswipraptini, Harco Leslie Hendric Spits Warnars, Arief Ramadhan, Widodo Budiharto",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3311203"
    },
    {
        "id": 9619,
        "title": "Intrusion Detection System using Statistical Query Tree with Hierarchical Clustering Approach",
        "authors": "M. Shashi, P.V.N. Rajeswari",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijdmmm.2024.10059511"
    },
    {
        "id": 9620,
        "title": "Retracted: A Dynamic Hierarchical Clustering Data Gathering Algorithm Based on Multiple Criteria Decision Making for 3D Underwater Sensor Networks",
        "authors": "",
        "published": "2023-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9756038"
    },
    {
        "id": 9621,
        "title": "MFHCC: Multi-View Feature Hierarchical Contrastive Clustering Model for Multi-Omics Data",
        "authors": "Zongli Jiang, Hongwei Ren, Ziwei Yang, Jinli Zhang, Zheng Chen",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bibm58861.2023.10385651"
    },
    {
        "id": 9622,
        "title": "Implementation of Hierarchical Agglomerative Clustering Method to East Kalimantan Unemployment Analysis",
        "authors": "Masna Wati, Dea Adela, Muh. Jamil",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitisee58992.2023.10405078"
    },
    {
        "id": 9623,
        "title": "A Novel Information Extraction Approach Employing Hierarchical Clustering Techniques with A Focus on Attribute Similarity Values",
        "authors": "D. Saravanan, Topunuru Kaladhar",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "Data mining technique developed in vast manner. It mainly used over in information retrieval, information filtering, Data retrieval techniques. In scientific world data mining techniques used over in hospital management, Schools, colleges, public libraries, shopping complexes, space research foundation. Data Mining refers to extracting the information. Many Algorithms are used over in Data mining area. Agglomerative hierarchical technique uses top down approach. Certain arrangements are made over in this algorithm in hierarchical manner. Hierarchical algorithm mainly used for time consuming process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/jaz.v44is7.2736"
    },
    {
        "id": 9624,
        "title": "HAC: Hierarchical Agglomerative Clustering With Linear Programming for Wireless Sensor Networks",
        "authors": "Sidi Mohamed Mohi Dine, Patrick Finnerty, Chikara Ohta",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3353318"
    },
    {
        "id": 9625,
        "title": "Method for Cleaning Outliers in Massive Data of Internet of Things Based on Hierarchical Clustering Algorithm",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/ijndes.2023.070807"
    },
    {
        "id": 9626,
        "title": "High-fidelity (repeat) consensus sequences from short reads using combined read clustering and assembly",
        "authors": "Ludwig Mann, Kristin Balasch, Nicola Schmidt, Tony Heitkam",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "Abstract\nBackground\nDespite the many cheap and fast ways to generate genomic data, good and exact genome assembly is still a problem, with especially the repeats being vastly underrepresented and often misassembled. As short reads in low coverage are already sufficient to represent the repeat landscape of any given genome, many read cluster algorithms were brought forward that provide repeat identification and classification. But how can trustworthy, reliable and representative repeat consensuses be derived from unassembled genomes?\n\nResults\nHere, we combine methods from repeat identification and genome assembly to derive these robust consensuses. We test several use cases, such as (1) consensus building from clustered short reads of non-model genomes, (2) from genome-wide amplification setups, and (3) specific repeat-centred questions, such as the linked vs. unlinked arrangement of ribosomal genes. In all our use cases, the derived consensuses are robust and representative. To evaluate overall performance, we compare our high-fidelity repeat consensuses to RepeatExplorer2-derived contigs and check, if they represent real transposable elements as found in long reads. Our results demonstrate that it is possible to generate useful, reliable and trustworthy consensuses from short reads by a combination from read cluster and genome assembly methods in an automatable way.\n\nConclusion\nWe anticipate that our workflow opens the way towards more efficient and less manual repeat characterization and annotation, benefitting all genome studies, but especially those of non-model organisms.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12864-023-09948-4"
    },
    {
        "id": 9627,
        "title": "Hybrid unstructured text features for meta-heuristic assisted deep CNN-based hierarchical clustering",
        "authors": "Bankapalli Jyothi, L. Sumalatha, Suneetha Eluri",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "The text clustering model becomes an essential process to sort the unstructured text data in an appropriate format. But, it does not give the pave for extracting the information to facilitate the document representation. In today’s date, it becomes crucial to retrieve the relevant text data. Mostly, the data comprises an unstructured text format that it is difficult to categorize the data. The major intention of this work is to implement a new text clustering model of unstructured data using classifier approaches. At first, the unstructured data is taken from standard benchmark datasets focusing on both English and Telugu languages. The collected text data is then given to the pre-processing stage. The pre-processed data is fed into the model of the feature extraction stage 1, in which the GloVe embedding technique is used for extracting text features. Similarly, in the feature extraction stage 2, the pre-processed data is used to extract the deep text features using Text Convolutional Neural Network (Text CNN). Then, the text features from Stage 1 and deep features from Stage 2 are all together and employed for optimal feature selection using the Hybrid Sea Lion Grasshopper Optimization (HSLnGO), where the traditional SLnO is superimposed with GOA. Finally, the text clustering is processed with the help of Deep CNN-assisted hierarchical clustering, where the parameter optimization is done to improve the clustering performance using HSLnGO. Thus, the simulation findings illustrate that the framework yields impressive performance of text classification in contrast with other techniques while implementing the unstructured text data using different quantitative measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/idt-220201"
    },
    {
        "id": 9628,
        "title": "Identifying Key Activities, Artifacts and Roles in Agile Engineering of Secure Software with Hierarchical Clustering",
        "authors": "Anže Mihelič, Tomaž Hovelja, Simon Vrhovec",
        "published": "2023-4-4",
        "citations": 0,
        "abstract": "Different activities, artifacts, and roles can be found in the literature on the agile engineering of secure software (AESS). The purpose of this paper is to consolidate them and thus identify key activities, artifacts, and roles that can be employed in AESS. To gain initial sets of activities, artifacts, and roles, the literature was first extensively reviewed. Activities, artifacts, and roles were then cross-evaluated with similarity matrices. Finally, similarity matrices were converted into distance matrices, enabling the use of Ward’s hierarchical clustering method for consolidating activities, artifacts, and roles into clusters. Clusters of activities, artifacts, and roles were then named as key activities, artifacts, and roles. We identified seven key activities (i.e., security auditing, security analysis and testing, security training, security prioritization and monitoring, risk management, security planning and threat modeling; and security requirements engineering), five key artifacts (i.e., security requirement artifacts, security repositories, security reports, security tags, and security policies), and four key roles (i.e., security guru, security developer, penetration tester, and security team) in AESS. The identified key activities, artifacts, and roles can be used by software development teams to improve their software engineering processes in terms of software security.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13074563"
    },
    {
        "id": 9629,
        "title": "Applying the agglomerative method in hierarchical clustering for the medium-sized companies listed on the Warsaw Stock Exchange",
        "authors": "Łukasz Sroka",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "The purpose of this article is to use a hierarchical algorithm to reduce the number of companies in stock exchange portfolios, together with the identification of the most and least profitable groups of the companies. To prepare the research, the author decided to use a hierarchical clustering method to segment mWIG40 index entities. The conducted research contributed to the knowledge of the segments appearing on mWIG40 index and the profitability of the obtained clusters in the analyzed period. It was concluded that the hierarchical clustering method can divide the entities from mWIG40 index into six segments. The obtained groups differed from each other in terms of the analyzed features. Moreover, it was found that it was possible to identify more and less profitable segments in terms of the rate of return. What is more, only one segment was characterized by a higher rate of return than the benchmark. The findings can help investors to make better decisions during their investing process. In addition, the results can help companies to map their business in the market.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33119/jmfs.2023.48.5"
    },
    {
        "id": 9630,
        "title": "Component Analysis and Identification of Glass Products Based on Hierarchical Clustering and Naive Bayes",
        "authors": "Linna Tang, Mingjun Tang, Lingji Zhang",
        "published": "2023-3-30",
        "citations": 2,
        "abstract": "In the process of weathering of ancient glass products, the interaction of internal elements and environmental elements will directly lead to the change of their composition proportion, thus affecting the judgment of the composition. In this paper, cultural relics were analyzed by chi-square test and spearman coefficient, and descriptive data analysis was used to process and predict the composition content of chemical data after weathering, and to preliminarily classify them with nuclear naive Bayesian method. The contour coefficient S was used to find the best K value, and the K-Means cluster analysis was used to select the chemical indicators of whether the different types of glass were weathered or not in 4 categories. Therefore, the best classification results were obtained respectively, and the relationship and difference between chemical components were obtained by Pearson correlation coefficient and principal component analysis. From the perspective of data analysis, this paper conducts statistical analysis for the data distribution law, uses K-Means and naive Bayes to divide the subclasses, and establishes the intelligent divisions of three different machine learning models after voting on the data. By combining the correlation analysis and the second reference number, the largest difference is the correlation of the chemical composition between the weathered high potassium according to the different European distance of the weathered high potassium, and the smallest difference is the correlation between the weathered lead barium and the unweathered lead barium.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v41i.6833"
    },
    {
        "id": 9631,
        "title": "An Unsupervised Hierarchical Clustering Approach to Improve Hopfield Retrieval Accuracy",
        "authors": "Matthew Lai, Longbing Cao, Haiyan Lu, Quang Ha, Li Li, Jahangir Hossain, Paul Kennedy",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191644"
    },
    {
        "id": 9632,
        "title": "Conceptual clustering with application on FCA context",
        "authors": "László Kovács",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.123013"
    },
    {
        "id": 9633,
        "title": "Analyzing Tourism Online Reviews",
        "authors": "Wolfram Höpken, Matthias Fuchs, Maria Lexhagen",
        "published": "2024-1-30",
        "citations": 0,
        "abstract": "Tourism managers are increasingly turning to the online sphere to gain relevant customer insights. However, current approaches to analyzing vast and rapidly changing user-generated content (UGC) face several limitations. Supervised approaches require significant effort to provide pre-tagged training data and cannot dynamically identify topics mentioned in UGC. On the other hand, unsupervised approaches typically do not support different abstraction levels or enable a successive refinement of analysis in a drill-down manner, which is often expected as a practical requirement of tourism and destination management. Our research objective is, therefore, to extend current supervised approaches for identifying predefined topics by adopting unsupervised approaches using cluster analysis. The results emphasize that unsupervised approaches can (1) detect non-predefined topics dynamically with an accuracy similar to supervised approaches, thus demonstrating the potential to replace them and avoid the necessity of providing pre-tagged training data. (2) To build a topic hierarchy, unsupervised approaches sense more fine-grained topics as an enhancement of predefined topics on a lower level of abstraction, enabling more powerful drill-down-like analyses. Overall, the proposed extended approach to topic detection promises to support tourism management by meaningfully analyzing the increasing mass of visitors’ online feedback.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37741/t.72.1.1"
    },
    {
        "id": 9634,
        "title": "A New Similarity Measure and Hierarchical Clustering Approach to Color Image Segmentation",
        "authors": "Radhwane Gherbaoui, Nacéra Benamrane, Mohammed Ouali",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iri58017.2023.00014"
    },
    {
        "id": 9635,
        "title": "Application of Hierarchical Clustering Approach for Prediction of Grain Size in Heat-Treated EN9 Steel",
        "authors": "Tapasmini Sahoo, Susmita Panda, Sweta Rani Biswal",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "One of the simplest, most popular, and productive ways to conduct research and testing in the field of materials science is through the use of metallographic study. Technological boon in the field of metallographic study, opens new gateway for materials characterization through image processing technologies. Image segmentation, edge detection, and roughly estimating grain size are the three main goals of metallographic image processing. The objective of this paper was to determine the grain size of EN9 steel by applying different clustering techniques to the image textured data, collected from EN9 steel metallographic specimens in normalized and annealed condition. In order to determine the average grain size in EN9 steel specimens when seen with a metallurgical microscope, this article blends the ideas of image processing with various hierarchical clustering methodologies to study material characteristics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1149/2754-2734/acbb1a"
    },
    {
        "id": 9636,
        "title": "Coupled clustering strategies for hierarchical matrix preconditioners in saddle point problems",
        "authors": "Jonas Grams, Sabine Le Borne",
        "published": "2023-10",
        "citations": 0,
        "abstract": "AbstractFluid flow problems can be modeled by the Navier–Stokes or, after linearization, by the Oseen equations. Their discretization results in discrete saddle point problems. These systems of equations are typically very large and need to be solved iteratively. Standard (block‐) preconditioning techniques for saddle point problems rely on an approximation of the Schur complement. Such an approximation can be obtained by a hierarchical (‐) matrix LU‐decomposition, which first approximates the Schur complement explicitly. The computational complexity of this computation depends, among other things, on the hierarchical block structure of the involved matrices. However, widely used techniques do not consider the connection between the discretization grids for the velocity field and the pressure, respectively. Here, we present a hierarchical block structure for the finite element discretization of the gradient operator that is improved by considering the connection between the two involved grids. Numerical results imply that the improved block structure allows for a faster computation of the Schur complement, which is the bottleneck for the set‐up of the ‐matrix LU‐decomposition.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/pamm.202300077"
    },
    {
        "id": 9637,
        "title": "Hierarchical agglomerative clustering-based skin lesion detection with region based neural networks classification",
        "authors": "M.V.S. Ramprasad, S.S.V. Nagesh, V. Sahith, Rohith Kumar Lankalapalli",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100865"
    },
    {
        "id": 9638,
        "title": "Hierarchical variable clustering via copula-based divergence measures between random vectors",
        "authors": "Steven De Keyser, Irène Gijbels",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijar.2023.109090"
    },
    {
        "id": 9639,
        "title": "Assessment of first-phase COVID-19 pandemic in Europe using hierarchical clustering based on principal components analysis",
        "authors": "Sanjay Kumar, Evrim Oral",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "<p>It is of great interest for researchers to assess the COVID-19 pandemic in Europe. Grouping of COVID-19-affected regions is an effective way to monitor and optimize planning to combat the disease. This paper applied hierarchical clustering based on principal components analysis (HCPCA) to COVID-19 data from affected European countries. Considering several attribute indices, we obtained a new set of indicators using principal components analysis to aggregate and reduce the dimension of attribute indices of affected countries. Further, we obtained groups of affected countries subject to their similarity using hierarchical clustering to the reduced observations of new attributes indices of these countries. This study aims to group European countries with similar epidemic severity using some presumed attribute indices. The study is limited up to 24 May 2020, to assess if the outputs of the study could help governments, administrators, World Health Organization (WHO), healthcare service professionals, and other decision-makers to optimize their policies and plan their regulations in the country level requirements so that transmission of infections, deaths, critical conditions of patients could be minimized. For this purpose, we used hierarchical clustering using principal components analysis to obtain better clusters of countries with similar epidemic severity.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v7i1.648"
    },
    {
        "id": 9640,
        "title": "Expanding the Class of Global Objective Functions for Dissimilarity-Based Hierarchical Clustering",
        "authors": "Sebastien Roch",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00357-023-09447-x"
    },
    {
        "id": 9641,
        "title": "Analysis of Corruption and Its Determinants by Hierarchical Clustering in OECD Countries",
        "authors": "Abdulkerim EROĞLU, Ahmet ÖZEN",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "Yolsuzluk siyasi, iktisadi ve mali birçok göstergede bozulmalara yol açan temel bir sorundur. Söz konusu göstergelerin de yolsuzluğun düzeyi üzerinde etkili olabilmesi, yolsuzluğun uzun vadeli olarak ele alınmasını gerektirmektedir. Bu bağlamda, çalışmanın amacı yolsuzlukla birlikte sosyoekonomik faktörler kapsamında OECD ülkelerinin nasıl kümelendiklerini ortaya koymaktır. Çalışmada 2014-2020 yıllarına ait yolsuzluk ve yolsuzlukla ilişkili seçilmiş değişkenler kullanılarak hiyerarşik kümeleme esas alınmış ve Ward Minimum Varyans yöntemi ile analiz edilmiştir. Elde edilen sonuçlara göre, OECD ülkelerinin iki ana kümeye ayrıldığı ve bazı ülkelerde benzerlikler bakımından yakınsamalar olduğu tespit edilmiştir. Yakınsan ülkelerin ise benzer siyasi, iktisadi ve mali tecrübelere sahip oldukları görülmüştür.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17233/sosyoekonomi.2023.03.16"
    },
    {
        "id": 9642,
        "title": "Generalisation of genomic findings and applications of polygenic risk scores",
        "authors": "Manuel Corpas, Segun Fatumo",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "AbstractPolygenic Risk Scores (PRS) (also known as polygenic scores, genetic risk scores or polygenic indexes) capture genetic contributions of a multitude of markers that characterise complex traits. Although their likely application to precision medicine remains to be established, promising advances have included their ability to stratify high risk individuals and targeted screening interventions. Current PRS have been mostly optimised for individuals of Northern European ancestries. If PRS are to become widespread as a tool for healthcare applications, more diverse populations and greater capacity for derived interventions need to be accomplished. In this editorial we aim to attract submissions from the research community that highlight current challenges in development of PRS applications at scale. We also welcome manuscripts that delve into the ethical, social and legal implications that the implementation of PRS may generate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12920-023-01615-7"
    },
    {
        "id": 9643,
        "title": "An interval convexity-based framework for multilevel clustering with applications to single-linkage clustering",
        "authors": "Patrice Bertrand, Jean Diatta",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dam.2023.08.003"
    },
    {
        "id": 9644,
        "title": "Penerapan Metode Hierarchical Clustering Multiscale Bootstrap untuk Pengelompokan Indikator Indeks Pembangunan Manusia Tahun 2021 di Jawa Barat",
        "authors": " Sophia Annisa Faisal, Nur Azizah Komara Rifai",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "Abstract. Cluster analysis is a technique for grouping objects that have the same characteristics into one group and between different groups. In general there are two methods, namely hierarchical and non-hierarchical. The average linkage method is one of the methods in the hierarchical cluster analysis method that can be used to group data, one of which is the Human Development Index (HDI) data. This study uses HDI indicator data in West Java in 2021. The average linkage method only provides solutions based on a measure of proximity, so this study uses the multiscale bootstrap method to obtain the validity of the groups formed. There are four clusters formed by the average linkage method. Of the four groups formed, there is one valid cluster, namely the fourth cluster which consists of the group with the highest average HDI score, namely Bandung City, Bekasi City, and Depok City.\r\nAbstrak. Analisis cluster adalah teknik untuk mengelompokkan objek-objek yang memiliki karakteristik sama ke dalam satu kelompok dan antar kelompok berbeda. Secara umum terdapat dua metode yaitu hierarki dan non-hierarki. Metode average linkage merupakan salah satu metode pada analisis cluster metode hierarki yang dapat digunakan untuk mengelompokkan data, salah satunya yaitu data Indeks Pembangunan Manusia (IPM). Penelitian ini menggunakan data indikator IPM di Jawa Barat Tahun 2021. Metode average linkage hanya memberikan solusi berdasarkan ukuran kedekatan jarak, sehingga pada penelitian ini menggunakan metode multiscale bootstrap untuk memperoleh validitas dari kelompok yang terbentuk. Terdapat empat cluster yang terbentuk dengan metode average linkage. Dari keempat kelompok yang terbentuk, terdapat satu cluster yang valid yaitu cluster keempat yang terdiri dari kelompok dengan nilai rata-rata IPM tertinggi yaitu Kota Bandung, Kota Bekasi, dan Kota Depok.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29313/bcss.v3i1.6327"
    },
    {
        "id": 9645,
        "title": "HC-UAP: Outliers detection method based-on hierarchical clustering for universally aligned time-series RNA-Seq profiles",
        "authors": "Abedalrhman Alkhateeb",
        "published": "2023",
        "citations": 1,
        "abstract": "Tracking abundant gene transcripts quantification over continuous cancer progression stages may reveal the mechanism of disease advancement. In this work, we profile the transcript quantification over the stages using a time-series approach, in which the stages/sub-stages of the disease are the time points, and the quantification measurements are the values. The values over time points are used to interpolate the growth of the progression using the cubic spline function. Then, the transcripts profiles are universally aligned and clustered using the time-series profile hierarchical clustering method based on the area between each pair of the aligned profiles; the method is named (HC-UAP). We compare the proposed method with a hierarchical clustering method based on Euclidean distance (HC-ED). Both methods were applied on two next-generation sequencing (NGS) prostate cancer datasets, the first from the Chinese and the second from the North American population. HC-ED clusters the dataset to find patterns while HC-UAP was able to single out outliers that trend differently in both datasets. While finding patterns in gene expression that trend over stages is the standard approach for analyzing time-series models, identifying outlier transcripts that grow differently than other transcripts can provide more details about the contribution of the mRNA transcriptional activity to the disease. They also can be a potential biomarker for the disease progression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5267/j.dsl.2022.10.004"
    },
    {
        "id": 9646,
        "title": "Analysis Content Type and Emotion of the Presidential Election Users Tweets using Agglomerative Hierarchical Clustering",
        "authors": "Cika Carissa Sujadi, Yuliant Sibaroni, Aditya Firman Ihsan",
        "published": "2023-7-7",
        "citations": 1,
        "abstract": "Over the past few years, social media has become essential for getting up-to-date information and interacting online. During presidential elections in Indonesia, Twitter has grown as a crucial platform for expressing opinions and sharing information. This study focuses on analyzing the content types and emotions of tweets related to Anies Baswedan, one of the presidential candidates. The results show a variety of discussions, including support, criticism, and discussion of policies for the 2024 presidential candidate. Clustering enables meaningful information extraction from vast Twitter data. Data were clustered using Agglomerative Hierarchical Clustering, which resulted in the identification of 10 clusters. With 4 clusters containing opinion content and 6 clusters containing information content. In addition, 6 clusters reflect excitement, 3 reflect expectations, and 1 reflect doubt. This research provides insights into the Twitter conversation around the 2024 presidential election, providing an understanding of content and emotions expressed by users.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i3.12616"
    },
    {
        "id": 9647,
        "title": "Hierarchical clustering identifies oxidative stress-related subgroups for the prediction of prognosis and immune microenvironment in gastric cancer",
        "authors": "Meng Zhu, Ning Zhang, Jingwei Ma",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e20804"
    },
    {
        "id": 9648,
        "title": "Enhancement Methods of Hydropower Unit Monitoring Data Quality Based on the Hierarchical Density-Based Spatial Clustering of Applications with a Noise–Wasserstein Slim Generative Adversarial Imputation Network with a Gradient Penalty",
        "authors": "Fangqing Zhang, Jiang Guo, Fang Yuan, Yuanfeng Qiu, Pei Wang, Fangjuan Cheng, Yifeng Gu",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "In order to solve low-quality problems such as data anomalies and missing data in the condition monitoring data of hydropower units, this paper proposes a monitoring data quality enhancement method based on HDBSCAN-WSGAIN-GP, which improves the quality and usability of the condition monitoring data of hydropower units by combining the advantages of density clustering and a generative adversarial network. First, the monitoring data are grouped according to the density level by the HDBSCAN clustering method in combination with the working conditions, and the anomalies in this dataset are detected, recognized adaptively and cleaned. Further combining the superiority of the WSGAIN-GP model in data filling, the missing values in the cleaned data are automatically generated by the unsupervised learning of the features and the distribution of real monitoring data. The validation analysis is carried out by the online monitoring dataset of the actual operating units, and the comparison experiments show that the clustering contour coefficient (SCI) of the HDBSCAN-based anomaly detection model reaches 0.4935, which is higher than that of the other comparative models, indicating that the proposed model has superiority in distinguishing between the valid samples and anomalous samples. The probability density distribution of the data filling model based on WSGAIN-GP is similar to that of the measured data, and the KL dispersion, JS dispersion and Hellinger’s distance of the distribution between the filled data and the original data are close to 0. Compared with the filling methods such as SGAIN, GAIN, KNN, etc., the effect of data filling with different missing rates is verified, and the RMSE error of data filling with WSGAIN-GP is lower than that of other comparative models. The WSGAIN-GP method has the lowest RMSE error under different missing rates, which proves that the proposed filling model has good accuracy and generalization, and the research results in this paper provide a high-quality data basis for the subsequent trend prediction and state warning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24010118"
    },
    {
        "id": 9649,
        "title": "Efficient Clustering-Based electrocardiographic biometric identification",
        "authors": "David Meltzer, David Luengo",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.119609"
    },
    {
        "id": 9650,
        "title": "Can hierarchical client clustering mitigate the data heterogeneity effect in federated learning?",
        "authors": "Seungjun Lee, Miri Yu, Daegun Yoon, Sangyoon Oh",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ipdpsw59300.2023.00134"
    },
    {
        "id": 9651,
        "title": "CLASSIFICATION OF THE NUMBER OF AGRICULTURAL EQUIPMENTS IN TURKEY BETWEEN 2003-2022 WITH HIERARCHICAL AND FUZZY CLUSTERING ANALYSIS",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.276"
    },
    {
        "id": 9652,
        "title": "Assessing Topic Modeling in Online Forums: A Comparative Study of Hierarchical and Centroid-Based Clustering Algorithms",
        "authors": "Ibrahim Bouabdallaoui, Fatima Guerouate, Mohammed Sbihi",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wincom59760.2023.10322986"
    },
    {
        "id": 9653,
        "title": "Hierarchical Clustering-Based State Grouping Reinforcement Learning for Switching Decision of Autonomous Vehicles",
        "authors": "Wenjie Ouyang, Yiwen Jiao, Yang Liu, Yang Li, Manjiang Hu, Hongmao Qin",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icus58632.2023.10318413"
    },
    {
        "id": 9654,
        "title": "A semi-supervised framework for concept-based hierarchical document clustering",
        "authors": "Seyed Mojtaba Sadjadi, Hoda Mashayekhi, Hamid Hassanpour",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11280-023-01209-4"
    },
    {
        "id": 9655,
        "title": "Non-linear correlation analysis in financial markets using hierarchical clustering",
        "authors": "J E Salgado-Hernández, Manan Vyas",
        "published": "2023-5-1",
        "citations": 1,
        "abstract": "Abstract\nDistance correlation coefficient (DCC) can be used to identify new associations and correlations between multiple variables. The distance correlation coefficient applies to variables of any dimension, can be used to determine smaller sets of variables that provide equivalent information, is zero only when variables are independent, and is capable of detecting nonlinear associations that are undetectable by the classical Pearson correlation coefficient (PCC). Hence, DCC provides more information than the PCC. We analyze numerous pairs of stocks in S&P500 database with the distance correlation coefficient and provide an overview of stochastic evolution of financial market states based on these correlation measures obtained using agglomerative clustering.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2399-6528/acd618"
    },
    {
        "id": 9656,
        "title": "TSI-based hierarchical clustering method and regular-hypersphere model for product quality detection",
        "authors": "Hao Xie, Shaowu Lu, Xiaoqi Tang",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cie.2023.109094"
    },
    {
        "id": 9657,
        "title": "Create the Taxonomy for Unintentional Insider Threat via Text Mining and Hierarchical Clustering Analysis",
        "authors": "Jolynn Baugher, Yanzhen Qu",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "The unintentional activities of system users can jeopardize the confidentiality, integrity, and assurance of data on information systems. These activities, known as unintentional insider threat activities, account for a significant percentage of data breaches. A method to mitigate or prevent this threat is using smart systems or artificial intelligence (AI). The construction of an AI requires the development of a taxonomy of  activities. The literature review focused on data breach threats, mitigation tools, taxonomy usage in cybersecurity, and taxonomy development using Endnote and Google Scholar. This study aims to develop a taxonomy of unintentional insider threat activities based on narrative descriptions of the breach events in public data breach databases. The public databases were from the California Department of Justice, US Health and Human Services, and Verizon, resulting in 1850 examples of human errors. A taxonomy was constructed to specify the dimensions and characteristics of objects. Text mining and hierarchical cluster analysis were used to create the taxonomy, indicating a quantitative approach. Ward’s agglomeration coefficient was used to ensure the cluster was valid. The resulting top-level taxonomy categories are application errors, communication errors, inappropriate data permissions, lost media, and misconfigurations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24018/ejece.2024.8.2.608"
    },
    {
        "id": 9658,
        "title": "Federation Subjects' Import Dependence Level Hierarchical Clustering Model",
        "authors": "Evgenii S. Mityakov, Sergei N. Mityakov, Natalia A. Murashova, Andrey I. Ladynin, Nina M. Shmeleva",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/neuront58640.2023.10175840"
    },
    {
        "id": 9659,
        "title": "Komparasi Metode Clustering K-Means, Dbscan dan Hierarchical Untuk Analisis Penyakit Hepatitis C",
        "authors": "Aditya Bachtiar, Nur Irvan Rizqi, Syahrul Mubarok",
        "published": "2023-2-17",
        "citations": 0,
        "abstract": "Beberapa tahun terakhir ini penyakit yang sering dihindari manusia adalah hepatitis. Hepatitis yaitu penyakit yang menjalar di organ hati manusia yang mengalami peradangan sehingga fungsi daripada hati itu tersendat. Dengan tersendatnya fungsi organ hati maka akan mempengaruhi organ yang lain  pada diri manusia dan berakibatkan aliran darah yang mengalir tidak sampai ke organ hati sehingga tekanan darah menjadi tidak normal dan pembuluh darah menjadi pecah. penelitian ini menggunakan metode klustering dengan dataset yang terdapat di UCI Repository lalu membandingan ketiga algoritma yakni Hierarchical, K-Means, dan DBSCAN yang bertujuan untuk mengetahui mana algoritma terbaik dari ketiga algoritma tersebut. hasil penelitian ini menunjukkan bahwa algoritma hierarchical mendapatkan hasil yang terbaik dengan nilai 0.7779 tanpa menggunakan scaler.",
        "keywords": "",
        "link": "http://dx.doi.org/10.19166/isd.v8i1.591"
    },
    {
        "id": 9660,
        "title": "Implementation of K-Means and Hierarchical Clustering in Determining  Levels of Smart City 2022 Based on Motion Index",
        "authors": "Nissa Shahadah Qur'ani, Arie Wahyu Wijayanto",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32520/stmsi.v12i2.2457"
    },
    {
        "id": 9661,
        "title": "CHIDYN: a clustering-based hierarchical approach for dynamic traffic assignment",
        "authors": "Arezoo Bybordi, Matthew DiCicco, Anita Raja, Ana L.C. Bazzan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.trpro.2024.02.009"
    },
    {
        "id": 9662,
        "title": "Probabilistic hierarchical clustering based identification and segmentation of brain tumors in magnetic resonance imaging",
        "authors": "Ankit Vidyarthi",
        "published": "2024-4-25",
        "citations": 0,
        "abstract": "Abstract\nThe automatic segmentation of the abnormality region from the head MRI is a challenging task in the medical science domain. The abnormality in the form of the tumor comprises the uncontrolled growth of the cells. The automatic identification of the affected cells using computerized software systems is demanding in the past several years to provide a second opinion to radiologists. In this paper, a new clustering approach is introduced based on the machine learning aspect that clusters the tumor region from the input MRI using disjoint tree generation followed by tree merging. Further, the proposed algorithm is improved by introducing the theory of joint probabilities and nearest neighbors. Later, the proposed algorithm is automated to find the number of clusters required with its nearest neighbors to do semantic segmentation of the tumor cells. The proposed algorithm provides good semantic segmentation results having the DB index-0.11 and Dunn index-13.18 on the SMS dataset. While the experimentation with BRATS 2015 dataset yields Dice\ncomplete=80.5 %, Dice\ncore=73.2 %, and Dice\nenhanced=62.8 %. The comparative analysis of the proposed approach with benchmark models and algorithms proves the model’s significance and its applicability to do semantic segmentation of the tumor cells with the average increment in the accuracy of around ±2.5 % with machine learning algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/bmt-2021-0313"
    },
    {
        "id": 9663,
        "title": "Clustering LiDAR Data with K-means and DBSCAN",
        "authors": "Mafalda Oliveira, André Marcal",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011667000003411"
    },
    {
        "id": 9664,
        "title": "A new and effective two-step clustering approach for single cell RNA sequencing data",
        "authors": "Ruiyi Li, Jihong Guan, Zhiye Wang, Shuigeng Zhou",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "Abstract\nBackground\nThe rapid devolvement of single cell RNA sequencing (scRNA-seq) technology leads to huge amounts of scRNA-seq data, which greatly advance the research of many biomedical fields involving tissue heterogeneity, pathogenesis of disease and drug resistance etc. One major task in scRNA-seq data analysis is to cluster cells in terms of their expression characteristics. Up to now, a number of methods have been proposed to infer cell clusters, yet there is still much space to improve their performance.\n\nResults\nIn this paper, we develop a new two-step clustering approach to effectively cluster scRNA-seq data, which is called TSC — the abbreviation of Two-Step Clustering. Particularly, by dividing all cells into two types: core cells (those possibly lying around the centers of clusters) and non-core cells (those locating in the boundary areas of clusters), we first clusters the core cells by hierarchical clustering (the first step) and then assigns the non-core cells to the corresponding nearest clusters (the second step). Extensive experiments on 12 real scRNA-seq datasets show that TSC outperforms the state of the art methods.\n\nConclusion\nTSC is an effective clustering method due to its two-steps clustering strategy, and it is a useful tool for scRNA-seq data analysis.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12864-023-09577-x"
    },
    {
        "id": 9665,
        "title": "Clustering Object-Centric Event Logs",
        "authors": "Anahita Ghahfarokhi, Fatemeh Akoochekian, Fareed Zandkarimi, Wil van der Aalst",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012123900003541"
    },
    {
        "id": 9666,
        "title": "A Hierarchical Approach for Multilingual Speech Emotion Recognition",
        "authors": "Marco Nicolini, Stavros Ntalampiras",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011714800003411"
    },
    {
        "id": 9667,
        "title": "Research on deduplication method of multiple relations based on hierarchical clustering algorithm",
        "authors": "Ying Wang, Weiwei Cheng, Chang Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijict.2023.128741"
    },
    {
        "id": 9668,
        "title": "Variational Bayes estimation of hierarchical Dirichlet-multinomial mixtures for text clustering",
        "authors": "Massimo Bilancia, Michele Di Nanni, Fabio Manca, Gianvito Pio",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00180-023-01350-8"
    },
    {
        "id": 9669,
        "title": "Modified Hierarchical Clustering Algorithm for Partial Discharge Separation",
        "authors": "Alessio Di Fatta, Antonino Imburgia, Giuseppe Rizzo, Ghulam Akbar, Vincenzo Li Vigni, Pietro Romano, Guido Ala",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ceidp51414.2023.10410179"
    },
    {
        "id": 9670,
        "title": "Scientific publications clustering using textual and citation information",
        "authors": "Nacim Fateh Chikhi",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123319"
    },
    {
        "id": 9671,
        "title": "A Hierarchical Clustering Random Forest Model Approach to Diagnose the Breast Cancer Diseases",
        "authors": "Polaki Sujatha, Chaitanya Mutyam, Raviteja Nekkanti, Nitin Kanakavalli, Basavaiah Soma",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpcsn58827.2023.00055"
    },
    {
        "id": 9672,
        "title": "An analysis of conditional mean-variance portfolio performance using hierarchical clustering",
        "authors": "Stephen R. Owen",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jfds.2023.100112"
    },
    {
        "id": 9673,
        "title": "Analysis of Regency/City Human Development Index Data in East Java Through Grouping Using Hierarchical Agglomerative Clustering Method",
        "authors": "Roudlotul Jannah Alfirdausy, Nurissaidah Ulinnuha, Moh. Hafiyusholeh",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32520/stmsi.v12i3.2959"
    },
    {
        "id": 9674,
        "title": "Near-infrared spectral interval screening based on hierarchical variables clustering and group SCAD in multivariate calibration",
        "authors": "Chen-Hao Huang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.vibspec.2024.103664"
    },
    {
        "id": 9675,
        "title": "Cleaning and Reconstruction of Wind Power Anomaly Data based on Hierarchical Clustering",
        "authors": "Yanqi Wu, Jingxia Liu, Ziyu Ren, Peihong Yang, Baoli Li",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/neessc59976.2023.10349333"
    },
    {
        "id": 9676,
        "title": "Hierarchical nearest neighbor descent, in-tree, and clustering",
        "authors": "Teng Qiu, Yongjie Li",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.patcog.2023.109300"
    },
    {
        "id": 9677,
        "title": "Customer Segmentation for E-Commerce Using Recency Frequency Monetary and Hierarchical Clustering",
        "authors": "Saumya Parag Phadkar, Chinmay Singhania, Siddharth Poddar, Jai Suryawanshi, Swati Chandurkar",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccubea58933.2023.10392053"
    },
    {
        "id": 9678,
        "title": "VirClust—A Tool for Hierarchical Clustering, Core Protein Detection and Annotation of (Prokaryotic) Viruses",
        "authors": "Cristina Moraru",
        "published": "2023-4-19",
        "citations": 11,
        "abstract": "Recent years have seen major changes in the classification criteria and taxonomy of viruses. The current classification scheme, also called “megataxonomy of viruses”, recognizes six different viral realms, defined based on the presence of viral hallmark genes (VHGs). Within the realms, viruses are classified into hierarchical taxons, ideally defined by the phylogeny of their shared genes. To enable the detection of shared genes, viruses have first to be clustered, and there is currently a need for tools to assist with virus clustering and classification. Here, VirClust is presented. It is a novel, reference-free tool capable of performing: (i) protein clustering, based on BLASTp and Hidden Markov Models (HMMs) similarities; (ii) hierarchical clustering of viruses based on intergenomic distances calculated from their shared protein content; (iii) identification of core proteins and (iv) annotation of viral proteins. VirClust has flexible parameters both for protein clustering and for splitting the viral genome tree into smaller genome clusters, corresponding to different taxonomic levels. Benchmarking on a phage dataset showed that the genome trees produced by VirClust match the current ICTV classification at family, sub-family and genus levels. VirClust is freely available, as a web-service and stand-alone tool.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/v15041007"
    },
    {
        "id": 9679,
        "title": "Additional Power Losses Estimation in Harmonic Polluted LV Distribution Grid using a Ward's Hierarchical Clustering Method",
        "authors": "Bogdan-Constantin Neagu, Gheorghe Grigoras, Razvan Livadariu",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecai58194.2023.10193906"
    },
    {
        "id": 9680,
        "title": "Copy-move forgery detection using SIFT and agglomerative hierarchical clustering",
        "authors": "Sajeeda Shikalgar, Rashi Madnani, Aditya Dhenge, Dhanashree Lodhe, Palak Mallawat",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0154751"
    },
    {
        "id": 9681,
        "title": "An Excellence Model Case Study Assessing the Gap in Managers' Views by Hierarchical Clustering",
        "authors": "Jan Střeleček, Barbora Stieberová, Zeynep Tugce Kalender, Miroslav Žilka",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "Purpose: This paper highlights the importance of business excellence models for SMEs and compares results from different model versions and managerial perspectives.\nMethodology/Approach: In an SME case study, three EFQM versions were applied (START, START PLUS (both based on EFQM 2013) and EFQM 2020) to make a comparative analysis of evaluation results. It utilises hierarchical clustering to gauge managerial agreement and examines the shift from EFQM 2013 to EFQM 2020.\nFindings: The paper presents comparative results, emphasising differences in evaluations. These results underscore the robustness of EFQM model versions and the significance of assessing managerial perspectives.\nResearch Limitation/implication: Similar analysis can be conducted for a large number of companies in order to make a comprehensive statistical comparison. Also, it could be useful to examine the differences among different branches of industry if there are any.\nOriginality/Value of paper: It is believed that this study will contribute to the existing literature by presenting the case study implementation of the excellence models in an SME. A conducted case study increases originality in a value-added way by using managerial views’ evaluations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12776/qip.v28i1.1924"
    },
    {
        "id": 9682,
        "title": "Hierarchical clustering analysis of musculoskeletal stress factors and their risk level in cardboard manufacturing: research from PLIBEL",
        "authors": "Martha Roselia Contreras-Valenzuela, Carlos Alejandro Martínez-Ibanez",
        "published": "2024-1-4",
        "citations": 1,
        "abstract": "Abstract\nObjective: A hierarchical cluster analysis for the cardboard manufacturing industry was developed with the aim of identifying similarities between workstations in terms of musculoskeletal stress factors (MSFs) and their impact on workers’ bodies.\nMethods: The hierarchical clustering analysis was conducted using data from 44 workstations, which included 6 body part divisions and 51 stress factors as variables with 36 answer options. Firstly, the content of the dataset was defined. Secondly, the data were agglomerated and classified into 3 clusters using Ward’s method based on the presence or absence of stress factors. Finally, the multivariable matrix was reduced to 2 factors: the x-axis representing the risk level of the workstation, and the y-axis representing the impact on the workers’ health.\nResults: The study found that workers’ knees were the most affected body parts, with 47 cases. The resulting work-related musculoskeletal disorders included tendinitis, arthralgia, chondromalacia, and gonarthrosis. The MSF with the most significant impact on the body’s health was fatiguing work that involves repeated jumps, prolonged squatting, or kneeling, present in cluster 1 and cluster 3. Moreover, two of the most common MSFs associated with repeated work positions were identified: a mild forward flexion of the back (63 cases) in combination with one leg being used more often to support the body (56 cases).\nConclusions: It was possible to identify the main work-related musculoskeletal disorders and the associated stress factors for the cardboard manufacturing industry by using hierarchical cluster classification and analysis, enabling the classification of risk levels and the impact on body health for each workstation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/joccuh/uiae008"
    },
    {
        "id": 9683,
        "title": "Model-based clustering of multiple networks with a hierarchical algorithm",
        "authors": "Tabea Rebafka",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11222-023-10329-w"
    },
    {
        "id": 9684,
        "title": "A hierarchical clustering approach for colorectal cancer molecular subtypes identification from gene expression data",
        "authors": "Shivangi Raghav, Aastha Suri, Deepika Kumar, Aakansha Aakansha, Muskan Rathore, Sudipta Roy",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.imed.2023.04.002"
    },
    {
        "id": 9685,
        "title": "Hierarchical higher-order dynamic mode decomposition for clustering and feature selection",
        "authors": "Adrián Corrochano, Giuseppe D'Alessio, Alessandro Parente, Soledad Le Clainche",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.camwa.2024.01.003"
    },
    {
        "id": 9686,
        "title": "Adaptive safety-aware semi-supervised clustering",
        "authors": "Haitao Gan, Zhi Yang, Ran Zhou",
        "published": "2023-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118751"
    },
    {
        "id": 9687,
        "title": "Exploring the Performance and Characteristics of Single Linkage and Complete Linkage Hierarchical Clustering Methods for IoT Sensor Networks",
        "authors": "Fuad Bajaber",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nThe research explores applying hierarchical clustering methods, namely single linkage and complete linkage, in IoT Sensor Networks (ISNs). ISNs are distributed systems comprising numerous sensor nodes that collect data from the environment and communicate with each other to transmit the data to a base station. Hierarchical clustering is a technique that groups nodes into clusters based on proximity and similarity. This paper implements and compares the performance of single linkage and complete linkage methods in terms of cluster size, network lifetime, and cluster quality. The study’s findings provide guidance for ISN researchers and designers in selecting the appropriate clustering method that meets their specific requirements.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/cait-2023-0041"
    },
    {
        "id": 9688,
        "title": "Semi-supervised Learning for Source Code Function Classification Using Hierarchical Density-Based Clustering",
        "authors": "Zhi Sun, Ye Han, Da He, BingWen Wang, Ling Zhang, Deming Mao",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsrs59833.2023.10381331"
    },
    {
        "id": 9689,
        "title": "Topology Identification Method of Low-voltage Station Area Based on Hierarchical Clustering Algorithm and WDDTW Distance",
        "authors": "Yifei Liu, Rong Cao, Yufeng Guo, Yingwei Wang",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/segre58867.2023.00046"
    },
    {
        "id": 9690,
        "title": "Noise Pollution Analysis Using Geographic Information System, Agglomerative Hierarchical Clustering and Principal Component Analysis in Urban Sustainability (Case Study: Tehran)",
        "authors": "Amir Esmael Forouhid, Shahrzad Khosravi, Jafar Mahmoudi",
        "published": "2023-1-22",
        "citations": 1,
        "abstract": "In this study, a new approach has been used with SPSS and MATLAB analysis to study urban road traffic noise distribution mapping, to obtain the representative road traffic noise maps. The observation has been performed at a high traffic highway. The factors influencing noise level (traffic, road width, slope, and residential or administrative–commercial land) use were surveyed and recorded for each point and their local and time dependencies were computed. According to the analysis, the maximum value of goodness of fit index for the traffic and noise level relationship was 0.64, followed by 0.489 for the percentage of residential land use. The result of this study showed that the vehicle speed, width of the road, and the land use can affect different sound levels emitted by moving vehicles on road. The model predicts that by increasing one vehicle per hour, an increase in noise level by 0.002 dB will happen.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15032112"
    },
    {
        "id": 9691,
        "title": "Evaluation of master’s degree programmes in project and construction management: an agglomerative hierarchical clustering study",
        "authors": "Murat Aydın",
        "published": "2024-1-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/15623599.2024.2303884"
    },
    {
        "id": 9692,
        "title": "Feature selection of microarray data using multidimensional graph neural network and supernode hierarchical clustering",
        "authors": "Weidong Xie, Shoujia Zhang, Linjie Wang, Kun Yu, Wei Li",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "AbstractCancer remains a significant cause of mortality, and the application of microarray technology has opened new avenues for cancer diagnosis and treatment. However, due to the challenges in sample acquisition, the genetic dimension of microarray data surpasses the sample dimension, resulting in high-dimensional small sample data. Effective feature selection is crucial for identifying biomarkers and facilitating further analysis. However, existing methods struggle to fully exploit the interdependencies among genes, such as regulatory networks and pathways, to guide the feature selection process and construct efficient classification models. In this paper, we propose a novel feature selection algorithm and classification model based on graph neural networks to address these challenges. Our proposed method employs a multidimensional graph to capture intricate gene interactions. We leverage link prediction techniques to enhance the graph structure relationships and employ a multidimensional node evaluator alongside a supernode discovery algorithm based on spectral clustering for initial node filtering. Subsequently, a hierarchical graph pooling technique based on downsampling is used to further refine node selection for feature extraction and model building. We evaluate the proposed method on nine publicly available microarray datasets, and the results demonstrate its superiority over both classical and advanced feature selection techniques in various evaluation metrics. This highlights the effectiveness and advancement of our proposed approach in addressing the complexities associated with microarray data analysis and cancer classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10462-023-10700-3"
    },
    {
        "id": 9693,
        "title": "Clarifying the use of hierarchical clustering in analyzing allergen molecule sensitization profiles",
        "authors": "Sevda Tuten Dal, Bulent Enis Sekerel",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/pai.14118"
    },
    {
        "id": 9694,
        "title": "An improved hierarchical clustering method based on the <scp>k‐NN</scp> and density peak clustering",
        "authors": "Zhicheng Shi, Renzhong Guo, Zhigang Zhao",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractClustering is one of the most prevalent and important data mining algorithms ever developed. Currently, most clustering methods are divided into distance‐based and density‐based. In 2014, the fast search and find of density peaks clustering method was proposed, which is simple and effective and has been extensively applied in several research domains. However, the original version requires manually assigning a cut‐off distance and selecting core points. Therefore, this article improves the density peak clustering method from two aspects. First, the Gaussian kernel is substituted with a k‐nearest neighbors method to calculate local density. This is important as compared with selecting a cut‐off distance, calculating the k‐value is easier. Second, the core points are automatically selected, unlike the original method that manually selects the core points regarding local density and distance distribution. Given that users' selection influences the clustering result, the proposed automatic core point selection strategy overcomes the human interference problem. Additionally, in the clustering process, the proposed method reduces the influence of manually assigned parameters.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/tgis.13115"
    },
    {
        "id": 9695,
        "title": "A hierarchical heterogeneous ant colony optimization based fingerprint recognition system",
        "authors": "N.K. Sreeja",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2023.200180"
    },
    {
        "id": 9696,
        "title": "q-rung orthopair fuzzy 2-tuple linguistic clustering algorithm and its applications to clustering analysis",
        "authors": "Fatima Abbas, Jawad Ali, Wali Khan Mashwani, Muhammad I. Syam",
        "published": "2023-2-16",
        "citations": 8,
        "abstract": "Abstractq-ROPFLS, including numeric and linguistic data, has a wide range of applications in handling uncertain information. This article aims to investigate q-ROPFL correlation coefficient based on the proposed information energy and covariance formulas. Moreover, considering that different q-ROPFL elements may have varying criteria weights, the weighted correlation coefficient is further explored. Some desirable characteristics of the presented correlation coefficients are also discussed and proven. In addition, some theoretical development is provided, including the concept of composition matrix, correlation matrix, and equivalent correlation matrix via the proposed correlation coefficients. Then, a clustering algorithm is expanded where data is expressed in q-ROPFL form with unknown weight information and is explained through an illustrative example. Besides, detailed parameter analysis and comparative study are performed with the existing approaches to reveal the effectiveness of the framed algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-29932-y"
    },
    {
        "id": 9697,
        "title": "A neighborhood-based robust clustering algorithm using Apollonius function kernel",
        "authors": "Shahin Pourbahrami",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123407"
    },
    {
        "id": 9698,
        "title": "HCLPars: Α New Hierarchical Clustering Log Parsing Method",
        "authors": "Arwa Bin Lashram, Lobna Hsairi, Haneen Al Ahmadi",
        "published": "2023-8-9",
        "citations": 1,
        "abstract": "Event logs are essential in many software systems’ maintenance and development, as detailed runtime information is recorded in them, allowing support engineers and developers to monitor systems, understand behaviors, and identify errors. With the increasing size and complexity of modern software systems, parsing their logs by the traditional (manual) method is cumbersome and useless. For this reason, recent studies have focused on automatically parsing log files. This paper presents the Hierarchical Clustering Log Parsing method, called HCLPars, for automatically parsing log files, consisting of 3 steps: parameter removal according to acquired knowledge in order to avoid errors, grouping similar raw log messages, and getting the set of keys that make up the log. Experiments were run on 16 real system log data, and the performance of the proposed algorithm was compared with the one of other 14 algorithms. It was shown that the HCLPars outperformed the other log parsers in terms of accuracy, efficiency, and robustness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48084/etasr.6013"
    },
    {
        "id": 9699,
        "title": "Data-driven Learning of Unsteady Flamelet Progress Variable Manifolds via Hierarchical Clustering and Grouped Multi-Target Artificial Neural Networks",
        "authors": "Tadbhagya Kumar, Ahmed Almeldein, Pinaki Pal, Islam Kabil",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-0801"
    },
    {
        "id": 9700,
        "title": "The hierarchical clustering method: abundance and properties of local satellite populations",
        "authors": "Chengyu Xi, James E Taylor",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "ABSTRACTThe faint satellites of the local Universe provide an important benchmark for our understanding of structure formation and galaxy formation, but satellite populations are hard to identify beyond the Local Group. We recently developed an iterative method to quantify satellite abundance using galaxy clustering and tested it on a local sample in the COSMOS field, where accurate photometric redshifts are available for a large number of faint objects. In this paper, we consider the properties of these satellite populations in more detail, studying the satellite stellar mass function (SSMF), the satellite-central connection, and quenching as a function of satellite and central mass and colour. Despite the limited sample size, our results show good consistency with those from much larger surveys and constrain the SSMF down to some of the lowest primary masses considered to date. We reproduce several known trends in satellite abundance and quenching, and find evidence for one new one, a dependence of the quiescent fraction on the primary-to-secondary halo mass ratio. We discuss the prospects for the clustering method in current and forthcoming surveys.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/mnras/stad769"
    },
    {
        "id": 9701,
        "title": "Cluster routing algorithm based on agglomerative hierarchical clustering in wireless sensor networks",
        "authors": "Hongbing Li, Hao Cui, Jun Ou, Yuning Wang",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2679327"
    },
    {
        "id": 9702,
        "title": "Mixed-Pose Positioning in Smartphone-Based Pedestrian Dead Reckoning Using Hierarchical Clustering",
        "authors": "Jingnan Tian, Li Cong, Honglei Qin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tim.2023.3326249"
    },
    {
        "id": 9703,
        "title": "Task allocation for optimal system cost using hierarchical clustering in distributed system",
        "authors": "Seema Yadav, Kanika Narang, Aastha Singh",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0199458"
    },
    {
        "id": 9704,
        "title": "Standard simplex induced clustering with hierarchical deep dictionary learning",
        "authors": "Ulises Rodríguez-Domínguez, Oscar Dalmau",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.image.2022.116918"
    }
]