[
    {
        "id": 17105,
        "title": "A comparative study of ensemble methods in the field of education: Bagging and Boosting algorithms",
        "authors": "Hikmet ŞEVGİN",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "This study aims to conduct a comparative study of Bagging and Boosting algorithms among ensemble methods and to compare the classification performance of TreeNet and Random Forest methods using these algorithms on the data extracted from ABİDE application in education. The main factor in choosing them for analyses is that they are Ensemble methods combining decision trees via Bagging and Boosting algorithms and creating a single outcome by combining the outputs obtained from each of them. The data set consists of mathematics scores of ABİDE (Academic Skills Monitoring and Evaluation) 2016 implementation and various demographic variables regarding students. The study group involves 5000 students randomly recruited.  On the deletion of loss data and assignment procedures, this number decreased to 4568. The analyses showed that the TreeNet method performed more successfully in terms of classification accuracy, sensitivity, F1-score and AUC value based on sample size, and the Random Forest method on specificity and accuracy. It can be alleged that the TreeNet method is more successful in all numerical estimation error rates for each sample size by producing lower values compared to the Random Forest method.  When comparing both analysis methods based on ABİDE data, considering all the conditions, including sample size, cross validity and performance criteria following the analyses, TreeNet can be said to exhibit higher classification performance than Random Forest. Unlike a single classifier or predictive method, the classification or prediction of multiple methods by using Boosting and Bagging algorithms is considered important for the results obtained in education.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21449/ijate.1167705"
    },
    {
        "id": 17106,
        "title": "Delamination Localization in the Composite Thin Plates Using Ensemble Learning: Bagging and Boosting Techniques",
        "authors": "Oguzhan Das, Duygu Bagci Das",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24200/sci.2023.59136.6072"
    },
    {
        "id": 17107,
        "title": "pdi-Bagging: A Proposal of Bagging-Type Ensemble Method Generating Virtual Data",
        "authors": "Honoka Irie, Isao Hayashi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011827600003393"
    },
    {
        "id": 17108,
        "title": "Application of Bagging, Boosting and Stacking Ensemble and EasyEnsemble Methods for Landslide Susceptibility Mapping in the Three Gorges Reservoir Area of China",
        "authors": "Xueling Wu, Junyang Wang",
        "published": "2023-3-11",
        "citations": 7,
        "abstract": "Since the impoundment of the Three Gorges Reservoir area in 2003, the potential risks of geological disasters in the reservoir area have increased significantly, among which the hidden dangers of landslides are particularly prominent. To reduce casualties and damage, efficient and precise landslide susceptibility evaluation methods are important. Multiple ensemble models have been used to evaluate the susceptibility of the upper part of Badong County to landslides. In this study, EasyEnsemble technology was used to solve the imbalance between landslide and nonlandslide sample data. The extracted evaluation factors were input into three bagging, boosting, and stacking ensemble models for training, and landslide susceptibility mapping (LSM) was drawn. According to the importance analysis, the important factors affecting the occurrence of landslides are altitude, terrain surface texture (TST), distance to residences, distance to rivers and land use. The influences of different grid sizes on the susceptibility results were compared, and a larger grid was found to lead to the overfitting of the prediction results. Therefore, a 30 m grid was selected as the evaluation unit. The accuracy, area under the curve (AUC), recall rate, test set precision, and kappa coefficient of a multi-grained cascade forest (gcForest) model with the stacking method were 0.958, 0.991, 0.965, 0.946, and 0.91, respectively, which a significantly better than the values produced by the other models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ijerph20064977"
    },
    {
        "id": 17109,
        "title": "Prediction of asphalt binder elastic recovery using tree-based ensemble bagging and boosting models",
        "authors": "Babak Asadi, Ramez Hajj",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.conbuildmat.2023.134154"
    },
    {
        "id": 17110,
        "title": "Application of machine learning boosting and bagging methods to predict compressive and flexural strength of marble cement mortar",
        "authors": "Zhiqiang Chen",
        "published": "2024-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mtcomm.2024.108600"
    },
    {
        "id": 17111,
        "title": "Estimation and comparison of gabion weir oxygen mass transfer by ensemble learnings of bagging, boosting, and stacking algorithms",
        "authors": "KM Luxmi, N. K Tiwari, S Ranjan",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/09715010.2023.2203109"
    },
    {
        "id": 17112,
        "title": "Bagging and Boosting Fine-Tuning for Ensemble Learning",
        "authors": "Changming Zhao, Ruimin Peng, Dongrui Wu",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tai.2023.3296685"
    },
    {
        "id": 17113,
        "title": "Multiclass Email Classification by Using  Ensemble Bagging and Ensemble Voting",
        "authors": "Ali Helmut, Danang Triantoro Murdiansyah",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "Email is a common communication technology in modern life. The more emails we receive, the more difficult and time consuming it is to sort them out. One solution to overcome this problem is to create a system using machine learning to sort emails. Each method of machine learning and data sampling result in different performance. Ensemble learning is a method of combining several learning models into one model to get better performance. In this study we tried to create a multiclass email classification system by combining learning models, data sampling, and several data classes to obtain the effect of Ensemble Bagging and Ensemble Voting methods on the performance of the macro average f1 score, and compare it with non-ensemble models. The results of this study show that the sensitivity of Naïve Bayes to imbalance data is helped by the Ensemble Bagging and Ensemble Voting method with ∆P (delta performance) of range 0.0001 – 0.0018. Logistic Regression has performance with Ensemble Bagging and Ensemble Voting by ∆P of range 0.0001-0.00015. Decision Tree has lowest performance compared to others with ∆P of -0.01",
        "keywords": "",
        "link": "http://dx.doi.org/10.33387/jiko.v6i2.6394"
    },
    {
        "id": 17114,
        "title": "Decomposition-Based Stacked Bagging Boosting Ensemble for Dynamic Line Rating Forecasting",
        "authors": "Amirhossein Ahmadi, Saman Taheri, Reza Ghorbani, Vahid Vahidinasab, Behnam Mohammadi-ivatloo",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpwrd.2023.3267511"
    },
    {
        "id": 17115,
        "title": "Prediction Model based on Bagging and Boosting Ensemble Technique for Decision Support System of Autonomous Smart IIoT Smart Aquaponic System",
        "authors": "Rani E Rodriguez, Joel T De Castro, Evans B Sansolis, Bobby D Gerardo, Yung-Cheol Byun",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\nThe aqua-agriculture food sector, challenged by climate change, exploited biodiversity, food insecurity, water crisis, and global pandemic, urgently needs the sustainability transition and more sustainable practices. Sustainability transitions aim to transform current patterns of production and consumption into sustainable ones while enhancing the ecological and economic situation. This agenda is much possible with the integration of IIoT and AI/ML into the aqua agriculture. In this study, the researchers integrated a Prediction Model based on Bagging and Boosting Ensemble Technique in the Decision Support System of an Autonomous Smart IIoT Smart Aquaponic System that autonomously monitored, controlled, and managed the aquaponic systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2559/1/012010"
    },
    {
        "id": 17116,
        "title": "Bagging and Voting Deep Learning Ensemble Methods for Binary Classifications of Solar Panel Cells Defects",
        "authors": "H. Tella, M. Mohandes, A. Al-Shaikhi, B. Liu, S. Rehman, H. Nuha",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssd58187.2023.10411247"
    },
    {
        "id": 17117,
        "title": "Comparing Boosting and Bagging Algorithms for Image Classification",
        "authors": "Chetan Chaudhary, Arun Gupta, R Murugan",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470582"
    },
    {
        "id": 17118,
        "title": "Evaluating and comparing bagging and boosting of hybrid learning for breast cancer screening",
        "authors": "Asma Zizaan, Ali Idri",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sciaf.2023.e01989"
    },
    {
        "id": 17119,
        "title": "CUDA-BASED PARALLELIZATION OF GRADIENT BOOSTING AND BAGGING ALGORITHM FOR DIAGNOSING DIABETES",
        "authors": "Lesia Mochurad",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "Data, its volume, structure, and form of presentation are among the most significant problems in working in the medical field. The probability of error is very high without innovative high-tech data analysis tools. It is easy to miss an important factor that is critical but lost among other, less important information. This work aims to study the proposed parallel gradient boosting algorithm in combination with the Bagging algorithm in the classification of diabetes to achieve greater stability and higher accuracy, reduce computational complexity and improve performance in medicine. The methods of parallelization of the Gradient Boosting algorithm in combination with the Bagging algorithm are investigated in the paper. Performance scores were obtained: approximately 7 using ThreadPoolExecutor and an eight-core computer system and 9.5 based on CUDA technology. Performance indicators that go to the unit are calculated. This, in turn, confirms the effectiveness of the proposed parallel algorithm. Another significant result of the study is improving algorithm accuracy by increasing the number of algorithms in the composition. The problem of diagnosing a patient's diabetes based on specific measurements included in the data set is considered. Detailed analysis and pre-processing of the selected dataset were performed. The parallelization of the proposed algorithm is implemented using the multi-core architecture of modern computers and CUDA technology. The process of learning models and training samples was parallelized. The theoretical estimation of the computational complexity of the offered parallel algorithm is given. A comparison of serial and parallel algorithm execution time using ThreadPoolExecutor when varying the number of threads and algorithms in the composition is presented. And also, the comparative analysis of time expenses at consecutive and parallel execution based on CPU and GPU is carried out.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31891/csit-2023-2-1"
    },
    {
        "id": 17120,
        "title": "An Ensemble Approach to Short-Term Wind Speed Predictions Using Stochastic Methods, Wavelets and Gradient Boosting Decision Trees",
        "authors": "Khathutshelo Steven Sivhugwana, Edmore Ranganai",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "Considering that wind power is proportional to the cube of the wind speed variable, which is highly random, complex power grid management tasks have arisen as a result. Wind speed prediction in the short term is crucial for load dispatch planning and load increment/decrement decisions. The chaotic intermittency of speed is often characterised by inherent linear and nonlinear patterns, as well as nonstationary behaviour; thus, it is generally difficult to predict it accurately and efficiently using a single linear or nonlinear model. In this study, wavelet transform (WT), autoregressive integrated moving average (ARIMA), extreme gradient boosting trees (XGBoost), and support vector regression (SVR) are combined to predict high-resolution short-term wind speeds obtained from three Southern African Universities Radiometric Network (SAURAN) stations: Richtersveld (RVD); Central University of Technology (CUT); and University of Pretoria (UPR). This hybrid model is termed WT-ARIMA-XGBoost-SVR. In the proposed hybrid, the ARIMA component is employed to capture linearity, while XGBoost captures nonlinearity using the wavelet decomposed subseries from the residuals as input features. Finally, the SVR model reconciles linear and nonlinear predictions. We evaluated the WT-ARIMA-XGBoost-SVR’s efficacy against ARIMA and two other hybrid models that substitute XGBoost with a light gradient boosting machine (LGB) component to form a WT-ARIMA-LGB-SVR hybrid model and a stochastic gradient boosting machine (SGB) to form a WT-ARIMA-SGB-SVR hybrid model. Based on mean absolute error (MAE), mean absolute percentage error (MAPE), root mean square error (RMSE), coefficient of determination (R2), and prediction interval normalised average width (PINAW), the proposed hybrid model provided more accurate and reliable predictions with less uncertainty for all three datasets. This study is critical for improving wind speed prediction reliability to ensure the development of effective wind power management strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/wind4010003"
    },
    {
        "id": 17121,
        "title": "Harnessing Diversity in Face Recognition: A Voting and Bagging Ensemble Approach",
        "authors": "Aniket Gupta, Suthir Sriram, V Nivethitha",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/autocom60220.2024.10486188"
    },
    {
        "id": 17122,
        "title": "Stacking-Enhanced Bagging Ensemble Learning for Breast Cancer Classification with CNN",
        "authors": "Peicheng Wu, Runze Ma, Teoh Teik Toe",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceem58740.2023.10319517"
    },
    {
        "id": 17123,
        "title": "Engineering College Admission Predictor Using Bagging Ensemble Modelling",
        "authors": "Mangesh Balpande, Sushrut Patil, Vedant Ranalkar, Gayatri Rana, Aadil Shaikh",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic457434.2024.10486717"
    },
    {
        "id": 17124,
        "title": "Hybrid Approach to Predict Prostate Cancer by IPCA Analysis with Boosting and Bagging Classifier",
        "authors": "Gundloori Mubarak, Rajabhushanam C",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10182926"
    },
    {
        "id": 17125,
        "title": "Email spam detection using bagging and boosting of machine learning classifiers",
        "authors": "Uma Bhardwaj, Priti Sharma",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijaip.2023.128084"
    },
    {
        "id": 17126,
        "title": "Predictive Modeling of Osteoporosis Risk Factors using XGBoost and Bagging Ensemble Technique",
        "authors": "I Irmawati, Eka Herdit Juningsih, Y Yanto",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "This study presents a predictive modeling framework for osteoporosis risk assessment using ensemble techniques, specifically XGBoost and Bagging. Leveraging a dataset comprising comprehensive health factors influencing osteoporosis development, including demographic details, lifestyle choices, medical history, and bone health indicators, the aim is to facilitate accurate identification of individuals at risk. The dataset consists of 1958 samples, evenly distributed between osteoporosis-positive and osteoporosis-negative cases. The methodology involves the separation of features and labels, followed by data splitting into training and testing sets. XGBoost, a powerful gradient boosting algorithm, is employed as the base estimator within a Bagging ensemble, enhancing predictive accuracy and generalization. The model is trained on the training set and evaluated using cross-validation techniques to ensure robustness and mitigate overfitting. The results of the classification report demonstrate promising performance metrics, with an overall accuracy of 88% on the test set. Precision and recall scores indicate strong predictive capabilities, particularly in correctly identifying osteoporosis-positive cases. The novel integration of XGBoost within a Bagging ensemble provides an innovative approach to osteoporosis risk prediction, harnessing the strengths of both algorithms to improve model performance. This research contributes to the advancement of osteoporosis management and prevention strategies by providing a reliable tool for early risk assessment. The combination of machine learning techniques with comprehensive health data offers a valuable approach to personalized healthcare, enabling targeted interventions and optimized resource allocation. Ultimately, this study aims to enhance patient outcomes and reduce the burden of osteoporosis-related morbidity and mortality.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37034/medinftech.v2i1.27"
    },
    {
        "id": 17127,
        "title": "Comparative Analysis for Detecting Malicious packets in LAN Network using Bagging and Boosting Techniques",
        "authors": "A.Vinitha, B. Rosiline Jeetha",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "The security is the important one in sharing the data through the network. The intrusion detection system helps to classify the data as the normal or anomaly by using the machine learning algorithms. There is the large pool of machine learning algorithms which helps to find the anomaly.  The algorithms have to find the connection that is normal or abnormal. The attacks are classified into four categories. Using the machine learning algorithm, the prediction is done to classify the packet as the normal or anomaly. The dataset used in this paper is communication of the LAN network which is happened in the very sensitive environments like military and Airforce. Various models are used to predict the anomaly but the bagging performs well in predicting the anomaly. There are various features associated in the dataset which helps to classify the network connection. The algorithms like adaboost was done with 10 iteration and the time for execution is 1.55 seconds and the accuracy are 94 %, bagging the time taken to execute the algorithm is 2.27 seconds, accuracy is 99%. Among these two algorithms the bagging performs well in predicting the abnormal data. Totally 42 attributes have been taken for the training and the testing purposes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/tjjpt.v44.i3.724"
    },
    {
        "id": 17128,
        "title": "Email spam detection using bagging and boosting of machine learning classifiers",
        "authors": "Priti Sharma, Uma Bhardwaj",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijaip.2023.10052961"
    },
    {
        "id": 17129,
        "title": "An efficient quantum algorithm for ensemble classification using bagging",
        "authors": "Antonio Macaluso, Luca Clissa, Stefano Lodi, Claudio Sartori",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "AbstractEnsemble methods aggregate predictions from multiple models, typically demonstrating improved accuracy and reduced variance compared to individual classifiers. However, they often come with significant memory usage and computational time requirements. A novel quantum algorithm that leverages quantum superposition, entanglement, and interference to construct an ensemble of classification models using bagging as an aggregation strategy is introduced. Through the generation of numerous quantum trajectories in superposition, the authors achieve B transformations of the training set with only  operations, allowing an exponential enlargement of the ensemble size while linearly increasing the depth of the corresponding circuit. Moreover, when assessing the algorithm's overall cost, the authors demonstrate that the training of a single weak classifier contributes additively to the overall time complexity, as opposed to the multiplicative impact commonly observed in classical ensemble methods. To illustrate the efficacy of the authors’ approach, experiments on reduced real‐world datasets utilising the IBM qiskit environment to demonstrate the functionality and performance of the proposed algorithm are introduced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/qtc2.12087"
    },
    {
        "id": 17130,
        "title": "Performance Analysis of Machine Learning Algorithms Using Bagging Ensemble Technique for Software Fault Prediction",
        "authors": "Roshan Samantaray, Himansu Das",
        "published": "2023-3-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscon57294.2023.10111952"
    },
    {
        "id": 17131,
        "title": "Benchmarking the Bagging and Boosting (B &amp; B) Algorithms for Modeling Optimized Autonomous Intrusion Detection Systems (AIDS)",
        "authors": "Shreya Upadhyaya, Deepti Mehrotra",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01914-x"
    },
    {
        "id": 17132,
        "title": "Bagging Ensemble Based on Multi-Layer Perceptron Neural Network for Landslide Susceptibility Assessment",
        "authors": "Matougui Zakaria, Djerbal Lynda, Bahar Ramdane",
        "published": "2023-5-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceogi57454.2023.10292962"
    },
    {
        "id": 17133,
        "title": "Bagging or boosting? Empirical evidence from financial statement fraud detection",
        "authors": "Xiaowei Chen, Cong Zhai",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractEnsemble learning, specifically bagging and boosting, has been widely used in the financial field for detecting financial fraud, but their relative performance still lacks consensus. This study compares the performance of five ensemble learning models based on bagging and boosting, using data from Chinese A‐share listed companies from 2012 to 2022, including the COVID‐19 pandemic period. Results show that bagging outperforms boosting in various evaluation indicators, with profitability and asset quality positively affecting financial fraud. This study reveals the mechanism by which ensemble learning affects financial fraud detection and expands related research in the financial field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/acfi.13159"
    },
    {
        "id": 17134,
        "title": "Spatial bagging to integrate spatial correlation into ensemble machine learning",
        "authors": "Fehmi Özbayrak, John T. Foster, Michael J. Pyrcz",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cageo.2024.105558"
    },
    {
        "id": 17135,
        "title": "Bagging and Boosting for Predicting Bank Customer Churn",
        "authors": "Dinda Dwi Ninditha Silalahi,  Marsella, Alexandro Alvin Valentino, Ivan Sebastian Edbert, Derwin Suhartono",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icamimia60881.2023.10427686"
    },
    {
        "id": 17136,
        "title": "Remaining Useful Life Estimation based on Noise Injection and a Kalman Filter Ensemble of modified Bagging Predictors",
        "authors": "",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3837/tiis.2023.12.002"
    },
    {
        "id": 17137,
        "title": "Evaluation of Tree-based Ensemble Bagging for Vehicle Fall Detection",
        "authors": "Moh Asif Sheikh, Kathansh Jain, Mohd. Suhail, Ravi Dhaundiyal, Tarun Kumar",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10398129"
    },
    {
        "id": 17138,
        "title": "Ensemble Bagging Discriminant and Logistic Regression in Classification Analysis",
        "authors": " Solimun, Adji Achmad Rinaldo Fernandes",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": " The main problem that often becomes a challenge in classification analysis is a class imbalance, for example, in bank credit collectability where performing loans (PL) are 5% and non-performing loans (NPL) are 95%. The purpose of this research is to develop a classification model for the imbalance of collectibility data on Bank X mortgage credit. The analysis developed is Ensemble on Discriminant Analysis and Logistic Regression. The ensemble used in this study is Bagging (Bootstrap Aggregating). The data used are secondary data on bank X mortgage credit collectibility with a sample of [Formula: see text] = 100 and simulation data. Generated data with [Formula: see text] = 1000 and consists of two scenarios, namely, data with unbalanced classes (50:950) and data with balanced classes (500:500). Evaluation of the classification model is seen from the accuracy, sensitivity, and specificity. The results of classification analysis with Ensemble using Bagging Discriminant and Logistic Regression Bagging on secondary data and simulations are better than ordinary Discriminant Analysis and Logistic Regression. The sensitivity and specificity of the credit collectibility classification using Bagging Discriminant and Logistic Regression Bagging are also higher. The originality in this study is in the form of an Ensemble model using Bagging Discriminant and Logistic Regression which can improve the performance of classification analysis and has implications for reducing risk both for banks and for Bank X KPR customers. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1793005725500061"
    },
    {
        "id": 17139,
        "title": "An Optimized Bagging Learning with Ensemble Feature Selection Method for URL Phishing Detection",
        "authors": "Ponni Ponnusamy, Prabha Dhandayudam",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42835-023-01680-z"
    },
    {
        "id": 17140,
        "title": "Deep Recurrent Speeded Robust Feature Learning Based Bagging Ensemble Multinomial Regressive Cancer Classification Using Mammograms",
        "authors": "K. Sai Krishna, P. Grace Kanmani Prince",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390000"
    },
    {
        "id": 17141,
        "title": "An Optimized Bagging Ensemble Learning Approach Using BESTrees for Predicting Students’ Performance",
        "authors": "Edmund Evangelista",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "Every academic institution's goal is to identify students who require additional assistance and take appropriate actions to improve their performance. As such, various research studies have focused on developing prediction models that can detect correlated patterns influencing students' performance, dropout, collaboration, and engagement. Among the influential predictive models available, the bagging ensemble has captured the interest of researchers seeking to improve prediction accuracy over single classifiers. However, prior work in this area has focused mainly on selecting single classifiers as the base classifier of the bagging ensemble, with little to no further optimization of the proposed framework. This study aims to fill this gap by providing a bagging ensemble framework to optimize its hyperparameters and achieve improved prediction accuracy. The proposed model used the Weka BESTrees data mining tool and Math language course student dataset from UCI Machine Learning Repository. Based on the experiments performed, the proposed bagging optimization technique can effectively increase the accuracy of a traditional bagging ensemble method. It reveals further that the proposed BESTrees framework can achieve an optimized performance when trained with the appropriate hyperparameters and hill climb metrics.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3991/ijet.v18i10.38115"
    },
    {
        "id": 17142,
        "title": "Prediction of gross calorific value from coal analysis using decision tree-based bagging and boosting techniques",
        "authors": "Tanveer Alam Munshi, Labiba Nusrat Jahan, M. Farhad Howladar, Mahamudul Hashan",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2023.e23395"
    },
    {
        "id": 17143,
        "title": "Text length considered adaptive bagging ensemble learning algorithm for text classification",
        "authors": "Youwei Wang, Jiangchun Liu, Lizhou Feng",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14578-9"
    },
    {
        "id": 17144,
        "title": "Implementation of Bagging Ensemble Deep Covnets for Iron Ore Image Characterization",
        "authors": "Uttam Kumar, Subrajeet Mohapatra, Prabodha Ranjan Sahoo",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10307661"
    },
    {
        "id": 17145,
        "title": "Optimization of C4.5 algorithm using information gain and bagging ensemble for diagnose of breast cancer",
        "authors": "Bina Estherly, Budi Prasetiyo",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0125942"
    },
    {
        "id": 17146,
        "title": "Hyperparameter tuning of supervised bagging ensemble machine learning model using Bayesian optimization for estimating stormwater quality",
        "authors": "Mohammadreza Moeini",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40899-024-01064-9"
    },
    {
        "id": 17147,
        "title": "A novel deep learning-based brain tumor detection using the Bagging ensemble with K-nearest neighbor",
        "authors": "K. V. Archana, G. Komarasamy",
        "published": "2023-1-19",
        "citations": 7,
        "abstract": "Abstract\nIn the case of magnetic resonance imaging (MRI) imaging, image processing is crucial. In the medical industry, MRI images are commonly used to analyze and diagnose tumor growth in the body. A number of successful brain tumor identification and classification procedures have been developed by various experts. Existing approaches face a number of obstacles, including detection time, accuracy, and tumor size. Early detection of brain tumors improves options for treatment and patient survival rates. Manually segmenting brain tumors from a significant number of MRI data for brain tumor diagnosis is a tough and time-consuming task. Automatic image segmentation of brain tumors is required. The objective of this study is to evaluate the degree of accuracy and simplify the medical picture segmentation procedure used to identify the type of brain tumor from MRI results. Additionally, this work suggests a novel method for identifying brain malignancies utilizing the Bagging Ensemble with K-Nearest Neighbor (BKNN) in order to raise the KNN’s accuracy and quality rate. For image segmentation, a U-Net architecture is utilized first, followed by a bagging-based k-NN prediction algorithm for classification. The goal of employing U-Net is to improve the accuracy and uniformity of parameter distribution in the layers. Each decision tree is fitted on a little different training dataset during classification, and the bagged decision trees are effective since each tree has minor differences and generates slightly different skilled predictions. The overall classification accuracy was up to 97.7 percent, confirming the efficiency of the suggested strategy for distinguishing normal and pathological tissues from brain MR images; this is greater than the methods that are already in use.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jisys-2022-0206"
    },
    {
        "id": 17148,
        "title": "Dual-IDS: A bagging-based gradient boosting decision tree model for network anomaly intrusion detection system",
        "authors": "Maya Hilda Lestari Louk, Bayu Adhi Tama",
        "published": "2023-3",
        "citations": 49,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.119030"
    },
    {
        "id": 17149,
        "title": "Estimating ensemble weights for bagging regressors based on the mean–variance portfolio framework",
        "authors": "Javier Pérez-Rodríguez, Francisco Fernández-Navarro, Thomas Ashley",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120462"
    },
    {
        "id": 17150,
        "title": "An Empirical Study to Analyse The Effect of Bagging and Feature Subspacing on The Performance of A Custom Ensemble Algorithm for Predicting Drug Protein Interactions",
        "authors": "Harshita Bhargava,  , Amita Sharma, Prashanth Suravajhala",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Objectives: The objective of this study is to analyse the effect of bagging and feature subspacing on the performance of a custom ensemble of decision tree classifiers for predicting drug protein interactions. Methods: In our present work we have designed a custom ensemble algorithm with decision trees as the base learner. We analysed the effect of bagging negative samples and feature subspacing on the performance of the custom ensemble in terms of AUCROC and AUPR. The Enzyme dataset from the Yamanishi dataset composed of 445 drugs and 664 proteins was used for the experiments. Findings: It was observed that the effect of bagging negative samples was significant as compared to feature supspacing in terms of AUPR metric. Now since AUPR is a metric that remains unaffected by the presence of negative samples hence the increase in AUPR by increasing the negative to positive ratio clearly indicated that the negative samples do contain the positives which are unknown and are yet to be verified. Novelty: The results give a strong indication that that feature subspacing has no considerable impact on the AUCROC metric performance of the custom ensemble while AUPR metric increases as the negative to positive ratio increases. The results give a foundation to the fact that, finding reliable negative samples from the entire set of negative drug protein pairs can further enhance the performance of the machine learning classifiers.  Keywords: Decision tree classifier, Ensemble classifier, Drug discovery, Bagging, Drug repurposing",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v17i10.3202"
    },
    {
        "id": 17151,
        "title": "Prediction model for rice husk ash concrete using AI approach: Boosting and bagging algorithms",
        "authors": "Muhammad Nasir Amin, Bawar Iftikhar, Kaffayatullah Khan, Muhammad Faisal Javed, Abdullah Mohammad AbuArab, Muhammad Faisal Rehman",
        "published": "2023-4",
        "citations": 42,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.istruc.2023.02.080"
    },
    {
        "id": 17152,
        "title": "Performance-based drift prediction of reinforced concrete shear wall using bagging ensemble method",
        "authors": "Bu-Seog Ju, Shinyoung Kwag, Sangwoo Lee",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.net.2023.05.008"
    },
    {
        "id": 17153,
        "title": "Which are best for successful aging prediction? Bagging, boosting, or simple machine learning algorithms?",
        "authors": "Razieh Mirzaeian, Raoof Nopour, Zahra Asghari Varzaneh, Mohsen Shafiee, Mostafa Shanbehzadeh, Hadi Kazemi-Arpanahi",
        "published": "2023-8-29",
        "citations": 1,
        "abstract": "Abstract\nBackground\nThe worldwide society is currently facing an epidemiological shift due to the significant improvement in life expectancy and increase in the elderly population. This shift requires the public and scientific community to highlight successful aging (SA), as an indicator representing the quality of elderly people’s health. SA is a subjective, complex, and multidimensional concept; thus, its meaning or measuring is a difficult task. This study seeks to identify the most affecting factors on SA and fed them as input variables for constructing predictive models using machine learning (ML) algorithms.\n\nMethods\nData from 1465 adults aged ≥ 60 years who were referred to health centers in Abadan city (Iran) between 2021 and 2022 were collected by interview. First, binary logistic regression (BLR) was used to identify the main factors influencing SA. Second, eight ML algorithms, including adaptive boosting (AdaBoost), bootstrap aggregating (Bagging), eXtreme Gradient Boosting (XG-Boost), random forest (RF), J-48, multilayered perceptron (MLP), Naïve Bayes (NB), and support vector machine (SVM), were trained to predict SA. Finally, their performance was evaluated using metrics derived from the confusion matrix to determine the best model.\n\nResults\nThe experimental results showed that 44 factors had a meaningful relationship with SA as the output class. In total, the RF algorithm with sensitivity = 0.95 ± 0.01, specificity = 0.94 ± 0.01, accuracy = 0.94 ± 0.005, and F-score = 0.94 ± 0.003 yielded the best performance for predicting SA.\n\nConclusions\nCompared to other selected ML methods, the effectiveness of the RF as a bagging algorithm in predicting SA was significantly better. Our developed prediction models can provide, gerontologists, geriatric nursing, healthcare administrators, and policymakers with a reliable and responsive tool to improve elderly outcomes.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12938-023-01140-9"
    },
    {
        "id": 17154,
        "title": "Improving k-Nearest Neighbors Model using SMOTE with Bagging Ensemble",
        "authors": "Ivana Meiska, Syifa Melinda Naf'an, Ig. Prasetya Dwi Wibawa, Meta Kallista, Brilliant Friezka Aina, Asif Awaludin",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/apwimob59963.2023.10365600"
    },
    {
        "id": 17155,
        "title": "Peripheral Pulmonary Lesions Classification Using Endobronchial Ultrasonography Images Based on Bagging Ensemble Learning and Down-Sampling Technique",
        "authors": "Huitao Wang, Kohei Shikano, Takahiro Nakajima, Yukihiro Nomura, Toshiya Nakaguchi",
        "published": "2023-7-20",
        "citations": 2,
        "abstract": "Lung cancer is the second most common cancer in the world, with an average five-year survival rate of 15 percent. Approximately 238,340 people were diagnosed in the US in 2023 based on the estimation of the American Cancer Society, and 127,070 people died from it. Cancer has always been a big problem for scientists. There has never been a good solution. So, the early detection of cancer is particularly important. In recent years, endobronchial ultrasonography (EBUS) images have been used more and more in the diagnosis of lung cancer because of their advantages of good real-time performance, no radiation, and superior performance. This research aims to develop a computer-aided diagnosis (CAD) system to differentiate benign and malignant peripheral pulmonary lesions (PPLs). The efficacy of this framework was evaluated on a dataset comprising 69 cases of lung carcinoma, encompassing 59 malignant instances and 10 benign cases. The final experimental results of accuracy, F1-Score, AUC, PPV, NPV, sensitivity, and specificity were 0.7, 0.63, 0.75, 0.84, 0.68, 0.56, and 0.85, respectively. From the experiment results, the developed CAD system has the potential ability to diagnose PPLs by using the EBUS images based on Deep Learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13148403"
    },
    {
        "id": 17156,
        "title": "Fake News Detection Using Boosting Ensemble Method",
        "authors": "Kirandeep Kaur, Nirbhay Kashyap",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/confluence60223.2024.10463421"
    },
    {
        "id": 17157,
        "title": "FAKE NEWS MULTI CLASS DETECTION USING TRANSFORMERS AND GRADIENT BOOSTING ENSEMBLE",
        "authors": "",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49747"
    },
    {
        "id": 17158,
        "title": "Ensemble Boosting Algorithms for Software Defect Prediction",
        "authors": "Dusa Sai Kiran, Ramesh Ponnala",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10466047"
    },
    {
        "id": 17159,
        "title": "Covid-19 Risk Prediction with Ensemble Boosting Algorithms",
        "authors": "Asli Gode, Emrah Hancer, Melike Siseci Cesmeli",
        "published": "2023-10-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/asyu58738.2023.10296689"
    },
    {
        "id": 17160,
        "title": "Boosting and bagging classification for computer science journal",
        "authors": "Nastiti Susetyo Fanany Putri, Aji Prasetya Wibawa, Harits Ar Rasyid, Andrew Nafalski, Ummi Rabaah Hasyim",
        "published": "2023-3-15",
        "citations": 2,
        "abstract": "In recent years, data processing has become an issue across all disciplines. Good data processing can provide decision-making recommendations. Data processing is covered in academic data processing publications, including those in computer science. This topic has grown over the past three years, demonstrating that data processing is expanding and diversifying, and there is a great deal of interest in this area of study. Within the journal, groupings (quartiles) indicate the journal's influence on other similar studies. SCImago provides this category. There are four quartiles, with the highest quartile being 1 and the lowest being 4. There are, however, numerous differences in class quartiles, with different quartile values for the same journal in different disciplines. Therefore, a method of categorization is provided to solve this issue. Classification is a machine-learning technique that groups data based on the supplied label class. Ensemble Boosting and Bagging with Decision Tree (DT) and Gaussian Nave Bayes (GNB) were utilized in this study. Several modifications were made to the ensemble algorithm's depth and estimator settings to examine the influence of adding values on the resultant precision. In the DT algorithm, both variables are altered, whereas, in the GNB algorithm, just the estimator's value is modified. Based on the average value of the accuracy results, it is known that the best algorithm for computer science datasets is GNB Bagging, with values of 68.96%, 70.99%, and 69.05%. Second-place XGBDT has 67.75% accuracy, 67.69% precision, and 67.83 recall. The DT Bagging method placed third with 67.31 percent recall, 68.13 percent precision, and 67.30 percent accuracy. The fourth sequence is the XGBoost GNB approach, which has an accuracy of 67.07%, a precision of 68.85%, and a recall of 67.18%. The Adaboost DT technique ranks in the fifth position with an accuracy of 63.65%, a precision of 64.21 %, and a recall of 63.63 %. Adaboost GNB is the least efficient algorithm for this dataset since it only achieves 43.19 % accuracy, 48.14 % precision, and 43.2% recall. The results are still quite far from the ideal. Hence the proposed method for journal quartile inequality issues is not advised.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26555/ijain.v9i1.985"
    },
    {
        "id": 17161,
        "title": "CART Classification on Ordinal Scale Data with Unbalanced Proportions using Ensemble Bagging Approach",
        "authors": "Luthfia Hanun Yuli Arini, Solimun Solimun, Achmad Efendi, Mohammad Ohid Ullah",
        "published": "2024-3-30",
        "citations": 0,
        "abstract": "CART is one of the algorithms in data exploration techniques with decision tree techniques. Unbalanced class proportions in the classification process can cause classification results of minor data to be incorrect. One way to overcome the problem of data imbalance is to use an ensemble bagging algorithm. The bagging algorithm utilizes the resampling method to carry out classification so that it can reduce bias in imbalanced data. The data used is secondary data from Fernandes and Solimun's 2023 research report. The number of sample are 100 respondents that has been valid and reliable. The sample for this research was mothers with toddlers in Wajak village, Malang Regency. The results showed that the ensemble bagging CART method is better at overcoming the problem of imbalance in the proportion of classes with a performance value of accuracy, sensitivity, specificity, and F1-Score values of 85%, 94.1%, 66.7%, and 78%. This research is limited to the Sumberputih Village area. So, the results of this research are only representative for the Wajak District area. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/jtam.v8i2.20201"
    },
    {
        "id": 17162,
        "title": "Boosting Predictive Power: Random Forest and Gradient Boosted Trees in Ensemble Learning",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-proceedings.133"
    },
    {
        "id": 17163,
        "title": "A Technical Comparative Heart Disease Prediction Framework Using Boosting Ensemble Techniques",
        "authors": "Najmu Nissa, Sanjay Jamwal, Mehdi Neshat",
        "published": "2024-1-16",
        "citations": 0,
        "abstract": "This paper addresses the global surge in heart disease prevalence and its impact on public health, stressing the need for accurate predictive models. The timely identification of individuals at risk of developing cardiovascular ailments is paramount for implementing preventive measures and timely interventions. The World Health Organization (WHO) reports that cardiovascular diseases, responsible for an alarming 17.9 million annual fatalities, constitute a significant 31% of the global mortality rate. The intricate clinical landscape, characterized by inherent variability and a complex interplay of factors, poses challenges for accurately diagnosing the severity of cardiac conditions and predicting their progression. Consequently, early identification emerges as a pivotal factor in the successful treatment of heart-related ailments. This research presents a comprehensive framework for the prediction of cardiovascular diseases, leveraging advanced boosting techniques and machine learning methodologies, including Cat boost, Random Forest, Gradient boosting, Light GBM, and Ada boost. Focusing on “Early Heart Disease Prediction using Boosting Techniques”, this paper aims to contribute to the development of robust models capable of reliably forecasting cardiovascular health risks. Model performance is rigorously assessed using a substantial dataset on heart illnesses from the UCI machine learning library. With 26 feature-based numerical and categorical variables, this dataset encompasses 8763 samples collected globally. The empirical findings highlight AdaBoost as the preeminent performer, achieving a notable accuracy of 95% and excelling in metrics such as negative predicted value (0.83), false positive rate (0.04), false negative rate (0.04), and false development rate (0.01). These results underscore AdaBoost’s superiority in predictive accuracy and overall performance compared to alternative algorithms, contributing valuable insights to the field of cardiovascular health prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computation12010015"
    },
    {
        "id": 17164,
        "title": "Predicting traffic crash severity using hybrid of balanced bagging classification and light gradient boosting machine",
        "authors": "Jovial Niyogisubizo, Lyuchao Liao, Fumin Zou, Guangjie Han, Eric Nziyumva, Ben Li, Yuyuan Lin",
        "published": "2023-1-30",
        "citations": 2,
        "abstract": "Accident severity prediction is a hot topic of research aimed at ensuring road safety as well as taking precautionary measures for anticipated future road crashes. In the past decades, both classical statistical methods and machine learning algorithms have been used to predict traffic crash severity. However, most of these models suffer from several drawbacks including low accuracy, and lack of interpretability for people. To address these issues, this paper proposed a hybrid of Balanced Bagging Classification (BBC) and Light Gradient Boosting Machine (LGBM) to improve the accuracy of crash severity prediction and eliminate the issues of bias and variance. To the best of the author’s knowledge, this is one of the pioneer studies which explores the application of BBC-LGBM to predict traffic crash severity. On the accident dataset of Great Britain (UK) from 2013 to 2019, the proposed model has demonstrated better performance when compared with other models such as Gaussian Naïve Bayes (GNB), Support vector machines (SVM), and Random Forest (RF). More specifically, the proposed model managed to achieve better performance among all metrics for the testing dataset (accuracy = 77.7%, precision = 75%, recall = 73%, F1-Score = 68%). Moreover, permutation importance is used to interpret the results and analyze the importance of each factor influencing crash severity. The accuracy-enhanced model is significant to several stakeholders including drivers for early alarm and government departments, insurance companies, and even hospitals for the services concerned about human lives and property damage in road crashes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/ida-216398"
    },
    {
        "id": 17165,
        "title": "A Bagging Ensemble Algorithm for Seasonal Time Series Forecasting",
        "authors": "Bhupendra Kumar, Neha Yadav,  Sunil",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-024-02648-0"
    },
    {
        "id": 17166,
        "title": "Exploring Model Learning Heterogeneity for Boosting Ensemble Robustness",
        "authors": "Yanzhao Wu, Ka-Ho Chow, Wenqi Wei, Ling Liu",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdm58522.2023.00074"
    },
    {
        "id": 17167,
        "title": "AnomalyBAGS: Bagging-based Ensemble Learning with Time-Series-to-Image Transformations for Robust Anomaly Detection",
        "authors": "Fatih S. Bayram, Mohamed Dwedar, Aleksandra Melke, Roland Schneider, Roman Radtke, Alexander Jesser",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetas59148.2023.10346596"
    },
    {
        "id": 17168,
        "title": "Deep learning-based active contour technique with bagging and boosting algorithms hybrid approach for detecting bone Cancer from Mri scan images",
        "authors": "Ediga Lingappa, L Rama Parvathy",
        "published": "2023-9",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14811-5"
    },
    {
        "id": 17169,
        "title": "Study of Methods for Improving the Meta-Algorithm of the Bagging Classifier",
        "authors": "Svitlana Gavrylenko, Oleksii Hornostal",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/khpiweek61412.2023.10312977"
    },
    {
        "id": 17170,
        "title": "Detecting Parkinson's disease from Speech signals using Boosting Ensemble Techniques",
        "authors": "P. Deepa, Rashmita Khilar",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceconf57129.2023.10083634"
    },
    {
        "id": 17171,
        "title": "Recognition of Retinopathy Images Through Bagging Ensemble with Homogeneous Tree-Based Classifiers",
        "authors": "Yunli Lee,  , Siew Fan Wong,  ",
        "published": "2023-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59567/ktaml.v1.01.01"
    },
    {
        "id": 17172,
        "title": "Bagging R-CNN: Ensemble for Object Detection in Complex Traffic Scenes",
        "authors": "Pengteng Li, Ying He, Dongfu Yin, F Richard Yu, Pinhao Song",
        "published": "2023-6-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10097085"
    },
    {
        "id": 17173,
        "title": "Classification of Mushroom Data Set by Ensemble Methods",
        "authors": "Şahin Yildirim, Mehmet Safa Bingöl",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "Due to disease of mushrooms, it is very important to classify mushrooms for predicting the best quality mushrooms. There are many methods to analyse the main parts of mushrooms. For above mentioned descriptions; in this simulation study five types of classification algorithm are employed to predict the structure of mushrooms. Mushroom dataset is used to predict the classes of mushrooms. The results are improved that these methods will be used to predict exact mushrooms features and classifications in real time approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17667/riim.2020.1/3."
    },
    {
        "id": 17174,
        "title": "Design Thinking Approach for Dimensionality Reduction using Ensemble Gradient Boosting Algorithm",
        "authors": "N. Selva Kumar, D. Kalaivani",
        "published": "2023-8-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220873"
    },
    {
        "id": 17175,
        "title": "Sentimental Analysis of YouTube Video Comments Using Bagging Ensemble Learning Approach",
        "authors": "Mr.Rajendra prasad .K,  ",
        "published": "2023-4-16",
        "citations": 0,
        "abstract": "An important indicator that shows how well-liked a YouTube video is by its viewers is the like ratio. By examining the emotive tone of viewer comments, sentiment analysis can be used to forecast the like ratio of a YouTube video. With this method, the YouTube API is used to first get the comments from the video. Following that, these comments are pre-processed to eliminate any unnecessary data, including URLs and special characters, and to change the text's case to lowercase. The pre-processed comments are then subjected to sentiment analysis using a natural language processing package, such as TextBlob or NLTK, to categorise them as positive, negative, or neutral. The like ratio can be estimated after sentiment analysis by measuring the percentage of positive comments to all comments. This can be used to determine how viewers feel about the video overall and forecast whether the film will have a high or low like ratio. Overall, forecasting the like ratio of a YouTube video using sentiment analysis can offer insightful information for content producers and marketers, assisting them in understanding the emotional response of their audience and improving their content accordingly. KEYWORDS: Text mining, Sentimental Analysis, Youtube, NLTK, Machine Learing Processing",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/isjem00336"
    },
    {
        "id": 17176,
        "title": "A Novel IoT-based Framework for Urine Infection Detection and Prediction using Ensemble Bagging Decision Tree Classifier",
        "authors": "Anisha Anisha, Munish Sabharwal, Rohit Tripathi",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "One of the most common conditions treated in adult primary care medicine is Urinary Tract Infection (UTI), which accounts for a sizeable portion of antibiotic prescriptions. A high degree of diagnostic accuracy is necessary because this issue is so prevalent and important in everyday clinical practice. Particularly in light of the rising prevalence of antibiotic resistance, excessive antibiotic prescriptions should be avoided. To examine the machine learning approach and Internet of Things (IoT) for urinary tract infections, this research proposes an Ensemble Bagging Decision Tree Classifier (EBDTC). In our study, to learn more about UTI, we conducted a study in which we collected the physiological data of 399 patients and preprocessed them using the min-max scalar normalization. Feature extraction using Principle Component Analysis (PCA) and classification using Ensemble Bagging Decision Tree Classifier (EBDTC). The performance outcomes of accuracy (96.25%), precision(96.22%), recall (98.07%), and f-1 measure(97.17%) demonstrate the proposed strategy's significantly improved performance in comparison to other baseline existing techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i5s.7081"
    },
    {
        "id": 17177,
        "title": "An Ensemble of Light Gradient Boosting Machine and Adaptive Boosting for Prediction of Type-2 Diabetes",
        "authors": "M. Jishnu Sai, Pratiksha Chettri, Ranjit Panigrahi, Amik Garg, Akash Kumar Bhoi, Paolo Barsocchi",
        "published": "2023-2-12",
        "citations": 3,
        "abstract": "AbstractMachine learning helps construct predictive models in clinical data analysis, predicting stock prices, picture recognition, financial modelling, disease prediction, and diagnostics. This paper proposes machine learning ensemble algorithms to forecast diabetes. The ensemble combines k-NN, Naive Bayes (Gaussian), Random Forest (RF), Adaboost, and a recently designed Light Gradient Boosting Machine. The proposed ensembles inherit detection ability of LightGBM to boost accuracy. Under fivefold cross-validation, the proposed ensemble models perform better than other recent models. Thek-NN, Adaboost, and LightGBM jointly achieve 90.76% detection accuracy. The receiver operating curve analysis shows that$$k$$k-NN, RF, and LightGBM successfully solve class imbalance issue of the underlying dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s44196-023-00184-y"
    },
    {
        "id": 17178,
        "title": "Optimal model selection for k-nearest neighbours ensemble via sub-bagging and sub-sampling with feature weighting",
        "authors": "Naz Gul, Wali Khan Mashwani, Muhammad Aamir, Saeed Aldahmani, Zardad Khan",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aej.2023.03.075"
    },
    {
        "id": 17179,
        "title": "Ensemble Model for Network Intrusion Detection System Based on Bagging Using J48",
        "authors": "Mohammad Otoom, Khalid Abdul Sattar, Mutasim Al Sadig",
        "published": "2023-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12913/22998624/161820"
    },
    {
        "id": 17180,
        "title": "Modeling Daily Reference Evapotranspiration from Climate Variables: Assessment of Bagging and Boosting Regression Approaches",
        "authors": "Jayashree T R, NV Subba Reddy, U Dinesh Acharya",
        "published": "2023-2",
        "citations": 9,
        "abstract": "AbstractThe increasing frequency of droughts and floods due to climate change has severely affected water resources across the globe in recent years. An optimal design for the scheduling and management of irrigation is thus urgently needed to adapt agricultural activities to the changing climate. The accurate estimation of reference crop evapotranspiration (ET0), a vital hydrological component of the water balance and crop water need, is a tiresome task if all the relevant climatic variables are unavailable. This study investigates the potential of four ensemble techniques for estimating precise values of the daily ET0 at representative stations in 10 agro-climatic zones in the state of Karnataka, India, from 1979 to 2014. The performance of these models was evaluated by using several combinations of climatic variables as inputs by using tenfold cross-validation. The outcomes indicated that predictions of ET0 by all four ensemble models based on all climatic variables were the most accurate in comparison with other input combinations. The random forest regressor was found to deliver the best performance among the four models on all measures considered (Nash–Sutcliffe efficiency, 1.0, root-mean-squared error, 0.016 mm/day, and mean absolute error, 0.011 mm/day). However, it incurred the highest computational cost, whereas the computational cost of the bagging model for linear regression was the lowest. The extreme gradient-boosting model delivered the most stable performance with a modified training dataset. The work here shows that these models can be recommended for daily ET0 estimation based on the users’ interests.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11269-022-03399-4"
    },
    {
        "id": 17181,
        "title": "A Hybrid Ensemble Learning Approach Utilizing Light Gradient Boosting Machine and Category Boosting Model for Lifestyle-Based Prediction of Type-II Diabetes Mellitus",
        "authors": "Mahadi Nagassou, Ronald Waweru Mwangi, Euna Nyarige",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jdaip.2023.114025"
    },
    {
        "id": 17182,
        "title": "Smart grid cyberattack types classification: A fine tree bagging-based ensemble learning approach with feature selection",
        "authors": "V.O. Ijeh, W.G. Morsi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.segan.2024.101291"
    },
    {
        "id": 17183,
        "title": "Stacked ensemble deep learning for pancreas cancer classification using extreme gradient boosting",
        "authors": "Wilson Bakasa, Serestina Viriri",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Ensemble learning aims to improve prediction performance by combining several models or forecasts. However, how much and which ensemble learning techniques are useful in deep learning-based pipelines for pancreas computed tomography (CT) image classification is a challenge. Ensemble approaches are the most advanced solution to many machine learning problems. These techniques entail training multiple models and combining their predictions to improve the predictive performance of a single model. This article introduces the idea of Stacked Ensemble Deep Learning (SEDL), a pipeline for classifying pancreas CT medical images. The weak learners are Inception V3, VGG16, and ResNet34, and we employed a stacking ensemble. By combining the first-level predictions, an input train set for XGBoost, the ensemble model at the second level of prediction, is created. Extreme Gradient Boosting (XGBoost), employed as a strong learner, will make the final classification. Our findings showed that SEDL performed better, with a 98.8% ensemble accuracy, after some adjustments to the hyperparameters. The Cancer Imaging Archive (TCIA) public access dataset consists of 80 pancreas CT scans with a resolution of 512 * 512 pixels, from 53 male and 27 female subjects. A sample of two hundred and twenty-two images was used for training and testing data. We concluded that implementing the SEDL technique is an effective way to strengthen the robustness and increase the performance of the pipeline for classifying pancreas CT medical images. Interestingly, grouping like-minded or talented learners does not make a difference.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/frai.2023.1232640"
    },
    {
        "id": 17184,
        "title": "Heart Disease Prediction Using a Soft Voting Ensemble of Gradient Boosting Models, RandomForest, and Gaussian Naive Bayes",
        "authors": "Kaustav Sen, Bindu Verma",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170399"
    },
    {
        "id": 17185,
        "title": "Ensemble Boosting Method of Power System Transient Stability Assessment Based on Cost-Sensitive Learning",
        "authors": "Chenhao Zhao, Zaibin Jiao",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ceege58447.2023.10246600"
    },
    {
        "id": 17186,
        "title": "A Novel Model Using Multiple Bagging Ensemble Method For Measuring, Inferring and Predicting the Quality of Continuous Assessment Question Papers",
        "authors": "Senthil Velan S, Preethika Reddy S, Preethi Bheemshankar Talwar, Gomathi R D",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10308275"
    },
    {
        "id": 17187,
        "title": "A bagging-based selective ensemble model for churn prediction on imbalanced data",
        "authors": "Bing Zhu, Cheng Qian, Seppe vanden Broucke, Jin Xiao, Yuanyuan Li",
        "published": "2023-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120223"
    },
    {
        "id": 17188,
        "title": "Hardware Trojan Detection Using Shapley Ensemble Boosting",
        "authors": "Zhixin Pan, Prabhat Mishra",
        "published": "2023-1-16",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3566097.3567920"
    },
    {
        "id": 17189,
        "title": "Evaluating strength properties of Eco-friendly Seashell-Containing Concrete: Comparative analysis of hybrid and ensemble boosting methods based on environmental effects of seashell usage",
        "authors": "Behnam Sadaghat, Seyed Abolfazl Ebrahimi, Omid Souri, Maryam Yahyavi Niar, Mohammad Reza Akbarzadeh",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108388"
    },
    {
        "id": 17190,
        "title": "An ensemble nearest neighbor boosting technique for prediction of Parkinson’s disease",
        "authors": "K Aditya Shastry",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100181"
    },
    {
        "id": 17191,
        "title": "Pre Screening of Cervical Cancer Through Gradient Boosting Ensemble Learning Method",
        "authors": "S. Priya, N. K. Karthikeyan, D. Palanikkumar",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.028599"
    },
    {
        "id": 17192,
        "title": "An Optimized Bagging Ensemble Learning of Machine Learning Algorithms for Early Detection of Diabetes",
        "authors": "Homer Benny Bandela, Shaik Sikindar, Chigurupati Ravi Swaroop, M V A L Narasimha Rao, Jyothi Surapaneni, N S Koti Mani Kumar Tirumanadham",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssas57918.2023.10331844"
    },
    {
        "id": 17193,
        "title": "IRS-BAG-Integrated Radius-SMOTE Algorithm with Bagging Ensemble Learning Model for Imbalanced Data Set Classification",
        "authors": "Lilis Yuningsih, Gede Angga Pradipta, Dadang Hermawan, Putu Desiana Wulaning Ayu, Dandy Pramana Hostiadi, Roy Rudolf Huizen",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Imbalanced learning problems are a challenge faced by classifiers when data samples have an unbalanced distribution among classes. The Synthetic Minority Over-Sampling Technique (SMOTE) is one of the most well-known data pre-processing methods. Problems that arise when oversampling with SMOTE are the phenomenon of noise, small disjunct samples, and overfitting due to a high imbalance ratio in a dataset. A high level of imbalance ratio and low variance conditions cause the results of synthetic data generation to be collected in narrow areas and conflicting regions among classes and make them susceptible to overfitting during the learning process by machine learning methods. Therefore, this research proposes a combination between Radius-SMOTE and Bagging Algorithm called the IRS-BAG Model. For each sub-sample generated by bootstrapping, oversampling was done using Radius SMOTE. Oversampling on the sub-sample was likely to overcome overfitting problems that might occur. Experiments were carried out by comparing the performance of the IRS-BAG model with various previous oversampling methods using the imbalanced public dataset. The experiment results using three different classifiers proved that all classifiers had gained a notable improvement when combined with the proposed IRS-BAG model compared with the previous state-of-the-art oversampling methods. Doi: 10.28991/ESJ-2023-07-05-04 Full Text: PDF",
        "keywords": "",
        "link": "http://dx.doi.org/10.28991/esj-2023-07-05-04"
    },
    {
        "id": 17194,
        "title": "An improved ensemble classification-based secure two stage bagging pruning technique for guaranteeing privacy preservation of DNA sequences in electronic health records",
        "authors": "P. Kaladevi, Sengathir Janakiraman, Praveen Ramalingam, D. Muthusankar",
        "published": "2023-1-5",
        "citations": 13,
        "abstract": "The advent of machine learning in the recent decade has excelled in determining new potential features and non-linear relationships existing between the data derived from the Electronic Health Records (EHR). Machine learning also enhances the process of handling data with maximum predictor variables compared to observations during the data mining process of prediction. The EHR data is often confronted with quality issues that are related to misclassification, missingness and measurement errors. In this context, ensemble classification schemes are determined to be essential for preventing the quality issues of EHR data. Moreover, the data sources like EHR include sensitive information that needs to be protected from disclosure before it is forwarded to the mining process. Further, the sensitive data of EHR must be hidden without modifying the dataset such that it does not influence the prediction accuracy of the incorporated ensemble classification mechanism. In this paper, the process of hiding EHR data is facilitated through Improved Sensitivity Drift based k-Anonymized Data Perturbation Scheme (ISD-k-ADP) that randomly perturbs the data in the dataset by including restricted amount of noise. This controlled amount of included noise is derived carefully from the Sensitivity Drift based depending on the expected privacy level before it is sent to the process of classification. This ISD-k-ADP scheme is reliable such that, it prevents the impact induced by the hidden data during the process of Two Stage Bagging Pruning based Ensemble Classification (TSBP-EC). Furthermore, the TSBP-EC uses the methods of distance and accuracy based pruning that aids in minimizing the size of the ensemble for ensuring effective and efficient classification using machine learning. The simulation results of the proposed ISD-k-ADP-TSBP-EC scheme is determined to be predominant based on Classification Accuracy, Precision, Recall and Kappa Statistic in contrast to the standard schemes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-221615"
    },
    {
        "id": 17195,
        "title": "An Approach to Loan Approval prediction Using Boosting Ensemble Learning",
        "authors": "Chintam Anusha, Rajendra Kumar G, Praveen M.A",
        "published": "2023-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaect57570.2023.10118093"
    },
    {
        "id": 17196,
        "title": "Dual-WGAN Ensemble Model for Alzheimer’s Dataset Augmentation with Minority Class Boosting",
        "authors": "Mohammad Samar Ansari, Kulsum Ilyas, Asra Aslam",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/3ict60104.2023.10391464"
    },
    {
        "id": 17197,
        "title": "Thyroid Disease Prediction Model on Boosting-based Stacking Ensemble Approach",
        "authors": "Subhash Mondal, Souptik Dutta, Soumadip Ghosh, Sarbartha Gupta, Dhrubajit Kakati, Amitava Nag",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126389"
    },
    {
        "id": 17198,
        "title": "Prediction of Anemia using various Ensemble Learning and Boosting Techniques",
        "authors": "Nalluri Schweta, Sagar Dhanaraj Pande",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "INTRODUCTION: Anemia is a disease of great concern. It is mainly seen in people who are deficient in several vitamins like B12 and those who are deficient in iron. Neglecting the situation and leaving it untreated could lead to severe consequences in the future. Hence it is of great importance to predict Anemia in an individual and treat it in the optimum stage.\r\nOBJECTIVES: In this paper, machine learning was used for the prediction of Anemia.\r\nMETHODS: The dataset used for this was formed by combining different datasets from Kaggle. The accuracy of various machine learning techniques was evaluated to find out the best one. Along with the supervised learning algorithms like Random Forest, SVM, Naive Bayes etc., Linear Discriminant Analysis, Quadratic Discriminant Analysis and ensemble learning methods were also performed.\r\nRESULTS: Upon evaluation, among the best performers, the execution time was also taken into consideration to determine which classifier works well. Among all the algorithms used, XGboost worked the best with an optimum execution time.\r\nCONCLUSION: The conclusion is that for the data used in the work, XGboost results as the best model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eetpht.9.4197"
    },
    {
        "id": 17199,
        "title": "Boosting-based ensemble of global network aligners for PPI network alignment",
        "authors": "Manuel Menor-Flores, Miguel A. Vega-Rodríguez",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.120671"
    },
    {
        "id": 17200,
        "title": "Click prediction boosting via Bayesian hyperparameter optimization-based ensemble learning pipelines",
        "authors": "Çağatay Demirel, A. Aylin Tokuç, Ahmet Tezcan Tekin",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2023.200185"
    },
    {
        "id": 17201,
        "title": "Credit Card Fraud Detection using Ensemble Machine Learning Method - Gradient Boosting Framework",
        "authors": "SK. Asiff, SK. Muzafar",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "Abstract: The use of credit cards has become commonplace in our daily lives, transforming the way we make cashless payments and making all types of transactions more convenient for buyers. However, credit card fraud has also become increasingly prevalent as the number of users has risen. Criminals may illegally obtain an individual's credit card information and use it for fraudulent activities. This project involved collecting a sample of a publicly available dataset from Kaggle, consisting of 284,807 credit card transactions. Extreme Gradient Boost was used to detect fraudulent transactions, and it was found to be the most effective method, achieving the highest AUC value of 97.67% after thorough analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.54509"
    },
    {
        "id": 17202,
        "title": "A hybrid ensemble forecasting model of passenger flow based on improved variational mode decomposition and boosting",
        "authors": "Xiwen Qin, Chunxiao Leng, Xiaogang Dong",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract>\n\t\t\t<p>An accurate passenger flow forecast can provide key information for intelligent transportation and smart cities, and help promote the development of smart cities. In this paper, a mixed passenger flow forecasting model based on the golden jackal optimization algorithm (GJO), variational mode decomposition (VMD) and boosting algorithm was proposed. First, the data characteristics of the original passenger flow sequence were extended. Second, an improved variational modal decomposition method based on the Sobol sequence improved GJO algorithm was proposed. Next, according to the sample entropy of each intrinsic mode function (IMF), IMF with similar complexity is combined into a new subsequence. Finally, according to the determination rules of the sub-sequence prediction model, the boosting modeling and prediction of different sub-sequences were carried out, and the final passenger flow prediction result was obtained. Based on the experimental results of three scenic spots, the mean absolute percentage error (MAPE) of the mixed set model is 0.0797, 0.0424 and 0.0849, respectively. The fitting degree reached 95.33%, 95.63% and 95.97% simultaneously. The results show that the hybrid model proposed in this study has high prediction accuracy and can provide reliable information sources for relevant departments, scenic spot managers and tourists.</p>\n\t\t</abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2024014"
    },
    {
        "id": 17203,
        "title": "Effective Diagnosis of Diabetes Mellitus using Voting Ensemble of Boosting Algorithms - Distinctive Machine Learning Approach",
        "authors": "Chokiyan Karthikeyini, B Sundarambal, R.M Bommi, Suresh Subramanian",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452645"
    },
    {
        "id": 17204,
        "title": "Anomaly detection using ensemble techniques for boosting the security of intrusion detection system",
        "authors": "Owais Bukhari, Parul Agarwal, Deepika Koundal, Sherin Zafar",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.01.080"
    },
    {
        "id": 17205,
        "title": "Ensemble Learning Paradigms for Flow Rate Prediction Boosting",
        "authors": "Kouao Laurent Kouadio, Jianxin Liu, Serge Kouamelan Kouamelan, Rong Liu",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11269-023-03562-5"
    },
    {
        "id": 17206,
        "title": "Bagging ensemble mean-shift Gaussian kernelized clustering based D2D connectivity enabled communication for 5G networks",
        "authors": "Varadala Sridhar, T. Annamani, M. Renuka, V. Vinay Kumar, Arunkumar Madupu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.prime.2023.100400"
    },
    {
        "id": 17207,
        "title": "Two-level boosting classifiers ensemble based on feature selection for heart disease prediction",
        "authors": "Kaushalya Dissanyake, Md Gapar Md Johar",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "<span>Heart disease is a prevalent global health concern, necessitating early detection to save lives. Machine learning has revolutionized medical research, prompting the investigation of boosting algorithms for heart disease prediction. This study employs three heart disease datasets from the University of California Irvine (UCI) repository: Cleveland, Statlog, and Long Beach, with 14 features each. Recursive feature elimination with a support vector machine (SVM) is utilized to identify significant features. Five boosting algorithms (gradient boosting algorithm (GB), adaptive boosting algorithms (AdaBoost), extreme gradient boosting algorithm (XGBoost), cat boost algorithm (CatBoost) and light gradient boosting algorithms (LightGBM)) are integrated into an ensemble model to achieve the best classification performance. The proposed model demonstrates superior accuracy, precision, recall, f-measure, and area under the curve (AUC) compared to individual boosting models, achieving 93.44%, 83.33%, and 79.75% accuracies for Cleveland, Statlog, and Long Beach datasets. This approach offers an accurate and efficient method for heart disease prediction, which is crucial for clinical decision-making and disease management.</span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijeecs.v32.i1.pp381-391"
    },
    {
        "id": 17208,
        "title": "Hybrid one‐dimensional residual autoencoder and ensemble of gradient boosting for cloud IDS",
        "authors": "Nupa Ram Chauhan, Rakesh Kumar Dwivedi",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "SummaryThe distributed and decentralized architecture of cloud computing is important for a number of industries, including business, government, entertainment, education, and information technology. It facilitates a wide aspect of information technology, where the computing model is vulnerable to attacks or intrusion. For detecting malicious activities, a novel intrusion detection system (IDS) is required to be developed. In this paper, an enhanced synthetic minority oversampling technique (SMOTE) with a hybrid one‐dimensional residual auto encoder and the Ensemble of Gradient Boosting (1D‐RAE‐EGB) models are proposed for cloud intrusion detection. The proposed IDS resolves the class imbalance problem through enhanced SMOTE. In addition, noise reduction is accomplished with ID‐RAE, which minimizes the data dimension. Finally, the soft voting‐based ensemble classification model is used for attack detection. The ensemble gradient boosting model comprises categorical boosting (CatBoost), extreme gradient boosting (XGBoost), and light gradient boosting machine (LightGBM). The ensemble model is fine‐tuned by reducing the number of parameters under fitting conditions since it is not compulsory to re‐adjust the weight values in a backpropagation process. The proposed IDS is implemented in Python using the NSL‐KDD dataset. The accuracy, precision, recall, f1‐score, false positive rate (FPR), false negative rate (FNR), specificity, and Kappa measure obtained for the proposed IDS are 99.98%, 99.3%, 98.5%, 99.95%, 0.723, 0.46, 99.98%, and 99.97%, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cpe.8088"
    },
    {
        "id": 17209,
        "title": "Time series–based prediction of antibiotic degradation via photocatalysis using ensemble gradient boosting",
        "authors": "Sheetal Sethi, Amit Dhir, Vinay Arora",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11356-024-32720-4"
    },
    {
        "id": 17210,
        "title": "An ensemble learning approach for diabetes prediction using boosting techniques",
        "authors": "Shahid Mohammad Ganie, Pijush Kanti Dutta Pramanik, Majid Bashir Malik, Saurav Mallik, Hong Qin",
        "published": "2023-10-26",
        "citations": 4,
        "abstract": "Introduction: Diabetes is considered one of the leading healthcare concerns affecting millions worldwide. Taking appropriate action at the earliest stages of the disease depends on early diabetes prediction and identification. To support healthcare providers for better diagnosis and prognosis of diseases, machine learning has been explored in the healthcare industry in recent years.Methods: To predict diabetes, this research has conducted experiments on five boosting algorithms on the Pima diabetes dataset. The dataset was obtained from the University of California, Irvine (UCI) machine learning repository, which contains several important clinical features. Exploratory data analysis was used to identify the characteristics of the dataset. Moreover, upsampling, normalisation, feature selection, and hyperparameter tuning were employed for predictive analytics.Results: The results were analysed using various statistical/machine learning metrics and k-fold cross-validation techniques. Gradient boosting achieved the greatest accuracy rate of 92.85% among all the classifiers. Precision, recall, f1-score, and receiver operating characteristic (ROC) curves were used to further validate the model.Discussion: The suggested model outperformed the current studies in terms of prediction accuracy, demonstrating its applicability to other diseases with similar predicate indications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fgene.2023.1252159"
    },
    {
        "id": 17211,
        "title": "Hybrid Extreme Gradient Boosting and Nonlinear Ensemble Models for Suspended Sediment Load Prediction in an Agricultural Catchment",
        "authors": "Gebre Gelete",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11269-023-03629-3"
    },
    {
        "id": 17212,
        "title": "Deep Boosting Multi-Modal Ensemble Face Recognition with Sample-Level Weighting",
        "authors": "Sahar Rahimi Malakshan, Mohammad Saeed Ebrahimi Saadabadi, Nima Najafzadeh, Nasser M. Nasrabadi",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcb57857.2023.10448893"
    },
    {
        "id": 17213,
        "title": "Feature-wise attention based boosting ensemble method for fraud detection",
        "authors": "Ruihao Cao, Junli Wang, Mingze Mao, Guanjun Liu, Changjun Jiang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106975"
    },
    {
        "id": 17214,
        "title": "Interplay of Pd ensemble sites induced by GaO  modification in boosting CO2 hydrogenation to formic acid",
        "authors": "Kohsuke Mori, Hiroto Hata, Hiromi Yamashita",
        "published": "2023-1",
        "citations": 17,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apcatb.2022.122022"
    },
    {
        "id": 17215,
        "title": "Brain stroke prediction model based on boosting and stacking ensemble approach",
        "authors": "Subhash Mondal, Soumadip Ghosh, Amitava Nag",
        "published": "2024-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41870-023-01418-0"
    },
    {
        "id": 17216,
        "title": "Performance comparison of machine learning models used for predicting subclinical mastitis in dairy cows: bagging, boosting, stacking and super-learner ensembles versus single machine learning models",
        "authors": "A. Satoła, K. Satoła",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3168/jds.2023-24243"
    },
    {
        "id": 17217,
        "title": "Boosting Speech Recognition Performance: A Robust and Accurate Ensemble Method based on HMMs",
        "authors": "Smaine Mazouzi, Fateh Bougamouza, Samira Hazmoune, Mohamed Benmohammed",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijista.2024.10060581"
    },
    {
        "id": 17218,
        "title": "Concrete Compressive Strength Prediction Based Web Application Using Gradient Boosting Based ML Ensemble: A Case Study",
        "authors": "Sandeep Nasier, Balwinder Lallotra, Nishtha Hooda, Hetarth Chopra",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smart59791.2023.10428279"
    },
    {
        "id": 17219,
        "title": "Enhancing Heart Disease Prediction Through KBEST-PCA Fusion Feature Selection and Ensemble Modeling With Gaussian Naive Bayes Boosting",
        "authors": "Dhivya P -, Sangavi N -, Akashprabu A C -, Anooskavin G -",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "Heart disease is a prevalent health condition with significant implications for patient health and well-being. Accurate and timely diagnosis plays a crucial role in effective treatment and management. In this study, we propose a combined approach using SelectKBest, Gaussian Naive Bayes (GNB), and Gradient Boosting Machines (GBM) to develop a robust predictive model for heart disease diagnosis. The SelectKBest algorithm is employed to identify the most informative features from the Statlog Heart Disease dataset. Statistical measures such as chi-squared test are utilized to select the top K features that exhibit the strongest associations with the target variable. The selected features are then used to train a GNB classifier, capturing the probabilistic relationships between the features and the diagnosis of heart disease. Predictions generated from the GNB model are combined with the original features, creating an extended feature matrix. Subsequently, a GBM ensemble model is trained on the extended feature matrix, leveraging the sequential combination of weak learners to improve the overall predictive performance. To evaluate the effectiveness of the proposed approach, extensive experiments are conducted on the Statlog Heart Disease dataset. Performance metrics including accuracy, precision, recall, and F1 score are used to compare the combined SelectKBest-GNB-GBM approach against individual classifiers and existing methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i04.4378"
    },
    {
        "id": 17220,
        "title": "Quadratic ensemble weighted emphasis boosting based energy and bandwidth efficient routing in Underwater Sensor Network",
        "authors": "O. Vidhya, S. Ranjitha Kumari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijin.2023.05.001"
    },
    {
        "id": 17221,
        "title": "An Ensemble Approach for Prediction of Cardiovascular Disease Using Meta Classifier Boosting Algorithms",
        "authors": "Sibo Prasad Patro, Neelamadhab Padhy, Rahul Deo Sah",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "There are very few studies are carried for investigating the potential of hybrid ensemble machine learning techniques for building a model for the detection and prediction of heart disease in the human body. In this research, the authors deal with a classification problem that is a hybridization of fusion-based ensemble model with machine learning approaches, which produces a more trustworthy ensemble than the original ensemble model and outperforms previous heart disease prediction models. The proposed model is evaluated on the Cleveland heart disease dataset using six boosting techniques named XGBoost, AdaBoost, Gradient Boosting, LightGBM, CatBoost, and Histogram-Based Gradient Boosting. Hybridization produces superior results under consideration of classification algorithms. The remarkable accuracies of 96.51% for training and 93.37% for testing have been achieved by the Meta-XGBoost classifier.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijdwm.316145"
    },
    {
        "id": 17222,
        "title": "Bagging: An Ensemble Approach for Recognition of Handwritten Place Names in Gurumukhi Script",
        "authors": "Harmandeep Kaur, Munish Kumar, Aastha Gupta, Monika Sachdeva, Ajay Mittal, Krishan Kumar",
        "published": "2023-7-31",
        "citations": 2,
        "abstract": "\n            In this article, the authors present an effort to recognize handwritten Gurumukhi place names for use in postal automation. Five feature extraction techniques (zoning, horizontal peak extent, vertical peak extent, diagonal, and centroid) have been analyzed and optimized using Principal Component Analysis (PCA). Four classification methods (\n            k\n            -Nearest Neighbor (\n            k\n            -NN), decision tree, random forest, and Convolutional Neural Network (CNN)) have been utilized to classify the handwritten word images. To enhance the recognition results, the authors have employed Bootstrap Aggregation (Bagging) with a majority voting scheme. The authors used a public benchmark dataset of 40,000 handwritten place-name samples in the Punjabi language for their experimental work. The experiments were conducted using a 70:30 partitioning approach, where 70% of the data was utilized for training and the remaining 30% for testing. The system achieved a maximum recognition accuracy of 96.98% by utilizing a combination of zoning, vertical peak extent, and diagonal features, and a minimum Mean Squared Error (MSE) of 0.86% based on a combination of zoning and horizontal peak extent features with a majority voting scheme through ensemble (Bagging) methodology.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3593024"
    },
    {
        "id": 17223,
        "title": "A bagging-strategy based heterogeneous ensemble deep neural networks approach for the multiple components fault diagnosis of hydraulic systems",
        "authors": "Junlang Wang, Huoyao Xu, Jie Liu, Xiangyu Peng, Chaoming He",
        "published": "2023-6-1",
        "citations": 4,
        "abstract": "Abstract\nHydraulic systems faults have the characteristics of being highly concealed and unclear. Due to the characteristics of the complex vibration transmission mechanism and strong nonlinear time-varying signals in hydraulic systems, it is extremely difficult to achieve fault diagnosis for hydraulic systems. Different components of the system can fail individually or simultaneously. Signal processing faces the problem of coupling between multi-component faults, which makes it more difficult to realise multi-component fault diagnosis. On the one hand, existing techniques rely on hand-designed features and only use a traditional single shallow machine model as the base classifier, and these do not have the ability to self-learn meaningful features. On the other hand, the diagnostic performance of a single base classifier sometimes does not meet engineering requirements. To handle the above problems, a bagging strategy based heterogeneous ensemble deep neural networks (DNNs) approach is proposed for the multiple components fault diagnosis of hydraulic systems. First, Pearson correlation coefficient and neighbourhood component analysis are developed for data channel selection and feature dimensionality reduction. Second, two distinct DNNs are constructed as base learners: a stacked sparse autoencoder and a deep hierarchical extreme-learning machine. Finally, a bagging strategy is adopted to integrate different DNNs to obtain robust diagnostic results. The results from this experiment demonstrate that the proposed method can precisely diagnose hydraulic system faults compared with comparative methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-6501/acbc3b"
    },
    {
        "id": 17224,
        "title": "Solar radiation forecasting using gradient boosting based ensemble learning model for various climatic zones",
        "authors": "Naveen Krishnan, K. Ravi Kumar, Sripathi Anirudh R.",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.segan.2024.101312"
    },
    {
        "id": 17225,
        "title": "Finding potential lncRNA–disease associations using a boosting-based ensemble learning model",
        "authors": "Liqian Zhou, Xinhuai Peng, Lijun Zeng, Lihong Peng",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Introduction: Long non-coding RNAs (lncRNAs) have been in the clinical use as potential prognostic biomarkers of various types of cancer. Identifying associations between lncRNAs and diseases helps capture the potential biomarkers and design efficient therapeutic options for diseases. Wet experiments for identifying these associations are costly and laborious.Methods: We developed LDA-SABC, a novel boosting-based framework for lncRNA–disease association (LDA) prediction. LDA-SABC extracts LDA features based on singular value decomposition (SVD) and classifies lncRNA–disease pairs (LDPs) by incorporating LightGBM and AdaBoost into the convolutional neural network.Results: The LDA-SABC performance was evaluated under five-fold cross validations (CVs) on lncRNAs, diseases, and LDPs. It obviously outperformed four other classical LDA inference methods (SDLDA, LDNFSGB, LDASR, and IPCAF) through precision, recall, accuracy, F1 score, AUC, and AUPR. Based on the accurate LDA prediction performance of LDA-SABC, we used it to find potential lncRNA biomarkers for lung cancer. The results elucidated that 7SK and HULC could have a relationship with non-small-cell lung cancer (NSCLC) and lung adenocarcinoma (LUAD), respectively.Conclusion: We hope that our proposed LDA-SABC method can help improve the LDA identification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fgene.2024.1356205"
    },
    {
        "id": 17226,
        "title": "A generalized decision tree ensemble based on the NeuralNetworks architecture: Distributed Gradient Boosting Forest (DGBF)",
        "authors": "Ángel Delgado-Panadero, José Alberto Benítez-Andrades, María Teresa García-Ordás",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-04735-w"
    },
    {
        "id": 17227,
        "title": "GBMLP-RBM: A Novel Stacking Ensemble Learning Framework Using Retricted Boltzmann Machine and Gradient Boosting Algorithms for Heart Disease Classification",
        "authors": "Kumar A. Shukla, Ayush Choudhary, Somay Vaidh, Uma Devi K.S.",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i-pact58649.2023.10434311"
    },
    {
        "id": 17228,
        "title": "Boosting speech recognition performance: a robust and accurate ensemble method based on HMMs",
        "authors": "Samira Hazmoune, Fateh Bougamouza, Smaine Mazouzi, Mohamed Benmohammed",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijista.2024.136523"
    },
    {
        "id": 17229,
        "title": "Construction of fuzzy classification systems by fitness sharing based genetic search and boosting based ensemble",
        "authors": "Jidong Li, Xuejie Zhang",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.fss.2024.108949"
    },
    {
        "id": 17230,
        "title": "Porosity Prediction for Carbon Dioxide Storage Assessment Using Boosting Ensemble Machine Learning Algorithms. Case Study: Darling Basin, Australia",
        "authors": "Kushan Sandunil, Ziad Bennour, Saaveethya Sivakumar, Ausama Giwelli, Lionel Esteban",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gecost60902.2024.10474745"
    },
    {
        "id": 17231,
        "title": "Performance of Hybrid Stacking and Bagging Methods Based on Machine Learning Algorithms in the Classification of Dengue Fever Incidence Rate",
        "authors": " Citakamalia, Sri Suryani Prasetiyowati, Yuliant Sibaroni",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicyta60173.2023.10428704"
    },
    {
        "id": 17232,
        "title": "Boosting lower-limb motor imagery performance through an ensemble method for gait rehabilitation",
        "authors": "Jing Zhang, Dong Liu, Weihai Chen, Zhongcai Pei, Jianhua Wang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.107910"
    },
    {
        "id": 17233,
        "title": "The Diagnosis of Diabetes Mellitus with Boosting Methods",
        "authors": "Hilal KOÇAK, Gürcan ÇETİN",
        "published": "2023-5-9",
        "citations": 0,
        "abstract": "In addition to the damage it can cause to various organs, diabetes mellitus (DM) also increases a person's risk of developing other serious health conditions. These can include heart disease, stroke, and nerve damage. Furthermore, DM is a leading cause of blindness and kidney failure. However, with proper management and treatment, many of the complications of DM can be prevented or delayed. Thus, early detection and treatment of DM are crucial. With the advancement of machine learning technology, new opportunities have emerged in the field of medicine. Many disease detection research rely on machine learning techniques, with a particular emphasis on boosting algorithms. Boosting algorithms are used to improve the accuracy of predictions made by other weak models such as decision trees. Using knowledge discovery methods, boosting algorithms are examined and compared on a diabetes dataset in this study. The performance of the boosting algorithms is evaluated by generating ROC curves and comparing average accuracy values. When the study's results were evaluated in terms of precision, Gradient Boosting, AdaBoost, CatBoost, LightGBM, and XGBoost algorithms gives success rates of %85, %83, %88, %86, and %87, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31202/ecjse.1242207"
    },
    {
        "id": 17234,
        "title": "Prediction of water-in-oil emulsion drilling fluids rheological properties based on GPR-Bagging ensemble learning",
        "authors": "Song Deng, Bingzhao Huo, Shoukun Xu, Mingguo Peng, Xiaopeng Yan, Chaowei Li, Jiangshuai Wang, Hongda Hao, Yadong Shi",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.colsurfa.2024.133336"
    },
    {
        "id": 17235,
        "title": "Modified boosting and bagging for building tilt rate prediction in tunnel construction",
        "authors": "Leilei Chang, Limao Zhang",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.autcon.2023.105059"
    },
    {
        "id": 17236,
        "title": "Boosting Ensemble Machine Learning Approach for Covid-19 Death Prediction",
        "authors": "Kuhaneswaran Banujan, Mohamed Ifham, B. T. G. S. Kumara",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "It is critical for physicians to correctly classify patients during a plague and determine who deserves minimal health assistance. Machine learning methods have been presented to reliably forecast the severity of COVID-19 disease. Previous research has often tested different machine learning algorithms and evaluated performance under different methods. It may be necessary to try several combinations of machine learning algorithms to discover the optimal prediction model to get the best results. This research aimed to train boosting ensemble algorithms and Artificial Neural Networks (ANN) and choose the model that best predicted how long patients would survive a Covid19 infection. The dataset for this study was obtained through kaggle.com. It contains blood samples from 4313 patients and is retrospectively evaluated to find relevant measures of overall mortality. Out of 48 parameters, only 16 selected parameters were considered using the information gain weight for each parameter. 5-fold cross-validation was employed on the training data set, and Receiver Operating Characteristic (ROC) curves were created to verify better the prediction algorithms' performance independent of the algorithm choice criteria. The models XGBoost, CatBoost, and LightBGM achieved an accuracy of 98%, AdaBoost 96%, and 93% for ANN, respectively, implying that ANN has lower accuracy than boosting approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4038/sljssh.v3i1.88"
    },
    {
        "id": 17237,
        "title": "Gradient Boosting and LSTM Based Hybrid Ensemble Learning for Two Step Prediction of Stock Market",
        "authors": "Pratyush Ranjan Mohapatra, Ajaya Kumar Parida, Santosh Kumar Swain, Santi Swarup Basa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.6.1254-1260"
    },
    {
        "id": 17238,
        "title": "Estimation of building project completion duration using a natural gradient boosting ensemble model and legal and institutional variables",
        "authors": "Farshad Peiman, Mohammad Khalilzadeh, Nasser Shahsavari-Pour, Mehdi Ravanshadnia",
        "published": "2023-12-26",
        "citations": 1,
        "abstract": "PurposeEarned value management (EVM)–based models for estimating project actual duration (AD) and cost at completion using various methods are continuously developed to improve the accuracy and actualization of predicted values. This study primarily aimed to examine natural gradient boosting (NGBoost-2020) with the classification and regression trees (CART) base model (base learner). To the best of the authors' knowledge, this concept has never been applied to EVM AD forecasting problem. Consequently, the authors compared this method to the single K-nearest neighbor (KNN) method, the ensemble method of extreme gradient boosting (XGBoost-2016) with the CART base model and the optimal equation of EVM, the earned schedule (ES) equation with the performance factor equal to 1 (ES1). The paper also sought to determine the extent to which the World Bank's two legal factors affect countries and how the two legal causes of delay (related to institutional flaws) influence AD prediction models.Design/methodology/approachIn this paper, data from 30 construction projects of various building types in Iran, Pakistan, India, Turkey, Malaysia and Nigeria (due to the high number of delayed projects and the detrimental effects of these delays in these countries) were used to develop three models. The target variable of the models was a dimensionless output, the ratio of estimated duration to completion (ETC(t)) to planned duration (PD). Furthermore, 426 tracking periods were used to build the three models, with 353 samples and 23 projects in the training set, 73 patterns (17% of the total) and six projects (21% of the total) in the testing set. Furthermore, 17 dimensionless input variables were used, including ten variables based on the main variables and performance indices of EVM and several other variables detailed in the study. The three models were subsequently created using Python and several GitHub-hosted codes.FindingsFor the testing set of the optimal model (NGBoost), the better percentage mean (better%) of the prediction error (based on projects with a lower error percentage) of the NGBoost compared to two KNN and ES1 single models, as well as the total mean absolute percentage error (MAPE) and mean lags (MeLa) (indicating model stability) were 100, 83.33, 5.62 and 3.17%, respectively. Notably, the total MAPE and MeLa for the NGBoost model testing set, which had ten EVM-based input variables, were 6.74 and 5.20%, respectively. The ensemble artificial intelligence (AI) models exhibited a much lower MAPE than ES1. Additionally, ES1 was less stable in prediction than NGBoost. The possibility of excessive and unusual MAPE and MeLa values occurred only in the two single models. However, on some data sets, ES1 outperformed AI models. NGBoost also outperformed other models, especially single models for most developing countries, and was more accurate than previously presented optimized models. In addition, sensitivity analysis was conducted on the NGBoost predicted outputs of 30 projects using the SHapley Additive exPlanations (SHAP) method. All variables demonstrated an effect on ETC(t)/PD. The results revealed that the most influential input variables in order of importance were actual time (AT) to PD, regulatory quality (RQ), earned duration (ED) to PD, schedule cost index (SCI), planned complete percentage, rule of law (RL), actual complete percentage (ACP) and ETC(t) of the ES optimal equation to PD. The probabilistic hybrid model was selected based on the outputs predicted by the NGBoost and XGBoost models and the MAPE values from three AI models. The 95% prediction interval of the NGBoost–XGBoost model revealed that 96.10 and 98.60% of the actual output values of the testing and training sets are within this interval, respectively.Research limitations/implicationsDue to the use of projects performed in different countries, it was not possible to distribute the questionnaire to the managers and stakeholders of 30 projects in six developing countries. Due to the low number of EVM-based projects in various references, it was unfeasible to utilize other types of projects. Future prospects include evaluating the accuracy and stability of NGBoost for timely and non-fluctuating projects (mostly in developed countries), considering a greater number of legal/institutional variables as input, using legal/institutional/internal/inflation inputs for complex projects with extremely high uncertainty (such as bridge and road construction) and integrating these inputs and NGBoost with new technologies (such as blockchain, radio frequency identification (RFID) systems, building information modeling (BIM) and Internet of things (IoT)).Practical implicationsThe legal/intuitive recommendations made to governments are strict control of prices, adequate supervision, removal of additional rules, removal of unfair regulations, clarification of the future trend of a law change, strict monitoring of property rights, simplification of the processes for obtaining permits and elimination of unnecessary changes particularly in developing countries and at the onset of irregular projects with limited information and numerous uncertainties. Furthermore, the managers and stakeholders of this group of projects were informed of the significance of seven construction variables (institutional/legal external risks, internal factors and inflation) at an early stage, using time series (dynamic) models to predict AD, accurate calculation of progress percentage variables, the effectiveness of building type in non-residential projects, regular updating inflation during implementation, effectiveness of employer type in the early stage of public projects in addition to the late stage of private projects, and allocating reserve duration (buffer) in order to respond to institutional/legal risks.Originality/valueEnsemble methods were optimized in 70% of references. To the authors' knowledge, NGBoost from the set of ensemble methods was not used to estimate construction project duration and delays. NGBoost is an effective method for considering uncertainties in irregular projects and is often implemented in developing countries. Furthermore, AD estimation models do fail to incorporate RQ and RL from the World Bank's worldwide governance indicators (WGI) as risk-based inputs. In addition, the various WGI, EVM and inflation variables are not combined with substantial degrees of delay institutional risks as inputs. Consequently, due to the existence of critical and complex risks in different countries, it is vital to consider legal and institutional factors. This is especially recommended if an in-depth, accurate and reality-based method like SHAP is used for analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ecam-12-2022-1170"
    },
    {
        "id": 17239,
        "title": "An Improved Ensemble Learning Approach for Heart Disease Prediction Using Boosting Algorithms",
        "authors": "Shahid Mohammad Ganie, Pijush Kanti Dutta Pramanik, Majid Bashir Malik, Anand Nayyar, Kyung Sup Kwak",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.035244"
    },
    {
        "id": 17240,
        "title": "Development of a High-Performance Concrete Compressive-Strength Prediction Model Using an Ensemble Machine-Learning Method Based on Bagging and Stacking",
        "authors": "Yun-Ji Kwak, Chaeyeon Go, Shinyoung Kwag, Seunghyun Eem",
        "published": "2023-2-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7734/coseik.2023.36.1.9"
    },
    {
        "id": 17241,
        "title": "Ensemble Learning for Cough-Based Subject-Independent COVID-19 Detection",
        "authors": "Vincenzo Conversano, Stavros Ntalampiras",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011651700003411"
    },
    {
        "id": 17242,
        "title": "Regularized boosting with an increasing coefficient magnitude stop criterion as meta-learner in hyperparameter optimization stacking ensemble",
        "authors": "Laura Fdez-Díaz, José Ramón Quevedo, Elena Montañés",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126516"
    },
    {
        "id": 17243,
        "title": "Boosting Attack Detection Capabilities in Multi-Tenant Distributed Systems via Meta-Ensemble Classifiers and Weighted Averaging",
        "authors": "Pravin Patil, Geetanjali Kale, Maanav Chandwani, Aarushi Wagh",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Multi-tenant distributed systems are a great way to share resources and scale performance, but they come with their share of security issues due to the introduction of more than one client on the cloud. Sharing of hardware and software resources among tenants gives rise to vulnerabilities and malicious tenants can misuse this shared data to launch attacks on other tenants. While efforts have traditionally focused on building secure network architectures, it is impossible to create a completely secure system due to its open-ended nature. This paper explores ways to detect malicious tenants on the cloud using machine learning algorithms. This paper proposes an ensemble-based meta-classifier to predict the probability of attack instantiation based on certain system parameter values. Additionally, this paper creates a dataset for analysis purposes and address the class imbalance problem often found in this domain where attack instances are rare. Satisfactory results were produced to distinguish between non attach and attack instances.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.8994"
    },
    {
        "id": 17244,
        "title": "A Within-Group Approach to Ensemble Machine Learning Methods for Causal Inference in Multilevel Studies",
        "authors": "Youmi Suk",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3102/ip.23.2058728"
    },
    {
        "id": 17245,
        "title": "An Ensemble Edge Computing Approach for SD-IoT security Using Ensemble of Feature Selection Methods and Classification",
        "authors": "Pinkey Chauhan, Mithilesh Atulkar",
        "published": "2024-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13369-024-08835-8"
    },
    {
        "id": 17246,
        "title": "An Adaptive Model Ensemble Adversarial Attack for Boosting Adversarial Transferability",
        "authors": "Bin Chen, Jiali Yin, Shukai Chen, Bohao Chen, Ximeng Liu",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00414"
    },
    {
        "id": 17247,
        "title": "Uncertainty Quantification for Machine Learning‐Based Ionosphere and Space Weather Forecasting: Ensemble, Bayesian Neural Network, and Quantile Gradient Boosting",
        "authors": "Randa Natras, Benedikt Soja, Michael Schmidt",
        "published": "2023-10",
        "citations": 0,
        "abstract": "AbstractMachine learning (ML) has been increasingly applied to space weather and ionosphere problems in recent years, with the goal of improving modeling and forecasting capabilities through a data‐driven modeling approach of nonlinear relationships. However, little work has been done to quantify the uncertainty of the results, lacking an indication of how confident and reliable the results of an ML system are. In this paper, we implement and analyze several uncertainty quantification approaches for an ML‐based model to forecast Vertical Total Electron Content (VTEC) 1‐day ahead and corresponding uncertainties with 95% confidence intervals (CI): (a) Super‐Ensemble of ML‐based VTEC models (SE), (b) Gradient Tree Boosting with quantile loss function (Quantile Gradient Boosting, QGB), (c) Bayesian neural network (BNN), and (d) BNN including data uncertainty (BNN + D). Techniques that consider only model parameter uncertainties (a and c) predict narrow CI and over‐optimistic results, whereas accounting for both model parameter and data uncertainties with the BNN + D approach leads to a wider CI and the most realistic uncertainties quantification of VTEC forecast. However, the BNN + D approach suffers from a high computational burden, while the QGB approach is the most computationally efficient solution with slightly less realistic uncertainties. The QGB CI are determined to a large extent from space weather indices, as revealed by the feature analysis. They exhibit variations related to daytime/nightime, solar irradiance, geomagnetic activity, and post‐sunset low‐latitude ionosphere enhancement.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1029/2023sw003483"
    },
    {
        "id": 17248,
        "title": "Rainfuzz: Reinforcement-Learning Driven Heat-Maps for Boosting Coverage-Guided Fuzzing",
        "authors": "Lorenzo Binosi, Luca Rullo, Mario Polino, Michele Carminati, Stefano Zanero",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011625300003411"
    },
    {
        "id": 17249,
        "title": "Boosting Ensemble Refinement with Transferable Force-Field Corrections: Synergistic Optimization for Molecular Simulations",
        "authors": "Ivan Gilardoni, Thorben Fröhlking, Giovanni Bussi",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.jpclett.3c03423"
    },
    {
        "id": 17250,
        "title": "Classification Performance Boosting for Interpolation Kernel Machines by Training Set Pruning Using Genetic Algorithm",
        "authors": "Jiaqi Zhang, Xiaoyi Jiang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012467200003654"
    },
    {
        "id": 17251,
        "title": "Deep Hybrid Bagging Ensembles for Classifying Histopathological Breast Cancer Images",
        "authors": "Fatima-Zahrae Nakach, Ali Idri, Hasnae Zerouaoui",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011704200003393"
    },
    {
        "id": 17252,
        "title": "Boosting Summarization with Normalizing Flows and Aggressive Training",
        "authors": "Yu Yang, Xiaotong Shen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.165"
    },
    {
        "id": 17253,
        "title": "A Data-Driven Kernel Principal Component Analysis–Bagging–Gaussian Mixture Regression Framework for Pulverizer Soft Sensors Using Reduced Dimensions and Ensemble Learning",
        "authors": "Shengxiang Jin, Fengqi Si, Yunshan Dong, Shaojun Ren",
        "published": "2023-9-18",
        "citations": 1,
        "abstract": "In light of the nonlinearity, high dimensionality, and time-varying nature of the operational conditions of the pulverizer in power plants, as well as the challenge of the real-time monitoring of quality variables in the process, a data-driven KPCA–Bagging–GMR framework for soft sensors using reduced dimensions and ensemble learning is proposed. Firstly, the methodology employs a Kernel Principal Component Analysis to effectively reduce the dimensionality of the collected process data in a nonlinear manner. Secondly, the reduced principal components are then utilized to reconstruct a refined set of input samples, followed by the application of the Bagging algorithm to obtain multiple subsets of the samples and develop corresponding Gaussian Mixture Regression models. Ultimately, the fusion output is achieved by calculating the weights of each local model based on Bayesian posterior probabilities. By conducting simulation experiments on the coal mill, the proposed approach has been validated as demonstrating superior predictive accuracy and excellent generalization capabilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16186671"
    },
    {
        "id": 17254,
        "title": "Be-1DCNN: a neural network model for chromatin loop prediction based on bagging ensemble learning",
        "authors": "Hao Wu, Bing Zhou, Haoru Zhou, Pengyu Zhang, Meili Wang",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "Abstract\nThe chromatin loops in the three-dimensional (3D) structure of chromosomes are essential for the regulation of gene expression. Despite the fact that high-throughput chromatin capture techniques can identify the 3D structure of chromosomes, chromatin loop detection utilizing biological experiments is arduous and time-consuming. Therefore, a computational method is required to detect chromatin loops. Deep neural networks can form complex representations of Hi-C data and provide the possibility of processing biological datasets. Therefore, we propose a bagging ensemble one-dimensional convolutional neural network (Be-1DCNN) to detect chromatin loops from genome-wide Hi-C maps. First, to obtain accurate and reliable chromatin loops in genome-wide contact maps, the bagging ensemble learning method is utilized to synthesize the prediction results of multiple 1DCNN models. Second, each 1DCNN model consists of three 1D convolutional layers for extracting high-dimensional features from input samples and one dense layer for producing the prediction results. Finally, the prediction results of Be-1DCNN are compared to those of the existing models. The experimental results indicate that Be-1DCNN predicts high-quality chromatin loops and outperforms the state-of-the-art methods using the same evaluation metrics. The source code of Be-1DCNN is available for free at https://github.com/HaoWuLab-Bioinformatics/Be1DCNN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/bfgp/elad015"
    },
    {
        "id": 17255,
        "title": "Prediction of Interface Shear Stiffness Modulus of Asphalt Pavement using Bagging Ensemble-based Hybrid Machine Learning Model",
        "authors": "Quynh-Anh Thi Bui, Duc Dam Nguyen, Mudassir Iqbal, Fazal E. Jalal, Indra Prakash, Binh Thai Pham",
        "published": "2023-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13369-023-08014-1"
    },
    {
        "id": 17256,
        "title": "Pre-diagnosis of flooding and drying in proton exchange membrane fuel cells by bagging ensemble deep learning models using long short-term memory and convolutional neural networks",
        "authors": "Kyunghyun Kim, Jaeyeon Kim, Heesoo Choi, Obeen Kwon, Yujae Jang, Sangbong Ryu, Heeyun Lee, Kyuhwan Shim, Taehyun Park, Suk Won Cha",
        "published": "2023-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2022.126441"
    },
    {
        "id": 17257,
        "title": "SynFine: Boosting Image Segmentation Accuracy Through Synthetic Data Generation and Surgical Fine-Tuning",
        "authors": "Mehdi Mounsif, Yassine Motie, Mohamed Benabdelkrim, Florent Brondolo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011848300003411"
    },
    {
        "id": 17258,
        "title": "A Predictive Prescription Framework for Stochastic Unit Commitment Using Boosting Ensemble Learning Algorithms",
        "authors": "Ogun Yurdakul, Feng Qiu, Andreas Meyer",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tpwrs.2023.3336902"
    },
    {
        "id": 17259,
        "title": "Ensemble Machine Learning of Gradient Boosting (XGBoost, LightGBM, CatBoost) and Attention-Based CNN-LSTM for Harmful Algal Blooms Forecasting",
        "authors": "Jung Min Ahn, Jungwook Kim, Kyunghyun Kim",
        "published": "2023-10-10",
        "citations": 4,
        "abstract": "Harmful algal blooms (HABs) are a serious threat to ecosystems and human health. The accurate prediction of HABs is crucial for their proactive preparation and management. While mechanism-based numerical modeling, such as the Environmental Fluid Dynamics Code (EFDC), has been widely used in the past, the recent development of machine learning technology with data-based processing capabilities has opened up new possibilities for HABs prediction. In this study, we developed and evaluated two types of machine learning-based models for HABs prediction: Gradient Boosting models (XGBoost, LightGBM, CatBoost) and attention-based CNN-LSTM models. We used Bayesian optimization techniques for hyperparameter tuning, and applied bagging and stacking ensemble techniques to obtain the final prediction results. The final prediction result was derived by applying the optimal hyperparameter and bagging and stacking ensemble techniques, and the applicability of prediction to HABs was evaluated. When predicting HABs with an ensemble technique, it is judged that the overall prediction performance can be improved by complementing the advantages of each model and averaging errors such as overfitting of individual models. Our study highlights the potential of machine learning-based models for HABs prediction and emphasizes the need to incorporate the latest technology into this important field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/toxins15100608"
    },
    {
        "id": 17260,
        "title": "Mapping potential inundation areas due to riverine floods using ensemble models of credal decision tree with bagging, dagging, decorate, multiboost, and random subspace",
        "authors": "ZhongJie Shen, Haisheng Deng, Alireza Arabameri, M. Santosh, Matej Vojtek, Jana Vojteková",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asr.2023.09.012"
    },
    {
        "id": 17261,
        "title": "A Boosting-Based Hybrid Feature Selection and Multi-Layer Stacked Ensemble Learning Model to Detect Phishing Websites",
        "authors": "Lakshmana Rao Kalabarige, Routhu Srinivasa Rao, Alwyn R. Pais, Lubna Abdelkareim Gabralla",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3293649"
    },
    {
        "id": 17262,
        "title": "Operando X‐Ray Diffraction Boosting Understanding of Graphite Phase Evolution in Lithium‐Ion Batteries (Small Methods 3/2024)",
        "authors": "Jinkun Wang, Yun Gao, Jianhong Liu, Hongying Liao, Li Wang, Xiangming He",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/smtd.202470016"
    },
    {
        "id": 17263,
        "title": "Ensemble Machine learning for Breast Cancer Detection",
        "authors": "Nourhan Elsabawy, Alaa Elnakeeb, Mohammed Baher, Nora Elrashidy",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imsa58542.2023.10217633"
    },
    {
        "id": 17264,
        "title": "A cluster-based ensemble approach for congenital heart disease prediction",
        "authors": "Ishleen Kaur, Tanvir Ahmad",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cmpb.2023.107922"
    },
    {
        "id": 17265,
        "title": "EEG rhythm based emotion recognition using multivariate decomposition and ensemble machine learning classifier",
        "authors": "Raveendrababu Vempati, Lakhan Dev Sharma",
        "published": "2023-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jneumeth.2023.109879"
    },
    {
        "id": 17266,
        "title": "Nonparametric bagging clustering methods to identify latent structures from a sequence of dependent categorical data",
        "authors": "Konrad Abramowicz, Sara Sjöstedt de Luna, Johan Strandberg",
        "published": "2023-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csda.2022.107583"
    },
    {
        "id": 17267,
        "title": "Combining a class-based classification method with ensemble boosting and sequential feature selection",
        "authors": "Chaitanya Kumar G. Sai, Kumar R. Kiran, Prasad Y. Siva, Kumar A. Kalyan, Sai N. Raghavendra",
        "published": "2023",
        "citations": 0,
        "abstract": "The Binary Min-Redundancy Max-Diversity (BMRMD) was utilized to determine the computer network hacking and attacks. The Intrusion Detection System (IDS) is crucial for detecting attacks on an organization, which have increased in size and scale, as well as other anomalies. IDS achieves this by preparing for the unauthorized information related to network security and it is essential for distinguishing various types of attacks. The organization's traffic dataset contains numerous highlights, so selecting and eliminating irrelevant items improves the accuracy of the organization's calculations. Containing a large amount of meaningless or excessive data, a dataset can cause fitting problems and reduce the capacity of the model to learn meaningful patterns. BRMMD approach covers not only the significance of each element but also the expected accuracy when an ideal set of features is given. Solving such challenges requires a series of feature selection techniques. Therefore, the challenge is addressed by evaluating the repeatability of the features and determining their relevance to the target class based on the optimal grouping of the included features.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26634/jdp.11.1.19237"
    },
    {
        "id": 17268,
        "title": "A new kernel regression approach for robustified\n            <i>L</i>\n            <sub>2</sub>\n            boosting",
        "authors": "Suneel Babu Chatla",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/03610926.2023.2280497"
    },
    {
        "id": 17269,
        "title": "Prediction of combustion, performance, and emission parameters of ethanol powered spark ignition engine using ensemble Least Squares boosting machine learning algorithms",
        "authors": "D. Jesu Godwin, Edwin Geo Varuvel, M. Leenus Jesu Martin",
        "published": "2023-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jclepro.2023.138401"
    },
    {
        "id": 17270,
        "title": "Software Effort Estimation Based on Ensemble Extreme Gradient Boosting Algorithm and Modified Jaya Optimization Algorithm",
        "authors": "Beesetti Kiran Kumar, Saurabh Bilgaiyan, Bhabani Shankar Prasad Mishra",
        "published": "2024-3",
        "citations": 0,
        "abstract": " Software development effort estimation is regarded as a crucial activity for managing project cost, time, and quality, as well as for the software development life cycle. As a result, proper estimating is crucial to the success of projects and to lower risks. Software effort estimation has drawn much research interest recently and has become a problem for the software industry. When results are inaccurate, an effort may be over- or under-estimated, which can disastrously affect project resources. In the sector, machine learning methods are becoming more and more prominent. Therefore, in this paper, we propose a Modified Jaya algorithm to improve the effectiveness of the estimated model; Modified JOA selects the ideal subset of components from an extensive feature collection. Then, the ensemble machine learning-based Enhanced Extreme gradient boosting algorithm and Ensemble Learning machine approach are employed to estimate the software effort. On the PROMISE SDEE repository, the proposed methodologies are empirically assessed. In this approach, applying machine learning techniques to the effort estimation process increases the likelihood that the time and cost estimates will be accurate. The proposed approach yields a greater performance. The key benefit of this approach is that it lowers the computational cost. This approach can also inspire the development of a tool that could reliably, effectively, and accurately estimate the effort required to complete different software projects. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s1469026823500323"
    },
    {
        "id": 17271,
        "title": "A Review of Three Methods of Artificial Intelligence in Smart Grid Cyber Security: Machine Learning, Reinforcement Learning, Ensemble Methods",
        "authors": "Luyao Xu",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Renewable energy is gradually replacing traditional fossil fuels. The change of power generation energy structure brings new challenges to the traditional power grid. Through the efficient bidirectional movement of electricity and information, smart grids might include renewable energy. For the complex informational and financial operations required by smart grid, communication systems are crucial, but they also make smart grid vulnerable to numerous cyber attacks. Smart grid cyber security has been widely concerned. The purpose of this paper is to explore the use of artificial intelligence technology in smart grid cyber security. Three methods in the field of artificial intelligence are highlighted: Machine Learning, Reinforcement Learning, and Ensemble Methods. This paper summarizes the benefits and drawbacks of their use of smart grid cyber security, and further makes a qualitative comparison of the three methods from multiple performance indicators.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/79xf0y91"
    },
    {
        "id": 17272,
        "title": "Streamlit Application for Advanced Ensemble Learning Methods in Crop Recommendation Systems – A Review and Implementation",
        "authors": "Yaganteeswarudu Akkem,  , Biswas Saroj Kumar, Aruna Varanasi",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i48.2850"
    },
    {
        "id": 17273,
        "title": "Morphological Classification of Extragalactic Radio Sources Using Gradient Boosting Methods",
        "authors": "Abdollah Masoud Darya, Ilias Fernini, Marley Vellasco, Abir Hussain",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191163"
    },
    {
        "id": 17274,
        "title": "Ensemble Methods for Consumer Price Inflation Forecasting",
        "authors": "Jorge Bravo, Afshin Ashofteh",
        "published": "2023",
        "citations": 0,
        "abstract": "Inflation forecasting is one of the central issues in micro and macroeconomics. Standard forecasting methods tend to follow a \"winner-take-all\" approach by which, for each time series, a single believed to be the best method is chosen from a pool of competing models. This paper investigates the predictive accuracy of a metalearning strategy called Arbitrated Dynamic Ensemble (ADE) in inflation forecasting using United States data.  The findings show that: i) the SARIMA model exhibits the best average rank relative to ADE and competing state-of-the-art model combination and metalearning methods; ii) the ADE methodology presents a better average rank compared to widely used model combination approaches, including the original Arbitrating approach, Stacking, Simple averaging, Fixed Share, or weighted adaptive combination of experts; iii) the ADE approach benefits from combining the base-learners as opposed to selecting the best forecasting model or using all experts; iv) the method is sensitive to the aggregation (weighting) mechanism.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18803/capsi.v23.317-336"
    },
    {
        "id": 17275,
        "title": "Optimization of Prediction Results Based on Ensemble Methods of Machine Learning",
        "authors": "Fayzullo Makhmadiyarovich Nazarov, Sherzodjon Yarmatov",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartindustrycon57312.2023.10110726"
    },
    {
        "id": 17276,
        "title": "Predicting total household energy expenditures using ensemble learning methods",
        "authors": "Esma Kesriklioğlu, Erkan Oktay, Abdulkerim Karaaslan",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.127581"
    },
    {
        "id": 17277,
        "title": "Highly efficient ensemble algorithms for computing the Stokes–Darcy equations",
        "authors": "Nan Jiang, Huanhuan Yang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cma.2023.116562"
    },
    {
        "id": 17278,
        "title": "Boosting the LAC-like activity of tetrapeptide capped copper nanoparticle-based nanozymes for colorimetric determination of adrenaline",
        "authors": "Lin Tian, Li Qi, Yutong Liu, Zhenwen Zhao, Wei Liu",
        "published": "2024",
        "citations": 0,
        "abstract": "Enzymatic activity is important for a variety of technological applications, but the limited stability and complex structures of enzymes often limit their use.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1039/d3ay02328a"
    },
    {
        "id": 17279,
        "title": "Comparison of Bagging and Sparcity Methods for Connectivity Reduction in Spiking Neural Networks with Memristive Plasticity",
        "authors": "Roman Rybka, Yury Davydov, Danila Vlasov, Alexey Serenko, Alexander Sboev, Vyacheslav Ilyin",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "Developing a spiking neural network architecture that could prospectively be trained on energy-efficient neuromorphic hardware to solve various data analysis tasks requires satisfying the limitations of prospective analog or digital hardware, i.e., local learning and limited numbers of connections, respectively. In this work, we compare two methods of connectivity reduction that are applicable to spiking networks with local plasticity; instead of a large fully-connected network (which is used as the baseline for comparison), we employ either an ensemble of independent small networks or a network with probabilistic sparse connectivity. We evaluate both of these methods with a three-layer spiking neural network, which are applied to handwritten and spoken digit classification tasks using two memristive plasticity models and the classical spike time-dependent plasticity (STDP) rule. Both methods achieve an F1-score of 0.93–0.95 on the handwritten digits recognition task and 0.85–0.93 on the spoken digits recognition task. Applying a combination of both methods made it possible to obtain highly accurate models while reducing the number of connections by more than three times compared to the basic model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bdcc8030022"
    },
    {
        "id": 17280,
        "title": "Ensemble Methods for Spatial Data Stream Classification",
        "authors": "Liam King, Wendy Osborn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.09.023"
    },
    {
        "id": 17281,
        "title": "Uncertainty Quantification with Deep Ensemble Methods for Super-Resolution of Sentinel 2 Satellite Images",
        "authors": "David Iagaru, Nina Maria Gottschling",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/psf2023009004"
    },
    {
        "id": 17282,
        "title": "Towards the transferable audio adversarial attack via ensemble methods",
        "authors": "Feng Guo, Zheng Sun, Yuxuan Chen, Lei Ju",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "AbstractIn recent years, deep learning (DL) models have achieved significant progress in many domains, such as autonomous driving, facial recognition, and speech recognition. However, the vulnerability of deep learning models to adversarial attacks has raised serious concerns in the community because of their insufficient robustness and generalization. Also, transferable attacks have become a prominent method for black-box attacks. In this work, we explore the potential factors that impact adversarial examples (AEs) transferability in DL-based speech recognition. We also discuss the vulnerability of different DL systems and the irregular nature of decision boundaries. Our results show a remarkable difference in the transferability of AEs between speech and images, with the data relevance being low in images but opposite in speech recognition. Motivated by dropout-based ensemble approaches, we propose random gradient ensembles and dynamic gradient-weighted ensembles, and we evaluate the impact of ensembles on the transferability of AEs. The results show that the AEs created by both approaches are valid for transfer to the black box API.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s42400-023-00175-8"
    },
    {
        "id": 17283,
        "title": "Inferring unknown unknowns: Regularized bias-aware ensemble Kalman filter",
        "authors": "Andrea Nóvoa, Alberto Racca, Luca Magri",
        "published": "2024-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cma.2023.116502"
    },
    {
        "id": 17284,
        "title": "Boosting the classification success in imbalanced data of bee larva cells",
        "authors": "Serkan Özgün, Mehmet Akif Şahman",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Selecting the appropriate honey harvesting method is crucial for sustainable beekeeping and optimal honey production. The use of primitive harvesting methods can lead to the death of bees and a decrease in honey yield. This study aims to address the issue of detecting and classifying young larvae on honeycombs. However, the area where young larvae are found is limited compared to other areas.  In this study, the dataset obtained from honeycombs was imbalanced, which has used the Synthetic Minority Oversampling TEchnique (SMOTE) algorithm to balance it. The SMOTE algorithm is a synthetic data generation method. The balanced dataset was then used for classification processes with k-Nearest Neighbors algorithm (k-NN), Decision Trees, and Support Vector Machines. The evaluation of the classification results included the F1-Score, G-Mean, and AUC metrics. The results showed that the classification of the dataset balanced with synthetic data was more successful.\n\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.58190/ijamec.2024.78"
    },
    {
        "id": 17285,
        "title": "Stacked ensemble methods for short-term electricity demand forecasting",
        "authors": "Judith Foster, Seán McLoone",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.10.1441"
    },
    {
        "id": 17286,
        "title": "A Comprehensive Study on Ensemble Methods for Software Error Detection",
        "authors": "Nagib Mahfuz -, Md. Mahedi Hasan -",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "Software Developers often find it painful and tedious to locate or pinpoint the errors that reside in the source code which causes serious hindrance in the progression of developing any software. In the field of software engineering, it is very crucial to understand the software metrics that are directly involved with the progression of the software. Besides, various classification algorithms have been used to foresee the errors in building the software. In this paper, we focus especially on ensemble algorithms as they tend to provide more precise and statistically efficient outcomes than the other traditional algorithms. This paper contains twenty software metrics that are pivotal in identifying errors in software applications. Eight Java projects have been gathered to showcase the significance of the software metrics in predicting errors. In this study, three ensemble methods are considered, MultiBoostAB, Dagging, and Decorate. For a detailed inspection of the performance, accuracy, recall, precision, F-measure, and ROC Curve were appraised. The comparisons exhibit Decorate as the highest-performing method and Dagging as the lowest.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i02.16105"
    },
    {
        "id": 17287,
        "title": "Credit risk analysis using boosting methods",
        "authors": "S. B. Coşkun, M. Turanli",
        "published": "2023-5-1",
        "citations": 4,
        "abstract": "Abstract\nThe use of credit for various occasions has become a routine in our lives. In return, banking and financial institutions require to determine whether the loan demands from them contain any risk. Accordingly, these institutions have been increased their activities in determining whether credit rating models from past credit records of the person applying for the loan works properly. Machine learning-based technologies have opened a new era in this field. AI and machine learning based methods for credit scoring are currently implemented by banking or non-banking financial institutions. Employed models are to extract meaningful features from the required data in which wide variety of information available. In this study, credit risk assessment is conducted using boosting methods such as CatBoost, XGBoost and Light GBM. To this aim, Kaggle Home Credit Default Risk dataset is used and the effect of crediting tendency on the results is also considered. The results have shown that gradient boosting methods provide results that are close to each other, and crediting tendency produces better AUC score in CatBoost while it causes a small decrement in AUC score of XGBoost and LightGBM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2478/jamsi-2023-0001"
    },
    {
        "id": 17288,
        "title": "White bagging, brown bagging and site of service policies: best practices in addressing provider markup in the commercial insurance market",
        "authors": "Caroline Pearson, Lindsey Schapiro, Steven D Pearson",
        "published": "2023-10",
        "citations": 0,
        "abstract": "New Institute for Clinical and Economic Review (ICER) analysis evaluates potential risks and advantages of reforms to current policies related to white bagging, brown bagging, and site of service policies that aim to address provider markup in the commercial insurance market.",
        "keywords": "",
        "link": "http://dx.doi.org/10.57264/cer-2023-0128"
    },
    {
        "id": 17289,
        "title": "Performance comparisons of the three data assimilation methods for improved predictability of PM2·5: Ensemble Kalman filter, ensemble square root filter, and three-dimensional variational methods",
        "authors": "Uzzal Kumar Dash, Soon-Young Park, Chul Han Song, Jinhyeok Yu, Keiya Yumimoto, Itsushi Uno",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.envpol.2023.121099"
    },
    {
        "id": 17290,
        "title": "Skin Disease Classification Based on Hybrid Wavelet Features and Ensemble Methods",
        "authors": "V.V. Lakshmi, S.J.G. Shoba, A. Royappa, J.G.A. Johnson",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Skin cancer is one of the most common cancers in the world. However, the disease is curable if detected in the beginning stage. Early detection of malignant lesions through accurate techniques and innovative technologies has a significant impact on reducing skin cancer mortality rates. Recently, artificial intelligence has come to the forefront to facilitate skin cancer diagnosis based on medical images. This work is concerned mainly with the analysis of dermoscopic images from PH2 database, the extraction of quantitative parameters that may describe the pattern for Skin Cancer Diagnostic System. Textural information is the major concern of the study. To show how textural patterns can be well described by texture specification, co-occurrence wavelet features are extracted. Then, Random Forest (RF) with ensemble method-based classifier is used for classification. Accuracy, Precision, Sensitivity, f1-score are considered as a measure of the usefulness of theproposed model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18137/cardiometry.2023.26.797802"
    },
    {
        "id": 17291,
        "title": "Evaluating and Comparing Heterogeneous Ensemble Methods for Unsupervised Anomaly Detection",
        "authors": "Simon Klüttermann, Emmanuel Müller",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191405"
    },
    {
        "id": 17292,
        "title": "Sentiment analysis of coronavirus data with ensemble and machine learning methods",
        "authors": "Muhammet Sinan Başarslan, Fatih Kayaalp",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "The coronavirus pandemic has distanced people from social life and increased the use of social media. People's emotions can be determined with text data collected from social media applications. This is used in many fields, especially in commerce. This study aims to predict people's sentiments about the pandemic by applying sentiment analysis to Twitter tweets about the pandemic using single machine learning classifiers (Decision Tree-DT, K-Nearest Neighbor-KNN, Logistic Regression-LR, Naïve Bayes-NB, Random Forest-RF) and ensemble learning methods (Majority Voting (MV), Probabilistic Voting (PV), and Stacking (STCK)). After vectorizing the tweets using two predictive methods, Word2Vec (W2V) and Doc2Vec, and two traditional word representation methods, Term Frequency-Inverse Document Frequency (TF-IDF) and Bag of Words (BOW), classification models built using single machine learning classifiers were compared to models built using ensemble learning methods (MV, PV and STCK) by heterogeneously combining single machine classifier algorithms. Accuracy (ACC), F-measure (F), precision (P), and recall (R) were used as performance measures, with training/test separation rates of 70%-30% and 80%-20%, respectively. Among these models, the ACC of ensemble learning models ranged from 89% to 73%, while the ACC of single classifier models ranged from 60% to 80%. Among the ensemble learning methods, STCK with Doc2Vec text representation/embedding method gave the best ACC result of 89%. According to the experimental results, ensemble models built with heterogeneous machine learning classifier algorithms gave better results than single machine learning classifier algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31127/tuje.1352481"
    },
    {
        "id": 17293,
        "title": "Ensemble learning application for textile defect detection",
        "authors": "Okan Guder, Sahin Isik, Yildiray Anagun",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "Textile production has an important share in the Turkish economy. One of the common problems in textile factories in Turkey is fabric texture defects that may occur due to textile machinery. The faulty production of the fabric adversely affects the company's economy and prestige. Many methods have been developed to achieve high accuracy in detecting defects in fabric. The aim of this study is to compare the performance of the models using the new dataset and deep learning models. The findings have determined that the Seresnet152d model, which is one of the transfer learning models, can classify with 95.38% accuracy on the generated dataset. Moreover, the majority voting gives 95.58% accuracy rate. In order to achieve high accuracy in the future, it is planned to optimize the parameters of the models used in the study with the help of swarm-oriented optimization algorithms.\n\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.58190/ijamec.2023.41"
    },
    {
        "id": 17294,
        "title": "Early Cardiovascular Disease Detection Using Ensemble Methods",
        "authors": "Aditya Ramachandran, Shraddha Kiran Burra, Sourabh Singh Verma",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10398045"
    },
    {
        "id": 17295,
        "title": "Boosting Ensemble Learning Technique for Landslide Activity Classification using Vegetation Anomalies Indicators",
        "authors": "Mohd Radhie Mohd Salleh, Muhammad Zulkarnain Abdul Rahman, Zamri Ismail, Mohd Faisal Abdul Khanan, Mohamad Jahidi Osman, Mohd Asraff Asmadi, Suhaini Mohamad Sukairi",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Having detailed information and inventories about landslides is important for studying landslides. These inventories have been created for various purposes. However, detecting and mapping landslides in highly dense vegetated areas and evaluating their activity state is a major challenge due to various factors, such as the dense tree canopy, undulating terrain, and fast-growing vegetation. Therefore, this paper presents a new technique for categorising landslide activity using vegetation anomalies indicators (VAIs) extracted from high-resolution remote sensing data. The data were utilised to support manual landslide inventory and VAI production. The landslide inventory map was divided randomly into two groups of datasets, one for training (70%) and the other for validation (30%). The classification process used a boosting ensemble learning approach, specifically Decision Tree (DT) and Stochastic Gradient Boosting (SGB), with seven primary VAIs as inputs. The study compared the classification models’ performance against various parameters, including spatial resolution and landslide depth. To evaluate the accuracy of the classification methods, metrics such as overall accuracy, kappa, producer’s accuracy, and user’s accuracy were measured from the validation dataset. The results demonstrated that both methods performed best under high spatial resolution. Among the two approaches, DT performed better, with an overall accuracy value of 89.6% for deep-seated translational, 64.0% for shallow translational, 67.0% for deep-seated rotational, and 80.0% for shallow rotational. This reliable accuracy that has been attained in landslide activity classification from VAI allows (i) to map and classify the landslide activity in the forested area, (ii) characterise the different types of vegetation characteristics to specific landslide activity, and (iii) permits for the continuous landslide activity monitoring in the area where monitoring activity is not practically feasible to be conducted.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11113/jagst.v3n1.57"
    },
    {
        "id": 17296,
        "title": "Improving the forecast performance of landslide susceptibility mapping by using ensemble gradient boosting algorithms",
        "authors": "Hang Ha, Quynh Duy Bui, Dinh Trong Tran, Dinh Quoc Nguyen, Hanh Xuan Bui, Chinh Luu",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10668-024-04694-3"
    },
    {
        "id": 17297,
        "title": "Identification of symptoms related to potato Verticillium wilt from UAV-based multispectral imagery using an ensemble of gradient boosting machines",
        "authors": "Ivan Lizarazo, Jorge Luis Rodriguez, Omar Cristancho, Felipe Olaya, Marlon Duarte, Flavio Prieto",
        "published": "2023-2",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.atech.2022.100138"
    },
    {
        "id": 17298,
        "title": "A new efficient decoder of linear block codes based on ensemble learning models: case of boosting",
        "authors": "Mohammed El Assad, Said Nouh, Imrane Chemseddine Idrissi, Seddiq El Kasmi Alaoui, Bouchaib AYLAJ, Mohamed Azzouazi",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "<p>Error-correcting codes are used to partially or completely correct errors as much as possible, while ensuring high transmission speeds. Several Machine Learning (ML) models such as Logistic Regression and Decision tree have been applied to correct transmission errors. Among the most powerful ML techniques are aggregation methods which have yielded to excellent results in many areas of research. It is this excellence that has prompted us to consider their application for the hard decoding problem. In this sense, we have successfully designed, tested and validated our proposed EL-BoostDec decoder (hard decision decoder based on Ensemble Learning - Boosting technique) which is based on computing of the syndrome of the received word and on using Ensemble Learning techniques to find the corresponding corrigible error. The obtained results with EL-BoostDec are very encouraging in terms of the binary error rate (BER) that it offers. Practically EL-BoostDec has succeed to correct 100% of errors that have weights less than or equal to the correction capacity of studied codes.  The comparison of EL-BoostDec with many competitors proves its power. A study of parameters which impact on EL-BoostDec performances has been established to obtain a good BER with minimum run time complexity.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijai.v13.i2.pp2236-2246"
    },
    {
        "id": 17299,
        "title": "Boosting Oversampling Methods for Imbalanced Data Classification",
        "authors": "Sumaiya Akter, Iram Ishika, Puja Rani Das, Md. Julker Nyne, Dewan Md. Farid",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441231"
    },
    {
        "id": 17300,
        "title": "Predictive models development using gradient boosting based methods for solar power plants",
        "authors": "Necati Aksoy, Istemihan Genc",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jocs.2023.101958"
    },
    {
        "id": 17301,
        "title": "De-noising boosting methods for variable selection and estimation subject to error-prone variables",
        "authors": "Li-Pang Chen",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11222-023-10209-3"
    },
    {
        "id": 17302,
        "title": "Optimized Dissolved Oxygen Prediction Using Genetic Algorithm and Bagging Ensemble Learning for Smart Fish Farm",
        "authors": "Prince Waqas Khan, Yung Cheol Byun",
        "published": "2023-7-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jsen.2023.3278719"
    },
    {
        "id": 17303,
        "title": "Ensemble Methods for Probabilistic Solar Power Forecasting: A Comparative Study",
        "authors": "Tawsif Ahmad, Ning Zhou",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/pesgm52003.2023.10253133"
    },
    {
        "id": 17304,
        "title": "Predictive Modeling of Recycled Aggregate Concrete Beam Shear Strength Using Explainable Ensemble Learning Methods",
        "authors": "Celal Cakiroglu, Gebrail Bekdaş",
        "published": "2023-3-10",
        "citations": 4,
        "abstract": "Construction and demolition waste (CDW) together with the pollution caused by the production of new concrete are increasingly becoming a burden on the environment. An appealing strategy from both an ecological and a financial point of view is to use construction and demolition waste in the production of recycled aggregate concrete (RAC). However, past studies have shown that the currently available code provisions can be unconservative in their predictions of the shear strength of RAC beams. The current study develops accurate predictive models for the shear strength of RAC beams based on a dataset of experimental results collected from the literature. The experimental database used in this study consists of full-scale four-point flexural tests. The recycled coarse aggregate (RCA) percentage, compressive strength (fc′), effective depth (d), width of the cross-section (b), ratio of shear span to effective depth (a/d), and ratio of longitudinal reinforcement (ρw) are the input features used in the model training. It is demonstrated that the proposed machine learning models outperform the existing code equations in the prediction of shear strength. State-of-the-art metrics of accuracy, such as the coefficient of determination (R2), mean absolute error, and root mean squared error, have been utilized to quantify the performances of the ensemble machine learning models. The most accurate predictions could be obtained from the XGBoost model, with an R2 score of 0.94 on the test set. Moreover, the impact of different input features on the machine learning model predictions is explained using the SHAP algorithm. Using individual conditional expectation plots, the variation of the model predictions with respect to different input features has been visualized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15064957"
    }
]