[
    {
        "id": 7905,
        "title": "PREDICTIVE MODELING OF THE MECHANICAL PROPERTIES OF ALPHA ALUMINA USING ARTIFICIAL NEURAL NETWORKS AND MULTIPLE LINEAR REGRESSION",
        "authors": "",
        "published": "2023-8",
        "citations": 0,
        "abstract": "In the present study, we built predictive models of the mechanical properties (Young's modulus, fracture strength and toughness) of ?-Al2O3. Experiments carried out on samples produced by spark plasma sintering (SPS). The experimental results were the basis for the evaluation of mathematical models and predictions by both the radial basis function neural network (RBFNN) and multiple linear regression (MLR) models. The results of the comparison of MLR and RBFNN models showed good agreement between the experimental data and the RBFNN model predictions whereas the MLR model reveals modest agreement with the studied mechanical properties.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14489/glc.2023.08.pp.062-064"
    },
    {
        "id": 7906,
        "title": "Molecular insights into anti-Alzheimer’s drugs through predictive modeling using linear regression and QSPR analysis",
        "authors": "Wakeel Ahmed, Kashif Ali, Shahid Zaman, Asma Raza",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": " The purpose of this paper is to discuss the use of topological indices (TIs) to anticipate the physical and biological aspects of innovative drugs used in the treatment of Alzheimer’s disease. Degree-based topological indices are generated using edge partitioning to assess the drugs Tacrine, Donepezil, Ravistigmine, Butein, Licochalcone-A and Flavokqwain-A. Furthermore, using linear regression, a quantitative structure–property relationship (QSPR) model is developed to predict the characteristics such as boiling point (BP), flash point (FP), molar volume (MV), molecular weight, complexity and polarizability. The findings show that topological indices have the potential to be used as a tool for drugs discovery and design in the field of Alzheimer’s disease treatment. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0217984924502609"
    },
    {
        "id": 7907,
        "title": "Predictive Modeling of PowerSchool Usage: Comparative Analysis of Linear Regression and Data Mining Techniques using Student Attributes",
        "authors": "Edelyn Rose R. Dawat",
        "published": "2023",
        "citations": 0,
        "abstract": "This research investigates Linear Regression, Artificial Neural Network (ANN), and Decision Tree Analysis in predicting PowerSchool usage based on student attributes (GPA, attendance, behavior). Linear Regression highlights GPA as the strongest predictor, achieving 62% predictive adequacy. The ANN model displays high accuracy but with increased incorrect predictions during testing, emphasizing the importance of GPA. Decision Tree reveals a 0.298 uncertainty despite high recall. The ANN model outperforms, demonstrating superior accuracy and recall, while the Linear Model shows good accuracy and precision. Although the Decision Tree Model presents high recall, it slightly lags in accuracy and precision. The F1-Measure peaks at 0.9231 for the ANN Model, offering directions for future model enhancements.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47772/ijriss.2023.7011006"
    },
    {
        "id": 7908,
        "title": "Robust Weighted Support Vector Regression Approach for Predictive Modeling",
        "authors": "R Muthukrishnan,  , S Kalaivani",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i30.1180"
    },
    {
        "id": 7909,
        "title": "Predictive Modeling of the Mechanical Properties of Alpha Alumina Using Artificial Neural Networks and Multiple Linear Regression",
        "authors": "H. Belghalem, B. Fissah, M. Djeddou, M. Hamidouche",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10717-023-00612-7"
    },
    {
        "id": 7910,
        "title": "Predictive modeling of PV solar power plant efficiency considering weather conditions: A comparative analysis of artificial neural networks and multiple linear regression",
        "authors": "Gökhan Sahin, Gültekin Isik, Wilfried G.J.H.M. van Sark",
        "published": "2023-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.egyr.2023.09.097"
    },
    {
        "id": 7911,
        "title": "Multiple Linear Regression Predictive Modeling of Colloidal and Fluorescence Stability of Theranostic Perfluorocarbon Nanoemulsions",
        "authors": "Michele Herneisey, Jelena M. Janjic",
        "published": "2023-3-29",
        "citations": 3,
        "abstract": "Perfluorocarbon nanoemulsions (PFC-NEs) are widely used as theranostic nanoformulations with fluorescent dyes commonly incorporated for tracking PFC-NEs in tissues and in cells. Here, we demonstrate that PFC-NE fluorescence can be fully stabilized by controlling their composition and colloidal properties. A quality-by-design (QbD) approach was implemented to evaluate the impact of nanoemulsion composition on colloidal and fluorescence stability. A full factorial, 12-run design of experiments was used to study the impact of hydrocarbon concentration and perfluorocarbon type on nanoemulsion colloidal and fluorescence stability. PFC-NEs were produced with four unique PFCs: perfluorooctyl bromide (PFOB), perfluorodecalin (PFD), perfluoro(polyethylene glycol dimethyl ether) oxide (PFPE), and perfluoro-15-crown-5-ether (PCE). Multiple linear regression modeling (MLR) was used to predict nanoemulsion percent diameter change, polydispersity index (PDI), and percent fluorescence signal loss as a function of PFC type and hydrocarbon content. The optimized PFC-NE was loaded with curcumin, a known natural product with wide therapeutic potential. Through MLR-supported optimization, we identified a fluorescent PFC-NE with stable fluorescence that is unaffected by curcumin, which is known to interfere with fluorescent dyes. The presented work demonstrates the utility of MLR in the development and optimization of fluorescent and theranostic PFC nanoemulsions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/pharmaceutics15041103"
    },
    {
        "id": 7912,
        "title": "Digital soil mapping: a predictive performance assessment of spatial linear regression, Bayesian and ML-based models",
        "authors": "Alain Kangela Matazi, Emmanuel Ehnon Gognet, Romain Glèlè Kakaï",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40808-023-01788-1"
    },
    {
        "id": 7913,
        "title": "Modeling Net Migration in the Philippines: Employing Linear Regression, and Time Series Analysis",
        "authors": "Roselyn A. Aginao",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.4.823.51167"
    },
    {
        "id": 7914,
        "title": "A comparative analysis of artificial neural network predictive and multiple linear regression models for ground settlement during tunnel construction",
        "authors": "",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/ace.2023.145281"
    },
    {
        "id": 7915,
        "title": "On Linear Regression for Fuzzy Data of Different Quality",
        "authors": "Serhii Mashchenko, Oleksandr Marchenko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/cmis/3392-4"
    },
    {
        "id": 7916,
        "title": "Linear Regression Model for Predictive Service Provider Selection",
        "authors": "Tamerlan Aghayev, Salviano Diamond, Sathish Kumar, Rachel Dudukovich, Janette Briones",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccaaw57883.2023.10219373"
    },
    {
        "id": 7917,
        "title": "Predictive Data Using Linear Regression in Agricultural Production",
        "authors": "Carina Dorneles, Clovis Santos",
        "published": "2025",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijids.2025.10061180"
    },
    {
        "id": 7918,
        "title": "Predictive diagnosis of diabetes based on multiple linear regression",
        "authors": "Boxing Liu",
        "published": "2023-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2669013"
    },
    {
        "id": 7919,
        "title": "Research On Laptop Price Predictive Model Based on Linear Regression, Random Forest and Xgboost",
        "authors": "Peiru Tian",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "In today's rapidly evolving technological environment, the portability and versatility of laptops have led to a significant growth in their user base as well, making them essential tools for individuals and businesses alike. Particularly since the COVID-19 pandemic, the rate of Work From Home (WFH) partially or overall WFH has exceeded 30%. Global laptop shipments have also far surpassed desktop PCs so far in 2017. Accurately predicting laptop prices is beneficial for retailers to devise competitive pricing strategies and for consumers to effectively budget and select the most suitable laptops. In this study, we used a dataset of 1320 samples to investigate the significance of features in a laptop price prediction model using linear regression, random forest, and XGBoost methods. We incorporated 13 features in the modeling process, including laptop brand, type, screen size, RAM, GPU, operating system, and weight. Three mathematical models were established to predict the price of laptop. By comparing the regression model metrics RMSE and R2 under linear regression, random forest and XGBoost models, the RMSE under the XGBoost model is 294.11 with an R2 of 0.85. It is evident that the XGBoost model exhibits the smallest RMSE and the highest R2 value closest to 1. This suggests that the XGBoost model provides the highest accuracy and best fit for the predictive model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/9nx5ad16"
    },
    {
        "id": 7920,
        "title": "A Generalized Framework for Adopting Regression-Based Predictive Modeling in Manufacturing Environments",
        "authors": "Mobayode O. Akinsolu, Khalil Zribi",
        "published": "2023-1-29",
        "citations": 0,
        "abstract": "In this paper, the growing significance of data analysis in manufacturing environments is exemplified through a review of relevant literature and a generic framework to aid the ease of adoption of regression-based supervised learning in manufacturing environments. To validate the practicality of the framework, several regression learning techniques are applied to an open-source multi-stage continuous-flow manufacturing process data set to typify inference-driven decision-making that informs the selection of regression learning methods for adoption in real-world manufacturing environments. The investigated regression learning techniques are evaluated in terms of their training time, prediction speed, predictive accuracy (R-squared value), and mean squared error. In terms of training time (TT), k-NN20 (k-Nearest Neighbour with 20 neighbors) ranks first with average and median values of 4.8 ms and 4.9 ms, and 4.2 ms and 4.3 ms, respectively, for the first stage and second stage of the predictive modeling of the multi-stage continuous-flow manufacturing process, respectively, over 50 independent runs. In terms of prediction speed (PS), DTR (decision tree regressor) ranks first with average and median values of 5.6784×106 observations per second (ob/s) and 4.8691×106 observations per second (ob/s), and 4.9929×106 observations per second (ob/s) and 5.8806×106 observations per second (ob/s), respectively, for the first stage and second stage of the predictive modeling of the multi-stage continuous-flow manufacturing process, respectively, over 50 independent runs. In terms of R-squared value (R2), BR (bagging regressor) ranks first with average and median values of 0.728 and 0.728, respectively, over 50 independent runs, for the first stage of the predictive modeling of the multi-stage continuous-flow manufacturing process, and RFR (random forest regressor) ranks first with average and median values of 0.746 and 0.746, respectively, over 50 independent runs, for the second stage of the predictive modeling of the multi-stage continuous-flow manufacturing process. In terms of mean squared error (MSE), BR (bagging regressor) ranks first with average and median values of 2.7 and 2.7, respectively, over 50 independent runs, for the first stage of the predictive modeling of the multi-stage continuous-flow manufacturing process, and RFR (random forest regressor) ranks first with average and median values of 3.5 and 3.5, respectively, over 50 independent runs, for the second stage of the predictive modeling of the multi-stage continuous-flow manufacturing process. All methods are further ranked inferentially using the statistics of their performance metrics to identify the best method(s) for the first and second stages of the predictive modeling of the multi-stage continuous-flow manufacturing process. A Wilcoxon rank sum test is then used to statistically verify the inference-based rankings. DTR and k-NN20 have been identified as the most suitable regression learning techniques given the multi-stage continuous-flow manufacturing process data used for experimentation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/inventions8010032"
    },
    {
        "id": 7921,
        "title": "Predictive Modeling of House Prices; A Regression Approach",
        "authors": "Natasha Saeed, Ahsan Shahzad, Mariam Bashir, Lismer Andres Caceres-Najarro",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icet59753.2023.10374881"
    },
    {
        "id": 7922,
        "title": "Predictive Modeling for Analysis of Coronavirus Symptoms Using Logistic Regression",
        "authors": " Anatoli Nachev",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17265/2159-5275/2023.04.001"
    },
    {
        "id": 7923,
        "title": "Predictive Maintenance Using Linear Regression",
        "authors": "Rudy Hartono Prayogo, Benedict Ariel Kurnianto, Nidia Pialina Nababan, Suharjito Suharjito",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "Problems regarding machine damage often occur in many industries, especially the manufacturing industry, which causes large losses for companies. This is of course influenced by various factors such as engine temperatures that are too high, engine rotation that is too fast, poor engine torque values, and so on. This research aims to provide predictive analysis results regarding engine conditions that have the potential to experience damage. To achieve this goal, this research will carry out predictive maintenance analysis using a linear regression analysis approach in which two linear regression models will be carried out where the first model involves PCA preprocessing and the second model is carried out without PCA. This research will use the predictive maintenance dataset from the conference (Matzka, 2020). It is known that the MSE, RMSE, MAE, and R2 values of the two methods have the same values, namely 0.909, 0.953, 0.806, and 0.772 respectively. Based on this research, it is concluded that whether PCA is performed or not, it does not significantly affect the results of the regression analysis. This outcome can be attributed to the artificial nature of the dataset, rendering it ideal. Moreover, the retained PCA value of 98% is close to the number of attributes in the original dataset.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36418/syntax-literate.v9i3.15366"
    },
    {
        "id": 7924,
        "title": "Predictive modelling based on statistical modeling of logistic regression for heart disease",
        "authors": "Jincheng Wang",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "The heart is the core driving force for the continuation of human life, and the disease of this organ is bound to be fatal. There are two main types of heart disease. Congenital diseases are caused by developmental problems in unborn children. These problems, mainly in the heart, can damage various parts of the heart. Acquired sexually transmitted diseases are diseases caused by environmental factors and their own growth and development after birth. The purpose of the project model is to predict heart disease and analyse the main types of heart disease in the population. In the whole research process, the most important thing is the establishment of the model. The algorithm principle of this model is logistic regression. Logistic regression is used to make predictions and probability calculations on the data. Through such algorithms, modelling techniques can be used to predict the impact of pathogenic factors on the probability of heart disease. In addition, prevention of heart disease can be improved with accurate and convenient model predictions that can be tailored to the population that fits the predictions. This method can improve the technical level and treatment level of the hospital, and can also reduce the harm caused by heart disease. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/41/20230710"
    },
    {
        "id": 7925,
        "title": "Predictive Methodology for Quality Assessment in Injection Molding Comparing Linear Regression and Neural Networks",
        "authors": "Angel Fernández, Isabel Clavería, Carmelo Pina, Daniel Elduque",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "The use of recycled polypropylene in industry to reduce environmental impact is increasing. Design for manufacturing and process simulation is a key stage in the development of plastic parts. Traditionally, a trial-and-error methodology is followed to eliminate uncertainties regarding geometry and process. A new proposal is presented, combining simulation with the design of experiments and creating prediction models for seven different process and part quality output features. These models are used to optimize the design without developing additional time-consuming simulations. The study aims to compare the precision and correlation of these models. The methods used are linear regression and artificial neural network (ANN) fitting. A wide range of eight injection parameters and geometry variations are used as inputs. The predictability of nonlinear behavior and compensatory effects due to the complex relationships between this wide set of parameter combinations is analyzed further in the state of the art. Results show that only Back Propagation Neural Networks (BPNN) are suitable for correlating all quality features in a single formula. The use of prediction models accelerates the optimization of part design, applying multiple criteria to support decision-making. The methodology is applied to the design of a plastic support for induction hobs. Furthermore, this methodology has demonstrated that a weight reduction of 27% is feasible. However, it is necessary to combine process parameters that differ from the standard ones with a non-uniform thickness distribution so that the remaining injection parameters, material properties, and dimensions fall within tolerances.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/polym15193915"
    },
    {
        "id": 7926,
        "title": "Regression-Based Approach for Proactive Predictive Modeling of Efficient Cloud Cost Estimation",
        "authors": "Mustafa Daraghmeh, Anjali Agarwal, Yaser Jararweh",
        "published": "2023-10-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sds59856.2023.10329194"
    },
    {
        "id": 7927,
        "title": "A Linear Support Vector Regression-Based Model Predictive Control with Repetitive and PI Elements for a Three-Phase Inverter",
        "authors": "Jianwu Zeng, Wei Qiao",
        "published": "2023-10-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecce53617.2023.10362584"
    },
    {
        "id": 7928,
        "title": "Measurement error effects on estimates from linear and nonlinear regression whole‐stand yield models",
        "authors": "John M. Zobel",
        "published": "2024-2",
        "citations": 0,
        "abstract": "AbstractSystems of whole‐stand yield models facilitate projections of forest attributes, but their inputs may be difficult to measure accurately. This study conducted sensitivity analyses to examine the effect of systematic and stochastic measurement errors on outputs from a representative system of equations. Simulated error was added to explanatory variables stand age, site index, or both. Results showed that large systematic error in one variable tended to produce moderate to large percent changes in all models, particularly the height and volume equations (often >50% change). Systematic error in both variables amplified this effect, especially for young, less productive stands. Stochastic error dramatically increased estimate variability (some relative standard errors >50%), particularly in the height and volume models at young ages and low site indices. These results suggest that measurement error may considerably alter projections and increase uncertainty when using whole‐stand yield models, highlighting the need for careful crew training.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/nrm.12384"
    },
    {
        "id": 7929,
        "title": "Multiple Linear Regression Modeling of Brachen Water Quality Parameters for Vannamei Shrimp Cultivation",
        "authors": "Mat Syai’in, Kevin Jonathan, Farrel Muhammad Al Fatih, Siti Azzalea Anisa, Izmi Duwi Cahyaningsih, Muhammad Hizbul Aziz, Faris Robby Zakariya, Ryan Yudha Adhitya, Nasyith Hananur Rohiem, . Mardlijah, Adi Soeprijanto",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012115900003680"
    },
    {
        "id": 7930,
        "title": "Evaporation and production efficiency modeling using classical least square regression and fuzzy linear recurrence",
        "authors": "Kaveh Ostad-Ali-Askari",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4761502"
    },
    {
        "id": 7931,
        "title": "Lifted Graph-based Modeling for Linear Predictive Control of Nonlinear Energy Systems",
        "authors": "Seho Park, Herschel C. Pangborn",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccta54093.2023.10252310"
    },
    {
        "id": 7932,
        "title": "Predictive Modeling of WQI of Trans Amadi Industrial Layout, Port Harcourt, Rivers State Nigeria Using Multiple Linear Regression",
        "authors": "Agori, J. E.,  , Atikpo, E, Iwemah E.R., Umukoro, O. L.,  ,  ,  ",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "It is important to monitor water quality and understand factors influencing indices like the Water Quality Index (WQI). This study aimed to assess water quality and to develop a predictive model for WQI based on common ions and using multiple linear regression analysis. Water samples were collected from 15 locations in Trans Amadi Industrial Layout, Port Harcourt and analyzed for 19 groundwater quality parameters (Temp, EC, DO, Turbidity, NO3, HCO3, pH, TDS, CI, SO₄, Fe, Na, Ca, Mg, Zn, Cu, Cr, Pb and Cd). Results of correlation analysis revealed that there were significant relationships between some of these parameters and the WQI. A multiple linear regression (MLR) model was developed to quantitatively examine relationships between the Water Quality Index (WQI) and key indicator variables and to predict the WQI based on the parameters. The model exhibited a strong coefficient of determination (R-squared = 0.9811), indicating a high level of accuracy in predicting the WQI. Mean Squared Error (MSE) and Root Mean Squared Error (RMSE) values confirmed the model's predictive capability. Overall, this study contributed to understanding the factors influencing water quality and showed that linear regression is a reliable method for predicting WQI. The model accurately explains variation in WQI based on nitrate, chloride, sodium, calcium and magnesium levels.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47191/ijmra/v6-i10-36"
    },
    {
        "id": 7933,
        "title": "Exploring the Predictive Power of Linear Regression in Real Estate Pricing: A Case Study on the Interplay between Asked Price and House Characteristics",
        "authors": "Faheem Abdeen Kulam Magdoom",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4627297"
    },
    {
        "id": 7934,
        "title": "Predictive Modeling of Student Academic Performance and Analysis of Environmental Change: A Random Forest Regression Approach",
        "authors": "Kem Emmanuel, Patrick Hosein",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictmod59086.2023.10438150"
    },
    {
        "id": 7935,
        "title": "Predictive Modeling of Run Time for Model and Data Distributed Inferencing Using Gradient Boosting Regression",
        "authors": "Scott Brown, David Harman, Cleon Anderson, Matthew Dwyer",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386633"
    },
    {
        "id": 7936,
        "title": "Study on Using Linear Regression Modeling to Better Estimate Total Surgical Procedure Time",
        "authors": "Siji Chen",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "To make the most of the resources available in the operating room, careful planning of the available block time and the patient case sequences is required (OR). These planning methods will only help if the forecasts provided by TPT can be relied upon. This study makes use of linear regression models to improve TPT forecasts. These models are given estimated surgeon-controlled time (eSCT) in addition to other parameters of relevance. Surgical procedures at six Dutch institutions between 2012 and 2016 were evaluated using data from a benchmarking database. There were 79,983 contributors, which resulted in 199,772 hours of OR being reported. We analyzed the risk variables for TPT, which revealed that eSCT, patient age, surgical type, ASA physical status category, and anesthetic procedure were all contributors. During calculating the projected TPT for each file, the eSCT was multiplied by a fixed ratio model (discussed in further detail elsewhere) by a factor of 1.33. According to the findings of the research conducted by van Veen-Berkx et al., a conservative estimate of the period during which anesthesia is stable is around 33 percent of the SCT (ACT). In conclusion, we analyzed different linear regression models to predict TPT. These models included eSCT as one of the independent factors among the other covariates. In the end, each of the regression models was retested, this time to see whether or not it was possible to predict ACT reliably without using eSCT as a covariate (which leads to TPT by adding SCT). The most accurate projections of TPT were generated by a linear regression model that used eSCT, the kind of operation, the ASA classification, and the type of anesthesia. Compared to the fixed ratio model and the ACT prediction approach, the performance of this model was very satisfactory. Significant cost savings and increases in overall productivity may be realized if more accurate estimates were included in the planning and sequencing algorithms used to enhance operating room usage.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v35i.7020"
    },
    {
        "id": 7937,
        "title": "Quadratic Regression Model Based Predictive Control of PMSM Drives with Field Weakening Operation Capability Constrained to the Linear Modulation Range",
        "authors": "Kristóf Bándy, Péter Stumpf",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isie51358.2023.10228069"
    },
    {
        "id": 7938,
        "title": "Predictive Modeling of Forest Fires in Yunnan Province: An Integration of ARIMA and Stepwise Regression Analysis",
        "authors": "Yan Shi, Changping Feng, Shipeng Yang",
        "published": "2023-12-27",
        "citations": 1,
        "abstract": "As global warming progresses, forest fires have become more frequent, leading to the destruction of forest biodiversity and consequently affecting Earth’s ecosystems and human living conditions. The ability to predict the long-term trend of forest fires holds significant value for fire prevention and management. In Yunnan Province, China, a region rich in forest resources, this study utilized temperature, average annual rainfall, relative humidity, and wind speed data from 1991 to 2021. We forecasted forest fires using the stepwise regression and autoregressive integrated moving average (ARIMA) model, incorporating the collected forest fire data. The findings reveal a negative correlation between rainfall and forest fire incidence, whereas wind speed exhibited a positive correlation. The ARIMA model forecasts a cyclical trend in fires from 2022 to 2033, with considerable fluctuations in the number of fires, notably in 2027 and 2033. The projected affected area is anticipated to show a marked increase from 2028 onwards. This research not only provides a novel methodology for forecasting forest fires but also lays a scientific foundation for the development of future fire prevention and mitigation strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14010256"
    },
    {
        "id": 7939,
        "title": "Predictive Modeling of  COVID- 19 Confirmed Cases  Using Regressive Objective Regression Methodology",
        "authors": "Fernando Martínez Fernández",
        "published": "2023-6-25",
        "citations": 0,
        "abstract": "The use of predictive models for the evolution of the pandemic is of great help in decision-making by the authorities. The fundamental objective of this work was to obtain through the Regressive Objective Regression, predictions of confirmed cases of COVID-19 in the Marta Abreu Teaching Polyclinic of the city of Santa Clara. In short-term modeling the model was significant at 19.7% with an error of 0.12. Variables dichotommics, saw tooth and saw tooth inverted and risk returned in 1.3, and 12 cases the trend is negative and not significant. We can conclude that a perfect result was obtained in the long term with the ROR methodology. The short-term ROR model depends on the cases of COVID-19 in the previous case, 3 cases back and 12 cases back without significant trend. The long-term model is perfect and depends on the cases of COVID-19 in 12 cases ago, with a negative trend.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21786/bbrc/16.2.1"
    },
    {
        "id": 7940,
        "title": "CAPM-alpha estimation with robust regression vs. linear regression",
        "authors": "Angel Samaniego,  ",
        "published": "2023-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24275/uam/azc/dcsh/ae/2022v38n97/samaniego"
    },
    {
        "id": 7941,
        "title": "Modeling Path Loss With the Growth Stages of a Rice Plantation Using Fuzzy Linear Regression",
        "authors": "Supachai Phaiboon",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3310265"
    },
    {
        "id": 7942,
        "title": "Modeling of Knowledge Toward Herbal Medicine for Oral Health Using Multiple Linear Regression and Neural Network",
        "authors": "Abedelmalek Tabnjh, Wan Muhamad Amir W Ahmad, Ruhaya Hasan",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7759/cureus.41790"
    },
    {
        "id": 7943,
        "title": "Early Detection of Lung Diseases by using Multiple Correlation and Multiple Linear Regression Predictive Algorithms on Air Pollution Data Set",
        "authors": "K. Siva Krishna, Thatavarti Satish, Jyotirmaya Mishra",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212177"
    },
    {
        "id": 7944,
        "title": "PREDICTIVE MODELING OF CLICK-THROUGH RATES: A REGRESSION ANALYSIS APPROACH",
        "authors": "Suleyman Suleymanzade,  ",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "This research uses advanced regression techniques to develop a robust predictive model for Click-Through Rates (CTR) in online advertising. The study leverages a diverse dataset encompassing various advertising campaigns and user interactions to uncover patterns and relationships influencing click-through behavior. The goal is to provide advertisers with a tool for accurate CTR prediction, enabling them to optimize campaigns and allocate resources effectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32010/26166127.2023.6.2.199.202"
    },
    {
        "id": 7945,
        "title": "Modeling The Influenced Factors of Remaining Operation Results Using Multiple Linear Regression",
        "authors": "Widiya Astuti Alam Sur, Ines Saraswati Machfiroh, Ricky Iskandar",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "The amount of Remaining Operation Results (ROR) obtained by Koperasi can reflect the health ofits financial management. Many economic factors can affect the ROR of Koperasi itself. This studyaims to determine the economic factors that significantly influence ROR based on a statistical model ofmultiple linear regression. The novelty of this research provides new analytical results that compare themost three influential factors based on previous research to show the factors significantly influencingthe ROR. The quantitative data used the five years financial statements of Koperasi Sawit Makmur in2017-2021 consists of 20 data on liabilities, net worth, assets, and ROR of Koperasi Sawit Makmur. Theresults show that asset variable as an excluded variable that does not affect the ROR of Koperasi withR2 = 0, 961. Liabilities and net worth variables can explain 96.1% of ROR, with 3.9% can be explainedby assets and other variables not included in the study. Liabilities have a negative and tangible effect,and net worth has a positive and partially real influence on ROR. The factor with the most dominantinfluence on ROR is net worth, with an influence percentage of 63,80%. The future research is expectedto provide an overview of net worth and asset determinants using related statistical methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30812/varian.v7i1.2635"
    },
    {
        "id": 7946,
        "title": "Evaluating the Predictive Accuracy and Precision of AlexNet and Linear Regression for Women’s Education Post-Independence",
        "authors": "A. Mary Joy Kinol, R M Bommi, M. Nalini, G. Uganya",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacrs58579.2023.10405081"
    },
    {
        "id": 7947,
        "title": "An Empirical Investigation of the Sales-Promotion Relationship: Modeling Factors Through Linear Regression Analysis",
        "authors": "Anuja Bokhare, Aishwarya Kulkarni, Madhuri Rao",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397783"
    },
    {
        "id": 7948,
        "title": "Harmonizing and aligning M/EEG datasets with covariance-based techniques to enhance predictive regression modeling",
        "authors": "Apolline Mellot, Antoine Collas, Pedro L. C. Rodrigues, Denis Engemann, Alexandre Gramfort",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "Abstract\nNeuroscience studies face challenges in gathering large datasets, which limits the use of machine learning (ML) approaches. One possible solution is to incorporate additional data from large public datasets; however, data collected in different contexts often exhibit systematic differences called dataset shifts. Various factors, for example, site, device type, experimental protocol, or social characteristics, can lead to substantial divergence of brain signals that can hinder the success of ML across datasets. In this work, we focus on dataset shifts in recordings of brain activity using MEG and EEG. State-of-the-art predictive approaches on magneto- and electroencephalography (M/EEG) signals classically represent the data by covariance matrices. Model-based dataset alignment methods can leverage the geometry of covariance matrices, leading to three steps: re-centering, re-scaling, and rotation correction. This work explains theoretically how differences in brain activity, anatomy, or device configuration lead to certain shifts in data covariances. Using controlled simulations, the different alignment methods are evaluated. Their practical relevance is evaluated for brain age prediction on one MEG dataset (Cam-CAN, n = 646) and two EEG datasets (TUAB, n = 1385; LEMON, n = 213). Among the same dataset (Cam-CAN), when training and test recordings were from the same subjects but performing different tasks, paired rotation correction was essential (δR2=+0.13 (rest-passive) or +0.17 (rest-smt)). When in addition to different tasks we included unseen subjects, re-centering led to improved performance (δR2=+0.096 for rest-passive, δR2=+0.045 for rest-smt). For generalization to an independent dataset sampled from a different population and recorded with a different device, re-centering was necessary to achieve brain age prediction performance close to within dataset prediction performance. This study demonstrates that the generalization of M/EEG-based regression models across datasets can be substantially enhanced by applying domain adaptation procedures that can statistically harmonize diverse datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/imag_a_00040"
    },
    {
        "id": 7949,
        "title": "Proposing a predictive model of individual micro-entrepreneurship in Brazilian metropolitan areas through multiple linear regression",
        "authors": "Gabriel Marcuzzo d, o Canto Cavalheiro",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijplap.2024.135198"
    },
    {
        "id": 7950,
        "title": "MODELING USING LINEAR AND POLYNOMIAL REGRESSION ALGORITHMS OF MACHINE LEARNING BASED ON MAHALLA DATA",
        "authors": "M.F. Ibragimov, O.K. Khujaev, H.J. Rakhimboev, D.Z. Khaitboeva",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "The article deals with the problem of creating a model and algorithm to support the importance of monitoring in the management of socio-economic processes in self-government bodies, decision-making in self-government bodies through machine learning. Models and algorithms of the decision-making process in digital form are studied, consisting of independent data, quantitative parametric assessments of the activities of self-government bodies and general expert assessments of self-government bodies. This model is used to quantify the generalized expert assessment of the condition of the object of the new self-government body, which is interpreted as a proposed improvement solution.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25743/dir.2022.99.37.017"
    },
    {
        "id": 7951,
        "title": "A study on vegetable commodity replenishment considering single item quantity limitations—based on gray prediction and linear regression modeling",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070916"
    },
    {
        "id": 7952,
        "title": "Modeling multiple linear regression analysis in the formation of biogas pressure",
        "authors": "Basirun Basirun, Ristu Haiban Hirzi, Muanah Muanah",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Fossil energy reserves to date are dwindling inversely proportional to the amount of consumption. So to overcome this problem, alternative energy is needed, one of which is biogas which is sourced from organic waste. The biogas production process has so far experienced many obstacles so that the formation of pressure has not been optimal. The aim of the research was to create a model to see the magnitude of the influence of humidity and temperature on the pressure of the biogas produced. The method used is multiple linear regression with the following stages, identifying variables, testing classical assumptions, model building, and model goodness. Based on the results of the analysis, the model Y ̂=17.029-0.042X_1+3.480X_2 is obtained. Simultaneous test results show that simultaneously humidity and temperature have a significant effect because the sig is 0.000<α(0.05). The results of the partial test (T-Test) of each variable also showed significant results on biogas pressure because the sig was 0.000<α(0.05). The coefficient of determination of 0.8180 means that humidity and temperature variables affect the formation of biogas pressure by 81.80% and the rest is influenced by other factors such us pH, C/NRatio, starter, and so on.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31764/jau.v10i3.16302"
    },
    {
        "id": 7953,
        "title": "Modeling Expenditure Standard Analysis to Assess the Reasonableness of Expenditure Budgets in Local Government Using Linear Regression",
        "authors": "Moch Lukman Hakim, Geraldi Catur Pamuji",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incitest59455.2023.10396915"
    },
    {
        "id": 7954,
        "title": "Bayes' approach of linear regression to modeling  the human development index in Indonesia",
        "authors": "Achmad Fazriwanandi, Darnah Andi Nohe, Wasono Wasono",
        "published": "2023-4-11",
        "citations": 0,
        "abstract": "Regression analysis is one of the data analysis techniques that can be used to examine the correlation between two variables, namely dependent variable and independent variable. It’s can be used to determine the parameter estimation of linear regression models are; the method of least squares or ordinary least square (OLS), Maximum likelihood estimation (MLE), and the Bayes method. Bayes' method defines the parameter as a random variable that describes the initial comprehension of the parameter before the observation was initiated and elucidated in an initial distribution refer as the prior distribution. The prior distribution used in this study is the pseudo prior distribution. The Data used in this study is secondary data, namely human development index (HDI) data in 2020, which was obtained from the website of the Central Statistics Agency (BPS). This study aims to estimate the regression model parameters using the Bayes method on the HDI data and the population data which adepts with information and communication technology (ICT) in Indonesia in 2020. The results of the specimen and analysis showed that population variables with ICT adepts have a significant effect on HDI variables. The results of the determination coefficient showed that 78.42% of HDI variables are affected by the population variables with ICT adepts while the remaining 21.58% are affected by other factors that have not been studied.\r\nKeywords: Bayes method, human development index, information communication and technology, linear regression, pseudo prior.MSC2020: 62F15",
        "keywords": "",
        "link": "http://dx.doi.org/10.19184/mims.v23i1.31641"
    },
    {
        "id": 7955,
        "title": "Methods you can count on: A simulation experiment showing the advantages generalized linear modeling (GLM) over the linear regression of log-transformed count data",
        "authors": "Grant S. McCall, Antonia Villafranca",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jasrep.2024.104377"
    },
    {
        "id": 7956,
        "title": "Multiple Linear Regression and Bagging-based Analysis and Modeling of Influence of Mother's Socio-economic Attributes on Anxiety of Online Education",
        "authors": "Liu Liu, Lili Jiang",
        "published": "2023-2-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecei57668.2023.10105352"
    },
    {
        "id": 7957,
        "title": "Harnessing Data-Driven Insights: Predictive Modeling for Diamond Price Forecasting using Regression and Classification Techniques",
        "authors": "Md Shaik Amzad Basha, Peerzadah Mohammad Oveis",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "In the multi-faceted world of gemology, understanding diamond valuations plays a pivotal role for traders, customers, and researchers alike. This study delves deep into predicting diamond prices in terms of exact monetary values and broader price categories. The purpose was to harness advanced machine learning techniques to achieve precise estimations and categorisations, thereby assisting stakeholders in informed decision-making. The research methodology adopted comprised a rigorous data preprocessing phase, ensuring the data's readiness for model training. A range of sophisticated machine learning models were employed, from traditional linear regression to more advanced   ensemble methods like Random Forest and Gradient Boosting. The dataset was also transformed to facilitate classification into predefined price tiers, exploring the viability of models like Logistic Regression and Support Vector Machines in this context. The conceptual model encompasses a systematic flow, beginning with data acquisition, transitioning through preprocessing, regression, and classification analyses, and culminating in a comparative study of the performance metrics. This structured approach underscores the originality and value of our research, offering a holistic view of diamond price prediction from both regression and classification lenses. Findings from the analysis highlighted the superior performance of the Random Forest regressor in predicting exact prices with an R2 value of approximately 0.975. In contrast, for classification into price tiers, both Logistic Regression and Support Vector Machines emerged as frontrunners with an accuracy exceeding 95%. These results provide invaluable insights for stakeholders in the diamond industry, emphasising the potential of machine learning in refining valuation processes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i9.8355"
    },
    {
        "id": 7958,
        "title": "Regression predictive modeling of high-speed motorized spindle using POA-LSTM",
        "authors": "Zhaolong Li, Junming Du, Wenming Zhu, Baodong Wang, Qinghai Wang, Benchao Sun",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.csite.2024.104053"
    },
    {
        "id": 7959,
        "title": "Inferential Statistics II: Linear Regression via the Linear Least Square Method in R",
        "authors": "Steffen Schwerdtfeger",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56776/abbd964d.f663afb2"
    },
    {
        "id": 7960,
        "title": "A Fully Differential Multi-bit MDAC Modeling with Multiple Linear Regression Calibration",
        "authors": "Jingwu Gong, Suzhen Cheng, Nan Liu, Peng Ding, Zhanqiang Ru, Helun Song",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cisce58541.2023.10142448"
    },
    {
        "id": 7961,
        "title": "Predictive modeling and multi objective optimization of Al 6063 for engraving depth and surface roughness using grey relational and regression analysis",
        "authors": "Anita Pritam, Rati Ranjan Dash, Ramesh Kumar Mallik",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.matpr.2021.07.271"
    },
    {
        "id": 7962,
        "title": "MODELING THE INTERRELATION BETWEEN ENERGY EFFICIENCY AND SHIP SAFETY BASED ON MULTIPLE LINEAR REGRESSION",
        "authors": "Oleksiy Melnyk",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "Energy efficiency and ship safety are two important aspects of maritime transportation that are essential for economic efficiency, the environment and maritime safety. Ship safety ensures the protection of crew, cargo and the environment. Energy-efficient technologies in shipping contribute to economic efficiency and lower fuel costs, as well as reduce greenhouse gas emissions and, most importantly, increase ship maneuverability, reducing the likelihood of getting into accidents, while the choice of energy-efficient materials and optimization of the structure and hull increase the ship's resistance to adverse conditions. This article explores the relationship between energy efficiency and ship safety. The main objective of the study is to assess the impact of ship energy efficiency on safety in the context of operation. The study applies a  methodology to establish the  relationship between independent variables, such as energy efficiency, ship's technical condition and crew training, and the dependent variable, ship's operational safety. The article presents the results of the analysis of the company's fleet data, where energy efficiency and safety indicators  evaluate each vessel. Using a multiple linear regression model, the coefficients of influence of each independent variable on ship safety were determined. These regression coefficients allow us to assess the contribution of each factor to the overall safety of the ship and identify the most significant factors. The results of the study indicate a significant impact of ship energy efficiency on  operational safety. Vessels with higher energy efficiency indicators have a high level of operational safety. This allows shipowners and ship operators to take measures to improve the energy efficiency of their fleet in order to increase safety and efficiency of  operation. The results of this study can be useful for ship owners, ship  operators, as well as for  representatives of maritime organizations and regulatory authorities involved in shipping safety. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.18664/1994-7852.204.2023.284042"
    },
    {
        "id": 7963,
        "title": "Predictive modeling of drilling operation for optimum MRR, machine power, and estimated tool life using fuzzy logic and regression analysis",
        "authors": "Arti Saxena, Y.M. Dubey, Manish Kumar",
        "published": "2023-5-4",
        "citations": 0,
        "abstract": "Models prediction is done for accurately anticipating metal removal rate (MRR), machine power (MP), and estimated tool life (ETL), which are vital in the industrial setup for better precision and higher speed. Cutting speed (CS) and feed rate (FR) were employed as controlling parameters for machining of P8 material on the SBCNC 60. By maintaining one of the two parameters constant at the mid-level, data from drilling experiments are sampled and examined. Application of ANOVA yields that the feed rate is 52.61 percent significant and the cutting speed is 46.49 percent significant for MRR, while cutting speed contributes 57.59 percent and feed rate contributes 41.77 percent to the machine power, and the same cutting speed contributes 83 percent to ETL’s output. The analysis results that CS at 190 m/min and FR at 0.3 mm/rev are optimal combinations of input control parameters for all output of drilling operations. The development of prediction models is done by fuzzy and its comparison is carried out with classical regression method for the achievement of optimum MRR, MP and ETL. Numerical parameters for establishing the optimum model are calculated for MAPE, RMSE, MAD, and correlation coefficient between experimental values and the values obtained from regression, and fuzzy logic predictions. MAPE, RMSE, MAD, and correlation coefficient calculated 1.27%, 2.43, 1.89, and 0.99 for MRR,0.97%,0.10, 0.09 and 0.997 for MP and 5.12%,1.01,0.67 and 0.99 for ETL respectively. Hence, the proposed fuzzy logic rules effectively predict the MRR, MP, and ETL on P8 material with optimized performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/jifs-222768"
    },
    {
        "id": 7964,
        "title": "A New Model for Building Energy Modeling and Management Using Predictive Analytics: Partitioned Hierarchical Multitask Regression (PHMR)",
        "authors": "Shuluo Ning, Hyunsoo Yoon",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "Buildings are major consumers of energy, accounting for a significant proportion of total energy use worldwide. This substantial energy consumption not only leads to increased operational costs but also contributes to environmental concerns such as greenhouse gas emissions. In the United States, building energy consumption accounts for about 40% of total energy use, highlighting the importance of efficient energy management. Therefore, accurate prediction of energy usage in buildings is crucial. However, accurate prediction of building energy consumption remains a challenge due to the intricate interaction of indoor and outdoor variables. This study introduces the Partitioned Hierarchical Multitask Regression (PHMR), an innovative model integrating recursive partition regression (RPR) with multitask learning (hierML). PHMR adeptly predicts building energy consumption by integrating both indoor factors, such as building design and operational variables, and outdoor environmental influences. Rigorous simulation studies illustrate PHMR’s efficacy. It outperforms traditional single-predictor regression models, achieving a 32.88% to 41.80% higher prediction accuracy, especially in scenarios with limited training data. This highlights PHMR’s robustness and adaptability. The practical application of PHMR in managing a modular house’s Heating, Ventilation, and Air Conditioning (HVAC) system in Spain resulted in a 37% improvement in prediction accuracy. This significant efficiency gain is evidenced by a high Pearson correlation coefficient (0.8) between PHMR’s predictions and actual energy consumption. PHMR not only offers precise predictions for energy consumption but also facilitates operational cost reductions, thereby enhancing sustainability in building energy management. Its application in a real-world setting demonstrates the model’s potential as a valuable tool for architects, engineers, and facility managers in designing and maintaining energy-efficient buildings. The model’s integration of comprehensive data analysis with domain-specific knowledge positions it as a crucial asset in advancing sustainable energy practices in the building sector.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/5595459"
    },
    {
        "id": 7965,
        "title": "Statistical modeling in the laser cladding process of Inconel 625 via linear regression and response surface method",
        "authors": "Mohammad Reza Borhani, Mohammad Rajabi, Reza Shojarazavi, Roohollah Jamaati",
        "published": "2023-5-1",
        "citations": 2,
        "abstract": "Inconel 625 is a corrosion-resistant alloy with excellent mechanical properties, which has many applications in the oil, gas, and aerospace industries. Considering that the statistical modeling of the cladding indicates the final quality of the laser cladding; therefore, in this work, the geometric characteristics of a single-track on a substrate similar to the coating material were investigated. The impact of main process parameters in direct laser deposition, including the powder feeding rate, laser power, and scanning speed, on the geometric features of single-pass, such as height, dilution, width, and wetting angle, was investigated by the response surface method and linear regression. According to the results, the single-pass width directly correlates with the power and inversely correlates with the scan rate. The height of a single pass has a direct relationship with the powder feeding rate and the power, while it inversely correlates with the scan rate. Dilution directly correlates with the scanning velocity and the powder feeding rate, but it has little correlation with the laser power. The wetting angle directly correlates with the scanning rate and the powder feeding rate, while having an inverse correlation with the power of the laser.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2351/7.0000964"
    },
    {
        "id": 7966,
        "title": "Komparasi linear regression, random forest regression, dan multilayer perceptron regression untuk prediksi tren musik TikTok",
        "authors": "Nadia Sofie Soraya, Hendry Hendry",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Prediksi korelasi feature audio terhadap lagu yang populer di TikTok merupakan hal penting dalam industri musik. Dengan bekal data yang memiliki beberapa feature audio maka dilakukan penelitian menggunakan metode Linear Regression (LR), Random Forest Regression (RFR), dan Multilayer Perceptron Regression (MLP Regression) untuk membandingkan model yang dapat memprediksi popularitas secara efektif dan feature yang mempengaruhi popularitas lagu di TikTok. Selain itu dilakukan juga Exploratory Data Analysis (EDA) untuk mendapatkan insight data. Hasil dari proses EDA yaitu popularitas lagu terbanyak berada pada range 40-80, durasi lagu antara 2-3 menit, feature loudness berkorelasi positif dengan energy, demikian juga antara artist_pop dan track_pop. Set feature importance pada model LR dan RFR untuk feature target track_pop adalah artist_pop, loudness, dan duration_ms. Metode LR memiliki hasil terbaik untuk dataset yang dipakai, dengan MSE sebesar 0.0313, RMSE sebesar 0.177, dan MAE sebesar 0.118.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24246/aiti.v20i2.191-205"
    },
    {
        "id": 7967,
        "title": "Kernel Cox partially linear regression: Building predictive models for cancer patients' survival",
        "authors": "Yaohua Rong, Sihai Dave Zhao, Xia Zheng, Yi Li",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "Wide heterogeneity exists in cancer patients' survival, ranging from a few months to several decades. To accurately predict clinical outcomes, it is vital to build an accurate predictive model that relates the patients' molecular profiles with the patients' survival. With complex relationships between survival and high‐dimensional molecular predictors, it is challenging to conduct nonparametric modeling and irrelevant predictors removing simultaneously. In this article, we build a kernel Cox proportional hazards semi‐parametric model and propose a novel regularized garrotized kernel machine (RegGKM) method to fit the model. We use the kernel machine method to describe the complex relationship between survival and predictors, while automatically removing irrelevant parametric and nonparametric predictors through a LASSO penalty. An efficient high‐dimensional algorithm is developed for the proposed method. Comparison with other competing methods in simulation shows that the proposed method always has better predictive accuracy. We apply this method to analyze a multiple myeloma dataset and predict the patients' death burden based on their gene expressions. Our results can help classify patients into groups with different death risks, facilitating treatment for better clinical outcomes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/sim.9938"
    },
    {
        "id": 7968,
        "title": "Use of logistic regression, nonlinear regression, and linear regression in lung cancer research",
        "authors": "Zhuonan Yu",
        "published": "2023-3-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2669953"
    },
    {
        "id": 7969,
        "title": "A New Decision Framework for Hybrid Solar and Wind Power Plant Site Selection Using Linear Regression Modeling Based on GIS-AHP",
        "authors": "Meysam Asadi, Kazem Pourhossein, Younes Noorollahi, Mousa Marzband, Gregorio Iglesias",
        "published": "2023-5-21",
        "citations": 3,
        "abstract": "Currently, worldwide attention to clean energy and sustainable energy has been expedited because of its many environmental benefits. In fact, wind and solar energies play a prime role in decarbonizing the energy market. However, finding the most suitable locations for wind/solar power plants is difficult because of the non-homogeneous distribution of these sources. This paper presents a novel method for selecting the optimal locations for wind and solar farms by mapping the space of the decision criteria to the site score. In addition, the multiple linear regression model was used, with the help of the combination of GIS and AHP methods, to model the siting of wind and solar power plants. The site scoring method used in this study is reliable and globally evaluated; therefore, the scores are accurate and effective. To reveal the ability of the proposed method, two study areas were investigated and researched. The results achieved based on the introduced method showed that, in case study 1, areas with an area of about 9, 4 and 7 km2 are suitable for the construction of wind, solar and wind/solar power plants, respectively. This paper also used fourteen existing wind/solar, wind and solar farms from five continents around the world. The results showed that the suggested model acts the same as the real data. In addition to the interest these results hold for the development of renewable energy in the study area, this novel approach may be applied elsewhere to select optimum sites for wind, solar, and combined wind and solar farms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15108359"
    },
    {
        "id": 7970,
        "title": "Climate Change and Rice Production in Bangladesh: Finding the Best Prospective Factors Using Multiple Linear Regression Modeling Techniques",
        "authors": "Mst. Noorunnahar, Rabbani Rushsa, Keya Rani Das",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Climatic factors like temperature, rainfall, humidity, CO2 and solar radiation significantly impact agricultural production. Bangladesh is primarily an agriculture-based developing country. Rice (Oryza sativa L.), the main food of Bangladeshi people also provides a significant percentage of their regular, balanced diet. Many studies have been conducted to determine the effects of climate variability and change on rice productivity in Bangladesh. This study aimed to investigate the relationship between rice crop production and climate variables (namely, average temperature, rainfall, CO2, and humidity) and find out the best model that has an actual impact on rice production. Selecting 'potential predictors' from numerous possible variables to influence the forecast variable and investigating the most appropriate model with a subset of the potential predictors are two major difficulties of fitting the multiple linear regression model. Best subset regression and stepwise regression were used to fit the model using R software. Our results revealed that temperature and CO2 were statistically significant for rice production at 5% and 1% levels of significance respectively. From Adjusted R2, climatic parameters account for 17.39 percent of the variation in rice production. Temperature and CO2 are the best predictors, according to model Cp and AIC values, and stepwise regression also supports this finding. The model that had been so successfully fitted was considered to be highly significant, demonstrating its potential for use in reality by the concerned planners and policymakers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24018/ejfood.2023.5.5.724"
    },
    {
        "id": 7971,
        "title": "Modeling of COVID‐19 death rate using various air pollutants: A multiple linear regression approach",
        "authors": "Kambhampati Teja, Nirban Laskar, Ruhul Amin Mozumder",
        "published": "2023-12",
        "citations": 0,
        "abstract": "AbstractAir pollution is a significant health risk, especially for vulnerable populations such as children, people with chronic illnesses, the elderly, and the economically and socially disadvantaged. Furthermore, air pollution has enormous social costs that we all bear in the form of premature deaths, low productivity, sick leave, and other strains on the healthcare system. The primary sources of air pollution are traffic, home fires, and industry. Measuring NO2 levels in air pollution reveals the extent of pollution caused by traffic, particularly diesel vehicles, which are the primary source of NO2. COVID‐19 rates are rising in areas with high levels of air pollution, according to mounting evidence. Toxic contaminants can make people more susceptible to COVID‐19. The causal relationship between air pollution and COVID‐19 cases has yet to be established, but experts warn that long‐term exposure will undoubtedly make people more susceptible to lung infections. Air pollution has been linked to an increase in cancer, heart disease, stroke, diabetes, asthma, and other comorbidities by inducing cellular damage and inflammation throughout the body. All of these factors increase the risk of death in COVID‐19 patients. As a result, air quality parameters must be predicted and monitored. To predict results, this study proposes a statistical‐based machine learning approach. Using multiple linear regression (MLR), Decision Tree (D.T.), and Random Forest (R.F.), the experimental results achieved 80%, 73%, and 65% accuracy on the dataset, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/tqem.21973"
    },
    {
        "id": 7972,
        "title": "Implementing QSPR modeling via multiple linear regression analysis to operations research: a study toward nanotubes",
        "authors": "Zhi-hao Hui, Adnan Aslam, Salma Kanwal, Saadia Saeed, Khadija Sarwar",
        "published": "2023-3-3",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1140/epjp/s13360-023-03817-5"
    },
    {
        "id": 7973,
        "title": "MODELING CLUSTERWISE LINEAR REGRESSION ON POVERTY RATE IN INDONESIA",
        "authors": "Eni Meylisah, Dyah Setyo Rini, Herlin Fransiska, Winalia Agwil, Bagus Sartono",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "When a person's income is so low that it cannot cover even the most basic living expenses, they are said to be poor. Data on poverty levels and hypothesized causes are used in this study. If the data pattern forms clusters, one of the regression analyses that can be used is Clusterwise Linear Regression (CLR). Therefore, this study aimed to determine the poverty rate modeling in Indonesia with the CLR method. The results showed that the best model is with 3 clusters, that for cluster 1, the factors that significantly affect the percentage of poverty are the percentage of electricity users  , the number of small and micro industries  and the number of tourist villages  n cluster 2, the amount of village tours  . In cluster 3, the percentage of users of electricity  and the percentage of villages that have mining and quarrying  .",
        "keywords": "",
        "link": "http://dx.doi.org/10.30598/barekengvol17iss3pp1653-1662"
    },
    {
        "id": 7974,
        "title": "Feature Analysis of Predictors Affecting the Nidus Obliteration of Linear Accelerator-Based Radiosurgery for Arteriovenous Malformations Using Explainable Predictive Modeling",
        "authors": "Kwang Hyeon Kim, Moon-Jun Sohn",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "This study aimed to evaluate prognostic factors associated with nidus obliteration following stereotactic radiosurgery (SRS) for cerebral arteriovenous malformations. From January 2001 to January 2018, 119 patients who underwent SRS with AVM were studied to analyze major prognostic factors (age, prescription dose (Gy), volume (mm3), nidus size (cm), and Spetzler–Martin (SM) grade) for nidus obliteration. A random forest and tree explainer was used to construct a predictive model of nidus obliteration. The prognostic factors affecting nidus obliteration from most to least important were age, nidus size, volume, total prescription dose, and SM grade, using a predictive model. In a specific case for nidus size (1.5 cm), total dose (23 Gy), and SM grade (2), the result showed a high obliteration score of 0.75 with the actual obliteration period of 6 months spent; the mean AUC was 0.90 in K-fold cross validation. The predictive model identified the main contributing factors associated with a prognostic of nidus obliteration from linear accelerator-based SRS for cerebral AVM. It was confirmed that the results, including the prognostic factors, are potentially useful for outcome prediction for patient and treatment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13074267"
    },
    {
        "id": 7975,
        "title": "Estimation of postseismic structural damage with the use of multiple linear regression and fuzzy linear regression methods",
        "authors": "Fani Gkountakou, Anaxagoras Elenas, Basil Papadopoulos",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0193150"
    },
    {
        "id": 7976,
        "title": "Standard Errors for Predictive Regression with Overlapping Observations",
        "authors": "Ke-Li Xu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4470760"
    },
    {
        "id": 7977,
        "title": "Optimizing Pension Participation in Kenya through Predictive Modeling: A Comparative Analysis of Tree-Based Machine Learning Algorithms and Logistic Regression Classifier",
        "authors": "Nelson Kemboi Yego, Juma Kasozi, Joseph Nkurunziza",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "Pension plans play a vital role in the economy by impacting savings, consumption, and investment allocation. Despite declining mortality rates and increasing life expectancy, pension enrollment remains low, affecting the long-term financial stability and well-being of populations. To address this issue, this study was conducted to explore the potential of predictive modeling techniques in improving pension participation. The study utilized three tree-based machine learning algorithms and a logistic regression classifier to analyze data from a nationally representative 2019 Kenya FinAccess Household Survey. The results indicated that ensemble tree-based models, particularly the random forest model, were the most effective in predicting pension enrollment. The study identified the key factors that influenced enrollment, such as National Health Insurance Fund (NHIF) usage, monthly income, and bank usage. The findings suggest that collaboration among the NHIF, banks, and pension providers is necessary to increase pension uptake, along with increased financial education for citizens. The study provides valuable insight for promoting and optimizing pension participation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/risks11040077"
    },
    {
        "id": 7978,
        "title": "Predicting BMW Stock Price Based on Linear Regression, LSTM, and Random Forest Regression",
        "authors": "Sijian Tao",
        "published": "2023-3-2",
        "citations": 2,
        "abstract": "The stock market is one of the most significant aspects of a county’s economy. Stock price prediction is not easy to implement due numerous features influencing it. This study will choose BMW as the target company, and predict its stock price with various state-of-art scenarios. The central claim of this article is to construct three reliable models that could predict the stock price of BMW by extracting and analyzing previous days’ stock prices. The major analysis is done by modeling and exploring data analysis, and is composed of several graphical methods. For the modeling part, three models (i.e., Multiple Linear Regression, LSTM, and Random Forest Regression) are constructed to predict BMW stock price. The database consists of five years of BMW stock prices on Kaggle to explore more analysis. Then, step by step checking and demonstrating are presented to prove the feasibility and precision of these three models. According to the analysis, the most precise model that has the highest accuracy and lowest error by analyzing regression and model results. These model final outcomes indicate that the Multiple Linear Regression model presents a higher accuracy and lower mean squared error than LSTM and Random Forest Regression. These results shed light on guiding further exploration of BMW stock price prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.3712"
    },
    {
        "id": 7979,
        "title": "Prediction of Facebook and GOOG Prices based on Linear Regression and LSTM Regression",
        "authors": "Xiaonan Zuo",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "Stock market analysis is a very difficult task, and stock markets are very complex and constantly changing environments. More and more stock investors are now becoming aware of the prominence of machine learning in the field of stocks and finance, and over the last decade or so machine learning has driven advances in the stock market, such as the ability to use different machine learning methods to predict stock movements in order to arrive at the best decisions and algorithmic trades. The problem that this project wants to investigate is the use of machine learning methods for stock prediction. Two stocks, Facebook and GOOG, were chosen as the datasets for the study. The datasets consisted of stock information from the last decade or so and two machine learning methods, namely long and short term memory and linear regression, were used to make predictions. The results obtained from these two models were analyzing and different results were obtained. The results present the conclusion that the linear regression model is more suitable than the LSTM model for predicting these two groups of stocks. Some error analysis was also carried out and some improvements were given for the two different models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v44i.4919"
    },
    {
        "id": 7980,
        "title": "Robust Regression in Environmental Modeling Based on Bayesian Additive Regression Trees",
        "authors": "Taoyun Cao, Limin Lu, Tangxing Jiang",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10666-023-09925-x"
    },
    {
        "id": 7981,
        "title": "The predictive roles of parental stress and intolerance of uncertainty on psychological well-being of parents with a newborn in neonatal intensive care unit: a hierarchical linear regression analysis",
        "authors": "Masoume Rambod, Nilofar Pasyar, Zeinab Mazarei, Mitra Soltanian",
        "published": "2023-12-1",
        "citations": 1,
        "abstract": "Abstract\nBackground\nHospitalization of newborns in neonatal intensive care units (NICU) exposes parents to considerable stress. This study aimed to determine the predictive role of parental stress and intolerance of uncertainty on the psychological well-being of parents with a newborn in NICU using hierarchical linear regression analysis.\n\nMethods\nThis cross-sectional study included 130 parents of newborns hospitalized in the NICU. Data were collected using Parental Stress Scale, Intolerance of Uncertainty Scale, and Psychological Wellbeing Scale. The data were analyzed in SPSS v.26 using hierarchical linear regression analysis.\n\nResults\nThe mean scores of the parents’ psychological well-being, parental stress, and intolerance of uncertainty were 79.08 (SD = 11.70), 63.06 (SD = 26.71), and 75.38 (SD = 19.40), respectively. The result of the hierarchical linear regression analysis revealed that, in step 1, academic education had a significant proportion of the variance of parents’ psychological well-being (β = 0.26, P = 0.005). In step 2, it was shown that academic education (β=-0.25, P = 0.006) and parental stress (β=-0.25, P = 0.006) had a significant proportion of the variance of parents’ psychological well-being. According to step 2, education levels, parental stress, and intolerance of uncertainty explained 22% of the changes in parents’ psychological well-being.\n\nConclusion\nThere was a significant association between the parents’ psychological well-being and education levels, intolerance of uncertainty, and parental stress. Academic education and parental stress were the predictors of parents’ psychological well-being. Based on these findings, early detection of parents’ education and stress are important for their psychological well-being.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12887-023-04420-4"
    },
    {
        "id": 7982,
        "title": "Predicting Twitter stock price using linear regression, random forest, and MLP regression",
        "authors": "Ziyu Huang",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "Since the chaos and complexity in the stock market, predicting stock prices with machinery approaches helps assert a new perspective for people to reach satisfactory results in stock analysis. The stock price of Twitter reflects its market value and performance, which are influenced by various factors such as user engagement, revenue, news, and sentiment. Predicting the stock price of Twitter is a challenging task that requires sophisticated methods and data analysis. In this essay, the author compares three different machine learning models to predict Twitters stock price: linear regression, random forest, and MLP regression. The paper uses historical data on Twitters stock price and various features such as volume, peak value, and trough value. The researcher evaluates the performance of each model using metrics such as Mean-squared Error and R-squared and finds that MLP regression outperforms the accuracy and generalization of the other two models. The author also discusses the limitations and implications of our findings for investors and researchers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/30/20241093"
    },
    {
        "id": 7983,
        "title": "IPO Underpricing: Implementation of the Predictive Model Using a Logistic Regression",
        "authors": "Youssef Louraoui",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4667670"
    },
    {
        "id": 7984,
        "title": "A Linear Regression Based-Approach to Collective Gas Source Localization",
        "authors": "Ronnier Rohrich, Luis Messias, Jose Lima, Andre Schneider de Oliveira",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012187100003543"
    },
    {
        "id": 7985,
        "title": "Forecasting Rice Production in Indonesia using Regression Techniques: A Comparative Analysis of Support Vector Machine, Linear Regression, and XGBoost Regression",
        "authors": "Erio Yoshino, Felix Indra Kurniadi, Budi Juarto",
        "published": "2023-9-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciss59129.2023.10291271"
    },
    {
        "id": 7986,
        "title": "Artificial neural network and multiple linear regression modeling for predicting thermal transmittance of plain-woven cotton fabric",
        "authors": "Mahmuda Akter, Elias Khalil, Md. Haris Uddin, Md. Kamrul Hassan Chowdhury, Shah Md. Maruf Hasan",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": " The present research compares a machine learning model with a statistical model, with specific emphasis on artificial neural networks and multiple linear regression models. The aim of this study is to forecast the thermal transmittance of a plain-woven cotton fabric using input data such as thread density measured in ends per inch, picks per inch, and fabric thickness. The artificial neural network is built using a network with feed-forward backpropagation, and the MATLAB software’s training function trainlm is used to modify its weight and basic values based on Levenberg–Marquardt optimization techniques. The sigmoid transfer function is used to set the layer output and measure network performance in terms of the root mean squared error, mean absolute error percentage, and coefficient of determination which were determined. For the artificial neural network prediction model, the root mean squared error and mean absolute error percentage were 1.05 and 3.132%, respectively, while the coefficient of determination was 0.9307. In contrast, the multiple linear regression prediction model had root mean squared error and mean absolute error percentage values of 2.98 and 8.97%, respectively, along with a coefficient of determination of 0.4727. The results reveal that the artificial neural network model outperforms the multiple linear regression model, showing superior accuracy and robustness in capturing the intricate interactions between important fabric parameters (ends per inch, picks per inch, and thickness) and thermal transmittance values. This research emphasizes the efficiency of artificial neural network modeling as a superior tool for forecasting thermal transmittance in textile applications rather than employing the time-consuming trial-and-error process for delivering significant insights for material engineering and energy-efficient design. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00405175241230082"
    },
    {
        "id": 7987,
        "title": "Design of a new model predictive control for Lipschitz non-linear delayed switched systems with application to water pollution system",
        "authors": "Yanjie Ma, Xuesong Hui",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41939-023-00205-5"
    },
    {
        "id": 7988,
        "title": "Multiple Linear Regression versus Automatic Linear Modelling",
        "authors": "S. Genç, M. Mendeş",
        "published": "2024",
        "citations": 0,
        "abstract": "ABSTRACT In this study, performances of Multiple Linear Regression and Automatic Linear Modelling are compared for different sample sizes and number of predictors. A comprehensive Monte Carlo simulation study was carried out for this purpose. Random numbers generated from multivariate normal distribution by using RNMVN function of IMSL library of Microsoft FORTRAN Developer Studio composed the material of this study. Results of the simulation study showed that the sample size and the number of predictors are the main factors that lead to produce different results. Although both methods gave very similar results especially when studied with large sample sizes (n≥100), the Automatic linear modelling is preferred for analyzing data sets due to its simplicity in analyzing data and interpreting the results, ability to present results visually and providing more detailed information especially studying large complex data sets. It will be beneficial to use the Automatic linear modelling especially in analyzing massive and complex data sets for the purposes of investigating the relationships between one continuous dependent and 10 or more predictors and determine the factors that affect the response or target variable. At the same time, it will also be possible to evaluate the effect of each predictor with a more detailed response.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1590/1678-4162-13071"
    },
    {
        "id": 7989,
        "title": "Early Forest-Fire Detection by Linear Regression, Ridge Regression And Lasso Regression",
        "authors": "Ananya. Mandre, Deeksha.R. Hebbar, J. Shreya Rao, Ananya Keshav, Shoaib Kamal, Trupthi Rao",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciisca59740.2023.00060"
    },
    {
        "id": 7990,
        "title": "Linear regression",
        "authors": "",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.nurse.0000993712.55719.2b"
    },
    {
        "id": 7991,
        "title": "A Piecewise Linear Regression and Classification Algorithm With Application to Learning and Model Predictive Control of Hybrid Systems",
        "authors": "Alberto Bemporad",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tac.2022.3183036"
    },
    {
        "id": 7992,
        "title": "Information-Theoretically Secure Multi-Party Linear Regression and Logistic Regression",
        "authors": "Hengcheng Zhou",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccgridw59191.2023.00042"
    },
    {
        "id": 7993,
        "title": "Osteoporosis prediction: developing multivariate linear regression and logistic regression models based on standard biochemistry profile",
        "authors": "Zihang Weng",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3013209"
    },
    {
        "id": 7994,
        "title": "Influence of noisy input data in accuracy of well interference coefficients by linear regression method",
        "authors": "Rodion M. Ganopolskij",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "Hydrodynamic simulators are used to predict the operation of a production well. Their work demands high performance. Alternative simplified methods are appearing constantly, for example, proxy models. Firstly, these models are tuned to historical data and then they make predictions. The source data is quite inaccurate and incomplete often. It is necessary to study how an input parameter error affects quality of forecast.\nThis article shows an algorithm for determining the well interference coefficients by linear regression method. Study was made of the stability of the obtained solution to the noise of the initial data under various conditions. A production well forecast has been obtained, which is then compared with the exact value. The error in which initial data has the greatest impact on the forecast error is analyzed. Possible options for ensuring sustainability are proposed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21684/2411-7978-2023-9-1-107-115"
    },
    {
        "id": 7995,
        "title": "Investigating hexagonal closed packed crystal lattice through QSPR modeling via linear regression analysis and Topsis",
        "authors": "Adnan Aslam, Saadia Saeed, Salma Kanwal, Fairouz Tchier",
        "published": "2024-2-1",
        "citations": 1,
        "abstract": "Abstracts\nThis research work covers three highly dominating reverse degree-based topological descriptors evaluated for the three-dimensional hexagonal close-packed (HCP) crystal structure lattice. HCP crystal lattice has a highly symmetrical and elegant crystal structure, and we have observed that results obtained from symmetrical structures draw symmetry in the numerical formulation obtained from topological descriptors. For this purpose, we will investigate whether the HCP lattice formed by an odd pair of unit cells is the best or an even pair of unit cells forming the lattice and how they behave in a dominating sense when investigated through the conclusions obtained from QSPR modeling. The QSPR model has been proposed to check the efficiency of each specified topological descriptor for five highly commendable physio-chemical properties: melting or boiling point, density, molar heat capacity, and enthalpy. Further, we have discovered the ideology to obtain the best possible structure when investigated and established on a statistically and mathematically strong proving and to what extent we can extract from QSPR to implement MCDM techniques, here considering TOPSIS that provide the best HCP structure lattice rankings. The obtained results may be helpful for researchers to better understand the structure and studying different physical/chemical properties of HCP crystal lattice.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1402-4896/ad1800"
    },
    {
        "id": 7996,
        "title": "Use of Segmented Linear Regression Under a Bayesian Approach to Detect Climate Change in Different Regions of the World",
        "authors": "",
        "published": "2023-3-20",
        "citations": 0,
        "abstract": "In this work we study the behavior of some climate data (annual temperature and precipitation averages) obtained from climate stations in eleven countries in different regions of the world. One of the goals of the study is to determine whether the climate variables have change-points that could indicate the possible beginning of a change in climate. Another goal is to analyze the possible changes detected by the change-points in terms of the linear trends of the climate variables under investigation. Based on the information provided, differences between different regions in terms of the locations of the change-points and the changes they produce may also be inferred. The data sets used in the study consist of the annual averages of the twelve monthly temperature averages and the annual averages of the total rain precipitation observed in each one of the twelve months of the year obtained over a period of time from the end of the 19th century to the end of the 20th century. Segmented linear regression models are used to study the existence of possible changes in the behavior of climatic variables, as well as the types of changes produced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33140/bscr.02.01.12"
    },
    {
        "id": 7997,
        "title": "Lessons in linear regression",
        "authors": "Miguel de Carvalho",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Abstract\nHow do you teach linear regression to pupils aged 12–14? Direct proportionality is the key, advises Miguel de Carvalho. That and some sporting superstars…",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/jrssig/qmad097"
    },
    {
        "id": 7998,
        "title": "Supplemental Material for Equivalence Testing for Linear Regression",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1037/met0000596.supp"
    },
    {
        "id": 7999,
        "title": "Stock Forecasting Based on Linear Regression Model and Nonlinear Machine Learning Regression Model",
        "authors": "Yushan Zhou",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "To enhance the accuracy of stock price prediction for Netflix and provide individuals with a comprehensive understanding of stock trading prices, this study constructs a predictive model by employing three distinct approaches: a linear regression model, a Long Short-term Memory (LSTM) artificial neural network, and a Gated Recursive Unit (GRU) which serves as a component of the LSTM architecture. A prediction scheme is devised, utilizing historical stock data spanning from 2002 to 2022 for Netflix. The primary objective is to forecast the stock price of Netflix for the subsequent 20-day period. To evaluate the efficacy of the three models, a rigorous assessment is conducted employing robust evaluation indices. The outcomes of this analysis will enable a determination of the fitting adequacy of each model, thereby facilitating the identification of the most suitable approach for accurate stock price prediction in the context of Netflix. This research endeavors to contribute to the field of stock market analysis by leveraging advanced predictive modeling techniques for enhanced forecasting accuracy and insightful decision-making.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/57/20230364"
    },
    {
        "id": 8000,
        "title": "Modeling Prediction Uncertainty in Regression using the Regression Tsetlin Machine",
        "authors": "K. Darshana Abeyrathna, Andreas Hafver, L. Yi Edward",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/istm58889.2023.10454923"
    },
    {
        "id": 8001,
        "title": "Predictive Model of the ENSO Phenomenon Based on Regression Trees",
        "authors": "Indalecio Mendoza Uribe",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "In this work, the supervised machine learning technique was applied to develop a predictive model of the phase of the El Niño-Southern Oscillation (ENSO) phenomenon. Regression trees were specifically used by means of the Scikit-Learn library of the Python programming language. Data from the period 1950-2022 were used as training and test. The performance of the predictive model was validated using three continuous type error measurement metrics: Mean Absolute Error, Maximum Error and Root Mean Square Root. The results indicate that with a greater number of training data the model improves its performance, with a tendency to decrease the error in forecasts. Which starts for the year 1953 with errors of 0.77, 1.41 and 0.75 for MAE, ME and RMSE respectively, ending for the year 2022 with errors of 0.28, 0.72 and 0.13 for the same metrics. It is concluded that, based on the results, the developed model is consistent and reliable for ENSO phase forecasts in a 12-month window.",
        "keywords": "",
        "link": "http://dx.doi.org/10.13164/mendel.2023.1.007"
    },
    {
        "id": 8002,
        "title": "Regression Analysis-Based Predictive Model for E-Commerce Application",
        "authors": "Sudev G, Shyam M, Dharini N",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnwc57852.2023.10127390"
    },
    {
        "id": 8003,
        "title": "Penerapan Data Mining untuk Prediksi Pelanggan di PT. XYZ Menggunakan Algoritma Linear Regression",
        "authors": "Fauzi Ramdhani, Kiki Setiawan",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "Dengan perkembangannya kegiatan export dan import dalam negeri terutama di daerah DKI Jakarta, membuat persaingan bisnis terutama dalam bidang depot kontainer makin marak. Sehingga menyebabkan dampak volume bongkar di dalam depot kontainer yang membuat pelanggan atau liner dapat berpindah ke kompetitor. PT. XYZ bergerak di bidang bisnis depot kontainer. PT. XYZ juga  menyediakan layanan pembayaran untuk memudahkan transaksi pelanggan agar dapat dilakukan Dimana saja sebagai salah satu cara untuk meningkatkan Strategi pemasaran dalam system ini mempunyai sekumpulan berbagai fitur untuk memudahkan transaksi. Penelitian ini dilakukan dalam rangka membantu tim Marketing untuk dapat mengetahui hasil prediksi transaksi pelanggan sehingga dapat menyiapkan strategi pemasaran yang lebih baik dalam menghadapi era kompetisi ini. Dalam kasus ini metod linear regresi dalam penambangan data adalah metod yang baik untuk melakukan prediksi. Software yang digunakan dalam metod Linear Regresi ini adalah RapidMiner dan menghasilkan nilai Root Mean Square Error (RMSE) sebesar 0.313 yang menunjukan proforma yang bagus dan hasil prediksi cukup akurat",
        "keywords": "",
        "link": "http://dx.doi.org/10.57152/malcom.v4i2.1217"
    },
    {
        "id": 8004,
        "title": "Response Variable Selection in Multivariate Linear Regression",
        "authors": "Kshitij Khare, Zhihua Su",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0127"
    },
    {
        "id": 8005,
        "title": "Statistical inference for function-on-function linear regression",
        "authors": "Holger Dette, Jiajun Tang",
        "published": "2024-2-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3150/23-bej1598"
    },
    {
        "id": 8006,
        "title": "Predicting ETF prices using linear regression",
        "authors": "Keqing Li",
        "published": "2023-1-13",
        "citations": 0,
        "abstract": "Machine learning has allowed computers to analyze data and make future predictions based on those dates. One of the most common and easiest to implement machine learning algorithms used to do this is simple linear regression. Simple linear regression finds trends in a data set by graphing a line that shows the relationship between two variables. This paper will show how Simple linear regression can predict future ETF prices by finding linear trends in two particular exchange-traded funds: Invesco QQQ and vanguard VGT, predict their value six months later using their five-year closing price in yahoo finance and compare their respective predicted growth rate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v36i.3381"
    },
    {
        "id": 8007,
        "title": "Linear regression",
        "authors": "Thomas Dombrowsky",
        "published": "2023-9",
        "citations": 2,
        "abstract": "Abstract:\nLinear regression is one of the most basic regression techniques used in research statistics, particularly nursing research. This article explains linear regression in detail.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1097/01.nurse.0000946844.96157.68"
    },
    {
        "id": 8008,
        "title": "Principal Simple Linear Regression",
        "authors": "Heydar Ali MARDANİ-FARD",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "In this paper, we propose a new method called principal simple linear regression for predicting a continuous response variable Y using a single continuous predictor X by utilizing multiple regression lines. This method is based on the theory of principal points and offers several advantages over classical simple linear regression methods, such as the ability to predict central, dispersion, and distributional tendencies of Y on X, and simultaneous estimation. We provide the main properties, inferences, and limiting behavior of the estimators. Additionally, we conduct a comprehensive simulation study to validate our theoretical results. The model is also applied to real datasets to demonstrate its effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15672/hujms.1303627"
    },
    {
        "id": 8009,
        "title": "Heart Disease Prediction using Chi-Square Test and Linear Regression",
        "authors": "Dinesh Kalla, Arvind Chandrasekaran",
        "published": "2023-4-29",
        "citations": 1,
        "abstract": "Heart disease is most common disease reported currently in the United States among both the genders and according to official statistics about fifty percent of the American population is suffering from some form of cardiovascular disease. This paper performs chi square tests and linear regression analysis to predict heart disease based on the symptoms like chest pain and dizziness. This paper will help healthcare sectors to provide better assistance for patients suffering from heart disease by predicting it in beginning stage of disease. Chi square test is conducted to identify whether there is a relation between chest pain and heart disease cases in the United States by analyzing heart disease dataset from IEEE Data Port. The test results and analysis show that males in the United States are most likely to develop heart disease with the symptoms like chest pain, dizziness, shortness of breath, fatigue, and nausea. This test also shows that there is a week corelation of 0.5 is identified which shows people with all ages including teens can face heart diseases and its prevalence increase with age. Also, the tests indicate that 90 percent of the participant who are facing severe chest pain is suffering from heart disease where majority of the successful heart disease identified is in males and only 10 percent participants are identified as healthy. The evaluated p-values are much greater than the statistical threshold of 0.05 which concludes factors like sex, Exercise angina, Cholesterol, old peak, ST_Slope, obesity, and blood sugar play significant role in onset of cardiovascular disease. We have tested the dataset with prediction model built on logistic regression and observed an accuracy of 85.12 percent.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130712"
    },
    {
        "id": 8010,
        "title": "A Bias Test for Heteroscedastic Linear Least Squares Regression",
        "authors": "Eric Blankmeyer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4371453"
    },
    {
        "id": 8011,
        "title": "Modeling the Yield of Maize: A Dummy Variable Regression Approach",
        "authors": "Emmanuel Idowu Olamide",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0854"
    },
    {
        "id": 8012,
        "title": "CENSORED DATA MODELING: A NOVEL ANTI-REGRESSION FRAMEWORK",
        "authors": "Sarmada Fera,  ",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "Censored data, where the exact value of an observation is not fully observed, poses a challenge in statistical modelling. Traditional regression approaches often fail to adequately handle such data, leading to biased estimates and inaccurate predictions. In this study, we propose a novel anti-regression framework specifically designed for censored data modelling. The framework integrates advanced statistical techniques and incorporates mechanisms to mitigate the impact of censoring. By leveraging the information available from censored observations, our approach provides more reliable estimates and improved predictive performance compared to traditional regression methods. We validate the effectiveness of our framework through extensive simulations and real-world case studies. The results demonstrate the superiority of the proposed anti-regression framework in accurately modelling censored data, highlighting its potential for various applications in fields such as medical research, finance, and engineering. This study contributes to the advancement of statistical modelling techniques for censored data and provides a valuable tool for researchers and practitioners dealing with such data in their analyses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37547/history-crjh-04-05-05"
    },
    {
        "id": 8013,
        "title": "Global Warming Analysis Based on ARIMA Multiple Linear Regression Model",
        "authors": "雨蕙 周",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/mos.2023.122118"
    },
    {
        "id": 8014,
        "title": "Modeling hydraulic fracture fluid efficiency in tight gas reservoirs using non-linear regression and a back-propagation neural network",
        "authors": "Rami Khouli, Ali A. Garrouch, Feras Alruhaimani",
        "published": "2023-1-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/12269328.2022.2159546"
    },
    {
        "id": 8015,
        "title": "Modeling Uncertainty Quantification of NDVI of Agricultural Fields through Bayesian Linear Regression in Time Series Prediction",
        "authors": "M. Srinivas,  , P. R. C. Prasad",
        "published": "2023",
        "citations": 0,
        "abstract": "The current research discusses the applications of Bayesian linear regression to predict the uncertainty of remote sensing data. To predict the uncertainty, the study considered the SENTINEL-2 satellite data of agricultural fields of Uttar Pradesh state of India. Using the stratified sampling method in Google Earth Engine, the random points generated are mapped to agricultural fields. Data was collected in the form of maximum Normalized Difference Vegetation Index (NDVI) values of each agricultural field. The dynamics of the time series predictions were explored with Bayesian linear regression, a probabilistic deep learning method. The model uncertainty defined as epistemic uncertainty is evaluated with the prior and posterior probability parameters of Bayesian statistics in linear regression. The number of regression lines predicted for the same data shows evidence of uncertainty. The Bayesian linear regression models show evidence of high uncertainty for the predicted NDVI values. The variation in model uncertainty is measured by dividing the dataset into samples and it is observed that with increase in data the uncertainty is reduced. Also, with the increase in data, the posterior density becomes sharper which corresponds to a decrease in variance. Further, the study extended the concept of regression analysis with Gaussian basis functions to determine the effect of model uncertainty with an increase in data. The analysis has shown the same result in knowing the effect of uncertainty with the increase in data. Further, a nonlinear polynomial regression model with a Gaussian distribution as a basis function was developed to evaluate the marginal probabilities of the evidence function in capturing the uncertainty with varying degrees of freedom. The polynomial regression with a Gaussian distribution using Bayesian statistics has captured the uncertainty and confirmed that the uncertainty is captured at lower degrees of freedom.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3808/jeil.202300098"
    },
    {
        "id": 8016,
        "title": "Linear and Non-Linear Regression Analysis on the Prediction of Compressive Strength of Sodium Hydroxide Pre-Treated Crumb Rubber Concrete",
        "authors": "Hamza Aamir, Kinza Aamir, Muhammad Faisal Javed",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023044005"
    },
    {
        "id": 8017,
        "title": "Interpretation Algorithm of Linear and Non-elementary Linear Regression Models Under Multicollinearity Conditions",
        "authors": "M.P. Bazilevski",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "When constructing machine learning models, more and more researchers come to understanding that in addition to the accuracy of the model, its interpretability is also important, that means the degree of understandability to a person. Currently, a new field is being formed in science - interpretable machine learning. This article is devoted to the study of linear regression models interpretation questions. Traditionally, linear regressions are interpreted in terms of weak correlation of explanatory variables. In this case, according to a well-known pattern, it is possible to explain the influence of each input variable on the output variable. Often the explanatory variables are highly correlated with each other. In such a situation, it is recommended to exclude strongly correlated variables, that leads, firstly, to a decrease in the model quality, and secondly, to integrity loss of the study and the interpretation of a process or phenomenon under study. In this paper, we propose an algorithm for interpreting a linear regression constructed for any degree of explanatory variablecorrelation. The algorithm gives the traditional interpretation of linear regression with weak correlation of all explanatory variables, while in case of strong correlation, as it follows from the theorem proved in the article, regression interpretation with several variables is reduced to interpreting an equation with one variable, without losing information about the relationships between pairs of explanatory variables. The algorithm can be used not only for simple linear regressions, but also for non-elementary ones, containing, in addition to explanatory variables, their pairs transformed by means of binary operations min and max. The operation of the algorithm is demonstrated on specific examples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22213/2410-9304-2023-3-40-47"
    },
    {
        "id": 8018,
        "title": "Maximizing performance of linear model predictive control of glycemia for T1DM subjects",
        "authors": "",
        "published": "2023-11-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/acs.2022.141714"
    },
    {
        "id": 8019,
        "title": "Prediction of compressive strength of GGBFS and Flyash-based geopolymer composite by linear regression, lasso regression, and ridge regression",
        "authors": "Ujjwal Sharma, Nakul Gupta, Manvendra Verma",
        "published": "2023-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42107-023-00721-2"
    },
    {
        "id": 8020,
        "title": "Asymptotic Theory for Moderate Deviations from the Unit Boundary in Quantile Autoregression and Predictive Regression",
        "authors": "Christis Katsouris",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4543649"
    },
    {
        "id": 8021,
        "title": "Predictive uncertainty assessment in flood forecasting using quantile regression",
        "authors": "Amina M. K., Chithra N. R",
        "published": "2023-9-1",
        "citations": 1,
        "abstract": "Abstract\n\nFloods and their associated impacts are topics of concern in land development planning and management, which call for efficient flood forecasting and warning systems. The performance of flood warning systems is affected by uncertainty in water level forecasts, which is due to their inability to measure or calculate a modeled value accurately. Predictive uncertainty is an emerging type of uncertainty modeling technique that emphasizes total uncertainty quantified as a probability distribution conditioned on all available knowledge. Predictive uncertainty analysis was done using quantile regression (QR) for machine learning-based flood models – Hybrid Wavelet Artificial Neural Network model (WANN) and Hybrid Wavelet Support Vector Machine model (WSVM) for different lead times. Comparing QR models of WANN and WSVM revealed that the slope, intercept, spread of forecast, and width of confidence band of the WANN model are more for each quantile indicating more uncertainty as compared to the WSVM model. In both models, with an increase in lead time, uncertainty has shown an increasing trend as well. The performance evaluation of inference obtained from QR models was evaluated using uncertainty statistics such as prediction interval coverage probability, average relative interval length (ARIL), and mean prediction interval (MPI).",
        "keywords": "",
        "link": "http://dx.doi.org/10.2166/h2oj.2023.040"
    },
    {
        "id": 8022,
        "title": "Logistic Regression and Predictive Analysis in Public Services of AI Strategies",
        "authors": "Prabhat Mittal, Suruchi Gautam",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "An essential national practice in the general growth of societies and economies is the quick integration of digital capabilities, innovations, and IT skills with government services in public sector. The adoption of digital capabilities and technological advancements renders more efficacy and efficiency to the delivery of public sector government services. The increasing demands of corporations and residents, however, present a significant challenge for the governments. In order to exploit emerging digital technologies, government needs to engage, interact and cooperate with residents, society, and enterprises. It must structure itself and guarantee that appropriate technology is put to use. Technology and innovation must be strategically incorporated in the initiatives to modernize public sector services. The objective of the study is to investigate the impact of various factors like digital capabilities, technology skills, innovation, and data capabilities on the implementation of AI enabled public services. The study uses the Governments' Artificial Intelligence Readiness Index score of 100 countries from Oxford Insights and IDRC. The results imply that use of AI in public services has a significant impact on the purchase of cutting-edge technology, data, and innovative capabilities of a nation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18421/tem122-19"
    },
    {
        "id": 8023,
        "title": "Comparison of Decision Tree Regression with Linear Regression Based on Prediction of Apple Stock Price",
        "authors": "Zongze Li",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "Machine learning has been increasingly used in stock price prediction with outstanding success. Decision tree regression models and linear regression models are both important models for predicting stock prices. The paper use decision tree regression and linear regression models to predict the opening price, closing price, high price and low price of Apple's stock price data respectively. The prediction effects of the two models are evaluated by the indicators of goodness of fit, mean square error, root mean square error and mean absolute error, and the prediction effects of the two models are compared. This experimental concludes that the decision tree regression model has better and more advantageous prediction results compared to the linear regression model. This study has guiding significance for machine learning in predicting stock prices when choosing a basic model or a combination of models for prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/45/20230259"
    },
    {
        "id": 8024,
        "title": "Research on Water Resources Development and Utilization Based on Linear Regression and Multiple Nonlinear Regression",
        "authors": "Yijing Chen, Genhua Zhang, Siyan Xie",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "With the further development of industrialization and urbanization, China's water resources will be more severe. In order to study the synergy of the three red line targets, we predicted the total water consumption in 2030 by establishing the total water consumption model and using the linear regression prediction method. It is assumed that the water consumption of 10,000 yuan of industrial added value and the effective utilization coefficient of agricultural irrigation water all reached the red line value in 2030. Next, a multivariate nonlinear regression model of total water consumption is established, and the indirect substitution method is used to obtain the function of the internal relationship among the water consumption of 10,000 yuan GDP, the actual water consumption per mu of cultivated land for irrigation, and the water consumption of 10,000 yuan industrial added value, which includes time variables, and then the sensitivity analysis of the above functions are carried out. The following conclusions are drawn: China's overall water resources development and utilization should adopt the policy of improving the effective utilization coefficient of farmland irrigation water and reducing the industrial added value water consumption of 10,000 yuan as a supplement.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v44i.7312"
    },
    {
        "id": 8025,
        "title": "Efficient Human Action Recognition using Novel Logistic Regression Compared over Linear Regression with Improved Accuracy",
        "authors": "S Bhanu Prakash, V. Amudha, Meenakshisundaram. N",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142567"
    },
    {
        "id": 8026,
        "title": "Popularity analysis of films in social media using logistic regression compared with linear regression algorithm",
        "authors": "Bharat Kumar Reddy Mekala, Nelson Kennedy Babu Christopher",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0139841"
    },
    {
        "id": 8027,
        "title": "OPTIMASI KINERJA LINEAR REGRESSION, RANDOM FOREST REGRESSION DAN MULTILAYER PERCEPTRON PADA PREDIKSI  HASIL PANEN",
        "authors": "Evita Fitri, Siti Nurhasanah Nugraha",
        "published": "2024-2-15",
        "citations": 0,
        "abstract": "Rice yield prediction is a significant challenge in the context of climate uncertainty and farmland variation. Erratic weather factors, along with land differences, make this prediction more complex. This research aims to address these issues using a machine learning approach. The method used involves three machine learning models namely Linear regression, Random Forest Regression, and ANN with MultiLayer Perceptron algorithm as well as the evaluation matrix RMSE (Root Mean Squared Error), MAE (Mean Absolute Error) and MAPE (Mean Absolute Percentage Error). This research focuses on testing the accuracy of the three models in the face of uncertain seasonal conditions and variations in agricultural land. The results showed that the MultiLayer Perceptron prediction model gave the best results with an error value of 0.094. The random forest regression method ranks second with an error value of 0.510, followed by Linear regression with an error value of 0.281. The importance of outlier testing in the model development process can be seen from the significant improvement in the performance of the MultiLayer Perceptron model. This research contributes to the development of a more reliable and dependable rice yield prediction system, especially in the midst of uncertain climatic conditions. Machine learning models, particularly MultiLayer Perceptron, can be an effective solution to increase agricultural productivity and reduce risks associated with weather changes and land variations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33480/inti.v18i2.5269"
    },
    {
        "id": 8028,
        "title": "Linear regression active learning based on IRD algorithm",
        "authors": "XiaoYan Chen",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icise60366.2023.00103"
    },
    {
        "id": 8029,
        "title": "Adaptive Linear Regression for Data Stream",
        "authors": "Aldo Marcelo Paim, Fabrício Enembreck",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191184"
    },
    {
        "id": 8030,
        "title": "A novel Bayesian variable selection algorithm for multiple linear regression",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.rodrigo"
    },
    {
        "id": 8031,
        "title": "A Complete Guide to Linear Regression Model Interpretation",
        "authors": "Yusuff Ashiru, Luqmon Oladele",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4503197"
    },
    {
        "id": 8032,
        "title": "Correction to: ‘Ancestor regression in linear structural equation models’",
        "authors": "",
        "published": "2023-8-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/biomet/asad028"
    },
    {
        "id": 8033,
        "title": "House Price Prediction Using Linear Regression Model",
        "authors": "Jaykumar Parekh -",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Machine learning is a subset of Artificial Intelligence. Artificial intelligence (AI) and machine learning (ML) are key technologies in solving problems and addressing a wide range of issues in many different fields. Due to its capacity to automate processes, analyze massive volumes of data, and make precise judgments. Generally, it is used in voice assistants, recommendation systems, autonomous vehicles as well as in fraud detection.  It also plays a vital role in the real estate sector, accurate house price prediction helps buyers, sellers, and investors make accurate decisions. There is a need for technology to predict housing values because they rise annually. Predicting house prices can assist developers in setting a property's selling price as well as buyers in scheduling the ideal time to buy a home. Four factors influence the price of a house which are area, bedrooms, bathrooms, and location. This study uses a methodology to forecast the price of houses based on relevant features, specifically by applying a linear regression model. Through the use of machine learning methods such as Random Forest, K-Means, Decision Tree, and Linear regression. This strategy will make it easier for people to invest money in a legacy without going via a broker. The study's findings indicate that the Linear regression yields the best accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i06.11519"
    },
    {
        "id": 8034,
        "title": "MEASUREMENT OF SUPPORT VECTOR REGRESSION PERFORMANCE  WITH CLUSTER ANALYSIS FOR STOCK PRICE MODELING",
        "authors": "Izza Dinikal Arsy, Dedi Rosadi",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "Risk-averse investors will seek out stock investments with the minimum risk. One step that can be taken is to develop a model of stock prices and predict their fluctuations in the coming months. Significant studies on the modeling of stock movements have used the ARCH/GARCH method, but this method requires some assumptions. This paper will discuss the performance of stock modeling using Support Vector Regression. The performance is measured using the root mean square error value in two stock clusters based on its volatility value, e.g., stocks with large volatility and stocks with small volatility. This case study makes use of daily closing price data from 10 LQ-45 index shares from October 12, 2018 to October 11, 2019. In conclusion, SVR's performance on stocks with high volatility produces RMSE, which is considerably higher than SVR's performance on stocks with low volatility.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14710/medstat.15.2.163-174"
    },
    {
        "id": 8035,
        "title": "Efficient continuous piecewise linear regression for linearising univariate non-linear functions",
        "authors": "John Alasdair Warwicker, Steffen Rebennack",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/24725854.2023.2299809"
    },
    {
        "id": 8036,
        "title": "Development of a Predictive Model to Correlate the Chemical Structure of Amines with Their Oxidative Degradation Rate in a Post-Combustion Amine-Based CO<sub>2</sub> Capture Process Using Multiple Linear Regression and Machine Learning Regression Approaches",
        "authors": "Pailin Muchan, Sirinee Kruthasoot, Tawan Kongton, Teeradet Supap, Jessica Narku-Tetteh, Supranee Lisawadi, Patchanok Srisuradetchai, Raphael Idem",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acsomega.3c07746"
    },
    {
        "id": 8037,
        "title": "Multiple Stock Prediction Based on Linear and Non-linear Machine Learning Regression Methods",
        "authors": "Shuqi Chen",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "In contemporary times, the pressing issue of global environmental pollution has prompted the exploration of alternative energy sources by various industries, aiming to mitigate the adverse environmental impacts caused by traditional energy production. Correspondingly, investors in the financial market have increasingly redirected their capital towards the new energy sector. Within this context, the present research endeavors to employ machine learning techniques for the prediction of Tesla's stock price. This study leverages multiple linear regression, polynomial regression, and lag models to construct models based on the datasets of TSLA, MPC, and UNG stock prices spanning the period of 2019-2020. By discerning potential patterns among these variables, the objective is to anticipate the future trajectory of TSLA stock price. According to machine learning methods, Tesla's stock price can be predicted, and the daily price of Tesla is influenced by the opening price, high price, low price and trading volume of the stock on that day. In addition, the share prices of energy companies related to Tesla also have an impact on Tesla's share price on that day. Specifically, Tesla's stock price is influenced by Natural Gas Company (UNG), which has an opposite relationship. Although common sense economics says that the crude oil market will be closely related to the new energy market. However, the results of this study demonstrated that Tesla's stock price is less influenced by Crude Oil Company (MPC).",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/46/20230343"
    },
    {
        "id": 8038,
        "title": "Development of Rainfall Prediction Models using Linear and Non-linear Regression Techniques",
        "authors": "Sandeep Kumar Sunori, Surya Kant, Pawan Agarwal, Pradeep Juneja",
        "published": "2023-10-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gcat59970.2023.10353508"
    },
    {
        "id": 8039,
        "title": "Comparative Analysis of Linear Regression, Polynomial Regression, and ARIMA Model for Short-term Stock Price Forecasting",
        "authors": "Hanlin Mo",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "This research investigates the effectiveness of three prominent stock price prediction methodologies: Linear Regression, Polynomial Regression, and AutoRegressive Integrated Moving Average (ARIMA) model. The study leverages one and a half years of historical data from Apple, Tesla, Amazon, and Nike stocks to predict average prices over the ensuing 14 days. The predictive efficacy of each model is tested against actual data, revealing their respective strengths and limitations. Linear Regression offers an overview of stock trends with limited intricacy, while Polynomial Regression delivers a more comprehensive understanding of price variations and cyclical trends. However, Polynomial Regression's reliability for predictions remains uncertain. In contrast, the ARIMA model, designed explicitly for short-term forecasting, demonstrates superior accuracy, correctly predicting seven out of eight scenarios. It should be noted that this is despite its assumptions of linearity and stationarity. The findings underscore the complexity of accurate stock market prediction and highlight the ARIMA model's reliability for short-term forecasts. Therefore, understanding the strengths and weaknesses of each model is crucial for improving stock price prediction techniques and for better grasping the complex dynamics of volatile stock markets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2754-1169/49/20230509"
    },
    {
        "id": 8040,
        "title": "Prediction of supply chain management to find defective products using logistic regression algorithm against linear regression algorithm for better accuracy",
        "authors": "Aishwarya Theerthala, Ramakrishnan Varadharajan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0136495"
    },
    {
        "id": 8041,
        "title": "Retracted: Predictive Model of Cerebral Vasospasm in Subarachnoid Hemorrhage Based on Regression Equation",
        "authors": "",
        "published": "2023-6-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9872786"
    },
    {
        "id": 8042,
        "title": "Bootstrapping the Double-Weighted Predictability Test for Predictive Quantile Regression",
        "authors": "Xiaohui Liu, Peiwen Xiao, Yuzi Liu, Wei Long",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4740614"
    },
    {
        "id": 8043,
        "title": "Predictive data-driven models of thermophysical properties using Gaussian process regression",
        "authors": "Mingshuo Zhou, Chenxu Ni, Xingjian Wang",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2514/6.2024-0869"
    },
    {
        "id": 8044,
        "title": "Comparison of Linear Regression and Logistic Regression Algorithms for Ground Water Level Detection with Improved Accuracy",
        "authors": "C. Gnaneswar Raju, V. Amudha, Sajiv G",
        "published": "2023-4-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142495"
    },
    {
        "id": 8045,
        "title": "Predictive Analysis of Coconut Prices in Kerala Markets Using Random Forest Regression",
        "authors": "",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets51201"
    },
    {
        "id": 8046,
        "title": "USING PREDICTIVE MODELING TO COMBAT MONEY LAUNDERING",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48009/1_iis_2023_120"
    },
    {
        "id": 8047,
        "title": "The Use of Fuzzy Linear Regression Modeling to Predict High-risk Symptoms of Lung Cancer in Malaysia",
        "authors": "Aliya Syaffa Zakaria, Muhammad Ammar Shafi, Mohd Arif Mohd Zim, Siti Noor Asyikin Mohd Razali",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140562"
    },
    {
        "id": 8048,
        "title": "Heteroscedasticity consistent ridge regression estimators in linear regression model",
        "authors": "Irum Sajjad Dar, Sohail Chand",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/03610918.2023.2276052"
    },
    {
        "id": 8049,
        "title": "Linear Regression Algorithm Analysis to Predict the Effect of Inflation on the Indonesian Economy.",
        "authors": "Fetrus Jari Harianto, Ferian Fauzi Abdulloh",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "Tujuan penelitian ini adalah untuk melihat perkembangan penelitian mengenai dampak inflasi global terhadap perkembangan perekonomian Indonesia. Penelitian ini melihat hubungan antara pengaruh inflasi dan perkembangan ekonomi di Indonesia. Metode penelitian yang digunakan dalam penelitian ini adalah metode penelitian kuantitatif yang dimulai dari pengumpulan data, preprocessing, Proses Implementasi Algoritma Regresi Linier, dan pengujian model. Root mean square error (RMSE) adalah model regresi prediktif yang melihat seberapa akurat PDB tahunan berdasarkan tingkat inflasi tahunan. Dalam hal ini, nilai RMSE sekitar 0,60. Artinya, secara rata-rata model peramalan memiliki kesalahan sebesar 0,66 dalam memperkirakan nilai PDB tahunan. Semakin rendah nilai RMSE, semakin baik kinerja model karena menunjukkan kesalahan yang lebih kecil.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i4.3224"
    },
    {
        "id": 8050,
        "title": "ENHANCING AIR QUALITY PREDICTION THROUGH LINEAR REGRESSION",
        "authors": "",
        "published": "2023-9-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets44874"
    },
    {
        "id": 8051,
        "title": "Local linear-kNN smoothing for Semi-functional partial linear regression",
        "authors": "Kedir NASSİMA HOUDA, Benchikh TAWFİK, Naceri AMİNA, Fetitah OMAR",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "The aim of this paper is to study a semi-functional partial linear regression model. The estimators are constructed by k-nearest neighbors local linear method. Some asymptotic results are established for an i.i.d sample under certain conditions, including asymptotic normality of the parametric component and the almost certain convergence (with rate) of the non-parametric component. Lastly, using cross-validation, the performances of our estimation method are presented on simulated data and on real data by comparing them with other known approaches for semi-functional partial linear regression models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15672/hujms.1294382"
    },
    {
        "id": 8052,
        "title": "Machine Learning Techniques For Stock Price Prediction - A Comparative Analysis Of Linear Regression, Random Forest, And Support Vector Regression",
        "authors": "Shital Sameer Pashankar, Jyoti Dashrath Shendage, Dr. Janardan Pawar",
        "published": "2024-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jaz.v45is4.4164"
    },
    {
        "id": 8053,
        "title": "Non-linear Regression Model for Fitting Experimental Emissions Data",
        "authors": "Denise Ahrens, Sebastian Traub",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "Abstract\nThe measurement and reporting of non-volatile Particulate Matter (nvPM) emissions is now integral to aircraft engine emission certification. Akin to other gaseous emissions, CAEP11 sets a new LTO based standard. So far, the question how nvPM emission can be corrected for ambient conditions has to remain open. Addressing this, combustor rig tests may be consulted, where performance parameter such as Air-to-fuel ratio, pressure and temperature can be varied independently. However, results from selected tests may be misleading as nvPM emissions may show measurement uncertainties within actual sensitivities. The paper provides a novel approach utilising experimental data to investigate the prevailing sensitivities at different operation conditions and derive applicable correction factors. This methodology makes use of the fundamental assumption that each change measured in nvPM emissions is explainable with the relative change in combustor AFR, the combustion chamber inlet pressure P3, and combustor inlet temperature T3, for a given combustor design running on the same fuel. Computing the relative changes between all measurements of the same test for all performance and emission parameters enables the fitting of a nonlinear regression model to the experimental data. The fitted function consists of the product of the relative change of the performance parameters to the power of polynomial exponents. The methodology has the potential to be applied to a wide variation of emissions data obtained from different sources as combustor rig tests as well as from engine emission tests. The paper concludes with a first application of the methodology to experimental engine emissions data and a short discussion on AFR sensitivity. In order to set-up a more broadly applicable model nvPM pathways and mechanisms and their dependencies must be better understood helping to identify relevant parameters, e.g. characteristic AFR in the nearfield of the fuel spray nozzle.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/gt2023-101631"
    },
    {
        "id": 8054,
        "title": "On the role of the design phase in a linear regression",
        "authors": "Junho Choi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4767794"
    },
    {
        "id": 8055,
        "title": "The Performance of Quantile Regression and Linear Regression with Heteroskedasticity was Compared in a Simulated Study",
        "authors": "",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18576/jsap/120226"
    },
    {
        "id": 8056,
        "title": "A comparative analysis of linear regression, neural networks and random forest regression for predicting air ozone employing soft sensor models",
        "authors": "Zheng Zhou, Cheng Qiu, Yufan Zhang",
        "published": "2023-12-16",
        "citations": 0,
        "abstract": "AbstractThe proposed methodology presents a comprehensive analysis of soft sensor modeling techniques for air ozone prediction. We compare the performance of three different modeling techniques: LR (linear regression), NN (neural networks), and RFR (random forest regression). Additionally, we evaluate the impact of different variable sets on prediction performance. Our findings indicate that neural network models, particularly the RNN (recurrent neural networks), outperform the other modeling techniques in terms of prediction accuracy. The proposed methodology evaluates the impact of different variable sets on prediction performance, finding that variable set E demonstrates exceptional performance and achieves the highest average prediction accuracy among various software sensor models. In comparing variable set E and A, B, C, D, it is observed that the inclusion of an additional input feature, PM10, in the latter sets does not improve overall performance, potentially due to multicollinearity between PM10 and PM2.5 variables. The proposed methodology provides valuable insights into soft sensor modeling for air ozone prediction.Among the 72 sensors, sensor NNR[Y]C outperforms all other evaluated sensors, demonstrating exceptional predictive performance with an impressive R2 of 0.8902, low RMSE of 24.91, and remarkable MAE of 19.16. With a prediction accuracy of 81.44%, sensor NNR[Y]C is reliable and suitable for various technological applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-49899-0"
    },
    {
        "id": 8057,
        "title": "Vector Auto-Regression-Based Predictive model for Smart Meter",
        "authors": "Mukta Jukaria, Ashutosh Upadhyay, Anuj Kumar",
        "published": "2023-3-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dicct56244.2023.10110196"
    },
    {
        "id": 8058,
        "title": "Predictive Modeling of Acrophobia Severity Using EEG Data",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/as-abstracts.1429"
    },
    {
        "id": 8059,
        "title": "Comparative Study of Iconnet Jabodetabek and Banten Using Linear Regression and Support Vector Regression",
        "authors": "Muhaimin Hasanudin, Ifan Prihandi, Sifania Nazua",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "PT PLN Indonesia Comnets Plus has little information regarding future customer growth, making it difficult to take steps to meet customer needs. This research aims to predict customer growth in the future based on quantitative data from the previous year, where the output provided produces data in the form of numbers that are analyzed using statistical methods. The hope is to provide information to maximize customer growth with the minimum area or bandwidth used by the company. This research uses linear regression and support vector regression (SVR) algorithms using a company secondary dataset of 252 data points with 5 attributes. Data was collected during the last one-year period, from January to December 2021. The results of the research show that predictions using both algorithms have increased, customer growth when viewed from the number of customers, bandwidth, and regional data has increased significantly. This can be seen from the value of the number of customers, which continues to increase, while the highest number of customers falls in December, the most requested bandwidth is 20 mbps, and the largest customer area is in the Depok area. The results of the research show that the SVR algorithm is superior in terms of mean absolute percentage error (MAPE): 0.02% MAPE, 0.10 MAE, and 0.99 RMSE, while for linear regression, the MAPE values were 36.28%, MAE 201, and RMSE 0.80.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47709/cnahpc.v6i1.3362"
    },
    {
        "id": 8060,
        "title": "Analysis of the Comparison Between Linear Regression, Random Forest, and Logistic Regression Methods in Predicting Crude Palm Oil (CPO) Price",
        "authors": "Surya Wijaya, Fauziah Fauziah",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "This study compared the predictive capabilities of linear regression, random forest, and logistic regression models for forecasting crude palm oil prices. Utilizing historical data from 02/11/2020 to 13/11/2023, the dataset underwent training and testing with three scenarios: 90:10, 80:20, and 70:30. Evaluation metrics, including RMSE, MSE, and MAPE, assessed model performance. Each method had unique strengths and weaknesses, and the choice depended on application needs. The goal was to improve decision accuracy in predicting crude palm oil price trends. In the 90:10 scenario, random forest outperformed linear and logistic regression, yielding smaller MSE (43948.56), MAE (80.37), and RMSE (209.64). Similarly, in the 80:20 scenario, random forest had smaller MSE (137787.61), MAE (106.38), and RMSE (371.20). In the 70:30 scenario, random forest showed smaller MSE (107582.32), MAE (104.13), and RMSE (328). Overall, random forest consistently demonstrated better performance than linear and logistic regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47709/brilliance.v3i2.3334"
    },
    {
        "id": 8061,
        "title": "The Role of Technical and Managerial Competencies in Improving the Quality of Regional Tax Revenue Administration Using Multiple Linear Regression",
        "authors": "Nahwa Umar",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231101041331"
    },
    {
        "id": 8062,
        "title": "Testing Exogeneity in the Functional Linear Regression Model",
        "authors": "Manuela Dorn, Melanie Birke, Carsten Jentsch",
        "published": "2026",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0154"
    },
    {
        "id": 8063,
        "title": "On modified unbiased ridge regression estimator in linear regression model",
        "authors": "Feras Sh. Batah, Mustafa. M. Salih, Mohammed. K. Salih, Şerifenur C. Erdal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0150785"
    },
    {
        "id": 8064,
        "title": "An Rkhs Approach for Pivotal Inference in Functional Linear Regression",
        "authors": "Holger Dette, Jiajun Tang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202022.0086"
    },
    {
        "id": 8065,
        "title": "Beyond Linearity: Harnessing Spline Regression Models to Capture Non-linear Relationships",
        "authors": "",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54908/iljs.2023.10.01.003"
    },
    {
        "id": 8066,
        "title": "Scaled Partial Envelope Model in Multivariate Linear Regression",
        "authors": "Jing Zhang, Zhensheng Huang, Lixing Zhu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202020.0352"
    },
    {
        "id": 8067,
        "title": "An Efficient Experimental Model to Estimate the Performance of the Raise Borer Drilling Machine Using Linear and Nonlinear Regression Approaches in the Azad Dam in Iran",
        "authors": "Sirvan Moradi, Ali Aalianvari, Abbas Aghajani Bazzazi",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40808-023-01849-5"
    },
    {
        "id": 8068,
        "title": "Stock Price predication based on Linear Regression, RNN, LSTM",
        "authors": "Bowen Xia",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "The prediction of stock price has always been a topic of concern by the financial analysis industry. With the progress of science and technology, the prediction methods of stock price are becoming more and more rich and advanced. From classical linear regression to the state-of-art neural network scenarios, from mathematics to AI deep learning, the introduction of computers and the development of programming also provide a new direction for the prediction of stock prices. This study takes the stock of Johnson & Johnson in the past five years as an example, selects the open, high, low price of the stock as the explanatory variable, and chooses the close price as the explanatory variable to establish a linear regression model. This study also establishes RNN and LSTM models to predict stock prices. Subsequently, the R2, RMSE, MAE of the model are evaluated, where LSTM model have the best R2 score and the best prediction of future stock price. These results shed light on guiding further exploration to the short-term stock price prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v38i.3715"
    },
    {
        "id": 8069,
        "title": "Study on Factors Based on Multiple Linear Regression Model Affecting Children’s Education Access",
        "authors": "启美 李",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/mos.2023.123223"
    },
    {
        "id": 8070,
        "title": "Linear Regression Modeling Based Scoring System to Reduce Benign Breast Biopsies Using Multi-parametric US with Color Doppler and SWE",
        "authors": "Burcu Özdemir Demirci, Onur Buğdaycı, Gökhan Ertaş, Deniz E.T. Şanlı, Handan Kaya, Erkin Arıbal",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.acra.2023.01.024"
    },
    {
        "id": 8071,
        "title": "Ancestor regression in linear structural equation models",
        "authors": "C Schultheiss, P Bühlmann",
        "published": "2023-11-15",
        "citations": 2,
        "abstract": "Summary\nWe present a new method for causal discovery in linear structural equation models. We propose a simple technique based on statistical testing in linear models that can distinguish between ancestors and non-ancestors of any given variable. Naturally, this approach can then be extended to estimating the causal order among all variables. We provide explicit error control for false causal discovery, at least asymptotically. This holds true even under Gaussianity, where other methods fail due to non-identifiable structures. These Type I error guarantees come at the cost of reduced power. Additionally, we provide an asymptotically valid goodness-of-fit p-value for assessing whether multivariate data stem from a linear structural equation model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/biomet/asad008"
    },
    {
        "id": 8072,
        "title": "Using Linear Regression in the Context of Military Power Enhancement",
        "authors": "Ivan Okromtchedlishvili",
        "published": "2023-12-25",
        "citations": 0,
        "abstract": "The article explores the application of linear regression in the context of military power enhancement. Linear regression analysis is employed to identify the key factors that contribute to military strength, such as defense expenditure and military personnel levels. The study utilizes data from 31 NATO member and partner countries and employs open-source data for analysis. The research aims to determine the impact of various independent variables on the dependent variable, the Military Strength Ranking for 2022, and identify which variables can be adjusted to achieve greater military power. The study's hypotheses are tested to establish the significance of each variable. The results indicate that defense expenditure and military personnel are statistically significant factors influencing military power. A higher defense budget and greater military personnel correlate positively with a higher Military Strength Ranking. However, the study acknowledges the challenge of balancing defense spending with civilian priorities, known as the \"guns versus butter\" dilemma. The importance of efficiently allocating defense funds to maximize military capability is emphasized, as history has shown that mere financial resources do not guarantee security. The study recommends increasing the share of military personnel, reducing administrative costs and optimizing structural units, particularly in supply and administration areas and the civil office's structural units, to enhance military capability within existing defense budgets. Additionally, the role of reserve forces is highlighted as a valuable resource for augmenting combat capabilities. The article underscores the need to strike a proper balance between active and reserve components of military capability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61446/ds.2.2023.7408"
    },
    {
        "id": 8073,
        "title": "Automated Piecewise Linear Regression for Analyzing Structural Health Monitoring Data",
        "authors": "",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14359/51740370"
    },
    {
        "id": 8074,
        "title": "Real-Time Model Predictive Control for Shot Aiming in Pinball Using k-NN Regression",
        "authors": "Michael Ikuru, Zachariah E. Fuchs",
        "published": "2023-8-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/naecon58068.2023.10365880"
    },
    {
        "id": 8075,
        "title": "AUTOMATED PERSONALITY PREDICTIVE MODEL FOR E-RECRUITMENT USING LOGISTIC REGRESSION TECHNIQUE",
        "authors": "Oluyinka I Omotosho",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "Human personality plays a vital role in individual's life as well as in the development of an organization. Common ways to evaluating human personality is by using standard questionnaires or by analyzing the Curriculum Vitae (CV). Traditionally, recruiters manually shortlist/filters a candidate’s CV as per their requirements. In this work, a system that automates the eligibility check and aptitude evaluation of candidates in a recruitment process is developed. To meet this need an automated system module is developed for the analysis of aptitude or personality test based on candidate’s CV. The work presented in this paper determines the personality trait of applicants through CV analysis using Python upon which the Personality prediction Model is built. The result helps in evaluating the qualities in the candidates by analyzing personality trait and character of such candidate. The system provides serves as a better option  for the recruitment process so that candidate’s data can extracted from CV and shortlisted  for the best decision via fair judgment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/cse.v8i5.5620"
    },
    {
        "id": 8076,
        "title": "An innovative disruptive malware detection and prediction of web vulnerability attackers using novel linear regression against logistic regression",
        "authors": "V. Jaswanth, B. Aishwarya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0178969"
    },
    {
        "id": 8077,
        "title": "PERBANDINGAN MODEL MULTIPLE LINEAR REGRESSION DAN DECISION TREE REGRESSION (STUDI KASUS: PREDIKSI HARGA SAHAM TELKOM, INDOSAT, DAN XL)",
        "authors": "Althof Thabibi, Raden Supriyanto",
        "published": "2023",
        "citations": 0,
        "abstract": "Penggunaan machine learning menjadi salah satu bidang yang banyak digunakan seiring berkembangnya zaman. Melakukan prediksi dengan baik pada suatu data dapat dibantu dengan teknik dan model pada machine learning. Regresi menjadi salah satu teknik terbaik yang dapat digunakan dalam memprediksi suatu data. Tujuan penelitian ini yaitu untuk memanfaatkan machine learning menggunakan regresi dalam memprediksi sebuah data dengan baik. Tahapan penelitian dalam melakukan prediksi ini meliputi pengumpulan materi, analisis dan perancangan, uji coba, dan implementasi. Uji coba dilakukan dalam 3 skema pengujian, yaitu 80:20, 70:30, dan 60:40. Implementasi dilakukan dengan evaluasi error setiap model regresi untuk menentukan model terbaik dalam mengolah dataset. Hasil penelitian menggunakan model Multiple Linear Regression (MLR) dan Decision Tree Regression (DTR) memiliki perbedaan yang cukup besar. Model MLR memiliki nilai terbaik untuk MAE menggunakan skema 70:30 dengan nilai sebesar 0.008, sedangkan untuk RMSE dan MAPE menggunakan skema 60:40 dengan nilai sebesar 2.591 dan 0.852. Model DTR memiliki nilai terbaik menggunakan skema 80:20 dengan nilai MAE sebesar 0.013, nilai RMSE sebesar 4.014, dan nilai MAPE sebesar 1.287. Kesimpulan menunjukkan bahwa model MLR lebih bagus digunakan untuk dataset telekomunikasi selama 5 tahun terakhir karena memiliki nilai lebih kecil daripada model DTR walaupun dengan skema yang berbeda.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35760/tr.2023.v28i1.6081"
    },
    {
        "id": 8078,
        "title": "Predictive modeling of the reduced partition function ratio for organic isotopologues",
        "authors": "Simon Andren, John Eiler",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7185/gold2023.18711"
    },
    {
        "id": 8079,
        "title": "Using Predictive Modeling to Combat Money Laundering",
        "authors": "Ivan Lopez Torres",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4441971"
    },
    {
        "id": 8080,
        "title": "Rush regression workbench: An integrated open-source application for regression modeling and analysis in healthcare analytics",
        "authors": "Kenneth Locey, Ryan Schipfer, Brittnie Dotson",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100314"
    },
    {
        "id": 8081,
        "title": "A Generalized Linear Transformation and Its Effects on Logistic Regression",
        "authors": "Guoping Zeng, Sha Tao",
        "published": "2023-1-15",
        "citations": 0,
        "abstract": "Linear transformations such as min–max normalization and z-score standardization are commonly used in logistic regression for the purpose of scaling. However, the work in the literature on linear transformations in logistic regression has two major limitations. First, most work focuses on improving the fit of the regression model. Second, the effects of transformations are rarely discussed. In this paper, we first generalized a linear transformation for a single variable to multiple variables by matrix multiplication. We then studied various effects of a generalized linear transformation in logistic regression. We showed that an invertible generalized linear transformation has no effects on predictions, multicollinearity, pseudo-complete separation and complete separation. We also showed that multiple linear transformations do not have effects on the variance inflation factor (VIF). Numeric examples with a real data were presented to validate our results. Our results of no effects justify the rationality of linear transformations in logistic regression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11020467"
    },
    {
        "id": 8082,
        "title": "Partially Linear Additive Functional Regression",
        "authors": "Xiaohui Liu, Wenqi Lu, Heng Lian, Yuzi Liu, Zhongyi Zhu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202020.0418"
    },
    {
        "id": 8083,
        "title": "Forestalling House Prices Using Linear Regression in Machine Learning",
        "authors": "",
        "published": "2023-8-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets43945"
    },
    {
        "id": 8084,
        "title": "Rapid Estimation of Battery Storage Capacity through Multiple Linear Regression",
        "authors": "Chulwon Jung, Woongchul Choi",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "Due to global warming issues, the rapid growth of electric vehicle sales is fully expected to result in a dramatic increase in returned batteries after the first use. Naturally, industries have shown great interest in establishing business models for retired battery reuse and recycling. However, they still have many challenges, such as high costs from the logistics of returned batteries and evaluating returned battery quality. One of the most important characteristics of a returned battery is the battery storage capacity. Conventionally, the battery’s energy capacity is measured through the low current full charging and discharging process. While this traditional measurement procedure gives a reliable estimate of battery storage capacity, the time required for a reliable estimate is unacceptably long to support profitable business models. In this paper, we propose a new algorithm to estimate battery storage capacity that can dramatically reduce the time for estimation through the partial discharging process. To demonstrate the applicability of the proposed algorithm, cylindrical and prismatic cells were used in the experiments. Initially, five indicators were selected from the voltage response curves that can identify battery storage capacity. Then, the five indicators were applied to principal component analysis (PCA) to extract dominant factors. The extracted factors were applied to a multiple linear regression model to produce a reliable estimation of battery storage capacity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/batteries9080424"
    },
    {
        "id": 8085,
        "title": "Model Selection in High-Dimensional Block-Sparse General Linear Regression",
        "authors": "Prakash B. Gohain, Magnus Jansson",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10289738"
    },
    {
        "id": 8086,
        "title": "Penerapan Metode Linear Regression untuk Memprediksi Peserta Training pada PT. NetSolution",
        "authors": "",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32409/jikstik.22.4.3411"
    },
    {
        "id": 8087,
        "title": "SIMPLE LINEAR REGRESSION OF SOCIAL MEDIA ACTIVITY AND STUDENT PERFORMANCE IN MINE SURVEYING STUDIES",
        "authors": "Mbalenhle Mpanza",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2024.0020"
    },
    {
        "id": 8088,
        "title": "Cryptocurrency Price Prediction Using LSTM, ARIMA, and Linear Regression",
        "authors": "",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets42248"
    },
    {
        "id": 8089,
        "title": "Information-based Optimal Subdata Selection for Clusterwise Linear Regression",
        "authors": "Yanxi Liu, John Stufken, Min Yang",
        "published": "2026",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202023.0302"
    },
    {
        "id": 8090,
        "title": "Multiple Linear Regression Analysis of the Animation Score",
        "authors": "Xianrui Fu",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "With the development of China’s economy, people’s living standards continue improving. This makes the cultural industry flourished. As an important part of the cultural, the animation industry is entering a golden age of development. The rapid development of the animation industry has led to a large number of national comics of varying quality. Based on the cultural atmosphere of domestic animation is not strong, the originality of animation production is not strong, the animation industry chain needs to be improved and other problems. This paper analyzed the significant factors affecting animation ratings through multiple linear regression models to make some suggestions for the future development of domestic animation. The summary analysis shows that name, storyboard and protagonist have a significant positive influence on the score. From the results, China's animation industry should pay attention to plot development and character building. It is hoped that the findings of this paper can have some guiding significance for the development of national comics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v49i.8501"
    },
    {
        "id": 8091,
        "title": "Perbandingan Teknik Prediksi Pemakaian Obat Menggunakan Algoritma Simple Linear Regression dan Support Vector Regression",
        "authors": "Sephia Pratista, Alwis Nazir, Iwan Iskandar, Elvia Budianita, Iis Afrianty",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "Public Health Centers (Puskesmas) had a crucial role in furnishing society essential healthcare services and medication management. To preempt errors in stock management, a predictive approach is employed. This prediction methodology involves comparing Data Mining techniques utilizing the Simple Linear Regression algorithm and Machine Learning methodologies harnessing the Support Vector Regression algorithm. This research uses Paracetamol 500 mg and Cetirizine drug data from January 2020 to June 2023. The selection of these algorithms is motivated by the continuous nature of the data variables and their temporal span, spanning 42 months (period). The core aim of this study is to evaluate the magnitude of predictive errors using the Mean Absolute Percentage Error (MAPE) methodology. Implementing these methods was effectuated through the programming language Python with an 80%:20% partitioning of training and testing data. Drawing from experimental endeavors conducted concerning Paracetamol 500 mg, the utilization of the Simple Linear Regression algorithm, yields a MAPE score of 20.85%, categorized as 'Moderate,' whereas the application of the Support Vector Regression algorithm generates a MAPE of 18.39%, classified as 'Good.' Otherwise, experimentation on Cetirizine employing the Simple Linear Regression algorithm, employing an identical division of training and testing data, results in a MAPE of 18.39%, also classified as 'Good.' Meanwhile, resorting to the Support Vector Regression algorithm leads to a MAPE of 17.14%, falling under the 'Good' category. Based on the MAPE obtained, the Support Vector Regression algorithm has better prediction results than the Simple Linear Regression algorithm",
        "keywords": "",
        "link": "http://dx.doi.org/10.47065/bits.v5i2.4260"
    },
    {
        "id": 8092,
        "title": "Asymptotic Optimality of Cp-Type Criteria in High-Dimensional Multivariate Linear Regression Models",
        "authors": "Shinpei Imori",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5705/ss.202020.0425"
    },
    {
        "id": 8093,
        "title": "Overview of high dimensional linear regression models",
        "authors": "Jin Li",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Linear regression analysis is one of the most basic and vital methods in statistical applications, especially when examining the relationship of one or more variables. This method initially used to analyze the relationship between father and child height has also been developed for nearly two hundred years. The development of computer technology has brought more efficient and accurate data processing, which allows us to use linear regression models to deal with high-dimensional and more complex scenarios. This paper mainly elaborates on the development of high-dimensional linear regression and the most classic models and tries to understand how some models can be improved. Finally, how to accurately apply model theory to practice will be a significant research direction in the future",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/5/20230427"
    },
    {
        "id": 8094,
        "title": "Exploring the Impact of Predictive Analytics on Accounting and Auditing Expertise: A Regression Analysis of LinkedIn Survey Data",
        "authors": "Olubukola Omolara Adebiyi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4626506"
    },
    {
        "id": 8095,
        "title": "Stepwise Regression for Increasing the Predictive Accuracy of Artificial Neural Networks: Applications in Benchmark and Advanced Problems",
        "authors": "George Papazafeiropoulos",
        "published": "2024-1-12",
        "citations": 1,
        "abstract": "A new technique is proposed to increase the prediction accuracy of artificial neural networks (ANNs). This technique applies a stepwise regression (SR) procedure to the input data variables, which adds nonlinear terms into the input data in a way that maximizes the regression between the output and the input data. In this study, the SR procedure adds quadratic terms and products of the input variables on pairs. Afterwards, the ANN is trained based on the enhanced input data obtained by SR. After testing the proposed SR-ANN algorithm in four benchmark function approximation problems found in the literature, six examples of multivariate training data are considered, of two different sizes (big and small) often encountered in engineering applications and of three different distributions in which the diversity and correlation of the data are varied, and the testing performance of the ANN for varying sizes of its hidden layer is investigated. It is shown that the proposed SR-ANN algorithm can reduce the prediction error by a factor of up to 26 and increase the regression coefficient between predicted and actual data in all cases compared to ANNs trained with ordinary algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/modelling5010009"
    },
    {
        "id": 8096,
        "title": "Regression-Driven Predictive Model to Estimate Learners' Performance through Multisource Data",
        "authors": "Shabnam Ara S J, Tanuja R, Manjula S H",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425033"
    },
    {
        "id": 8097,
        "title": "A new robust inference for predictive quantile regression",
        "authors": "Zongwu Cai, Haiqiang Chen, Xiaosai Liao",
        "published": "2023-5",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jeconom.2021.10.012"
    },
    {
        "id": 8098,
        "title": "Predictive Model of Student Dropout Based on Logistic Regression",
        "authors": "B.R. Cuji Chacha, W.L. Gavilanes López, M.B. Pérez Constante",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "Student desertion is a phenomenon that has spread significantly in many higher education institutions in Ecuador. The objective of the research was to develop a predictive model of student dropout based on multiple binary logistic regression, with the purpose of detecting possible dropouts. The methodology used consists of three phases: Phase 1: Analysis of variables; Phase 2: Formulation of the mathematical model; and Phase 3: Evaluation. For the estimation of the coefficients of the model, the SPSS tool was obtained. After the creation of the predictive model, it was concluded that the most significant variables that contribute to the diagnosis of dropout are marital status, age, gender, Note2s, and Note1s. It is also evident that students have a higher risk of dropping out if they are married and lower risk if they are single or divorced. Finally it was concluded that gender is a factor that directly influences dropout; male students are more likely to drop out than females.\r\nKeywords: logistic regression, predictive model, desertion.\r\nResumen\r\nLa deserción estudiantil es un fenómeno que se ha extendido significativamente en gran cantidad de instituciones educativas de nivel superior en el Ecuador. El objetivo de la investigación fue desarrollar un modelo predictivo de deserción estudiantil basado en la regresión logística binaria múltiple, con el propósito de detectar a posibles desertores. La metodología utilizada consta de tres fases: Fase1: Análisis de variables. Fase2: Formulación del modelo matemático. Fase3: Evaluación. Para la estimación de los coeficientes del modelo se utilizó la herramienta SPSS. Posterior a la creación del modelo predictivo se llegó a concluir que las variables más significativas que aportan al diagnóstico de la deserción son estado civil, edad, género Nota2s y Nota1s, además se evidencia que los estudiantes tienen mayor riesgo de deserción si están casados y menor riesgo si están solteros o divorciados, finalmente se concluye, que el género es un factor que influye directamente en la deserción, los estudiantes masculinos son más propensos a desertar que los femeninos.\r\nPalabras Clave: regresión logística, modelo predictivo, deserción.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/espoch.v3i1.14477"
    },
    {
        "id": 8099,
        "title": "Calibration of A Regression Network Based on the Predictive Variance with Applications to Medical Images",
        "authors": "Lior Frenkel, Jacob Goldberger",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230543"
    },
    {
        "id": 8100,
        "title": "Slurry-ability mathematical modeling of microwave-modified lignite: A comparative analysis of multivariate non-linear regression model and XGBoost algorithm model",
        "authors": "Yangguang Ren, Ziqi Lv, Zhiqiang Xu, Qun Wang, Zhe Wang",
        "published": "2023-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2023.128143"
    },
    {
        "id": 8101,
        "title": "Forecasting Tsunami Hazards Using Ocean Bottom Sensor Data and Classification Predictive Modeling",
        "authors": "Yao Li",
        "published": "2023-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/iecg2022-14266"
    },
    {
        "id": 8102,
        "title": "Optimization Of Replenishment and Sales Strategies of Vegetable Commodities Based on Multiple Linear Regression and Non-Linear Programming",
        "authors": "Xiangkun Fu, Xiangshi Li, Wenhuizi Wang",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "Automated pricing of vegetable items generates suggested selling prices for the items based on the provided item data, considering the structure of the data. The aim of this paper is to better help superstores plan future replenishment volumes and pricing strategies by analysing sales data for each category and individual item in the vegetable category. Specifically, this paper takes the category as a unit, uses the processed cost-plus pricing, sales volume, purchase price, and loss rate data of each vegetable category to establish a linear regression model, and based on the least squares method, the relationship between cost-plus pricing and total sales volume of each vegetable category is fitted to solve the problem, and the multivariate linear relationship expression with high fit is obtained; based on the cost-plus pricing rule, the future replenishment volume and pricing decision is established based on each category. Based on the cost-plus pricing rule, a nonlinear programming model is established based on the total daily replenishment and pricing decision for each category in the coming week, with the revenue of the superstore as the optimization objective, and considering the constraint of the transport loss rate, the total daily replenishment in the coming week under the maximal revenue is solved by using MATLAB to get the corresponding replenishment strategy, and then the total daily replenishment is substituted into the multivariate linear expression to calculate the corresponding pricing strategy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/tyaamw25"
    },
    {
        "id": 8103,
        "title": "Predictive modeling of lower extremity injury risk in male elite youth soccer players using least absolute shrinkage and selection operator regression",
        "authors": "Mathias Kolodziej, Andreas Groll, Kevin Nolte, Steffen Willwacher, Tobias Alt, Marcus Schmidt, Thomas Jaitner",
        "published": "2023-6",
        "citations": 0,
        "abstract": "PurposeTo (1) identify neuromuscular and biomechanical injury risk factors in elite youth soccer players and (2) assess the predictive ability of a machine learning approach.Material and MethodsFifty‐six elite male youth soccer players (age: 17.2 ± 1.1 years; height: 179 ± 8 cm; mass: 70.4 ± 9.2 kg) performed a 3D motion analysis, postural control testing, and strength testing. Non‐contact lower extremities injuries were documented throughout 10 months. A least absolute shrinkage and selection operator (LASSO) regression model was used to identify the most important injury predictors. Predictive performance of the LASSO model was determined in a leave‐one‐out (LOO) prediction competition.ResultsTwenty‐three non‐contact injuries were registered. The LASSO model identified concentric knee extensor peak torque, hip transversal plane moment in the single‐leg drop landing task and center of pressure sway in the single‐leg stance test as the three most important predictors for injury in that order. The LASSO model was able to predict injury outcomes with a likelihood of 58% and an area under the ROC curve of 0.63 (sensitivity = 35%; specificity = 79%).ConclusionThe three most important variables for predicting the injury outcome suggest the importance of neuromuscular and biomechanical performance measures in elite youth soccer. These preliminary results may have practical implications for future directions in injury risk screening and planning, as well as for the development of customized training programs to counteract intrinsic injury risk factors. However, the poor predictive performance of the final model confirms the challenge of predicting sports injuries, and the model must therefore be evaluated in larger samples.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1111/sms.14322"
    },
    {
        "id": 8104,
        "title": "Comparison Random Forest Regression and Linear Regression For Forecasting BBCA Stock Price",
        "authors": "Arif Mudi Priyatno, Lailatul Syifa Tanjung, Wahyu Febri Ramadhan, Putri Cholidhazia, Putri Zulia Jati, Fahmi Iqbal Firmananda",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "Stock trading is a popular financial instrument worldwide. In Indonesia, the stock market is known as the Indonesia Stock Exchange (BEI), and one actively traded stock is PT Bank Central Asia (BBCA). However, predicting stock price movements is challenging due to various influencing factors. Investors use fundamental and technical analyses for decision-making, but results often vary. Machine learning, particularly random forest regression and linear regression algorithms, can be used for stock price forecasting. In this paper, we compares these two machine learning methods to forecast BBCA stock prices, aiming to provide more accurate and effective solutions for investor's investment and trading decisions. The evaluation results of cross-validation mean squared error (MSE), root mean squared error (RMSE), mean absolute error (MAE), and mean absolute percentage error (MAPE) for linear regression were 0.12848, 0.35807, 0.29570, and 0.0036%, respectively, while for random forest regression were 27473.76, 158.04, 142.70, and 1.7153%. These findings indicate that linear regression outperforms in forecasting performance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31004/jutin.v6i3.16933"
    }
]