[
    {
        "id": 19571,
        "title": "Enhanced Parallel-Particle Swarm Optimization (EP-PSO) Approach for Solving Nurse Rostering Problem",
        "authors": "Nagaraj V. Dharwadkar, Gautami G. Shingan, Sandeep Uttam Mane, Santosh Joshi",
        "published": "2022-5-6",
        "citations": 1,
        "abstract": "A Nurse Rostering Problem is a highly-constrained combinatorial optimization problem, where we assign several nurses to shifts by violating minimum constraints. Due to massive number of constraints, these problems are difficult to handle manually. The advantage of automating the task is to generate a roster having not only high quality but also more flexibility by reducing the workload, time and effort of head nurses. The PSO algorithm is extremely dependent upon settings of control parameters and balance the exploration and exploitation in search space. These problems are avoided by proposed an ES-PSO Algorithm. Highly constrained problems have huge search space to find an optimal solution, hence to cover that space and find the solution in the stipulated time necessary to increase population. However, it may take more time for particle updating and fitness evaluations. To improve execution time of the compute-intensive task, we have used OpenMP and CUDA framework. The adapted algorithm improves the outcome by minimizing penalty and reduces stuff of compute-intensive tasks.",
        "link": "http://dx.doi.org/10.4018/ijsir.298261"
    },
    {
        "id": 19572,
        "title": "Optimasi Parameter Artificial Neural Network (ANN) Menggunakan Particle Swarm Optimization (PSO) Untuk Pengkategorian Nasabah Bank",
        "authors": "Lennox Larwuy",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Artificial Neural Network (ANN), also known as Jaringan Saraf Tiruan, is one of the methods commonly used for pattern recognition, classification, forecasting, and regression, depending on the problem or data used. While the results obtained are generally good, there are often issues with determining the initial parameters as the initial weights, which can lead to non-convergence of results. This is why a method is needed to optimize the ANN parameters to achieve better outcomes. Particle Swarm Optimization (PSO) was chosen as the method to optimize the ANN parameters (PSO-ANN). The best parameter values for PSO were predefined, with w (inertia weight) set to 0.8 and c1 and c2 (acceleration coefficients) set to 1.5. Subsequently, PSO-ANN was trained using a bank customer dataset to determine the categories of customers with credit problems or not. The results were compared with using ANN without parameter optimization. The obtained results showed an Accuracy rate of 82.6%, Precision of 91.1%, and Recall of 37.1%. This represents an improvement compared to the results of ANN without parameter optimization, which had an Accuracy rate of 80.1%, Precision of 89.5%, and Recall of 32.4%.",
        "link": "http://dx.doi.org/10.33772/jmks.v3i3.60"
    },
    {
        "id": 19573,
        "title": "Traffic Light Controller Module Based on Particle Swarm Optimization (PSO)",
        "authors": "Manish Vishwanath",
        "published": "No Date",
        "citations": 0,
        "abstract": ": A traffic light control module base on PSO algorithm has been presented to find the optimal set of adjacent streets thatare the candidate to take the green period time providing the best vehicles flow. In our previous work a visual traffic light monitoringmodule has been presented. This module able to determine the traffic conditions (crowded, normal and empty). The proposed controlmodule should be able to integrate with the previous monitoring module to develop a new complete intelligent traffic light system.Promising results have been obtained via applying the proposed traffic light controller module. The controller module shows itsability to select a set of streets. The green period time will be given to these selected streets to achieve the optimal vehicle flowthrough the traffic light’s intersections. The results show that the proposed control module improving the flow ratio about 85% to96% with a different number of traffic lights.",
        "link": "http://dx.doi.org/10.31219/osf.io/a29kj"
    },
    {
        "id": 19574,
        "title": "Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Erik Cuevas, Alma Rodríguez",
        "published": "2020-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003006312-6"
    },
    {
        "id": 19575,
        "title": "An Enhanced Particle Swarm Optimization (PSO) Employing Quasi-Random Numbers",
        "authors": "Shivakumar Kannan, Urmila Diwekar",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper introduces an innovative Particle Swarm Optimization (PSO) Algorithm in-corporating Sobol and Halton Random number samplings. It evaluates the enhanced PSO&#039;s performance against conventional PSO employing Monte Carlo Random Number Samplings. The comparison involves assessing the algorithms across nine benchmark problems and the renowned Travelling Salesman Problem (TSP). The re-sults reveal consistent enhancements achieved by the enhanced PSO utilizing Sob-ol/Halton samplings across the benchmark problems. Particularly noteworthy are the substantial improvements demonstrated by the enhanced PSO in solving the Travel-ling Salesman Problem. These findings underscore the efficacy of employing Sobol and Halton random number generation methods in enhancing algorithm efficiency.",
        "link": "http://dx.doi.org/10.20944/preprints202403.0944.v1"
    },
    {
        "id": 19576,
        "title": "Forward Node Selection Using Particle Swarm Optimization (PSO) for Broadcasting in MANET",
        "authors": "Saraswathi R.",
        "published": "2020-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12i1/20201042"
    },
    {
        "id": 19577,
        "title": "Comparative Economic between Bat Algorithm (Ba) and Particle Swarm Optimization (Pso) for Solving Economy Dispatch",
        "authors": "Vicky Andria Kusuma, Restu Mukti Utomo, Lucky Dwi Saputra, Yuli Prasetyo",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009490402720280"
    },
    {
        "id": 19578,
        "title": "PSO-UFS: A Novel Approach to Univariate Feature Selection Using Particle Swarm Optimization",
        "authors": "Mohammed Mehdi Bouchene",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nUnivariate Feature Selection (UFS) traditionally involves a labor-intensive process of trial-and-error, necessitating the selection of scoring functions and the determination of feature numbers. These choices can inadvertently affect both the performance and interpretability of the model. To address this challenge, we introduce Particle Swarm Optimization for Univariate Feature Selection (PSO-UFS), an innovative method that automates these crucial decisions. \nPSO-UFS leverages the power of Particle Swarm Optimization (PSO) to autonomously identify the optimal scoring function and feature subset that maximize a machine learning algorithm's performance metric. Our empirical evaluations across multiple datasets demonstrate that PSO-UFS significantly outperforms traditional UFS in various performance metrics, including accuracy, precision, recall, and F1-score. \nImportantly, PSO-UFS generates more interpretable feature subsets, thereby enhancing the model's comprehensibility. This advancement paves the way for broader applications in real-world scenarios where feature reduction and interpretability are paramount.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3801641/v1"
    },
    {
        "id": 19579,
        "title": "Study of Hybrid Transmission HVAC/HVDC by Particle Swarm Optimization (PSO)",
        "authors": "Yulianta Siregar, Credo Maestro Hasianta Pardede",
        "published": "No Date",
        "citations": 1,
        "abstract": "Indonesia's SUMBAGUT 150 kV transmission of High Voltage Alternating Current Network (HVAC) system has considerable power losses. These power losses are a critical problem in the transmission network system. Meanwhile, this study provides one solution to reduce power losses using a High Voltage Direct Current (HVDC) network system. Determining the location to convert HVAC into HVDC is very important. The authors use Particle Swarm Optimization (PSO) to get the optimal location on the 150 kV SUMBAGUT HVAC transmission network system. The study results showed that before using the HVDC network system, the power losses were 122.26 MW. Meanwhile, power losses with one transmission HVDC in the \"Paya Pasir-Sei Rotan\" are 84.16 MW, \"Porsa-P. Siantar\" 90.83 MW, \"Paya Pasir-Paya Geli\" 104.14 MW. Then power losses with two transmission HVDC in \"Paya Pasir-Sei Rattan\" and \"Porsa-P. Siantar\" is 71.24 MW, \"Paya Pasir-Sei Rotan\" and \"Paya Pasir-Paya Geli\" 77.46 MW, \"Porsa-P. Siantar\" and \"Paya Pasir-Paya Geli\" 78.52 MW. The last result, power losses with three transmission HVDC in \"Paya Pasir-Sei Rotan,\" \"Porsa-P. Siantar,\" and \"Paya Pasir-Paya Geli\" lost 64.57 MW.",
        "link": "http://dx.doi.org/10.20944/preprints202209.0240.v1"
    },
    {
        "id": 19580,
        "title": "A New Hybrid Harris Hawks Optimization (HHO) and Particle Swarm Optimization (PSO) Algorithm for the Design of Castellated Beams",
        "authors": "Mohammadreza Mashayekhi, Soroush Mosayebi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn this paper, a hybrid meta-heuristic algorithm based on Harris Hawk Optimization (HHO) and Particle Swarm Optimization (PSO) is developed and used for the design of castellated beams. The total cost, including material and construction costs, is taken as the objective function, and the code requirements and geometry limitations have been considered in constraint functions. The proposed method is used to obtain the optimal solution of three examples. The solution is then compared with the results of five known methods. It is observed that the proposed algorithm achieves better results with a higher convergence speed as compared to the considered methods.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2608871/v1"
    },
    {
        "id": 19581,
        "title": "Perception of Particle Swarm Optimization (PSO) Algorithm in Insurance Strategies",
        "authors": "Hossein Niavand, R. Mahesh",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3436969"
    },
    {
        "id": 19582,
        "title": "Improved Divorce Prediction Using Machine learning- Particle Swarm Optimization (PSO)",
        "authors": "P. Ranjitha, Akshatha Prabhu",
        "published": "2020-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet49848.2020.9154081"
    },
    {
        "id": 19583,
        "title": "Optimization of Horizontal Axis Tidal Turbines Farming Configuration Using Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Muhammad Asroril Mubarok, Nu Rhahida Arini, Dendy Satrio",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ies59143.2023.10242450"
    },
    {
        "id": 19584,
        "title": "OPTIMALISASI PENJUALAN MOTOR MENGGUNAKAN ALGORITMA PARTICLE SWARM OPTIMIZATION (PSO)",
        "authors": "Andi Lala",
        "published": "2019-10-17",
        "citations": 0,
        "abstract": "Saat ini pengguna transportasi masih banyak sekali, kendaraan-kendaraan yang dibutuhkan guna untuk memenuhi kebutuhan sehari-hari tidak pernah kunjung habis, banyak perusahaan-perusahaan yang bersaing dalam bidang transportasi terutama pada bidang penjualan motor.\r\nPenelitian yang akan dilakukan adalah untuk mengetahui hasil peningkatan penjualan motor, membantu mempercepat proses pengoptimalan peningkatan penjualan dengan menggunakan algoritma Particle Swarm Optimization (PSO). \r\n Kesimpulan dari penelitian ini adalah untuk mengetahui diskon dan uang muka yang akan digunakan dengan tujuan meningkatkan penjualan motor kedepan dan perkiraan besar total penjualan selama 12 bulan kedepan.\r\nKata kunci : PSO, optimalisasi, SPK, Metode",
        "link": "http://dx.doi.org/10.37676/jmi.v15i2.864"
    },
    {
        "id": 19585,
        "title": "Particle Swarm Optimization (PSO) based Algorithm for the Optimal Location and Setting of FACTS Devices to Improve Voltage Stability",
        "authors": "Lui gi, Caleb Benjamin",
        "published": "2017-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.9756/bijpsic.8337"
    },
    {
        "id": 19586,
        "title": "Study of Hybrid Transmission HVAC/HVDC by Particle Swarm Optimization (PSO)",
        "authors": "Yulianta Siregar, Credo Pardede",
        "published": "2022-10-16",
        "citations": 0,
        "abstract": "There are considerable power losses in Indonesia’s SUMBAGUT 150 kV transmission High Voltage Alternating Current Network (HVAC) system. These power losses and the voltage profile are critical problems in the transmission network system. This research provides one possible way to reduce power losses involving the use of a High Voltage Direct Current (HVDC) network system. Determining the location to convert HVAC into HVDC is very important. The authors of the current study used Particle Swarm Optimization (PSO) to determine the optimal location on the 150 kV SUMBAGUT HVAC transmission network system. The study results show that, before using the HVDC network system, the power loss was 68.41 MW. On the other hand, power loss with the conversion of one transmission line to HVDC was 57.31 MW for “Paya Pasir–Paya Geli” (efficiency 16.22%), 51.79 MW for “Paya Pasir–Sei Rotan” (efficiency 24.29%), and 60.8 MW for “Renun–Sisikalang” (efficiency 110.12%). The power loss with the conversion of two transmission lines to HVDC was 45.7 MW for “Paya Pasir–Paya Geli” and “Paya Pasir–Sei Rotan” (efficiency 33.19%), 44.95 MW for “Paya Pasir–Paya Geli” and “Renun–Sidikalang” (efficiency 26.98%), and 44.69 MW for “Paya Pasir–Sei Rotan” and “Renun–Sidikalang” (efficiency 34.67%). The power loss with the conversion of three transmission lines to HVDC was 38.71 MW for “Paya Pasir–Paya Geli,” “Paya Pasir–Sei Rotan,” and “Renun–Sidikalang” (efficiency 41.41%).",
        "link": "http://dx.doi.org/10.3390/en15207638"
    },
    {
        "id": 19587,
        "title": "Introductory Chapter: Swarm Intelligence and Particle Swarm Optimization",
        "authors": "Pakize Erdogmus",
        "published": "2018-5-30",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.74076"
    },
    {
        "id": 19588,
        "title": "A generic model order reduction technique based on Particle Swarm Optimization (PSO) algorithm",
        "authors": "Khaled Salah",
        "published": "2017-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/eurocon.2017.8011103"
    },
    {
        "id": 19589,
        "title": "Mining high utility itemsets using Shuffled Complex Evolution of particle swarm optimization (SCE-PSO) optimization algorithm",
        "authors": "C. Sivamathi, S. Vijayarani",
        "published": "2017-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icici.2017.8365213"
    },
    {
        "id": 19590,
        "title": "Study on optimization method for airfoil in supersonic case based on Particle Swarm optimization(PSO)",
        "authors": "Zhongkai Chen",
        "published": "2022-8-21",
        "citations": 1,
        "abstract": "In order to adapt to the society demand of requiring faster aircraft, this thesis aims at combining Particle Swarm optimization (PSO) with Computational Fluid Dynamics (CFD) to get a optimized airfoil which possesses a better areodynmics performance in supersonic case. This paper adopts the method of using small disturbance equation to simulate the flow field, which is more effective and stable and easier to implement. Besides, this paper adopts traditional PSO. The results show that the magnitude of ratio of lift-drag has increased by 16.29% and the magnitude of lift has risen by 13.69%, while the magnitude of drag has decreased by 2.2% after the optimization, compared with the initial airfoil. Besides, the results also reveal that the front of the optimized airfoil is wider than that of the initial airfoil and the rear of the optimized airfoil is narrower than that of the initial airfoil, which can represent that the optimized airfoil effectively enlarge the magnitude of ratio of lift-drag and lift and suppresses the drag and influence generated by shock.",
        "link": "http://dx.doi.org/10.54097/hset.v13i.1337"
    },
    {
        "id": 19591,
        "title": "Implementation of Particle Swarm Optimization (PSO) Method in Minimum Quantity Lubrication (MQL) Optimization to Obtain Optimal Machining in CNC Milling Machine",
        "authors": "Yogi Muldani Hendrawan, Faza Husnan Anshori, Andri Pratama, Herman Budi Harja, . Pandoe, Akil Priyamanggala Danadibrata",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011891500003575"
    },
    {
        "id": 19592,
        "title": "Particle Swarm Optimization-Based Data Aggregation in Wireless Sensor Network",
        "authors": "Meeta Gupta, Adwitiya Sinha",
        "published": "2021-1",
        "citations": 0,
        "abstract": "Wireless sensor networks have battery-operated sensor nodes, which need to be conserved to have prolonged network lifetime. The amount of power consumed for routing sensed data from the sensor node to the sink node is large. Thus, in order to optimize the energy usage in sensor network efficient data aggregation techniques are needed. Particle swarm optimization (PSO) is a speculative and evolutionary computing technique based on swarm intelligence for solving optimization problems in sensor network such as nodes deployment, node scheduling, data clustering, and aggregation. The paper proposes a PSO-based sensor network aggregation protocol (PSO-SNAP) with K-means to provide initial centroid. The PSO has been used to find the optimal aggregated value having minimum quantization error. The output of the K-means algorithm is used as an initial centroid in PSO.  Apart from K-means, K-medoid and simple average has also been used to provide initial seed to the PSO algorithm and results of all three approaches are compared.",
        "link": "http://dx.doi.org/10.4018/ijsir.2021010101"
    },
    {
        "id": 19593,
        "title": "PERBANDINGAN ALGORITMA PARTICLE SWARM OPTIMIZATION (PSO) DAN ALGORITMA GLOWWORM SWARM OPTIMIZATION (GSO) DALAM PENYELESAIAN SISTEM PERSAMAAN NON LINIER",
        "authors": "Ana Ulul Azmi, Rusli Hidayat, M Ziaul Arif",
        "published": "2019-3-1",
        "citations": 0,
        "abstract": "Non-linear equation system is one of the mathematics problems which difficult to solve. Several methods have been introduced to solve the problems. Newton-Raphson method is the most common and widely used as the basis for evolving the latest numerical methods. However, this method requires the derivative of each equation with respect to every variable when calculating the Jacobian. Naturally, obtaining the derivative is challenging in certain cases. In addition, it needs a proper initial value to obtain the converged solution. Therefore, the new technique with a simple random initial value is urgently needed. In this study, it is shown the implementation of the two metaheuristic optimization methods, including Particle Swarm Optimization (PSO) and the Glowworm Swarm Optimization (GSO) to estimate the solution of a non-linear equation system. Several examples of nonlinear equation system were used for evaluating and testing the performance and the accuracy of both algorithms. In this simulation, the results show that PSO converged to the exact solution (global optimum) better than Glowworm Swarm Optimization (GSO).\r\nKeywords: Non-Linear Equation Systems, Particle Swarm Optimization (PSO), Glowworm Swarm Optimization (GSO)",
        "link": "http://dx.doi.org/10.19184/mims.v19i1.17263"
    },
    {
        "id": 19594,
        "title": "Particle Swarm Optimization with Targeted Position-Mutated Elitism (PSO-TPME) for Partially Shaded PV Systems",
        "authors": "Tamir Shaqarin",
        "published": "2023-2-22",
        "citations": 5,
        "abstract": "In partial shading situations, the power–voltage (P–V) characteristics of photovoltaic (PV) systems become more complex due to many local maxima. Hence, traditional maximum power point tracking (MPPT) techniques fail to recognize the global maximum power point (MPP), resulting in a significant drop in the produced power. Global optimization strategies, such as metaheuristic approaches, efficiently address this issue. This work implements the recent “particle swarm optimization through targeted position-mutated elitism” (PSO-TPME) with a reinitialization mechanism on a PV system under partial shading conditions. The fast-converging and global exploration capabilities of PSO-TPME make it appealing for online optimization. PSO-TPME also offers the flexibility of tuning the particle classifier, elitism, mutation level, and mutation probability. This work analyzes several PSO-TPME parameter settings for the MPPT of partially shaded PV systems. Simulations of the PV system under varying shading patterns show that PSO-TPME, with balanced exploitation–exploration settings, outperforms PSO in terms of convergence speed and the amount of captured energy during convergence. Furthermore, simulations of partial shading conditions with fast-varying, smooth, and step-changing irradiance demonstrated that the proposed MPPT technique is capable of dealing with these severe conditions, capturing more than 97.7% and 98.35% of the available energy, respectively.",
        "link": "http://dx.doi.org/10.3390/su15053993"
    },
    {
        "id": 19595,
        "title": "Data Reconciliation on PLTGU Gresik Using Particle Swarm Optimization (PSO)",
        "authors": "Wahyu T Pratiwi, Totok R. Biyanto",
        "published": "2017-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12962/j23378530.v2i3.a3077"
    },
    {
        "id": 19596,
        "title": "Optimalisasi Penjualan Motor Menggunakan Algoritma Particle Swarm Optimization (PSO)",
        "authors": "Ujang Juhardi, Andilala Andilala",
        "published": "2019-10-17",
        "citations": 0,
        "abstract": "Saat ini pengguna transportasi masih banyak sekali, kendaraan-kendaraan yang dibutuhkan guna untuk memenuhi kebutuhan sehari-hari tidak pernah kunjung habis, banyak perusahaan-perusahaan yang bersaing dalam bidang transportasi terutama pada bidang penjualan motor. Penelitian yang akan dilakukan adalah untuk mengetahui hasil peningkatan penjualan motor, membantu mempercepat proses pengoptimalan peningkatan penjualan dengan menggunakan algoritma Particle Swarm Optimization (PSO).   Kesimpulan dari penelitian ini adalah untuk mengetahui diskon dan uang muka yang akan digunakan dengan tujuan meningkatkan penjualan motor kedepan dan perkiraan besar total penjualan selama 12 bulan kedepan.\r\nKata kunci : PSO, optimalisasi, SPK, Metode",
        "link": "http://dx.doi.org/10.37676/jmi.v15i2.870"
    },
    {
        "id": 19597,
        "title": "Optimal Coordination of Over-current Relay Using Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Pankaj Kumar Choudhary, Dushmanta Kumar Das",
        "published": "2020-10-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aspcon49795.2020.9276703"
    },
    {
        "id": 19598,
        "title": "An Artificial Neural Network-Particle Swarm Optimization (Ann-Pso) Approach to Predict the Aeration Efficiency of Venturi Aeration System",
        "authors": "Anamika Yadav, Subha  M. Roy",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4328023"
    },
    {
        "id": 19599,
        "title": "N-PSO: endmember extraction using advance particle swarm optimization for NLMM",
        "authors": "Omprakash Tembhurne, Deepti Shrimankar",
        "published": "2018-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12046-018-0839-5"
    },
    {
        "id": 19600,
        "title": "EEA-PSO: Endmember extraction using advance particle swarm optimization",
        "authors": "Omprakash W. Tembhurne, Deepti Shrimankar",
        "published": "2018-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/rait.2018.8389067"
    },
    {
        "id": 19601,
        "title": "Predicting occurrence of liquefaction-induced lateral spreading using gradient boosting algorithms integrated with particle swarm optimization: PSO-XGBoost, PSO-LightGBM, and PSO-CatBoost",
        "authors": "Selçuk Demir, Emrehan Kutlug Sahin",
        "published": "2023-6",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11440-022-01777-1"
    },
    {
        "id": 19602,
        "title": "Application of fuzzy logic controller and PID optimization control strategy based on particle swarm optimization (PSO) for inventory management",
        "authors": "Hicham Sarir",
        "published": "2020-11-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/isaect50560.2020.9523666"
    },
    {
        "id": 19603,
        "title": "Milkfish Feed Optimization Using Adaptive Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Beryl Labique Ahmadie, Wanda Athira Luqyana, Wayan Firdaus Mahmudy, Rio Arifando",
        "published": "2019-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/siet48054.2019.8986094"
    },
    {
        "id": 19604,
        "title": "Global Optimization using Random Adaptive Backtracking Particle Swarm Optimization (RAB-PSO)",
        "authors": "Dennis M. Barrios II, Bobby D. Gerardo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.12.077"
    },
    {
        "id": 19605,
        "title": "An Enhanced Critically Self Correlated Particle Swarm Optimization (CSC-PSO) algorithm for efficient Resource Allocation in Cloud Computing",
        "authors": "Geetha R, V. Rajamani, V. Parthasarathy",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAs we move in the direction of the technology-driven world, cloud computing has become an inevitable paradigm in various communities. Typically, cloud users and providers' contradicting requirements like maximized performance with minimal cost and maximized revenue with increased resource utilization are of great importance. Likewise, there has been an extensive array of improvements achieved in the last few decades targeting minimal response time and cloud resources latency. However, there is still a need for cloud platforms' robustness addressing the peculiar parameter Quality of Service (QoS) which encompass a group of parameters resource availability, throughput, and security. This paper investigates the resource management between the cloud service providers and consumers, considering security as a primary concern. This paper proposes novel method of enhanced Critically Self Correlated Particle Swarm Optimization (CSC-PSO) algorithm for efficient performance of resource allocation in cloud services. The proposed algorithms' performance and Quality of Service properties are evaluated with extensive experiments using real-time datasets in a large-scale network prototyped system and is compared with the existing algorithms.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1366799/v1"
    },
    {
        "id": 19606,
        "title": "An Intelligent Network Intrusion Detection System Using Particle Swarm Optimization (PSO) and Deep Network Networks (DNN)",
        "authors": " Preethi D., Neelu Khare",
        "published": "2021-4",
        "citations": 5,
        "abstract": "Network intrusion detection system (NIDS) plays a major role in ensuring network security. In this paper, the authors propose a PSO-DNN-based intrusion detection system. The correlation-based feature selection (CFS) applied for feature selection with particle swarm optimization (PSO) as search method and deep neural networks (DNN) for classification of network intrusions. The Adam optimizer is applied for optimizing the learning rate, and softmax classifier is used for classification. The experimentations were duly conducted on the standard benchmark NSL-KDD dataset. The proposed model is validated using 10-fold cross-validation and evaluated using the performance metrics such as accuracy, precision, recall, and F1-score. Also, the results are also compared with DNN and CFS+DNN. The experimental results show that the proposed model performs better compared with other methods considered for comparison.",
        "link": "http://dx.doi.org/10.4018/ijsir.2021040104"
    },
    {
        "id": 19607,
        "title": "Energy management system of a microgrid using particle swarm optimization (PSO) and communication system",
        "authors": "",
        "published": "2020-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/pbpo160e_ch7"
    },
    {
        "id": 19608,
        "title": "A Tuning Method for PID Controller Parameters Based on Particle Swarm Optimization (PSO)",
        "authors": "Wanyuan Nie, Zhenyu Wu, Chao Luo, Shuyao Zhang",
        "published": "2020-11-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac51589.2020.9327536"
    },
    {
        "id": 19609,
        "title": "Traffic Light Controller Module Based on Particle Swarm Optimization (PSO)",
        "authors": "Emad Issa Abdul Kareem",
        "published": "2018",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11648/j.ajai.20180201.12"
    },
    {
        "id": 19610,
        "title": "QUAntum Particle Swarm Optimization: an auto-adaptive PSO for local and global optimization",
        "authors": "Arnaud Flori, Hamouche Oulhadj, Patrick Siarry",
        "published": "2022-6",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10589-022-00362-2"
    },
    {
        "id": 19611,
        "title": "System Control and Optimization in Wastewater Treatment: A Particle Swarm Optimization (PSO) Approach",
        "authors": "Xudong Ye, Bing Chen, Rune Storesund, Baiyu Zhang",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-824463-0.00027-6"
    },
    {
        "id": 19612,
        "title": "Optimal Load Distribution of Thermal Generating Units using Particle Swarm Optimization (PSO)",
        "authors": "",
        "published": "2019-9-5",
        "citations": 0,
        "abstract": "This paper shows load planning of two thermal generating units feeding a load of 200 MW using Particle swarm optimization (PSO). The PSO involves selection of population size or number of particle, fitness function. The advantages of PSO over conventional method are better and reliable solution, better convergence rate. Initially fitness function, population size corresponding to each variable are decided, thereafter PSO is used for finding most optimal solution of the generating units under different set of iteration. The performance of system using PSO is compared with conventional method in terms of the tolerance band.",
        "link": "http://dx.doi.org/10.35940/ijrte.b1081.0782s719"
    },
    {
        "id": 19613,
        "title": "Performance Comparison of PSO and Its New Variants in the Context of VLSI Global Routing",
        "authors": "Subhrapratim Nath, Jamuna Kanta Sing, Subir Kumar Sarkar",
        "published": "2018-5-30",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.72811"
    },
    {
        "id": 19614,
        "title": "Evaluación de la capacidad de diseño de filtro de capacidades conmutadas con Particle Swarm Optimization (PSO)",
        "authors": "Gonzalo Tomás Vodanovic, Eduardo Romero, Gabriela Peretti",
        "published": "2020-10-5",
        "citations": 0,
        "abstract": "En el presente trabajo, se analiza la capacidad del algoritmo Optimización por Enjambre de Partículas para diseñar filtros analógicos de capacidades conmutadas embebidos en una plataforma deseñales mixtas para una amplia variedad de especificaciones. Se utiliza la tasa de convergencia para medir el rendimiento del optimizador en estos distintos escenarios y se analizan las razones por la que esta métrica varía para distintas especificaciones de filtro. ",
        "link": "http://dx.doi.org/10.33414/ajea.5.765.2020"
    },
    {
        "id": 19615,
        "title": "OPTIMASI ALGORITMA C4.5 MENGGUNAKAN PARTICLE SWARM OPTIMIZATION (PSO) UNTUK KLASIFIKASI PENYEBAB PERCERAIAN",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.35891/explorit.v11i1.1472"
    },
    {
        "id": 19616,
        "title": "COMPARATIVE ANALYSIS OF 5 ALGORITHM BASED PARTICLE SWARM OPTIMIZATION (PSO) FOR PREDICTION OF GRADUATE TIME GRADUATION",
        "authors": "Achmad Noercholis Noercholis",
        "published": "2020-4-7",
        "citations": 2,
        "abstract": "<strong>Graduation information is very important for Higher Education involved in education. The data received by students each year is an important part as a source of information for making decisions on the Higher Education side in admitting new students. The results show the PSO-based K-NN Algorithm at k-optimum = 19 has the best performance of the 5 existing algorithms, with an Accuracy value = 74.08% and an Under Curve Area (AUC) value = 0.788. Attributes of Gender, Semester Achievment Index 1, 2, 4, 6 and 7 as well as Employment Status make a real contribution to the right graduation of students. The addition of the Particle Swarm Optimization (PSO) feature always increases the accuracy value, while the highest increase in accuracy value in the Decision Tree (C4.5) Algorithm is 5.21%, the lowest in the Vector Support Engine Algorithm of 1.79%. The K-Nearest Neighbor (k-NN) algorithm corresponds to the third order, it remains the algorithm that has the best value, the highest accuracy value, this is due to the questionable value before discussing the PSO features. For the evaluation phase, the results of the accuracy are much better if using the overall data training (Angaktan 2007-2011), both with the 2011 Force test data or the 2010-2011 Force. Timely graduation of students begins in the class of 2011, with a value of 98.18% (100% resolution), meaning students start graduating on time</strong>",
        "link": "http://dx.doi.org/10.18860/mat.v12i1.8216"
    },
    {
        "id": 19617,
        "title": "Particle Swarm Optimization (PSO) for Maximum Power Point Tracking",
        "authors": "Piyush Agrawal, Mohammed Asim, Mohd Tariq",
        "published": "2022-6-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icefeet51821.2022.9847759"
    },
    {
        "id": 19618,
        "title": "Structure of Particle Swarm Optimization (PSO)",
        "authors": "Mohammad Ehteram, Akram Seifi, Fatemeh Barzegari Banadkooki",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-9733-4_2"
    },
    {
        "id": 19619,
        "title": "METODE KLASIFIKASI BERBASIS  PARTICLE SWARM OPTIMIZATION (PSO) UNTUK PREDIKSI KELULUSAN TEPAT WAKTU MAHASISWA",
        "authors": "Moh. Zainuddin",
        "published": "2018-10-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32815/jitika.v13i1.247"
    },
    {
        "id": 19620,
        "title": "Penerapan Particle Swarm Optimization (PSO) untuk Klasifikasi dan Analisis Kredit dengan Menggunakan Algoritma C4.5",
        "authors": "Saprudin Saprudin",
        "published": "2017-12-25",
        "citations": 2,
        "abstract": "Teknik klasifikasi saat ini sudah banyak digunakan untuk mengatasi permasalahan yang terkait dengan penggolongan data.  Implementasi teknik klasifikasi ini dapat diterapkan pada berbagai bidang. Tujuan utama dari metode klasifikasi adalah proses penemuan model (fungsi)  yang menggambarkan dan membedakan  kelas data. Salah satu metode yang paling baik untuk klasifikasi adalah algoritma C4.5. Untuk itu penulis menggunakan metode klasifikasi C4.5; dan untuk dapat meningkatkan nilai akurasinya dioptimasi dengan PSO (Particle Swarm Optimization) dimana data uji yang digunakan adalah Data German Credit. Dari hasil percobaan yang dilakukan model algoritma C4.5 berbasis Particle Swarm Optimization (PSO) mendapatkan hasil terbaik yaitu 70%; sedangkan model algoritma C4.5 tanpa Particle Swarm Optimization ( PSO)   hanya 68;6%;  sehingga selisih untuk nilai akurasi sebesar 1;4%. Dapat disimpulkan bahwa penerapan teknik optimasi particle swarm optimization dapat meningkatkan nilai akurasi pada algoritma C4.5.",
        "link": "http://dx.doi.org/10.32493/informatika.v2i4.1488"
    },
    {
        "id": 19621,
        "title": "PCI-PSO: Preference-Based Component Identification Using Particle Swarm Optimization",
        "authors": "Seyed Mohammad Hossein Hasheminejad, Shabnam Gholamshahi",
        "published": "2019-9-25",
        "citations": 3,
        "abstract": "Abstract\nNowadays, component identification is one of the main challenges of software analysis and design. The component identification process aims at clustering classes into components and subcomponents. There are a number of methods to identify components in the literature; however, most of them cannot be customized to software architect’s preferences. To address this limitation, in this paper, we propose a preference-based method by the name of preference-based component identification using particle swarm optimization (PCI-PSO) to identify logical components. PCI-PSO provides a novel method to handle the software architect’s preferences using an interactive (i.e. human in the loop) search. PCI-PSO employs a customized PSO to automatically classify classes into suitable logical components and avoid the problem of identifying the proper number of components. We evaluated the effectiveness of PCI-PSO with four real-world cases. Results revealed that PCI-PSO has an ability to identify more cohesive and independent components with respect to the software architect’s preferences in comparison to the existing component identification methods.",
        "link": "http://dx.doi.org/10.1515/jisys-2017-0244"
    },
    {
        "id": 19622,
        "title": "LSTM-PSO: Long Short-Term Memory Ship Motion Prediction Based on Particle Swarm Optimization",
        "authors": "Yuxin Yao, Liang Han, Jiangyun Wang",
        "published": "2018-8",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gncc42960.2018.9018688"
    },
    {
        "id": 19623,
        "title": "PENEMPATAN LOKASI OPTIMAL STATIC VAR COMPENSATOR (SVC) UNTUK MINIMISASI RUGI DAYA MENGGUNAKAN METODE PARTICLE SWARM OPTIMIZATION (PSO)",
        "authors": "Defa Mulyana",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "Suatu sistem yang baik seharusnya memiliki nilai tegangan yang tidak melebihi batas toleransi dengan kerugian daya yang minimal. Kualitas tegangan sangat dipengaruhi oleh ketersediaan sumber daya reaktif pada sistem. Profil tegangan dan  rugi-rugi daya adalah dua parameter yang sangat perlu dijaga dalam sistem tenaga listrik (STL). Kompensasi daya reaktif adalah cara dalam mengatasi persoalan tegangan dan rugi-rugi daya dengan cara menginjeksi daya reaktif STL menggunakan device kontrol pada saluran tranmisi yang disebut dengan Flexible Alternating Current Tranmission System (FACTS) salah satunya Static VAR Compensator (SVC). SVC terdiri dari komponen Thyristor Controlled Reactor (TCR), Thyristor Switched Capasitor (TSC) dan Filter Capasitor (FC). Filter harmonisa terhubung paralel dengan TCR yang berfungsi untuk mengatasi harmonisa yang dihasilkan oleh TCR. Disamping itu, permasalahan penempatan kompensasi daya reaktif  yang optimal adalah menjadi perhatian pada makalah ini. Metode Particle Swarm Optimization (PSO) digunkan untuk mencari lokasi yang tepat. Analisa aliran daya menggunakan Electric Transient Analysis Progam (ETAP). Dengan menempatkan SVC pada Bus 17 mampu mengurangi rugi-rugi daya aktif dari 0,155 MW menjadi 0,140 MW turun sebesar 0,15 MW setara dengan 10 kW dan untuk rugi-rugi daya reaktif dari 0,107 MVAR menjadi 0,097 MVAR turun sebesar 0,1 MVAR setara dengan 10 kVAR.",
        "link": "http://dx.doi.org/10.26714/me.v13i2.6779"
    },
    {
        "id": 19624,
        "title": "Perancangan Algoritma Optimasi Menggunakan  Particle Swarm Optimization (PSO) Untuk Model Wind Turbine Farm",
        "authors": "Jawwad Sulthon Habiby, Aris Triwiyatno, Trias Andromeda",
        "published": "2021-11-23",
        "citations": 0,
        "abstract": "Di Indonesia dengan tuntutan energi listrik yang terus meningkat, produksi bahan bakar yang berupa batu bara dan minyak bumi mungkin akan mencapai batasnya dalam beberapa dasawarsa, disertai peningkatan sejumlah kasus cuaca ekstrim dan pemanasan global. Oleh karena itu, perlu dicari semacam solusi terhadap pemenuhan listrik dengan pemanfaatan energi alternative terbarukan yang cukup berpotensi di Indonesia. Salah satu energi alternatif terbarukan yang saat ini adalah penggunaan teknologi turbin angin dimana energi angin yang diperoleh bebas dari alam, akan diubah sedemikian rupa hingga menjadi energi listrik. Dalam tesis ini dipelajari tentang efek dari penggunaan turbin angin dengan jarak hub yang berbeda di sebuah wilayah produksi pembangkitan listrik tenaga angin, untuk mencari jarak dan jumlah turbin terbaik yang digunakan. Disajikan sebuah formulasi matematis dalam membangun sistem multi-turbin. Mengingat turbin angin dengan jarak dan jumlah turbin yang bervariasi maka model tersebut diselesaikan menggunakan metode Algoritma Particle Swarm Optimization (PSO). Dengan hasil konfigurasi turbin yang terbaik akan diperoleh biaya yang minimum dan  pembangkitan daya yang maksimum.",
        "link": "http://dx.doi.org/10.24269/jtm.v1i01.4123"
    },
    {
        "id": 19625,
        "title": "Optimized V-Shaped Beam Micro-Electrothermal Actuator Using Particle Swarm Optimization (PSO) Technique",
        "authors": "Salah Eldeen Osman, Musaab Zarog",
        "published": "2019-4-2",
        "citations": 6,
        "abstract": "Background:Electrothermal microactuators are very promising for wide range of Microelectromechanical Systems (MEMS) applications due to the low voltage requirement and large force produced.Method:A new optimized V-beam electrothermal micro actuator was implemented in variable optical attenuator. In this work, Particle Swarm Optimization (PSO) technique is proposed to design the Vshaped beam.Result:The approach has successfully improved both angular displacement & output force of the microactuator. Entropy generation rate was used as optimization criteria.",
        "link": "http://dx.doi.org/10.2174/1876402911666190208162346"
    },
    {
        "id": 19626,
        "title": "Optimal Power Flow for a Power System under Particle Swarm Optimization (PSO) based",
        "authors": "Vian Hasan, Firas Mohammed",
        "published": "2020-1-28",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2020919757"
    },
    {
        "id": 19627,
        "title": "Optimum suspension design for non-linear half vehicle model using particle swarm optimization (PSO) algorithm",
        "authors": "Ahmet Yildiz",
        "published": "2019-9-30",
        "citations": 8,
        "abstract": "This paper is considered with a non-linear suspension design for half vehicle model by using particle swarm optimization technique. To analyze the ride comfort, a five-degree of freedom system is built, and it is integrated with the Particle Swarm Optimization (PSO) for optimizing the vehicle vibrations. A multi-objective function is proposed as the sum of the minimum seat and vehicle body acceleration, the minimum suspension deflection and the constraints and the design variables of the optimization problem are selected as the spring and damping coefficients of the front and rear suspension and the non-linear spring and the linear damping coefficients of the seat. The simulations are carried out and the results are compared with the non-optimized values. It is demonstrated that the vehicle vibration is decreased significantly with the help of the optimum values of the suspension parameters.",
        "link": "http://dx.doi.org/10.21595/vp.2019.21012"
    },
    {
        "id": 19628,
        "title": "NDT-PSO, a New NDT based SLAM Approach using Particle Swarm Optimization",
        "authors": "Sara Bouraine, Abdelhak Bougouffa, Ouahiba Azouaoui",
        "published": "2020-12-13",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icarcv50220.2020.9305519"
    },
    {
        "id": 19629,
        "title": "Analisis Penerapan Optimasi Perbandingan Kinerja Algoritma C4.5 Dan Naïve Bayes Berbasis Particle Swarm Optimization (Pso) Untuk",
        "authors": "Taghfirul Azhima Yoga Siswa",
        "published": "2018-9-7",
        "citations": 0,
        "abstract": "Perlu dilakukan upaya pencegahan untuk meningkatkan kesadaran masyarakat dalam mengenali gejala dan risiko penyakit kanker payudara sehingga dapat menentukan langkah-langkah pencegahan dan deteksi dini yang tepat. Sejalan dengan hal itu data mining merupakan salah satu pemanfaatan teknologi informasi dalam bidang kesehatan yang banyak digunakan sebagai sistem pendukung keputusan klinis dalam memprediksi dan mendiagnosa berbagai penyakit dengan akurasi data yang sangat baik. Penelitian ini bertujuan mengevaluasi perbandingan penerapan optimasi kinerja terbaik metode klasifikasi data mining algoritma C4.5 dan Naïve Bayes berbasis Particle Swarm Optimization (PSO) untuk mendeteksi kanker payudara menggunakan pengukuran confusion matrix, AUC dan T-Test. Dataset kanker payudara yang digunakan berjumlah 699 record dengan 11 parameter indikator yang terdiri dari Code Number, Clump Thickness, Uniformity of Cell Size, Uniformity of Cell Shape, Marginal Adhesion, Single Epithelial Cell Size, Bare Nuclei, Bland Chromatin, Normal Nucleoli, Mitoses, dan Class yang diolah menggunakan software RapidMiner Versi 9. Hasil penelitian ini didapatkan bahwa optimasi Particle Swarm Optimization (PSO) dapat meningkatkan kinerja akurasi C4.5 dari 90,19% menjadi 94,29% dan Naïve Bayes 97,65% menjadi 97,96%. Hasil kinerja terbaik yang diuji menggunakan T-Test adalah algoritma Naïve Bayes (PSO) memiliki nilai tertinggi sebesar 0,980. Dengan demikian algoritma Naïve Bayes berbasis Particle Swarm Optimization (PSO) dapat memberikan solusi terbaik terhadap akurasi pendeteksian penyakit kanker payudara.",
        "link": "http://dx.doi.org/10.52771/bangkitindonesia.v7i2.48"
    },
    {
        "id": 19630,
        "title": "PENEMPATAN LOKASI OPTIMAL STATIC VAR COMPENSATOR (SVC) UNTUK MINIMISASI RUGI DAYA MENGGUNAKAN METODE PARTICLE SWARM OPTIMIZATION (PSO)",
        "authors": "Defa Mulyana",
        "published": "2020-12-31",
        "citations": 0,
        "abstract": "Suatu sistem yang baik seharusnya memiliki nilai tegangan yang tidak melebihi batas toleransi dengan kerugian daya yang minimal. Kualitas tegangan sangat dipengaruhi oleh ketersediaan sumber daya reaktif pada sistem. Profil tegangan dan  rugi-rugi daya adalah dua parameter yang sangat perlu dijaga dalam sistem tenaga listrik (STL). Kompensasi daya reaktif adalah cara dalam mengatasi persoalan tegangan dan rugi-rugi daya dengan cara menginjeksi daya reaktif STL menggunakan device kontrol pada saluran tranmisi yang disebut dengan Flexible Alternating Current Tranmission System (FACTS) salah satunya Static VAR Compensator (SVC). SVC terdiri dari komponen Thyristor Controlled Reactor (TCR), Thyristor Switched Capasitor (TSC) dan Filter Capasitor (FC). Filter harmonisa terhubung paralel dengan TCR yang berfungsi untuk mengatasi harmonisa yang dihasilkan oleh TCR. Disamping itu, permasalahan penempatan kompensasi daya reaktif  yang optimal adalah menjadi perhatian pada makalah ini. Metode Particle Swarm Optimization (PSO) digunkan untuk mencari lokasi yang tepat. Analisa aliran daya menggunakan Electric Transient Analysis Progam (ETAP). Dengan menempatkan SVC pada Bus 17 mampu mengurangi rugi-rugi daya aktif dari 0,155 MW menjadi 0,140 MW turun sebesar 0,15 MW setara dengan 10 kW dan untuk rugi-rugi daya reaktif dari 0,107 MVAR menjadi 0,097 MVAR turun sebesar 0,1 MVAR setara dengan 10 kVAR.",
        "link": "http://dx.doi.org/10.26714/me.13.2.2020.100-110"
    },
    {
        "id": 19631,
        "title": "Particle Swarm Optimization Solution for Power System Operation Problems",
        "authors": "Mostafa Kheshti, Lei Ding",
        "published": "2018-5-30",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.72409"
    },
    {
        "id": 19632,
        "title": "Particle Swarm Optimization (PSO) Inspired Grey Wolf Optimization (GWO) Algorithm",
        "authors": "ogendra Singh Kushwah,  , R.K. Shri vastava",
        "published": "2018-6-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22315373/ijmtt-v58p520"
    },
    {
        "id": 19633,
        "title": "Analisis Sentimen Pemilu 2024 dengan Naive Bayes Berbasis Particle Swarm Optimization (PSO)",
        "authors": "Tommy Dwi Putra, Ema Utami, Mei P Kurniawan",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "Pemilu merupakan sarana kedaulatan masyarakat untuk memilih anggota DewanPerwakilan Rakyat, anggota Dewan Perwakilan Daerah, Presiden dan Wakil Presiden, dan pemilihananggota Dewan Perwakilan Rakyat Daerah, dilakukan secara langsung. Pada penelitian ini penulismenggunakan metode Naïve Bayes (NB) berbasis Particle Swarm Optimization (PSO) dalammenganalisa label sentimen positif, negatif dan netral pada postingan para pengguna media sosialTwitter yang berkaitan dengan pemilu 2024. Jumlah dataset setelah pemrosesan menjadi 1.000 data.Tahap evaluasi menggunakan Confusion matrix diperoleh nilai akurasi algoritma yaitu untuk NaïveBayes tanpa Particle Swarm Optimization (PSO) nilai akurasi sebesar 73,67%. Sedangkan untukalgoritma Naïve Bayes berbabis Particle Swarm Optimization (PSO) nilai akurasi sebesar 78,33%.Dapat diketahui bahwa tingkat akurasi dari algoritma Naïve Bayes berbabis Particle SwarmOptimization (PSO) lebih unggul dibandingkan algoritma Naïve Bayes tanpa Particle SwarmOptimization (PSO).",
        "link": "http://dx.doi.org/10.35200/ex.v11i2.13"
    },
    {
        "id": 19634,
        "title": "Analisis Sentimen Review Produk Skincare Dengan Naïve Bayes Classifier Berbasis Particle Swarm Optimization (PSO)",
        "authors": "Tri Astuti, Yuli Astuti",
        "published": "2022-10-25",
        "citations": 0,
        "abstract": "Skin care products have become the main needs of all people who are the targets of various brands of skin care products. However, not all skin care products have good quality according to consumer needs. They look for products that have the best quality by looking at reviews from other people, so they have an idea that influences their interest from other people's reviews submitted through various marketplace platforms or social media regarding the results after using these skin care products. Sentiment analysis is one way to analyze and classify reviews into positive opinions and negative opinions regarding the product in question to look for product quality based on public views. The algorithm used in this research is the Naive Bayes Classifier. The Naive Bayes Classifier method was chosen for reasons of ease of implementation, fast and high accuracy. The Naïve Bayes method also has a disadvantage, namely it is sensitive to feature selection, which results in low classification accuracy. Therefore, in this study, the feature selection method, namely Particle Swarm Optimization, was used in order to increase the accuracy of the Naïve Bayes classifier. The dataset used is 800 data reviews and tested using 10-Fold Cross Validation. The results showed an increase in accuracy from 77.96% to 79.85%.",
        "link": "http://dx.doi.org/10.30865/mib.v6i4.4119"
    },
    {
        "id": 19635,
        "title": "Optimasi K-Means Dengan Particle Swarm Optimization (PSO) Dalam Penentuan Titik Awal Pusat Klaster Data Telekomunikasi",
        "authors": "Raden Gesit Prasasti Alam, Yan Everhard",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "Berkembangnya kebutuhan masyarakat terhadap layanan telekomunikasi telah mengakibatkan persaingan yang semakin sengit di antara perusahaan-perusahaan di industri tersebut. Oleh karena itu, perusahaan-perusahaan ini dituntut untuk mencari strategi promosi guna meningkatkan penjualan produk mereka. SiDompul adalah aplikasi yang dikembangkan XL Axiata untuk membantu RO (Retail Outlet) dalam melakukan penjualan paket data XL Axiata. Di tahun 2022 terjadinya penurunan penjualan paket data XL Axiata dilihat dari transaksi penjualan Retail Outlet melalui aplikasi SiDompul mengalami penurunan 37% dan targetnya tidak tercapai. Penelitian ini bertujuan untuk membentuk dan menguji pemodelan klasterisasi dari data transaksi penjualan dengan metode K-Means dan metode Particle Swarm Optimization (PSO). PSO untuk optimasi penentuan pusat klaster atau centroid. Pada penelitian ini, Algoritma K-Means dan PSO terbukti dapat membentuk 2 klaster yang lebih baik dimana nilai quantization errornya dan nilai SSE lebih rendah yaitu quantization 2.920 dan SSE 17.255 sedangkan pada K-Means quantization 2.939 dan SSE 17.288. ",
        "link": "http://dx.doi.org/10.62411/tc.v23i1.9743"
    },
    {
        "id": 19636,
        "title": "Random Number Generator Based On Hybrid Algorithm Between Particle Swarm Optimization (PSO) Algorithm And 3D-Chaotic System And Its Application",
        "authors": "Rajaa Ahmed Ali",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.34279/0923-008-003-005"
    },
    {
        "id": 19637,
        "title": "Development of Forked Divergence Particle Swarm Optimization",
        "authors": "So FUKUHARA, Masao ARAKAWA",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1299/jsmeoptis.2022.14.u00019"
    },
    {
        "id": 19638,
        "title": "Design Feature Selection and Classifiers for Hybrid Feature Selection - Particle Swarm Optimization (HFS-PSO)",
        "authors": "Kumar U Siddamallappa, Nisarg Gandhewar",
        "published": "2022-9-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icirca54612.2022.9985472"
    },
    {
        "id": 19639,
        "title": "PSO-PS:Parameter Synchronization with Particle Swarm Optimization for Distributed Training of Deep Neural Networks",
        "authors": "Qing Ye, Yuxuan Han, Yanan Sun, Jiancheng Lv",
        "published": "2020-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207698"
    },
    {
        "id": 19640,
        "title": "Particle Swarm Optimization with Reducing Boundaries (PSO-RB) for Maximum Power Point Tracking of Partially Shaded PV Arrays",
        "authors": "Alfredo S Beltran, Sandip Das",
        "published": "2020-6-14",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/pvsc45281.2020.9300516"
    },
    {
        "id": 19641,
        "title": "SOLITON WAVE GENERATION ON NONLINEAR TRANSMISSION LINES USING A PARTICLE SWARM OPTIMIZATION (PSO) ALGORITHM",
        "authors": "Abdullah AKSOY, Sibel YENİKAYA",
        "published": "2022-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17482/uumfd.1066491"
    },
    {
        "id": 19642,
        "title": "Optimasi Waktu dan Biaya (Time Cost Trade Off - TCTO) Menggunakan Particle Swarm Optimization (PSO)",
        "authors": "Mohammad Khabibulloh, Tri Joko Wahyu Adi",
        "published": "2022-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12962/j23373539.v11i3.96419"
    },
    {
        "id": 19643,
        "title": "An Embellished Particle Swarm Optimization Technique in VANET for Finding Optimal Route (E-PSO)",
        "authors": "S. Chithra Devi, D. Maheswari",
        "published": "2022-12-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s42979-022-01508-z"
    },
    {
        "id": 19644,
        "title": "Multi response optimization of thrust force and delamination in carbon fiber reinforced polymer (CFRP) drilling using backpropagation neural network-particle swarm optimization (BPNN-PSO)",
        "authors": "R. Norcahyo, B. O. P. Soepangkat,  Sutikno",
        "published": "2018",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5046263"
    },
    {
        "id": 19645,
        "title": "PSO + FL = PAASO: particle swarm optimization + federated learning = privacy-aware agent swarm optimization",
        "authors": "Vicenç Torra, Edgar Galván, Guillermo Navarro-Arribas",
        "published": "2022-12",
        "citations": 6,
        "abstract": "AbstractIn this paper, we present an unified framework that encompasses both particle swarm optimization (PSO) and federated learning (FL). This unified framework shows that we can understand both PSO and FL in terms of a function to be optimized by a set of agents but in which agents have different privacy requirements. PSO is the most relaxed case, and FL considers slightly stronger constraints. Even stronger privacy requirements can be considered which will lead to still stronger privacy-preserving solutions. Differentially private solutions as well as local differential privacy/reidentification privacy for agents opinions are the additional privacy models to be considered. In this paper, we discuss this framework and the different privacy-related alternatives. We present experiments that show how the additional privacy requirements degrade the results of the system. To that end, we consider optimization problems compatible with both PSO and FL.",
        "link": "http://dx.doi.org/10.1007/s10207-022-00614-6"
    },
    {
        "id": 19646,
        "title": "GA=PSO: Realizing Equivalent Particle Swarm Optimization by Genetic Algorithm",
        "authors": "Ruoyu Zhu, Zhonglong Zheng, Hua Wang, Xiangmin Zhou, Dong Liu, Lin Sun",
        "published": "2023-5-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaci58115.2023.10146140"
    },
    {
        "id": 19647,
        "title": "Optimization of warpage on plastic part by using particle swarm optimization (PSO) method",
        "authors": "M. H. N. Hidayah, Z. Shayfull, N. Z. Noriman, S. M. Sazli, R. Norshahira, A. T. N. A. Miza",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5066791"
    },
    {
        "id": 19648,
        "title": "A Single Phase of Modified Multilevel Inverter using Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Rosli Omar,  Nizam, Mohammed Rasheed, Marizan Sulaiman",
        "published": "2019-6",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/i2cacis.2019.8825092"
    },
    {
        "id": 19649,
        "title": "Optimizing Neural Networks Using Particle Swarm Optimization (PSO) Algorithm for Hypertension Disease Prediction",
        "authors": "Sudriyanto Sudriyanto",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "Penyakit hipertensi atau tekanan darah tinggi merupakan masalah kesehatan yang signifikan secara global. Prediksi yang akurat tentang risiko hipertensi dapat membantu dalam pencegahan, diagnosa, dan pengobatan dini. Dalam penelitian ini, kami mengusulkan penggunaan algoritma Particle Swarm Optimization (PSO) untuk mengoptimalkan jaringan saraf dalam prediksi penyakit hipertensi. Metode ini menggabungkan keunggulan jaringan saraf dalam pemodelan yang kompleks dengan kemampuan PSO dalam mencari solusi optimal. Proses optimisasi dilakukan dengan mengatur bobot dan biases dalam jaringan saraf menggunakan PSO. Kami menggunakan dataset yang telah dipersiapkan dengan fitur-fitur yang relevan untuk prediksi hipertensi. Performa jaringan saraf sebelum dan sesudah optimisasi dievaluasi menggunakan metrik evaluasi seperti Root Mean Squared Error (RMSE) dan Squared Error. Neural Network plus Particle Swarm Optimization (NN + PSO) menghasilkan nilai Root Mean Square Error (RMSE) yang lebih rendah (0.170) dibandingkan dengan metode Neural Network (NN) tanpa Particle Swarm Optimization (0.197). Selain itu, metode NN berbasis PSO juga menghasilkan squared error yang lebih rendah (0.029) dibandingkan dengan NN (0.039). Hasil eksperimen menunjukkan bahwa penggunaan algoritma PSO meningkatkan performa neural network dalam prediksi hipertensi. Terdapat penurunan yang signifikan dalam nilai RMSE dan squared error setelah mengoptimalkan neural network menggunakan PSO. Hal ini menunjukkan bahwa prediksi yang dihasilkan lebih dekat dengan nilai sebenarnya, dan tingkat akurasi prediksi meningkat.",
        "link": "http://dx.doi.org/10.33650/jeecom.v5i2.6759"
    },
    {
        "id": 19650,
        "title": "Intelligent Electrical Engineering Automation on Account of Particle Swarm Optimization (PSO) Algorithm",
        "authors": "Zhiwei Li",
        "published": "2022-10-1",
        "citations": 1,
        "abstract": "Abstract\nElectrical engineering is closely related to people’s life. Many projects have proved that electrical engineering using PSO algorithm provides more convenient applications for people’s production and life, greatly improves people’s living standards, and makes people’s life and work more relaxed and valid. In many production fields, such as subway engineering, if advanced electrical engineering automation is adopted, the subway engineering can be carried out validly from start to finish, and the workload of workers can be greatly reduced. PSO algorithm further improves the automation performance of electrical engineering, and effectively breaks through the traditional electrical engineering operation mode, improve the operation efficiency. This text studies the concept and work flow of PSO algorithm, introduces the intelligent working principle and internal mechanism of electrical engineering. Data analysis, intelligent electrical engineering automation on account of PSO algorithm effectively improve the intelligent effect of electrical engineering automation.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2355/1/012013"
    },
    {
        "id": 19651,
        "title": "PEMODELAN SUMBER TEKANAN GUNUNG SINABUNG MENGGUNAKAN SKEMA INVERSI PARTICLE SWARM OPTIMIZATION (PSO)",
        "authors": "Ratih Kumalasari, Wahyu Srigutomo, Irwan Meilano, Hendra Gunawan",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Gunung Sinabung merupakan salah satu gunung aktif diindonesia yang masuk dalam gunungapi tipe A setelah erupsi pertama kali pada tahun 2010 setelah sebelumnya tidak ada aktivitas erupsi. Gunung sinabung terus erupsi hingga saat ini yang mejadikan Gunung Sinabung perlu diamati lebih lanjut terkait aktivitas yang terjadi serta dilakukan pemodelan untuk memprediksi kondisi bawah permukaan yang dapat membantu proses analisis. Pemodelan terhadap data permukaan Gunung Sinabung yang berasal dari data pergeseran permukaan dari GPS pada tahun 2015-2016 telah dimodelkan dengan skema inversi particle swarn optimization (PSO). Erupsi yang terus menerus pada tahun tersbut menghasilkan data yang sangat fluktuatif dengan hasil inversi menunjukan bahwa sumber tekanan pada tekanan pada Gunung Sinabung terletak pada kedalaman dangkal yaitu 0,5km hingga 1,0 km dibawah permukaan laut dibawah Gunung Sinabung, dengan sumber tekanan yang dangkal serta adanya inflasi pada tubuh gunung api maka memungkinkan adanya erupsi secara kontiyu dalam waktu yang singkat ",
        "link": "http://dx.doi.org/10.22437/jop.v8i3.27099"
    },
    {
        "id": 19652,
        "title": "An improved dynamic weighted particle swarm optimization (IDW-PSO) for continuous optimization problem",
        "authors": "Ashish Kumar Singh, Anoj Kumar",
        "published": "2023-1-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s13198-023-01868-6"
    },
    {
        "id": 19653,
        "title": "Desain Hibrid Menggunakan PID-ANFIS  Controller Pada Motor DC Berbasis PSO (Particle Swarm Optimization)",
        "authors": "Machrus Ali, Ahmad Ali Syaifudin, Hidayatul Nurohmah",
        "published": "2021-9-20",
        "citations": 0,
        "abstract": "DC motors can be used as generators or motors. For this reason, it is necessary to design the best DC motor speed regulation in order to obtain the best optimization. DC motor setting modeling must be adjusted to the DC motor characteristics and setting model. The results of the performance of the DC control model have a different steady-state error, settling time, and overshoot. From the results of running the program, it is found that the PID-PSO-ANFIS hybrid control model produces the best output performance. The results of PID-PSO-ANFIS optimization show that there is no overshot and undershot, settling time is 0.04 seconds, the motor speed reaches a constant and stable state. This design will be developed using artificial intelligence methods and other controllers in order to obtain the best optimization.",
        "link": "http://dx.doi.org/10.30736/je-unisla.v6i2.707"
    },
    {
        "id": 19654,
        "title": "Optimization of Controller Parameters for the Proposed DCALS Using Particle Swarm Optimization (PSO) Technique",
        "authors": "",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "GA is a well-established algorithm with many versions and many applications. PSO is a relatively recent heuristic search method whose mechanics are inspired by the swarming or collaborative behavior of biological populations. PSO is similar to the GA in the sense that these two evolutionary heuristics are population-based search methods. In other words, PSO and the GA move from a set of points (population) to another set of points in a single iteration with likely improvement using a combination of deterministic and probabilistic rules.",
        "link": "http://dx.doi.org/10.4018/978-1-6684-7388-7.ch010"
    },
    {
        "id": 19655,
        "title": "Validation of Hybridized Particle Swarm Optimization (PSO) Algorithm with the Pheromone Mechanism of Ant Colony Optimization (ACO) using Standard Benchmark Function",
        "authors": "Mogaji Stephen, Alese Boniface, Adetunmbi Adebayo",
        "published": "2018-12-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/cae2018652799"
    },
    {
        "id": 19656,
        "title": "Optimization of shrinkage on thick plate plastic part by using particle swarm optimization (PSO)",
        "authors": "R. Norshahira, Z. Shayfull, R. Hamzah, S. M. Sazli Saad, M. H. N. Hidayah, A. T. N. A. Miza",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5066789"
    },
    {
        "id": 19657,
        "title": "Defected Ground Structure (DGS) Optimization of Microstrip Antenna Using Particle Swarm Optimization (PSO) for Gain Enhancement",
        "authors": "A'isya Nur AuliaYusuf, Prima Dewi Purnamasari, Fitri Yuli Zulkifli",
        "published": "2022-12-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitisee57756.2022.10057925"
    },
    {
        "id": 19658,
        "title": "Quadcopter Vehicle Proportional-Integral-Derivative Controller (PIDC) Tuning by Particle-Swarm Optimization (PSO)",
        "authors": "Abdullah Al Gizi",
        "published": "2022-7-12",
        "citations": 0,
        "abstract": "Inspection of the faults and damages in high voltage transmission lines is not only unsafe and costly but also a very time-consuming process. In addition, it demands highly skilled manpower for the operation at tens of meters above the ground on cables carrying thousands of Volts. Meanwhile, the Quadcopter Aerial Vehicle (QAV) system became a popular alternative for aerial photography applications due to its low cost, ease of usage, and fast response wherein the proportional-integral-derivative controller (PIDC) is used. The PID controller compares the expected location of the drone with the actual measured position thereby can accurately detect the faults in the transmission lines. Based on these factors, in this study, the flight simulation is done according to the desired flight path, and drone imagery is used for (insulator, power line, and porcelain) flaw identification. Furthermore, three movements (roll, pitch, and yaw) of the quadcopter were controlled by different PIDC that were optimized using the particle swarm optimization (PSO). The MATLAB/Simulink application was used to develop the system and simulate the results (R2021b). This clearly suggested that the quadcopter continues to fly on a trajectory with minimum inaccuracy, wherein the PIDC operated as a closed-loop adaptive controller. Finally, the PSO-PIDC outperformed the PIDC due to the critical nature of manual gain modification for quadcopter flight stability.",
        "link": "http://dx.doi.org/10.4108/eetct.v9i31.1922"
    },
    {
        "id": 19659,
        "title": "Improved Support Vector Machine (SVM) Performance on Go-Jek Service Review Classification Using Particle Swarm Optimization (PSO)",
        "authors": "Windha Mega P.D.,  Haryoko",
        "published": "2022-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icimcis56303.2022.10017911"
    },
    {
        "id": 19660,
        "title": "A hybrid genetic algorithm (GA)–particle swarm optimization (PSO) algorithm for demand side management in smart grid considering wind power for cost optimization",
        "authors": "Chitrangada Roy, Dushmanta Kumar Das",
        "published": "2021-6",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12046-021-01626-z"
    },
    {
        "id": 19661,
        "title": "Exergoeconomic analysis for a thermoelectric generator using mutation particle swarm optimization (M-PSO)",
        "authors": "Xi Wang, Paul Henshaw, David S.-K. Ting",
        "published": "2021-7",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.apenergy.2021.116952"
    },
    {
        "id": 19662,
        "title": "OPTIMASI PENGGUNAAN SISTEM PENGEREMAN REGENERATIF  DAN PNEUMATIC PADA KERETA REL LISTRIK JABODETABEK MENGGUNAKAN METODE PARTICLE SWARM OPTIMIZATION (PSO)",
        "authors": "Hanan Hadi Sasmita, Agung Nugroho, Tejo Sukmadi",
        "published": "2018-8-13",
        "citations": 0,
        "abstract": "Sebagai alat transportasi yang dapat menampung penumpang lebih banyak, Kereta Rel Listrik (KRL) harus memilki sistem kerja yang baik guna menunjang kebutuhan akan sarana transportasi massal di Indonesia. Salah satu faktor yang dapat menyebabkan kurang baiknya sistem kerja KRL adalah kurang optimal dalam penggunaan sistem pengereman pada KRL. Sistem pengereman pada KRL menggunakan gabungan dari pengereman elektrik (pengereman regeneratif) dan pengereman mekanik (pengereman pneumatic). Penggunaan dapat disimpulkan lebih baik jika waktu dan jarak tempuh yang dibutuhkan kereta sesuai standar dan dapat menghemat konsumsi energi karena penggunaan regenerative braking. Penelitian ini dilakukan dengan tujuan untuk menentukan kapan penggunaan regenerative braking dan pneumatic braking yang optimal pada KRL Jabodetabek sehingga kereta dapat bekerja dengan baik dan dapat menghemat konsumsi energi. Metode yang digunakan untuk optimasi penggunaan sistem pengereman ini adalah Particle Swarm Optimization (PSO) dengan bantuan Software Matlab R2016a. Hasil penelitian yang diperoleh yaitu bahwa penggunaan sistem pengereman yang optimal adalah dengan melakukan pengereman regeneratif terlebih dahulu saat kecepatan kereta 70 km/jam selama 17,3611 detik sejauh 217,0139 m. Kemudian melakukan pengereman pneumatic selama 6,9444 detik sejauh 19,2901 meter. Sehingga akan menghasilkan arus sebesar 372,5637 A dan energi yang dihemat untuk powering KRL sebesar 1,7778 kWh dengan daya sebesar 368,6508 kW.",
        "link": "http://dx.doi.org/10.14710/transient.7.1.284-293"
    },
    {
        "id": 19663,
        "title": "Mining high utility itemsets using Genetic Algorithm Based-Particle Swarm Optimization (GA-PSO)",
        "authors": "Kannimuthu Subramanian, Premalatha Kandhasamy",
        "published": "2023-1-5",
        "citations": 1,
        "abstract": "Mining high utility itemsets (HUIs) from transaction databases is one of the current research areas in the data mining field. HUI mining finds itemsets whose utility meets a predefined threshold. It enables users to quantify the usefulness or preferences of products by utilizing different values. Since utility mining approaches do not satisfy the downward closure property, the cost of candidate generation for HUI mining in terms of time and memory space is excessive. This paper presents Genetic Algorithm based Particle Swarm Optimization (GA-PSO), which can efficiently prune down the number of candidates and optimally acquire the complete set of high utility itemsets. The proposed algorithm’s performance is assessed using the synthetic dataset T20.I6.D100K and the real-time supermarket dataset, which comprises 38765 transactions and 167 unique products. It performs very effectively in terms of time and memory on large databases constituted of small transactions, which are challenging for existing high utility itemsets mining algorithms to manage. Experiments on real-world applications show the importance of high utility itemsets in business decisions, as well as the distinction between frequent and high utility itemsets.",
        "link": "http://dx.doi.org/10.3233/jifs-220871"
    },
    {
        "id": 19664,
        "title": "Implementasi Particle Swarm Optimization (PSO) pada Analysis Sentiment Review Aplikasi Trafi menggunakan Algoritma Naive Bayes (NB)",
        "authors": "Eka Rini Yulia, Kusmayanti - Solecha",
        "published": "2021-2-3",
        "citations": 1,
        "abstract": "Abstract - The development of transportation applications is now getting bigger so that many vendors compete for business in creating transportation mode applications, starting from the quality and quantity so that it is often questioned. With this, the researcher held a transportation application called Trafi to get opinions or comments on applications from people who had used the application and poured it into online media. Of the many comments reviewed to obtain a set of positive and negative forms of data from the text that the researcher will process. For classification data using Naïve Bayes (NB), NB is one of the most popular algorithms for pattern recognition. Apart from simplicity, the Naive Bayes classifier is a popular machine learning technique for text classification, Particle Swarm Optimization (PSO) which combines with the Naive Bayes classification to improve performance. Before use, optimization with PSO in the data set accuracy obtained was 69.50% and after the combination of Naive Bayes and PSO accuracy was 72.34%. Use PSO and Naïve Bayes according to the concept of text mining which aims to find patterns that exist in text, the activity carried out by text mining here is text classification.Abstract - The development of transportation applications is now getting bigger so that many vendors compete for business in creating transportation mode applications, starting from the quality and quantity so that it is often questioned. With this, the researcher held a transportation application called Trafi to get opinions or comments on applications from people who had used the application and poured it into online media. Of the many comments reviewed to obtain a set of positive and negative forms of data from the text that the researcher will process. For classification data using Naïve Bayes (NB), NB is one of the most popular algorithms for pattern recognition. Apart from simplicity, the Naive Bayes classifier is a popular machine learning technique for text classification, Particle Swarm Optimization (PSO) which combines with the Naive Bayes classification to improve performance. Before use, optimization with PSO in the data set accuracy obtained was 69.50% and after the combination of Naive Bayes and PSO accuracy was 72.34%. Use PSO and Naïve Bayes according to the concept of text mining which aims to find patterns that exist in text, the activity carried out by text mining here is text classification.Keywords: Sentiment Analysis, Android Appstore Product Review, Naive Bayes Algorithm",
        "link": "http://dx.doi.org/10.31294/jtk.v7i1.9078"
    },
    {
        "id": 19665,
        "title": "PSO-CALBA: Particle Swarm Optimization Based Content-Aware Load Balancing Algorithm in Cloud Computing Environment",
        "authors": "Muhammad Adil, Said Nabi, Summair Raza",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31577/cai_2022_5_1157"
    },
    {
        "id": 19666,
        "title": "Investigation of river water pollution using Muskingum method and particle swarm optimization (PSO) algorithm",
        "authors": "Hadi Norouzi, Jalal Bazargan",
        "published": "2024-4",
        "citations": 0,
        "abstract": "AbstractRiver water pollution is one of the most important environmental issues. Advection–dispersion equations are used to study the temporal changes in pollutant concentration along the study river reach. The use of advection–dispersion equations in investigating how the concentration of pollution is transformed requires a lot of data including river cross-section characteristics, dispersion coefficient, and upstream and downstream boundary conditions, etc. therefore, the corresponding calculations are very costly, difficult and time-consuming. In the present study, instead of using the mentioned equations, the linear Muskingum method (used in previous studies for flood routing) and the particle swarm optimization (PSO) algorithm was used for the first time to calculate the temporal changes in pollution concentration at different stream locations. The presented solution in the presented study is very accurate and only requires the temporal changes in concentration in the upstream and downstream of the study river reach and for this reason, it is very low-cost and easy to use and requires less time to collect data and perform calculations. In the proposed method, the parameters (X, K, ∆t) of the linear Muskingum method were optimized using the PSO algorithm, and by dividing the temporal changes in the input concentration into three areas of the beginning (the input concentration is greater than the output concentration), the peak (the maximum input and output concentrations) and the end (the output concentration is greater than the input concentration) areas, the accuracy of the calculations increased. The mentioned method was studied for different lengths (first case of x = 50 m (up) and x = 75 m (down), second case of x = 50 m (up) and x = 100 m (down), third case of x = 75 m (up) and x = 100 m (down)) and the mean relative error (MRE) of the total, peak area and the relative error of the maximum concentration using constant parameters for the first case were calculated as 7.08, 1.02, and 2.34 percent, for the second case as 7.41, 11.06 and 6.69 percent, and for the third case as 6.75, 3.59 and 5.42 percent, respectively. If three parameters of (X, K, ∆t) are used, the mentioned values improved by 31.3, 63.7 and 65.5 percent, respectively compared to the case of using constant parameters.",
        "link": "http://dx.doi.org/10.1007/s13201-024-02127-0"
    },
    {
        "id": 19667,
        "title": "Multiobjective Optimal Power Flow (MO-OPF) using Hybrid Harris Hawk-Particle Swarm Optimization Algorithm Hy(HHO-PSO)",
        "authors": "Rafae Ashfaq, Intisar Ali Sajjad",
        "published": "2023-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icece58062.2023.10092489"
    },
    {
        "id": 19668,
        "title": "Flood routing by linear Muskingum method using two basic floods data using particle swarm optimization (PSO) algorithm",
        "authors": "Hadi Norouzi, Jalal Bazargan",
        "published": "2020-8-1",
        "citations": 20,
        "abstract": "Abstract\nThe Muskingum method is one of hydrological approaches that has been used for flood routing for many years thanks to its simplicity and reasonable accuracy over other methods. In engineering works, the calculation of the Peak section of a flood hydrograph is crucially important. In the present study, using the particle swarm optimization (PSO) algorithm, instead of using a single basic flood, the parameters of the linear Muskingum method (X, K, Δt) are calculated by computed arithmetic and geometric means relevant to two basic floods in the form of eight different models for calculating the downstream hydrograph. The results indicate that if the numerical values of the calculated flood inflow are placed in the interval of the inflow and the basic flood which the parameters X, K, Δt are from, the computation accuracy in approximating the outflow flood related to the peak section of the inflow hydrograph increases for all the mentioned models. In other words, if the arithmetic mean of X, K and the geometric mean of Δt, relevant to the two basic floods, are used instead of using values of X, K, Δt of a single basic flood, the computational accuracy in estimating the flood peak section of the hydrograph in downstream has the highest increase among all the eight models. Thus, the Mean Relative Error (MRE) relevant to the peak section of the inflow hydrograph of the third flood (observational flood) obtained by the first and second basic floods was equal to 4.89% and 2.91%, respectively, while in case of using the arithmetic mean of X and K and the geometric mean of Δt, related to the first and second basic floods (the best models presented in this study), this value is equal to 1.66%.",
        "link": "http://dx.doi.org/10.2166/ws.2020.099"
    },
    {
        "id": 19669,
        "title": "Particle Swarm Optimization (PSO) Tuning of PID Control on DC Motor",
        "authors": "Eka Suci Rahayu, Alfian Ma'arif, Abdullah Çakan",
        "published": "2022-7-6",
        "citations": 14,
        "abstract": "The use of DC motors is now common because of its advantages and has become an important necessity in helping human activities. Generally, motor control is designed with PID control. The main problem that is often discussed in PID is parameter tuning, namely determining the value of the Kp, Ki, and Kd parameters in order to obtain optimal system performance. In this study, one method for tuning PID parameters on a DC motor will be used, namely the Particle Swarm Optimization (PSO) method. Parameter optimization using the PSO method has stable results compared to other methods. The results of tuning the PID controller parameters using the PSO method on the MATLAB Simulink obtained optimal results where the value of Kp = 8.9099, K = 2.1469, and Kd = 0.31952 with the value of rise time of 0.0740, settling time of 0.1361 and overshoot of 0. Then the results of hardware testing by entering the PID value in the Arduino IDE software produce a stable motor speed response where Kp = 1.4551, Ki= 1.3079, and Kd = 0.80271 with a rise time value of 4.3296, settling time of 7.3333 and overshoot of 1.",
        "link": "http://dx.doi.org/10.31763/ijrcs.v2i2.476"
    },
    {
        "id": 19670,
        "title": "Stochastic Greedy-Based Particle Swarm Optimization for Workflow Application in Grid",
        "authors": "Ruey-Maw Chen, Yin-Mou Shen",
        "published": "2018-5-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.73587"
    }
]