[
    {
        "id": 17371,
        "title": "Few-Shot Learning",
        "authors": "",
        "published": "2020-1-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781139061773.015"
    },
    {
        "id": 17372,
        "title": "Exploring Few-Shot Learning Approaches for Bioinformatics Advancements",
        "authors": "Neha Bhati, Ronak Duggar, Abdullah Alzahrani",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "This chapter delves deeply into few-shot learning, a rapidly developing area crucial in driving bioinformatics forward. First, the basics of few-shot learning are laid forth, emphasizing the field's applicability to bioinformatics. Case studies showcasing real-world applications in areas as varied as protein structure prediction, drug development, and genomic analysis provide a deep dive into several few-shot learning approaches like meta-learning and transfer learning. The chapter also provides an in-depth analysis of recent developments, highlights current difficulties, and suggests exciting new avenues for exploration. This chapter highlights the rising significance of few-shot learning in bioinformatics and provides insights into its potential to benefit biomedical research.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch016"
    },
    {
        "id": 17373,
        "title": "Few-Shot Few-Shot Learning and the role of Spatial Attention",
        "authors": "Yann Lifchitz, Yannis Avrithis, Sylvaine Picard",
        "published": "2021-1-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr48806.2021.9412902"
    },
    {
        "id": 17374,
        "title": "Learning From Scarcity",
        "authors": "Pooja Dixit, Advait Vihan Kommula, Pramod Sing Rathore",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "This chapter delves into the transformative synergy of few-shot learning and healthcare, elucidating its impact on medical procedures. Anchored in machine learning fundamentals, it establishes a core framework through a review of algorithms. Addressing challenges of small healthcare datasets, the chapter highlights the pivotal role of few-shot learning. Innovative methods like multimodal integration and federated learning enhance model robustness, offering insights into complex healthcare scenarios. Formal mathematical explanations categorize few-shot learning challenges, opening avenues for a deeper understanding and implementation in medical imaging.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch018"
    },
    {
        "id": 17375,
        "title": "When the Few Outweigh the Many: Illicit Content Recognition with Few-Shot Learning",
        "authors": "G. Cascavilla, G. Catolino, M. Conti, D. Mellios, D. Tamburri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012049400003555"
    },
    {
        "id": 17376,
        "title": "Investigating Learning with Few Shot Data",
        "authors": " Stefanie",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this project, I explore a teaching strategy called learning to teach (L2T) in which a teacher model could provide high-quality training samples to a student model. However, one major problem of L2T is that the teacher model will only select a subset of the training dataset as the final training data for the student. A learning to teach small-data learning strategy (L2TSDL) is proposed to solve this problem. In this strategy, the teacher model will calculate the importance score for every training sample and help student to make use of all training samples.",
        "link": "http://dx.doi.org/10.31219/osf.io/xwh3m"
    },
    {
        "id": 17377,
        "title": "Few-Shot Class Incremental Learning with Generative Feature Replay",
        "authors": "Abhilash Shankarampeta, Koichiro Yamauchi",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010246602590267"
    },
    {
        "id": 17378,
        "title": "Prediction Model of Stroke Based on Few-Shot Learning",
        "authors": "Xujun Wu, Guoxin Wang",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012042100003620"
    },
    {
        "id": 17379,
        "title": "Challenges and Limitations of Few-Shot and Zero-Shot Learning",
        "authors": "V. Dankan Gowda, Sajja Suneel, P. Ramesh Naidu, S. V. Ramanan, Sampathirao Suneetha",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "Essential to the development of AI and machine learning, this chapter explores the complex areas of few-shot and zero-shot learning. There have been great advancements towards more efficient and adaptive AI systems with few-shot learning and zero-shot learning, respectively, which can learn from minimal data and infer from particular data instances without previous exposure. Nevertheless, there are several limits and difficulties associated with these procedures. This chapter delves deeply into the theoretical foundations of both techniques, explaining how they work and what problems they solve in different ways. It examines the semantic gap, domain adaptation problems, and model bias, as well as the computational restrictions, overfitting, and model generalizability that are intrinsic to few-shot learning and zero-shot learning, respectively. We may better understand the ideas' potential use in different real-world contexts by comparing and contrasting them.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch007"
    },
    {
        "id": 17380,
        "title": "Optimization of Image Embeddings for Few Shot Learning",
        "authors": "Arvind Srinivasan, Aprameya Bharadwaj, Manasa Sathyan, S. Natarajan",
        "published": "2021",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010243202360242"
    },
    {
        "id": 17381,
        "title": "Metric-Based Few-Shot Learning for Pollen Grain Image Classification",
        "authors": "Philipp Viertel, Matthias König, Jan Rexilius",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011727900003411"
    },
    {
        "id": 17382,
        "title": "Bridging the Gap between Few-Shot and Many-Shot Learning via Distribution Calibration",
        "authors": "Shuo Yang, Songhua Wu, Tongliang Liu, Min Xu",
        "published": "No Date",
        "citations": 0,
        "abstract": "A major gap between few-shot and many-shot learning is the data distribution empirically observed by the model during training. In few-shot learning, the learned model can easily become over-fitted based on the biased distribution formed by only a few training examples, while the ground-truth data distribution is more accurately uncovered in many-shot learning to learn a well-generalized model. In this paper, we propose to calibrate the distribution of these few-sample classes to be more unbiased to alleviate such an over-fitting problem. The distribution calibration is achieved by transferring statistics from the classes with sufficient examples to those few-sample classes. After calibration, an adequate number of examples can be sampled from the calibrated distribution to expand the inputs to the classifier. Extensive experiments on three datasets, miniImageNet, tieredImageNet, and CUB, show that a simple linear classifier trained using the features sampled from our calibrated distribution can outperform the state-of-the-art accuracy by a large margin. We also establish a generalization error bound for the proposed distribution-calibration-based few-shot learning, which consists of the distribution assumption error, the distribution approximation error, and the estimation error. This generalization error bound theoretically justifies the effectiveness of the proposed method.",
        "link": "http://dx.doi.org/10.36227/techrxiv.14380697"
    },
    {
        "id": 17383,
        "title": "Optimizing Few-Shot Learning based on Variational Autoencoders",
        "authors": "Ruoqi Wei, Ausif Mahmood",
        "published": "No Date",
        "citations": 0,
        "abstract": "Despite the importance of few-shot learning, the lack of labeled training data in the real world, makes it extremely challenging for existing machine learning methods as this limited data set does not represent the data variance well. In this research, we suggest employing a generative approach using variational autoencoders (VAEs), which can be used specifically to optimize few-shot learning tasks by generating new samples with more intra-class variations. The purpose of our research is to increase the size of the training data set using various methods to improve the accuracy and robustness of the few-shot face recognition. Specifically, we employ the VAE generator to increase the size of the training data set, including the basic and the novel sets while utilizing transfer learning as the backend. Based on extensive experimental research, we analyze various data augmentation methods to observe how each method affects the accuracy of face recognition. We conclude that the face generation method we proposed can effectively improve the recognition accuracy rate to 96.47% using both the base and the novel sets.",
        "link": "http://dx.doi.org/10.20944/preprints202109.0389.v1"
    },
    {
        "id": 17384,
        "title": "Few-Shot Learning",
        "authors": "Hugo Larochelle",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-63416-2_861"
    },
    {
        "id": 17385,
        "title": "Bridging the Gap between Few-Shot and Many-Shot Learning via Distribution Calibration",
        "authors": "Shuo Yang, Songhua Wu, Tongliang Liu, Min Xu",
        "published": "No Date",
        "citations": 0,
        "abstract": "A major gap between few-shot and many-shot learning is the data distribution empirically observed by the model during training. In few-shot learning, the learned model can easily become over-fitted based on the biased distribution formed by only a few training examples, while the ground-truth data distribution is more accurately uncovered in many-shot learning to learn a well-generalized model. In this paper, we propose to calibrate the distribution of these few-sample classes to be more unbiased to alleviate such an over-fitting problem. The distribution calibration is achieved by transferring statistics from the classes with sufficient examples to those few-sample classes. After calibration, an adequate number of examples can be sampled from the calibrated distribution to expand the inputs to the classifier. Extensive experiments on three datasets, miniImageNet, tieredImageNet, and CUB, show that a simple linear classifier trained using the features sampled from our calibrated distribution can outperform the state-of-the-art accuracy by a large margin. We also establish a generalization error bound for the proposed distribution-calibration-based few-shot learning, which consists of the distribution assumption error, the distribution approximation error, and the estimation error. This generalization error bound theoretically justifies the effectiveness of the proposed method.",
        "link": "http://dx.doi.org/10.36227/techrxiv.14380697.v1"
    },
    {
        "id": 17386,
        "title": "Meta-learning Fine-tuned Feature Extractor for Few-shot Image Classification",
        "authors": "Yulin Shen, Xian Shuai",
        "published": "2022-1-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3512353.3512355"
    },
    {
        "id": 17387,
        "title": "Knowledge Distillation Meets Few-Shot Learning: An Approach for Few-Shot Intent Classification Within and Across Domains",
        "authors": "Anna Sauer, Shima Asaadi, Fabian Küch",
        "published": "2022",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.nlp4convai-1.10"
    },
    {
        "id": 17388,
        "title": "Empowering Few-Shot Learning through Domain Adaptation",
        "authors": "Ramond Jude, fidelicy flex",
        "published": "No Date",
        "citations": 0,
        "abstract": "Few-shot learning is a fascinating subfield of machine learning that addresses the challenge of training models to recognize and generalize from a limited amount of data. In recent years, the integration of domain adaptation techniques has emerged as a powerful approach to enhance the effectiveness of few-shot learning. This article explores the concept of empowering few-shot learning through domain adaptation, shedding light on the significance, methods, and promising applications of this synergy.",
        "link": "http://dx.doi.org/10.31219/osf.io/rnpvq"
    },
    {
        "id": 17389,
        "title": "Few-Shot Learning with Representative Global Prototype",
        "authors": "Yukun Liu, Daming Shi, Hexiu Lin",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4453239"
    },
    {
        "id": 17390,
        "title": "WITHDRAWN: Few-shot Learning on the Diagnosis of Lymphatic Metastasis of Lung Carcinoma",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe full text of this preprint has been withdrawn, as it was submitted in error. Therefore, the authors do not wish this work to be cited as a reference. Questions should be directed to the corresponding author.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-493350/v2"
    },
    {
        "id": 17391,
        "title": "Adaptive Learning Knowledge Networks for Few-Shot Learning",
        "authors": "Minghao Yan",
        "published": "2019",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2019.2934694"
    },
    {
        "id": 17392,
        "title": "Few-shot cotton leaf spots disease classification based on metric learning",
        "authors": "Xihuizi Liang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground: Cotton diceases seriously affect the yield and quality of cotton. The type of pest or disease suffered by cotton can be determined by the disease spots on the cotton leaves. This paper presents a small-sample learning framework that can be used for cotton leaf disease spot classification task, which using deep learning techniques is constructed based on a metric learning approach, to prevent and control cotton diseases timely. First, disease spots on cotton leaf's disease images are segmented by different methods, compared by using support vector machine (SVM) method and threshold segmentation, and discussed the suitable one. With segmented disease spot images as input, a disease spot dataset is established, and the cotton leaf disease spots were classified using a classical convolutional neural network classifier, the structure and framework of convolutional neural network had been designed, and the setting of relevant parameters and the detailed network structure configuration are analyzed according to the experimental environment. The features of two different images are extracted by a parallel two-way convolutional neural network with weight sharing. Then, the network uses a loss function to learn the metric space, in which similar leaf samples are close to each other and different leaf samples are far away from each other. Results: To achieve the classification of cotton leaf spots by small sample learning, this paper constructs a metric-based learning method to extract cotton leaf spot features and classify the leaves. In the process of leaf spot extraction, image segmentation of the spots is performed by threshold segmentation and SVM, and comparative analysis is performed. In the process of leaf spot classification, the structural framework of leaf spot feature extractor and feature classifier is constructed, and the overall framework is built using the idea of two-way parallel convolutional neural network. A variety of excellent convolutional neural network feature extractors such as Vgg, DesenNet, and ResNet were used for feature extraction work, and a combination design based on the small sample classification framework was performed and compared. Experimentally, it is demonstrated that the classification accuracy is improved by nearly 7.7% on average for different number of samples in the case of using this optimizer. S-DesneNet have the highest accuracy. When n is 5, 10, 15 and 20, the accuracy is 58.63%, 84.41% ,92.51% and 91.75%, respectively, and the average accuracy is improved by nearly 7.7% compared with DenseNet. Conclusions: To solve the problem of classification accuracy degradation due to small number of samples in small sample training tasks, a spatial structure optimizer (SSO) acting on the training process is proposed for this purpose.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-776867/v1"
    },
    {
        "id": 17393,
        "title": "Direct Multimodal Few-Shot Learning of Speech and Images",
        "authors": "Leanne Nortje, Herman Kamper",
        "published": "2021-8-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2021-49"
    },
    {
        "id": 17394,
        "title": "Few-Shot Learning Based on Multilevel Semantic Enhancement and Feature Reconstructionfew-Shot Learning Based on Multilevel Semantic Enhancement and Feature Reconstruction",
        "authors": "Tuo Xu, Xinyi Dong, Jie Li, Yuefan Du",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4604465"
    },
    {
        "id": 17395,
        "title": "Review of: \"Automated human cell classification in sparse datasets using few-shot learning\"",
        "authors": "Harbin Hlj",
        "published": "2022-3-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/bvd1fq"
    },
    {
        "id": 17396,
        "title": "Few-Shot Learning",
        "authors": "Hugo Larochelle",
        "published": "2020",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-03243-2_861-1"
    },
    {
        "id": 17397,
        "title": "How Much Data is Enough? Benchmarking Transfer Learning for Few Shot ECG Image Classification",
        "authors": "Sathvik Bhaskarpandit",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011531700003523"
    },
    {
        "id": 17398,
        "title": "Few-Shot and Zero-Shot Learning for Historical Text Normalization",
        "authors": "Marcel Bollmann, Natalia Korchagina, Anders Søgaard",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/d19-6112"
    },
    {
        "id": 17399,
        "title": "Learning Sample Relationship for Cross-Domain Few-Shot Learning",
        "authors": "Miaohua Zhang, Xiaohan Yu, Yongsheng Gao, Zicheng Pan, Jun Zhou",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4452073"
    },
    {
        "id": 17400,
        "title": "Few-Shot Deep Learning Method for Spectra-Based Data Discriminatory Analysis",
        "authors": "Dian Rong, Haiyan Wang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4770188"
    },
    {
        "id": 17401,
        "title": "A few shots at few shot learning",
        "authors": "Donald Waagen, Don Hulsey, David Gray",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2661719"
    },
    {
        "id": 17402,
        "title": "Meta-Learning Initialization vs Optimizer: Beyond 20 Ways Few-Shot Learning",
        "authors": "Aroof Aimen, Sahil Sidheekh, Hansin Ahuja, Narayanan  C. Krishnan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4266883"
    },
    {
        "id": 17403,
        "title": "Learning about few-shot concept learning",
        "authors": "Ananya Rastogi",
        "published": "2022-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1038/s43588-022-00367-1"
    },
    {
        "id": 17404,
        "title": "Learning End-to-End Deep Learning Based Image Signal Processing Pipeline Using a Few-Shot Domain Adaptation",
        "authors": "Georgy Perevozchikov, Egor Ershov",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012268900003660"
    },
    {
        "id": 17405,
        "title": "Performance Evaluation of Few-shot Learning-based System Identification",
        "authors": "Hongtian Chen, Chao Cheng, OGUZHAN DOGRU, Biao Huang",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper proposes a performance evaluation method for few-shot learning-based system identification. The basic idea behind the proposed approach is to use ``probably approximately correct (PAC)'' to assess the obtained boundary of identification errors. The study demonstrates effectiveness of the proposed solution when the noise is not white and there are only limited data samples for the identification in practical applications. The contributions of this study include: 1) modeling errors are quantified via the $L_\\infty$ norm; 2) the bounded noises are considered; 3) it is shown that both the modeling and prediction errors can be reduced by increasing the size of training data. Rigorous mathematical analysis and a case study demonstrate the effectiveness of the proposed performance evaluation strategy.",
        "link": "http://dx.doi.org/10.36227/techrxiv.19808446"
    },
    {
        "id": 17406,
        "title": "Few-Shot Learning Text Classification in Federated Environments",
        "authors": "Nehal Muthukumar",
        "published": "2021-10-9",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/stcr51658.2021.9588833"
    },
    {
        "id": 17407,
        "title": "Few-Shot Remote Sensing Image Classification with Meta-Learning",
        "authors": "Surbhi Sharma, Ribana Roscher, Morris Riedel, Gabriele Cavallaro",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>The performance of machine learning models relies on the quality, quantity, and diversity of annotated remote sensing datasets. However, the expensive effort required to annotate samples from diverse locations around the globe, coupled with the need for higher computation, often leads to models that are less generalizable across different regions. This paper explores the use of few-shot learning with meta-learning to improve the generalization capability of deep learning models on remote sensing image classification problems with limited annotated samples. The experiments show that metric-based meta-learners, such as prototypical and matching networks, provide comparable performance to more complex optimization-based meta-learning approaches like model-agnostic meta-learning and its variations. Few-shot learning with meta-learning can unlock greater generalization capabilities in machine learning models, thereby significantly impacting various remote sensing applications.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22788866.v1"
    },
    {
        "id": 17408,
        "title": "Performance Evaluation of Few-shot Learning-based System Identification",
        "authors": "Hongtian Chen, Chao Cheng, OGUZHAN DOGRU, Biao Huang",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper proposes a performance evaluation method for few-shot learning-based system identification. The basic idea behind the proposed approach is to use ``probably approximately correct (PAC)'' to assess the obtained boundary of identification errors. The study demonstrates effectiveness of the proposed solution when the noise is not white and there are only limited data samples for the identification in practical applications. The contributions of this study include: 1) modeling errors are quantified via the $L_\\infty$ norm; 2) the bounded noises are considered; 3) it is shown that both the modeling and prediction errors can be reduced by increasing the size of training data. Rigorous mathematical analysis and a case study demonstrate the effectiveness of the proposed performance evaluation strategy.",
        "link": "http://dx.doi.org/10.36227/techrxiv.19808446.v1"
    },
    {
        "id": 17409,
        "title": "pDeep3: Towards More Accurate Spectrum Prediction with Fast Few-Shot Learning",
        "authors": "Ching Tarn, Wen-Feng Zeng",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractSpectrum prediction using deep learning has attracted a lot of attention in recent years. Although existing deep learning methods have dramatically increased the pre-diction accuracy, there is still considerable space for improvement, which is presently limited by the difference of fragmentation types or instrument settings. In this work, we use the few-shot learning method to fit the data online to make up for the shortcoming. The method is evaluated using ten datasets, where the instruments includes Velos, QE, Lumos, and Sciex, with collision energies being differently set. Experimental results show that few-shot learning can achieve higher prediction accuracy with almost negligible computing resources. For example, on the dataset from a untrained instrument Sciex-6600, within about 10 seconds, the prediction accuracy is increased from 69.7% to 86.4%; on the CID (collision-induced dissociation) dataset, the prediction accuracy of the model trained by HCD (higher energy collision dissociation) spectra is increased from 48.0% to 83.9%. It is also shown that, the method is not critical to data quality and is sufficiently efficient to fill the accuracy gap. The source code of pDeep3 is available at http://pfind.ict.ac.cn/software/pdeep3.",
        "link": "http://dx.doi.org/10.1101/2020.09.13.295105"
    },
    {
        "id": 17410,
        "title": "Semantic Transformation-Based Data Augmentation for Few-Shot Learning",
        "authors": "Mei-hong Pana, Hongyi Xin, Hongbin Shen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4321351"
    },
    {
        "id": 17411,
        "title": "Few-Shot Remote Sensing Image Classification with Meta-Learning",
        "authors": "Surbhi Sharma, Ribana Roscher, Morris Riedel, Gabriele Cavallaro",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>The performance of machine learning models relies on the quality, quantity, and diversity of annotated remote sensing datasets. However, the expensive effort required to annotate samples from diverse locations around the globe, coupled with the need for higher computation, often leads to models that are less generalizable across different regions. This paper explores the use of few-shot learning with meta-learning to improve the generalization capability of deep learning models on remote sensing image classification problems with limited annotated samples. The experiments show that metric-based meta-learners, such as prototypical and matching networks, provide comparable performance to more complex optimization-based meta-learning approaches like model-agnostic meta-learning and its variations. Few-shot learning with meta-learning can unlock greater generalization capabilities in machine learning models, thereby significantly impacting various remote sensing applications.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22788866"
    },
    {
        "id": 17412,
        "title": "Active Few-Shot Learning for Sound Event Detection",
        "authors": "Yu Wang, Mark Cartwright, Juan Pablo Bello",
        "published": "2022-9-18",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2022-10907"
    },
    {
        "id": 17413,
        "title": "Dynamic Few-shot Learning for Computational Social Science",
        "authors": "Ranadheer Malla, Travis Coan, Vivek Srinivasan, Constantine Boussalis",
        "published": "No Date",
        "citations": 0,
        "abstract": "Large Language Models (LLMs) have revolutionized Natural Language Processing (NLP) and have recently demonstrated remarkable potential in social science research through their capacity to efficiently perform a wide range of text-as-data tasks. However, current applied social science research which relies on these models tend to use closed-source models and zero-shot learning. This study contrasts the performance of state-of-the-art closed-source LLMs with their open-source counterparts across 10 multi-class classification tasks critical to social science research, such as emotion detection and political speech classification. In addition, we introduce dynamic few-shot learning, an enhancement to static few-shot learning, that leverages semantic similarity to dynamically choose contextually relevant examples from a pre-defined corpus for improved prompt engineering. Our research indicates that dynamic few-shot learning significantly boosts classification performance, especially for much smaller models. Our findings help expand the methodological toolbox for social scientists and suggest more transparent, ethical, and efficient ways of leveraging the power of LLMs in social science research.",
        "link": "http://dx.doi.org/10.31235/osf.io/nfhe8"
    },
    {
        "id": 17414,
        "title": "Demystification of Few-shot and One-shot Learning",
        "authors": "Ivan Y. Tyukin, Alexander N. Gorban, Muhammad H. Alkhudaydi, Qinghua Zhou",
        "published": "2021-7-18",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534395"
    },
    {
        "id": 17415,
        "title": "Few-Shot Learning Based on Metric Learning Using Class Augmentation",
        "authors": "Susumu Matsumi, Keiichi Yamada",
        "published": "2021-1-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr48806.2021.9411993"
    },
    {
        "id": 17416,
        "title": "An Augmented Generator Using Contrastive Learning to Improve Few-Shot Learning in Remote Sensing",
        "authors": " olaoyegodwin, Jack Rose, Core Hermes",
        "published": "No Date",
        "citations": 0,
        "abstract": "The field of remote sensing has made remarkable strides in capturing and interpretinginformation from distant environments. However, one of the persisting challenges inremote sensing is the ability to learn and adapt quickly to new, less explored scenarios. Few-shot learning, a subfield of machine learning, addresses this issue by enablingmodels to learn from a very limited set of labeled examples. In this article, we delve intoan innovative approach that leverages an augmented generator and contrastive learningtechniques to enhance few-shot learning in remote sensing.",
        "link": "http://dx.doi.org/10.31219/osf.io/d2upz"
    },
    {
        "id": 17417,
        "title": "Knowledge Extraction: A Few-shot Relation Learning Approach",
        "authors": "HuaGang Li, Bo Liu",
        "published": "2022-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlke55170.2022.00057"
    },
    {
        "id": 17418,
        "title": "Few-Shot Learning With Embedded Class Models and Shot-Free Meta Training",
        "authors": "Avinash Ravichandran, Rahul Bhotika, Stefano Soatto",
        "published": "2019-10",
        "citations": 95,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2019.00042"
    },
    {
        "id": 17419,
        "title": "Bioinformatics in Agriculture and Ecology Using Few-Shots Learning From Field to Conservation",
        "authors": "Jayashri Prashant Shinde, Smitha Nayak, Deepika Amol Ajalkar, Yogesh Kumar Sharma",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "The integration of bioinformatics with contemporary machine-learning algorithms is transforming sustainable practices and conservation activities in biology and agriculture. Plant disease identification is an area where few-shot learning (FSL) excels because of data scarcity. This study applies FSL to computational biology to tackle agricultural and environmental concerns. Bioinformatics has a significant influence on sustainable farming and research, according to the report. The chapter introduces few-shot learning, and shows how it may address the lack of labelled data in several disciplines. Case studies, including explanations, demonstrate the manner in which the FSL method is widely used in ecological surveillance, environmental programs, and crop supervisors. The essay discusses ethical issues around machine learning in ecological systems and agriculture, emphasizing open and responsible data methods.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch002"
    },
    {
        "id": 17420,
        "title": "Learning Self-Target Knowledge for Few-Shot Segmentation",
        "authors": "Yadang Chen, Sihan Chen, Zhi-Xin Yang, Enhua Wu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4373077"
    },
    {
        "id": 17421,
        "title": "Transductive Meta-Learning with Enhanced Feature Ensemble for Few-shot Semantic Segmentation",
        "authors": "Amin Karimi, CHARALAMBOS POULLIS",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper addresses few-shot semantic segmentation and proposes a novel transductive end-to-end method that overcomes three key problems affecting performance. First, we present a novel ensemble of visual features learned from pretrained classification and semantic segmentation networks with the same architecture. Our approach leverages the varying dis-criminative power of these networks, resulting in visual features that capture rich and diverse information at different depths. Secondly, the pretrained semantic segmentation network serves as a base class extractor, which significantly reduces false positives. Thirdly, a transductive meta-learning method addresses the prediction by first learning the relationship between labeled and unlabeled data points with matching support foreground to query features (intra-class similarity) and then applying this knowledge to predict on the unlabeled query image (intra-object similarity), which simultaneously learns propagation and false positive suppression. To evaluate our method, we performed experiments on benchmark datasets, and the results demonstrate significant improvement, with minimal trainable parameters 2.98M. Specifically, using Resnet-101, we achieve state-of-the-art performance for both 1-shot and 5-shot Pascal-5i , as well as on 1-shot and 5-shot COCO-20i .",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3557409/v1"
    },
    {
        "id": 17422,
        "title": "Introduction to Bioinformatics and Machine Learning",
        "authors": "Rakhi Chauhan",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "ML has revolutionised bioinformatics' difficult biological data analysis. Pattern recognition and biological process categorization help ML systems diagnose diseases, predict protein structures, and investigate gene expression. Few-shot learning and bioinformatics are effective at optimising results with limited resources, overcoming biological dataset access issues. ML and bioinformatics advance precision medicine and drug discovery while improving biological understanding. This chapter examines bioinformatics ML methods like supervised classification, clustering, and probabilistic graphical models to find new insights. Text mining, systems biology, evolution, proteomics, and genomics use deterministic and stochastic heuristics for optimisation. Understanding bioinformatics methods and modern ML technologies while understanding implementation challenges is the study goal. Few-shot learning is highlighted to show its importance. ML and bioinformatics together improve our knowledge and solve real problems, improving research methods in biological and medical sciences.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch017"
    },
    {
        "id": 17423,
        "title": "Rethinking Few-Shot Class-Incremental Learning: A Lazy Learning Baseline",
        "authors": "Zhili Qin, Wei Han, Jiaming Liu, Rui Zhang, Zejun Sun, Junming Shao",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4647326"
    },
    {
        "id": 17424,
        "title": "Few-Shot Learning of TTPs Classification Using Large Language Models",
        "authors": "Yu Fengrui, Yanhui Du",
        "published": "No Date",
        "citations": 0,
        "abstract": "Tactics, Techniques, and Procedures (TTPs) constitute the most valuable aspect of Cyber Threat Intelligence (CTI). However, TTPs are often implicit in unstructured text, necessitating manual analysis by field experts. Automating the classification of TTPs from unstructured text is a crucial task in contemporary research. MITRE ATT&amp;CK serves as the de facto standard for studying TTPs. Existing research constructs classification datasets based on its procedural examples for tactics and techniques. However, due to a significant proportion of small sample categories, a long-tail phenomenon exists, leading to a highly imbalanced sample distribution. Consequently, more research concentrates on categories with relatively abundant samples. This paper proposes a method that combines ChatGPT data augmentation with Instruction Supervised Fine-Tuning of open large language models. This approach offers a solution for TTPs classification in few-shot learning scenarios, achieving coverage of 625 technical categories. The Precision, Recall, and F1 scores reach 86.2%, 89.9%, and 87.3%, respectively.",
        "link": "http://dx.doi.org/10.20944/preprints202401.0372.v1"
    },
    {
        "id": 17425,
        "title": "Image Semantic Segmentation Based on Few-Shot Learning",
        "authors": "Renjie Ma, An-Min Zou",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451379"
    },
    {
        "id": 17426,
        "title": "Few Shot Learning with Embedding Alignment and Standardization",
        "authors": "Krishna Kumar Singh",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4123253"
    },
    {
        "id": 17427,
        "title": "Few-Shot and Zero-Shot Multi-Label Learning for Structured Label Spaces",
        "authors": "Anthony Rios, Ramakanth Kavuluru",
        "published": "2018",
        "citations": 69,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/d18-1352"
    },
    {
        "id": 17428,
        "title": "Knowledge Sharing-Based Multi-Block Federated Learning for Few-Shot Oil Layer Identification",
        "authors": "Bingyang Chen, Xingjie Zeng",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4400829"
    },
    {
        "id": 17429,
        "title": "Exploration of Deep Learning and Transfer Learning in Bioinformatics",
        "authors": "Yash Mahajan, Muskan Sharma",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "In the dynamic field of bioinformatics, the fusion of deep learning and transfer learning techniques has ushered in a transformative era of discovery. Deep learning, powered by neural networks, has emerged as a formidable tool for deciphering intricate biological data, spanning genomics, proteomics, and metabolomics. Its capacity to automatically discern complex patterns and features within vast datasets has revolutionized our comprehension of biological processes. Transfer learning, a complementary approach, introduces a novel dimension to bioinformatics. By harnessing pre-trained models from domains like computer vision and natural language processing, researchers can expedite their analyses, reducing the demand for extensive labeled data. This cross-domain knowledge transfer expedites the progress of bioinformatics applications, from predicting protein structures to identifying disease biomarkers.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-1822-5.ch012"
    },
    {
        "id": 17430,
        "title": "Learning Class-Aware Prototypical Representations for Few-Shot Learning",
        "authors": "Xiaoying Chen, Weijie Ye",
        "published": "2023-7-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icivc58118.2023.10270788"
    },
    {
        "id": 17431,
        "title": "Hybrid Pooling Networks for Few-shot Learning",
        "authors": "Shaoqing Tan, Ruoyu Yang",
        "published": "2020-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207287"
    },
    {
        "id": 17432,
        "title": "Fast Few-Shot Classification by Few-Iteration Meta-Learning",
        "authors": "Ardhendu Shekhar Tripathi, Martin Danelljan, Luc Van Gool, Radu Timofte",
        "published": "2021-5-30",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icra48506.2021.9561269"
    },
    {
        "id": 17433,
        "title": "Prototype Reinforcement for Few-Shot Learning",
        "authors": "Liheng Xu, Qian Xie, Baoqing Jiang, Jiashuo Zhang",
        "published": "2020-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac51589.2020.9326820"
    },
    {
        "id": 17434,
        "title": "Exploiting Style Transfer-Based Task Augmentation for Cross-Domain Few-Shot Learning",
        "authors": "Shuzhen Rao, Jun Huang, Zengming Tang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4424628"
    },
    {
        "id": 17435,
        "title": "A Novel Meta-Attention Mechanism Based Few-Shot Learning Method",
        "authors": "Xu Jia, Na Ma, Fuming Sun, Xiaohui Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4289241"
    },
    {
        "id": 17436,
        "title": "Reinforcement Learning for Few-Shot Text Generation Adaptation",
        "authors": "Pengsen Cheng, Jinqiao Dai, Jiamiao Liu, Jiayong Liu, Peng Jia",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4342101"
    },
    {
        "id": 17437,
        "title": "Few-Shot Open-Set Learning for On-Device Customization of KeyWord Spotting Systems",
        "authors": "Manuele Rusci, Tinne Tuytelaars",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-1904"
    },
    {
        "id": 17438,
        "title": "Meta-Transfer-Adjustment Learning for Few-Shot Learning",
        "authors": "Yadang Chen, Yan Hui, Zhi-Xin Yang, Enhua Wu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4111235"
    },
    {
        "id": 17439,
        "title": "Utilizing An Auxiliary Generator in Contrastive Learning for Improved Few-Shot Learning in Remote Sensing",
        "authors": "Mangrove Steve, Anthomy Odu, Daniel Adedokun",
        "published": "No Date",
        "citations": 0,
        "abstract": "Remote sensing technology plays a pivotal role in today's world, enabling theacquisition of valuable information about the Earth's surface and its dynamicprocesses. From monitoring environmental changes and disaster management toprecision agriculture and urban planning, the applications of remote sensing arewide-ranging. One of the challenges in remote sensing is the need to recognize andclassify objects or phenomena with limited labeled data, a scenario often referredto as few-shot learning. Few-shot learning in remote sensing tasks presents unique challenges due to thescarcity of annotated samples for a wide variety of land cover and land usecategories. Traditional machine learning techniques often struggle to adapt to thesedata constraints, limiting the ability to accurately detect and classify objects ofinterest. To address this, researchers have turned to advanced machine learningtechniques, including contrastive learning, to improve few-shot learning in remotesensing",
        "link": "http://dx.doi.org/10.31219/osf.io/za4d7"
    },
    {
        "id": 17440,
        "title": "Meta-free few-shot learning via representation learning with weight averaging",
        "authors": "Kuilin Chen, Chi-Guhn Lee",
        "published": "2022-7-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn55064.2022.9892722"
    },
    {
        "id": 17441,
        "title": "Dynamic Relation-Aware Multiple Instance Learning for Few-Shot Learning",
        "authors": "Kaipeng Zheng, Liu Cheng, Jie Shen",
        "published": "2022-7-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn55064.2022.9892340"
    },
    {
        "id": 17442,
        "title": "Thermal Runaway Diagnosis of Energy Storage Battery Based on Multi-Source Domain Transfer Learning Algorithm Under Few-Shot Learning",
        "authors": "Chenchen Dong, Dashuai Sun",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4586358"
    },
    {
        "id": 17443,
        "title": "Simultaneous Perturbation Stochastic Approximation for Few-Shot Learning",
        "authors": "Andrei Boiarov, Oleg Granichin, Olga Granichina",
        "published": "2020-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/ecc51009.2020.9143831"
    },
    {
        "id": 17444,
        "title": "Mixture Gaussian Prototypes for Few-Shot Learning",
        "authors": "Ruijin Jiang, Zhaohui Cheng",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw53433.2021.00118"
    },
    {
        "id": 17445,
        "title": "Continual Learning for Few-Shot Class-Added Motor Fault Diagnosis",
        "authors": "Ao Ding, Xiaojian Yi, Yong Qin, Biao Wang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4436024"
    },
    {
        "id": 17446,
        "title": "Multi-Level Contrastive Learning for Few-Shot Problems",
        "authors": "Qing Chen, Jian Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4206873"
    },
    {
        "id": 17447,
        "title": "A Cognition-Driven Framework for Few-Shot Class-Incremental Learning",
        "authors": "Xuan Wang, Zhong Ji, Yanwei Pang, Yunlong Yu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4691075"
    },
    {
        "id": 17448,
        "title": "Unsupervised Few-Shot Image Segmentation with Dense Feature Learning and Sparse Clustering",
        "authors": "Kuangdai Leng, Robert Atwood, Winfried Kockelmann, Deniza Chekrygina, Jeyan Thiyagalingam",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012380700003660"
    },
    {
        "id": 17449,
        "title": "Ortho-Shot: Low Displacement Rank Regularization with Data Augmentation for Few-Shot Learning",
        "authors": "Uche Osahor, Nasser M. Nasrabadi",
        "published": "2022-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wacv51458.2022.00210"
    },
    {
        "id": 17450,
        "title": "Few-Shot Object Detection Via Stabilized Meta-Learning Framework with Sample Normalization",
        "authors": "Yang Ren, Hai Jiang, Menglong Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4576880"
    },
    {
        "id": 17451,
        "title": "Boosting Few-Shot Learning in Remote Sensing Leveraging an Auxiliary Generator through Contrastive Learning",
        "authors": "Mangrove Steve, Anthomy Odu, Jack Rose,  olaoyegodwin",
        "published": "No Date",
        "citations": 0,
        "abstract": "Remote sensing technology has revolutionized the way we perceive and interact with our planet, enablingus to acquire invaluable information about our environment, natural resources, and ecosystems. Frommonitoring land use changes to studying climate patterns and disaster management, remote sensing hasbecome an indispensable tool for scientific research and practical applications. However, the effective application of remote sensing data often relies on the ability to classify andinterpret these vast and complex datasets. This presents a substantial challenge, as remote sensing datatypically exhibit high dimensionality, encompassing diverse terrain types, weather conditions, andimaging modalities. Furthermore, acquiring labeled data for supervised machine learning approaches isoften arduous, time-consuming, and expensive in remote sensing contexts. Few-shot learning emerges as a promising paradigm to address these issues. It seeks to develop modelscapable of learning from a limited amount of labeled data, which is a common scenario in remote sensingapplications due to the cost and effort associated with ground truth data collection. Few-shot learning isespecially valuable in cases where we need to recognize previously unseen classes or adapt quickly tochanging conditions, such as tracking forest fires or monitoring urban development. Despite its potential, few-shot learning in remote sensing faces significant hurdles, such as inadequatemodel generalization, limited data diversity, and challenges in feature extraction from complex datasources. In recent years, several advancements have been made in remote sensing image analysis, including the integration of deep learning techniques, but there remains a critical need for improving few- shot learning capabilities in this domain. This paper introduces a novel approach to address the limitations of few-shot learning in remote sensing. We propose the incorporation of an auxiliary generator powered by contrastive learning, a technique thathas demonstrated success in diverse applications, from natural language processing to computer vision. This auxiliary generator, working in conjunction with our few-shot learning model, enhances the ability todiscriminate between different classes and adapt to new remote sensing scenarios with limited labeleddata",
        "link": "http://dx.doi.org/10.31219/osf.io/2v46h"
    },
    {
        "id": 17452,
        "title": "Survey on Meta Learning Algorithms for Few Shot Learning",
        "authors": "Madhava Gaikwad, Ashwini Doke",
        "published": "2022-5-25",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciccs53718.2022.9788260"
    },
    {
        "id": 17453,
        "title": "Active Learning with few shot learning for crisis management",
        "authors": "Matthieu François, Paul Gay",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3617233.3617278"
    },
    {
        "id": 17454,
        "title": "A two-generation based method for few-shot learning with few-shot instance-level privileged information",
        "authors": "Jian Xu, Jinghui He, Bo Liu, Fan Cao, Yanshan Xiao",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10489-024-05388-z"
    },
    {
        "id": 17455,
        "title": "Dynamic Model-Agnostic Meta-Learning for Incremental Few-Shot Learning",
        "authors": "Jansen Keith L. Domoguen, Prospero C. Naval",
        "published": "2022-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr56361.2022.9956522"
    },
    {
        "id": 17456,
        "title": "Splicing learning: A novel few-shot learning approach",
        "authors": "Lianting Hu, Huiying Liang, Long Lu",
        "published": "2021-4",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ins.2020.11.028"
    },
    {
        "id": 17457,
        "title": "Ecopm-Net: A Novel Essential Covariance Prototype Metric Network for Few-Shot Learning",
        "authors": "Jie Su, Qiuyu Xu, Zhang Jing",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4495473"
    },
    {
        "id": 17458,
        "title": "Domain Agnostic Few-shot Learning for Speaker Verification",
        "authors": "Seunghan Yang, Debasmit Das, Janghoon Cho, Hyoungwoo Park, Sungrack Yun",
        "published": "2022-9-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2022-940"
    },
    {
        "id": 17459,
        "title": "Few-Shot Named Entity Recognition with Hybrid Multi-Prototype Learning",
        "authors": "Zenghua Liao, Junbo Fei, Weixin Zeng, Xiang Zhao",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nInformation extraction provides the basic technical support for knowledge graph construction and Web applications. Named entity recognition(NER) is one of the fundamental tasks of information extraction. Recognizing unseen entities from numerous contents with the support of only a few labeled samples, also termed as few-shot learning, is a crucial issue to be studied. Few-shot NER aims at identifying emerging named entities from the context with the support of a few labeled samples. Existing methods mainly use the same strategy to construct a single prototype for each entity or non-entity class, which has limited expressiveness power and even biased representation. In this work, we propose a novel hybrid multi-prototype class representation approach. Specifically, for entity classes, we first insert labels after entities in support sentences to enrich the learned token and label embeddings with more contextual information. Then, for each entity span, the contextual token embeddings are averaged to form its entity-level prototype, while the contextual label embedding is considered as its label-level prototype. The set of prototypes for all entities in a class constitute the multi-prototype of this entity class. For non-entity class, we directly use the set of token embeddings to represent it, where multi-prototype refers to the multiple token embeddings. By treating the entity and non-entity classes differently, our hybrid strategy can extract more precise class representations from the support examples. Furthermore, we establish a harder and more reasonable experimental setting of few-shot NER by offering a rigorous sampling strategy. Extensive empirical results show that our proposal improves F1 scores by 3%∼10% absolute points over prior models on popular benchmark Few-NERD under both loose and our proposed rigorous sampling constraints, achieving state-of-the-art performance.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2188949/v1"
    },
    {
        "id": 17460,
        "title": "Optimizing Few-Shot Learning Based on Variational Autoencoders",
        "authors": "Ruoqi Wei, Ausif Mahmood",
        "published": "2021-10-24",
        "citations": 4,
        "abstract": "Despite the importance of few-shot learning, the lack of labeled training data in the real world makes it extremely challenging for existing machine learning methods because this limited dataset does not well represent the data variance. In this research, we suggest employing a generative approach using variational autoencoders (VAEs), which can be used specifically to optimize few-shot learning tasks by generating new samples with more intra-class variations on the Labeled Faces in the Wild (LFW) dataset. The purpose of our research is to increase the size of the training dataset using various methods to improve the accuracy and robustness of the few-shot face recognition. Specifically, we employ the VAE generator to increase the size of the training dataset, including the basic and the novel sets while utilizing transfer learning as the backend. Based on extensive experimental research, we analyze various data augmentation methods to observe how each method affects the accuracy of face recognition. The face generation method based on VAEs with perceptual loss can effectively improve the recognition accuracy rate to 96.47% using both the base and the novel sets.",
        "link": "http://dx.doi.org/10.3390/e23111390"
    },
    {
        "id": 17461,
        "title": "Few−shot learning of frame structure damage detection based on Meta−Learning and DCCMN model",
        "authors": "Chaozhi Cai, Xiaoyu Guo, Wenmei Fu, Jianhua Ren",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nIn response to the poor detection performance of frame structure under limited data conditions, this paper proposes a novel approach. This approach is based on the concepts of dynamic convolution and models such as ResNet and ShuffleNet. It introduces a Cross − Mix module and builds upon it to formulate the DCCMN (Dynamic Convolution Cross − Mix Network) model. Meta − Learning and the DCCMN model are applied to detect frame structure damage under few − shot scenarios (Meta + DCCMN). Experiments are conducted on the floor frame structure of Columbia University to validate the effectiveness of this approach. The proposed approach is subjected to N − way K − shot experiments and compared under the same conditions with SVM, ResNet − 18, DCCMN, and Meta + ResNet − 18 models. Experimental results demonstrate that, in the case of few − shot learning, the accuracy of this approach can reach 100% in 2 − way 5 − shot and 9 − way 10 − shot scenarios. Furthermore, the proposed damage detection approach outperforms other models, effectively addressing frame structure detection challenges under limited data conditions.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3321893/v1"
    },
    {
        "id": 17462,
        "title": "Local Propagation for Few-Shot Learning",
        "authors": "Yann Lifchitz, Yannis Avrithis, Sylvaine Picard",
        "published": "2021-1-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr48806.2021.9412178"
    },
    {
        "id": 17463,
        "title": "Multi-Stage Meta-Learning for Few-Shot with Lie Group Network Constraint",
        "authors": "Fang Dong, Fanzhang Li",
        "published": "No Date",
        "citations": 0,
        "abstract": "Deep learning has achieved lots of successes in many fields, but when trainable sample are extremely limited, deep learning often under or overfitting to few samples. Meta-learning was proposed to solve difficulties in few-shot learning and fast adaptive areas. Meta-learner learns to remember some common knowledge by training on large scale tasks sampled from a certain data distribution to equip generalization when facing unseen new tasks. Due to the limitation of samples, most approaches only use shallow neural network to avoid overfitting and reduce the difficulty of training process, that causes the waste of many extra information when adapting to unseen tasks. Euclidean space-based gradient descent also make meta-learner's update inaccurate. These issues cause many meta-learning model hard to extract feature from samples and update network parameters. In this paper, we propose a novel method by using multi-stage joint training approach to post the bottleneck during adapting process. To accelerate adapt procedure, we also constraint network to Stiefel manifold, thus meta-learner could perform more stable gradient descent in limited steps. Experiment on mini-ImageNet shows that our method reaches better accuracy under 5-way 1-shot and 5-way 5-shot conditions.",
        "link": "http://dx.doi.org/10.20944/preprints202003.0035.v1"
    },
    {
        "id": 17464,
        "title": "EASE: Unsupervised Discriminant Subspace Learning for Transductive Few-Shot Learning",
        "authors": "Hao Zhu, Piotr Koniusz",
        "published": "2022-6",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr52688.2022.00887"
    },
    {
        "id": 17465,
        "title": "Few-Shot Learning Based on Multilevel Semantic Enhancement and Feature Reconstruction",
        "authors": "Tuo Xu, Xinyi Dong, Jie Li, Yuefan Du",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4635954"
    },
    {
        "id": 17466,
        "title": "DFTGL: Domain Filtered and Target Guided Learning for Few-Shot Anomaly Detection",
        "authors": "Jiajun Zhang, Yanzhi Song, Zhouwang Yang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThis paper addresses cross-domain challenges in few-shot anomaly detection, where utilizing various source domains leads to diminished representations and compromised detection in the target domain. To tackle this, we propose Domain Filtering and Target-Guided Learning (DFTGL). Initially, we measure domain gaps and retain source domains with smaller disparities. We introduce a limited number of target domain samples to create an intermediate domain for better feature transfer during training. Additionally, we employ category-prior-based augmentation to refine feature distribution estimation while ensuring image registration. Experimental results demonstrate significant improvements in image-level AUROC compared to the baseline: 5.1%, 5.9%, and 4.1% (2-shot, 4-shot, and 8-shot settings) on MVTec and 6.9%, 2.1%, and 2.5% on ViSA datasets. This pioneering research effectively narrows domain gaps, enabling proficient feature transfer, and holds promise for early anomaly detection in industries like product inspection and medical diagnostics.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3933273/v1"
    },
    {
        "id": 17467,
        "title": "Mitigating Catastrophic Forgetting for Few-Shot Spoken Word Classification Through Meta-Learning",
        "authors": "Ruan van der Merwe, Herman Kamper",
        "published": "2023-8-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-385"
    },
    {
        "id": 17468,
        "title": "Similarity Learning based Few Shot Learning for ECG Time Series Classification",
        "authors": "Priyanka Gupta, Sathvik Bhaskarpandit, Manik Gupta",
        "published": "2021-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/dicta52665.2021.9647357"
    },
    {
        "id": 17469,
        "title": "Sparse Model-Agnostic Meta-Learning Algorithm for Few-Shot Learning",
        "authors": "Sibo Gai, Donglin Wang",
        "published": "2019-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cchi.2019.8901909"
    },
    {
        "id": 17470,
        "title": "Unleashing the Potential of Auxiliary Generators in Contrastive Learning for Augmented Few-Shot Learning in Remote Sensing",
        "authors": "Anthomy Odu, Jack Rose,  olaoyegodwin",
        "published": "No Date",
        "citations": 0,
        "abstract": "Remote sensing technology has revolutionized our ability to monitor and understand our planet. With applications ranging from disaster management and land use classification to climatemonitoring and urban planning, remote sensing has become an indispensable tool for variousdomains. In the context of remote sensing, few-shot learning stands out as a crucial problem, asit enables the rapid adaptation of machine learning models to new and previously unseenenvironments, objects, or land cover types with only a minimal amount of labeled data. However, despite its importance, few-shot learning in remote sensing presents substantial challenges, primarily due to the limited availability of annotated data for the vast diversity of Earth'slandscapes and features.",
        "link": "http://dx.doi.org/10.31219/osf.io/mqdvn"
    }
]