[
    {
        "id": 23971,
        "title": "Extensions to Inverse Gaussian First Hitting Time Regression Models",
        "authors": "",
        "published": "2017-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119437260.ch4"
    },
    {
        "id": 23972,
        "title": "Learning Semiparametric Regression with Missing Covariates Using Gaussian Process Models",
        "authors": "Abhishek Bishoyi, Xiaojing Wang, Dipak K. Dey",
        "published": "2020-3-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/18-ba1136"
    },
    {
        "id": 23973,
        "title": "Gaussian linear regression models",
        "authors": "Murray Aitkin",
        "published": "2022-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003216025-15"
    },
    {
        "id": 23974,
        "title": "Creating Gaussian Process Regression Models for Molecular Simulations Using Adaptive Sampling",
        "authors": "Matthew J. Burn, Paul Popelier",
        "published": "No Date",
        "citations": 0,
        "abstract": "<div>FFLUX is a new force field that combines the accuracy of quantum mechanics with the speed of force </div><div>fields, without any link to the architecture of classical force fields. This force field is atom‐focused and </div><div>adopts  the  parameter‐free  topological  atom  from  Quantum  Chemical  Topology  (QCT).  FFLUX  uses </div><div>Gaussian Process Regression (GPR) (aka kriging) models to make predicƟons of atomic properties, which </div><div>in this work are atomic energies according to QCT’s InteracƟng Quantum Atom (IQA) approach. Here </div><div>we report the adaptive sampling technique Maximum Expected Prediction Error (MEPE) to create data‐</div><div>compact,  efficient  and  accurate  kriging  models  (sub  kJ  mol‐1  for  water,  ammonia,  methane  and </div><div>methanol, and sub kcal mol‐1 for N‐methylacetamide  (NMA)). The models cope with large molecular </div><div>distortions  and  are  ready  for  use  in  molecular  simulation.  A  brand  new  press‐one‐buƩon  Python </div><div>pipeline, called ICHOR, carries out the training. </div>",
        "link": "http://dx.doi.org/10.26434/chemrxiv.12530468"
    },
    {
        "id": 23975,
        "title": "Creating Gaussian Process Regression Models for Molecular Simulations Using Adaptive Sampling",
        "authors": "Matthew J. Burn, Paul Popelier",
        "published": "No Date",
        "citations": 0,
        "abstract": "FFLUX is a new force field that combines the accuracy of quantum mechanics with the speed of force fields, without any link to the architecture of classical force fields. This force field is atom‐focused and adopts the parameter‐free topological atom from Quantum Chemical Topology (QCT). FFLUX uses Gaussian Process Regression (GPR) (aka kriging) models to make predicƟons of atomic properties, which in this work are atomic energies according to QCT’s InteracƟng Quantum Atom (IQA) approach. Here we report the adaptive sampling technique Maximum Expected Prediction Error (MEPE) to create data‐compact, efficient and accurate kriging models (sub kJ mol‐1 for water, ammonia, methane and methanol, and sub kcal mol‐1 for N‐methylacetamide (NMA)). The models cope with large molecular distortions and are ready for use in molecular simulation. A brand new press‐one‐buƩon Python pipeline, called ICHOR, carries out the training.",
        "link": "http://dx.doi.org/10.26434/chemrxiv.12530468.v1"
    },
    {
        "id": 23976,
        "title": "ICHOR: A Modern Pipeline for Producing Gaussian Process Regression Models for Atomistic Simulations",
        "authors": "Matthew Burn, Paul Popelier",
        "published": "No Date",
        "citations": 0,
        "abstract": "Current practical use of machine learning is more involved than model architecture and the optimisation technique itself. It is very important that the modern machine learning method is supported with a robust set of tools for the creation and manipulation of data sets. ICHOR is one such tool designed for the purpose of creating fast and accurate atomistic Gaussian process regression (GPR) models through the use of active learning. ICHOR operates in the context of FFLUX, a fully polarisable force field based on the energies and multipole moments of quantum topological atoms. ICHOR interacts with the in‐house GPR program FEREBUS for training, and with DL_FFLUX (derived from DL_POLY) for geometry optimisation and molecular simulation. ICHOR utilises the latest technologies in HPC cluster management to produce GPR models reliably at scale.",
        "link": "http://dx.doi.org/10.26434/chemrxiv-2022-v3d42"
    },
    {
        "id": 23977,
        "title": "Non-asymptotic confidence estimation of the parameters in stochastic regression models with Gaussian noises",
        "authors": "Victor V. Konev, Sergey E. Vorobeychikov",
        "published": "2017-1-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/07474946.2016.1275421"
    },
    {
        "id": 23978,
        "title": "Optimization of artificial viscosity in production codes based on Gaussian Regression surrogate models",
        "authors": "Vitaliy Gyrya, Evan Lieberman, Mark Kenamond, Mikhail Shashkov",
        "published": "2022-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1881779"
    },
    {
        "id": 23979,
        "title": "Bayesian Gaussian distributional regression models for more efficient norm estimation",
        "authors": "Lieke Voncken, Thomas Kneib, Casper J Albers, Nikolaus Umlauf, Marieke Timmerman",
        "published": "No Date",
        "citations": 0,
        "abstract": "A test score on a psychological test is usually expressed as a normed score, representing its relative position to test scores in a reference population. These typically depend on predictor(s) such as age. The test score distribution conditional on predictors is estimated using regression, which may need large normative samples to estimate the relationships between the predictor(s) and the distribution characteristics properly. In this study, we examine to what extent this burden can be alleviated by using prior information in the estimation of new norms using Bayesian Gaussian distributional regression. In a simulation study, we investigate to what extent this norm estimation is more efficient and how robust it is to prior model deviations. We varied the prior type, prior misspecification, and sample size. The results showed that using a fixed effects prior resulted in more efficient norm estimation than a weakly informative prior, given that the prior misspecification was not age dependent. With the proposed method and reasonable prior information, the same norm precision can be achieved with a smaller normative sample. This may help test developers to achieve cost-efficient high-quality norms. The method is illustrated using empirical normative data of the IDS-2 intelligence test.",
        "link": "http://dx.doi.org/10.31234/osf.io/7j8ym"
    },
    {
        "id": 23980,
        "title": "Non-linear regression",
        "authors": "Gennady Samorodnitsky, Murad S. Taqqu",
        "published": "2017-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780203738818-5"
    },
    {
        "id": 23981,
        "title": "The relationship between Gaussian process based c-regression models and kernel c-regression models",
        "authors": "Yukihiro Hamasuna, Yuya Yokoyama, Kaito Takegawa",
        "published": "2022-11-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/scisisis55246.2022.10002098"
    },
    {
        "id": 23982,
        "title": "A guide to modeling outcomes that have lots of zeros with Bayesian hurdle lognormal and hurdle Gaussian regression models",
        "authors": "Andrew Heiss",
        "published": "No Date",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.59350/6exz3-3vd33"
    },
    {
        "id": 23983,
        "title": "Data Analysis with Regression Models, Advanced Regression Models, and Machine Learning through Optimization",
        "authors": "William P. Fox",
        "published": "2020-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003009573-12"
    },
    {
        "id": 23984,
        "title": "How priors of initial hyperparameters affect Gaussian process regression models",
        "authors": "Zexun Chen, Bo Wang",
        "published": "2018-1",
        "citations": 62,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neucom.2017.10.028"
    },
    {
        "id": 23985,
        "title": "A guide to modeling outcomes that have lots of zeros with Bayesian hurdle lognormal and hurdle Gaussian regression models",
        "authors": "Andrew Heiss",
        "published": "No Date",
        "citations": 0,
        "abstract": "In a research project I’ve been working on for several years now, we’re interested in the effect of anti-NGO legal crackdowns on various foreign aid-related outcomes: the amount of foreign aid a country receives and the proportion of that aid dedicated to contentious vs.&nbsp;non-contentious causes or issues. These outcome variables are easily measurable thanks to the AidData project, but they post a tricky methodological issue.",
        "link": "http://dx.doi.org/10.59350/ety2j-09566"
    },
    {
        "id": 23986,
        "title": "Multiscale Topology Optimization With Gaussian Process Regression Models",
        "authors": "Joel C. Najmon, Homero Valladares, Andres Tovar",
        "published": "2021-8-17",
        "citations": 1,
        "abstract": "Abstract\nMultiscale topology optimization (MSTO) is a numerical design approach to optimally distribute material within coupled design domains at multiple length scales. Due to the substantial computational cost of performing topology optimization at multiple scales, MSTO methods often feature subroutines such as homogenization of parameterized unit cells and inverse homogenization of periodic microstructures. Parameterized unit cells are of great practical use, but limit the design to a pre-selected cell shape. On the other hand, inverse homogenization provide a physical representation of an optimal periodic microstructure at every discrete location, but do not necessarily embody a manufacturable structure. To address these limitations, this paper introduces a Gaussian process regression model-assisted MSTO method that features the optimal distribution of material at the macroscale and topology optimization of a manufacturable microscale structure. In the proposed approach, a macroscale optimization problem is solved using a gradient-based optimizer The design variables are defined as the homogenized stiffness tensors of the microscale topologies. As such, analytical sensitivity is not possible so the sensitivity coefficients are approximated using finite differences after each microscale topology is optimized. The computational cost of optimizing each microstructure is dramatically reduced by using Gaussian process regression models to approximate the homogenized stiffness tensor. The capability of the proposed MSTO method is demonstrated with two three-dimensional numerical examples. The correlation of the Gaussian process regression models are presented along with the final multiscale topologies for the two examples: a cantilever beam and a 3-point bending beam.",
        "link": "http://dx.doi.org/10.1115/detc2021-66758"
    },
    {
        "id": 23987,
        "title": "Gaussian process regression for spatiotemporal analysis of groundwater level variations.",
        "authors": "Emmanouil A Varouchakis, George P Karatzas",
        "published": "No Date",
        "citations": 0,
        "abstract": "\n        &lt;p&gt;In geostatistical analysis a Bayesian approach has more advantages over classical methods since it allows to deal with the parameters and the uncertainty in the model. Spatiotemporal geostatistical modelling can be performed by using the Gaussian process regression method under a Bayesian framework. In a Bayesian approach the overall uncertainty can be represented by a probability distribution. In this work the groundwater level spatiotemporal variability was assessed based on a ten years&amp;#8217; time series of biannual average data from an extensive network of wells in the island of Crete, Greece. The Gaussian process regression method was employed to produce reliable maps of groundwater level variability and to identify groundwater level patterns for the island of Crete. Thus, this work could help to detect areas where interventions of groundwater management are necessary considering the associated uncertainty.&lt;/p&gt;\n        ",
        "link": "http://dx.doi.org/10.5194/egusphere-egu2020-6665"
    },
    {
        "id": 23988,
        "title": "Probabilistic Damage Quantification via the Integration of Non- parametric Time-Series and Gaussian Process Regression Models",
        "authors": "AHMAD AMER, FOTIS KOPSAFTOPOULOS",
        "published": "2019-11-15",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12783/shm2019/32379"
    },
    {
        "id": 23989,
        "title": "Research on Screening and Evaluating Virtual Samples by Multi-Gaussian Process Regression Models",
        "authors": "Xintao Wu, Wenyuan Tang, Juan Chen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450770"
    },
    {
        "id": 23990,
        "title": "Gaussian Copula–based Regression Models for the Analysis of Mixed Outcomes: An Application on Household's Utilization of Health Services Data",
        "authors": "Z. Rezaei Ghahroodi, R. Aliakbari Saba, T. Baghfalaki",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2991/jsta.d.190306.009"
    },
    {
        "id": 23991,
        "title": "Parameter estimation and statistical test of geographically weighted bivariate Poisson inverse Gaussian regression models",
        "authors": "Junita Amalia,  Purhadi, Bambang Widjanarko Otok",
        "published": "2017",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5012224"
    },
    {
        "id": 23992,
        "title": "Gaussian Process Regression and Conditional Karhunen-Lo\\'{E}Ve Models for Data Assimilation in Inverse Problems",
        "authors": "Yu-Hong Yeung, David Barajas-Solano, Alexandre Tartakovsky",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4353546"
    },
    {
        "id": 23993,
        "title": "Interpolation, Gaussian process regression, and kriging",
        "authors": "William Menke",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-95576-8.00002-7"
    },
    {
        "id": 23994,
        "title": "Predictive data-driven models of thermophysical properties using Gaussian process regression",
        "authors": "Mingshuo Zhou, Chenxu Ni, Xingjian Wang",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2024-0869"
    },
    {
        "id": 23995,
        "title": "Linear Regression Models",
        "authors": "",
        "published": "2020-9-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2307/j.ctv14jx6sm.11"
    },
    {
        "id": 23996,
        "title": "Analysis of noisy transient signals based on Gaussian process regression",
        "authors": "I. Baglaeva, B. Iaparov, I. Zahradník, A. Zahradníková",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractDynamic systems such as cells or tissues generate, either spontaneously or in response to stimuli, transient signals that carry information about the system. Characterization of recorded transients is often hampered by a low signal-to-noise ratio (SNR). Reduction of the noise by filtering has limited use due to partial signal distortion. Occasionally, transients can be approximated by a mathematical function, but such a function may not hold correctly if recording conditions change. We introduce here the model-independent approximation method for general noisy transient signals based on the Gaussian process regression (GPR). The method was implemented in the software TransientAnalyzer, which detects transients in a record, finds their best approximation by the Gaussian process, constructs a surrogate spline function, and estimates specified signal parameters. The method and software were tested on a cellular model of the calcium concentration transient corrupted by various SNR levels and recorded at a low sampling frequency. Statistical analysis of the model data sets provided the error of estimation <7.5% and the coefficient of variation of estimates <17% for peak SNR=5. The performance of GPR on signals of diverse experimental origin was even better than fitting by a function. The software and its description are available on GitHub.Statement of SignificanceTransient signals convey information on the state and function of the studied system. However, the estimation of their characteristic parameters is complicated by the noise present in the recordings. Methods used for noise reduction have various disadvantages, such as distortion of the time course by filtering, the difficult superposition of many transients for accurate averaging, or a lack of a model for data fitting. In this work, we present a general method for the automatic analysis of noisy transient signals based on Gaussian process regression and its implementation in Python. The method can analyze recorded transients reliably at peak SNR ≥ 2 with a precision equivalent to the model-fitting methods.",
        "link": "http://dx.doi.org/10.1101/2022.09.27.509665"
    },
    {
        "id": 23997,
        "title": "Development of advanced machine learning models for optimization of methyl ester biofuel production from papaya oil: Gaussian process regression (GPR), multilayer perceptron (MLP), and K-nearest neighbor (KNN) regression models",
        "authors": "Abdulrahman Sumayli",
        "published": "2023-7",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.arabjc.2023.104833"
    },
    {
        "id": 23998,
        "title": "Count regression models for keyness analysis",
        "authors": "Lukas Sönning",
        "published": "No Date",
        "citations": 0,
        "abstract": "A wide variety of measures have been used in previous work to assess the keyness of items in a particular domain of language use. The present paper explores an approach to keyword analysis based on regression modeling. Specifically, we use a form of negative binomial regression, which offers a number of advantages compared to existing techniques for identifying typical items in a target corpus. Thus, it is responsive to the multidimensional nature of keyness and can address multiple aspects of typicalness simultaneously, using a single statistical model. Further, metrics of interest can be enriched with confidence intervals, which allows us to isolate descriptive and inferential indicators of keyness. Finally, all quantities are based on a text-level analysis, which accounts for the fact that the target and reference corpus consist of text files and adjusts uncertainty estimates accordingly. As an illustrative case study, we rely on COCA to identify key verbs in academic writing and demonstrate how negative binomial regression may be used to this end. Our checks on the coverage rate of the 95% confidence intervals indicate that this model seems to be adequate for purposes of statistical inference. Due consideration will also be given to the limitations of this procedure, and we conclude by outlining the kinds of keyness analyses for which count regression models may be a worthwhile approach. The online supplementary material for this paper provides data and R code for the implementation of keyness regression.",
        "link": "http://dx.doi.org/10.31234/osf.io/25mwj"
    },
    {
        "id": 23999,
        "title": "Rockfill Dam Constitutive Models’ Calibration Using Gaussian Process Regression-Response Surface Model with Jaya Optimizer",
        "authors": "Fei Kang, Siyuan Wu, Junjie Li",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1061/9780784484982.025"
    },
    {
        "id": 24000,
        "title": "Financial time series volatility analysis using Gaussian process state-space models",
        "authors": "Jianan Han",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this thesis, we propose a novel nonparametric modeling framework for financial time series data analysis, and we apply the framework to the problem of time varying volatility modeling.  Existing parametric models have a rigid transition function form and they often have over-fitting problems when model parameters are estimated using maximum likelihood methods.  These drawbacks effect the models' forecast performance.  To solve this problem, we take Bayesian nonparametric modeling approach.  By adding Gaussian process prior to the hidden state transition process, we extend the standard state-space model to a Gaussian process state-space model.  We introduce our Gaussian process regression stochastic volatility (GPRSV) model.  Instead of using maximum likelihood methods, we use Monte Carlo inference algorithms.  Both online particle filter and offline particle Markov chain Monte Carlo methods are studied to learn the proposed model.  We demonstrate our model and inference methods with both simulated and empirical financial data.",
        "link": "http://dx.doi.org/10.32920/ryerson.14655975"
    },
    {
        "id": 24001,
        "title": "A unified Gaussian copula methodology for spatial regression analysis",
        "authors": "John Hughes",
        "published": "2022-9-23",
        "citations": 0,
        "abstract": "AbstractSpatially referenced data arise in many fields, including imaging, ecology, public health, and marketing. Although principled smoothing or interpolation is paramount for many practitioners, regression, too, can be an important (or even the only or most important) goal of a spatial analysis. When doing spatial regression it is crucial to accommodate spatial variation in the response variable that cannot be explained by the spatially patterned explanatory variables included in the model. Failure to model both sources of spatial dependence—regression and extra-regression, if you will—can lead to erroneous inference for the regression coefficients. In this article I highlight an under-appreciated spatial regression model, namely, the spatial Gaussian copula regression model (SGCRM), and describe said model’s advantages. Then I develop an intuitive, unified, and computationally efficient approach to inference for the SGCRM. I demonstrate the efficacy of the proposed methodology by way of an extensive simulation study along with analyses of a well-known dataset from disease mapping.",
        "link": "http://dx.doi.org/10.1038/s41598-022-20171-1"
    },
    {
        "id": 24002,
        "title": "Regional Tourism Demand Forecasting with Machine Learning Models: Gaussian Process Regression vs. Neural Network Models in a Multiple-Input Multiple-Output Setting",
        "authors": "Oscar Claveria, Enric Monte, Salvador Torra",
        "published": "No Date",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.2945556"
    },
    {
        "id": 24003,
        "title": "Secure Computation of Gaussian Process Regression for Data Analysis",
        "authors": "Takayuki Nakachi, Yitu Wang",
        "published": "2021-8-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco54536.2021.9615991"
    },
    {
        "id": 24004,
        "title": "Inference of Kinetics in Population Balance Models using Gaussian Process Regression",
        "authors": "Michiel Busschaert, Stefen Waldherr",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2022.07.474"
    },
    {
        "id": 24005,
        "title": "Financial time series volatility analysis using Gaussian process state-space models",
        "authors": "Jianan Han",
        "published": "No Date",
        "citations": 0,
        "abstract": "In this thesis, we propose a novel nonparametric modeling framework for financial time series data analysis, and we apply the framework to the problem of time varying volatility modeling.  Existing parametric models have a rigid transition function form and they often have over-fitting problems when model parameters are estimated using maximum likelihood methods.  These drawbacks effect the models' forecast performance.  To solve this problem, we take Bayesian nonparametric modeling approach.  By adding Gaussian process prior to the hidden state transition process, we extend the standard state-space model to a Gaussian process state-space model.  We introduce our Gaussian process regression stochastic volatility (GPRSV) model.  Instead of using maximum likelihood methods, we use Monte Carlo inference algorithms.  Both online particle filter and offline particle Markov chain Monte Carlo methods are studied to learn the proposed model.  We demonstrate our model and inference methods with both simulated and empirical financial data.",
        "link": "http://dx.doi.org/10.32920/ryerson.14655975.v1"
    },
    {
        "id": 24006,
        "title": "Regression Analysis – Linear Models with Non‐random Regressors (Model I of Regression Analysis) and with Random Regressors (Model II of Regression Analysis)",
        "authors": "",
        "published": "2018-2-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119385295.ch8"
    },
    {
        "id": 24007,
        "title": "Application of Nonlinear Gaussian Process Regression Models for CO2 Emissions Prediction",
        "authors": "Ahmed Abdelhadi Ahmed, Yousif Badri, Asaad Shamseldin",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iit59782.2023.10366420"
    },
    {
        "id": 24008,
        "title": "Surrogate Models for Hypersonic Aerothermodynamics and Aerodynamics using Gaussian Process Regression",
        "authors": "Jens A. Rataczak, Iain D. Boyd, Jay W. McMahon",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2024-0461"
    },
    {
        "id": 24009,
        "title": "Understanding Seamount Genesis: Utilizing Gaussian Process Regression and Clustering for Morphological Analysis",
        "authors": "Yanghui Zhao, Bryan Riel, Hanghang Ding, Dazhen Deng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Seamounts are theorized to originate from deep mantle plumes or shallow, plate-related activities. The mantle plume hypothesis suggests that abnormally hot materials rise from the lowermost mantle and produce large volumes of volcanism on the surface. However, the accuracy of morphological analysis and volume estimation is highly influenced by the representation accuracy of irregularly shaped seamounts and the extent to which thick sediment coverage obscures their bases. As a result, the precise contribution of magma from mantle plumes to surface volcanism remains unclear.\nOur study introduces a novel approach using Gaussian Process Regression to reconstruct the complex topography of seamounts, both above and beneath sedimentary covers. This approach advances previous analyses by (1) taking account of irregular seamount topography and (2) correcting for the varying sediment thicknesses that obscure seamount bases. Our investigation yields two principal findings.\n1. Refined Volcanism Distribution Mapping\nAnalysis in the Pacific Ocean indicates that only 18% of total intraplate volcanic activity is attributable to plume-related volcanism. In addition, the volume statistics of plume-related seamounts and those along the Large Low-Shear-Velocity Province margins show no significant distinction from those of other intraplate seamounts. These results suggest that proposed plumes account for only a minority of the volume of intraplate volcanism in the Pacific plate, and that shallow rather than deep processes are dominant.\nAlong the volcanic Kyushu-Palau Ridge, high seamount volumes are observed near lithospheric weak zones, implying that tectonic inheritance significantly influences magma distribution during volcanic arc formation.\n2. Comprehensive Morphological Analysis\nEmploying machine learning clustering analysis on high-resolution multibeam bathymetry data, we categorize seamounts in the South China Sea basin into three distinct morphological types: Type I, large seamounts with steep slopes and rounded bases, predominantly located along extinct ridges; Type II, linear seamounts characterized by gentler slopes, situated along ridges; and Type III, smaller, elliptically-based seamounts found along transform faults or off-ridge areas. This morphological classification provides a novel quantitative framework correlating seamount shapes with their tectonic environments during volcanic activity.\nOverall, this research advances our understanding of seamount genesis, highlighting the importance of shallow tectonic processes in shaping submarine volcanic landscapes.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu24-4616"
    },
    {
        "id": 24010,
        "title": "Clustering Sensitivity Analysis for Gaussian Process Regression Based Solar Output Forecast",
        "authors": "Fatemeh Najibi, Dimitra Apostolopoulou, Eduardo Alonso",
        "published": "2021-6-28",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/powertech46648.2021.9495007"
    },
    {
        "id": 24011,
        "title": "Designing for Parameter Subsets in Gaussian Nonlinear Regression Models",
        "authors": "Timothy E. O’Brien",
        "published": "2021-7-13",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.6339/jds.2005.03(2).190"
    },
    {
        "id": 24012,
        "title": "Relative importance analysis for count regression models",
        "authors": "Joseph Nicholas Luchman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Count variables are common in organizational science as an outcome. Count regression models (CRMs), such as Poisson regression, are recommended as methods to analyze count variables but can be challenging to interpret given their non-linear functional form. I recommend relative importance analysis as a method to use in interpreting CRM results. This work extends on past research by describing an approach to determining the importance of independent variables in CRMs using dominance analysis (DA). In this manuscript, I review DA as a relative importance method, recommend an R2 to use with CRM-based DA, and outline the results of an analysis with simulated data that uses the recommended methodology. I also discuss the effect of differential exposure to the count generating probability across observations on count outcomes, how to correct for differential exposure, and the effect of differential exposure on relative importance determination. This work contributes to the literature by extending DA to CRMs, discussing the impact of differential exposure on CRM-based relative importance, and providing thoroughly documented example analysis that researchers can use to implementing themethodology in their research.",
        "link": "http://dx.doi.org/10.31234/osf.io/596af"
    },
    {
        "id": 24013,
        "title": "First Hitting Time Regression Models",
        "authors": "",
        "published": "2017-6-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119437260.ch2"
    },
    {
        "id": 24014,
        "title": "Spatio-Temporal Data Analysis at Scale Using Models Based on Gaussian Processes",
        "authors": "Michael Stein",
        "published": "2017-3-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1346562"
    },
    {
        "id": 24015,
        "title": "Analysis Of Overdispersion Data Using Poisson Invers Gaussian Regression Model",
        "authors": "Marsono Marsono",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": " \r\nSalah satu pelanggaran asumsi dalam model regresi Poisson pada kebanyakan data count (cacahan) adalah ditemukan kasus overdispersi, dimana varians variabel respon lebih besar dari rata-ratanya. Untuk mengatasi kasus overdispersi, dibentuk model regresi yang merupakan perpaduan antara distribusi Poisson dengan beberapa distribusi lain. Poisson Invers Gaussian (PIG) merupakan salah satu model regresi dari model campuran untuk mengatasi overdispersi. Penelitian ini membandingkan model regresi Poisson Invers Gaussian dengan model regresi Poisson bertujuan mengetahui variabel-variabel yang mempengaruhi jumlah kasus bayi mati di Provinsi Jawa Timur pada tahun 2019. Penaksiran parameter regresi PIG dilakukan dengan metode Maximum Likelihood Estimator (MLE). Berdasarkan nilai AIC paling kecil diketahui model regresi Poisson Invers Gaussian lebih baik dari model regresi Poisson.",
        "link": "http://dx.doi.org/10.31605/saintifik.v9i2.409"
    },
    {
        "id": 24016,
        "title": "Introduction to Regression Models",
        "authors": "Peter H. Westfall, Andrea L. Arias",
        "published": "2020-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003025764-1"
    },
    {
        "id": 24017,
        "title": "Basics of Regression Models",
        "authors": "Jacek Welc, Pedro J. Rodriguez Esquerdo",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-71156-0_1"
    },
    {
        "id": 24018,
        "title": "Genetic Programming and Gaussian Process Regression Models for Groundwater Salinity Prediction: Machine Learning for Sustainable Water Resources Management",
        "authors": "Alvin Lal, Bithin Datta",
        "published": "2018-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sustech.2018.8671343"
    },
    {
        "id": 24019,
        "title": "Non-stationary Gaussian process regression applied in validation of vehicle dynamics models",
        "authors": "Stephan Rhode",
        "published": "2020-8",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.engappai.2020.103716"
    },
    {
        "id": 24020,
        "title": "Mapping vegetation variables in Google Earth Engine using Gaussian Process Regression models.&amp;#160;&amp;#160;&amp;#160;",
        "authors": "Matías Salinero Delgado, Luca Pipia, Eatidal Amin, Santiago Belda, Jochem Verrelst",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;The aim of ESA's forthcoming FLuorescence EXplorer (FLEX) is to achieve a global monitoring of the vegetation's chlorophyll fluorescence by means of an imaging spectrometer, FLORIS. For the retrieval of the fluorescence signal measured from space, other vegetation variables need to be retrieved simultaneously, such as (1) Leaf Area Index (LAI), (2) Leaf Chlorophyll content (Cab), and (3) Fractional Vegetation cover (FCover), among others. The undergoing SENTIFLEX ERC project has already demonstrated the feasibility to operationally infer these variables by hybrid retrieval approaches, which combine the generalization capabilities offered by radiative transfer models (RTMs) and computational efficiency of machine learning methods. Reflectance spectra corresponding to a large variety of canopy realizations served as input to train a Gaussian Process Regression (GPR) algorithm for each targeted variable. Following this approach, sets of GPR retrieval models have been trained for Sentinel-2 and -3 reflectance images.&lt;/p&gt;&lt;p&gt;In that direction, we started to explore the potential of Google Earth Engine (GEE) to facilitate regional to global mapping. &amp;#160;GEE is a platform with multi-petabyte satellite imagery catalog and geospatial datasets with planetary-scale analysis capabilities, which is freely available for scientific purposes. Among the different EO archives, it is possible to access the whole collection of Sentinel-2 ground reflectance data. In this work, we present the results of an efficient implementation of the GPR-based vegetation models developed for Sentinel-2 in the framework of SENSAGRI H2020 project in GEE. By taking advantage of GEE cloud-computing power, we are able to avoid the typical bottleneck of downloading and process large amounts of data locally and generate results of GPR-based retrieval models developed for Sentinel-2 in a fast and efficient way, covering large areas in matter of seconds. As a first step in that direction we present here an open web-based GEE application able to generate LAI Green and LAI Brown maps from Sentinel-2- imagery at 20m in a tile-wise manner all over the world, and time series of selected pixels during user-defined time interval.&lt;/p&gt;&lt;p&gt;To illustrate this functionalities and have better understanding of the phenology, we targeted a region in Castilla y Le&amp;#243;n (Spain) from where we will present results for 2018 classified per crop type. This land cover classification was generated by the ITACYL (&lt;span&gt;Instituto Tecnol&amp;#243;gico Agrario de Castilla y Le&amp;#243;n&lt;/span&gt;) during SENSAGRI.&lt;/p&gt;&lt;p&gt;Future development will tackle the possibility to extend our analysis capability to additional variables, such as FCover and Cab, maintaining the computational efficiency as the main driver to ensure that the GEE application continues to be an agile and easy tool for spatiotemporal Earth observation studies.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu21-12359"
    },
    {
        "id": 24021,
        "title": "COMPARATIVE ANALYSIS FOR FUZZY NONPARAMETRIC REGRESSION MODELS",
        "authors": "Münevvere YILDIZ, Memmedağa MEMMEDLİ",
        "published": "2021-12-29",
        "citations": 0,
        "abstract": "Statistical modeling is essential in revealing the relationships between variables. These models can be classified as parametric and nonparametric methods in studies using crisp values. However, most of the data collected are inherently fuzzy. In this framework, it has been a subject that has been studied from past to present that the methods derived for exact values are expressed as methods with fuzzy valued input and output variables. The study aims to describe nonparametric local polynomial regression models in fuzzy structure to examine the results for cases where an input variable is a crisp number, and the output variable is a symmetrical triangular and trapezoidal fuzzy number. According to the results, the bandwidth parameter was smaller in models where the degree of the polynomial was taken as one and larger in the case of three. In addition, the bandwidth parameter was found to be larger in models using the Epanechnikov kernel.",
        "link": "http://dx.doi.org/10.18038/estubtda.1033350"
    },
    {
        "id": 24022,
        "title": "Regression Models",
        "authors": "Prabhanjan Narayanachar Tattar, H. J. Vaman",
        "published": "2022-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003306979-5"
    },
    {
        "id": 24023,
        "title": "Introduction to Lifetime Data and Regression Models",
        "authors": "",
        "published": "2017-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119437260.ch1"
    },
    {
        "id": 24024,
        "title": "Regression Analysis and Estimating Regression Models",
        "authors": "John B. Guerard, Anureet Saxena, Mustafa Gultekin",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-43547-9_12"
    },
    {
        "id": 24025,
        "title": "Non-Gaussian Linear Mixed Models",
        "authors": "",
        "published": "2019-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1142/9789814733847_0003"
    },
    {
        "id": 24026,
        "title": "Bayesian Inference for Stationary Points in Gaussian Process Regression Models for Event-Related Potentials Analysis",
        "authors": "Cheng-Han Yu, Meng Li, Colin Noe, Simon Fischer-Baum, Marina Vannucci",
        "published": "2023-6-1",
        "citations": 3,
        "abstract": "Abstract\nStationary points embedded in the derivatives are often critical for a model to be interpretable and may be considered as key features of interest in many applications. We propose a semiparametric Bayesian model to efficiently infer the locations of stationary points of a nonparametric function, which also produces an estimate of the function. We use Gaussian processes as a flexible prior for the underlying function and impose derivative constraints to control the function's shape via conditioning. We develop an inferential strategy that intentionally restricts estimation to the case of at least one stationary point, bypassing possible mis-specifications in the number of stationary points and avoiding the varying dimension problem that often brings in computational complexity. We illustrate the proposed methods using simulations and then apply the method to the estimation of event-related potentials derived from electroencephalography (EEG) signals. We show how the proposed method automatically identifies characteristic components and their latencies at the individual level, which avoids the excessive averaging across subjects that is routinely done in the field to obtain smooth curves. By applying this approach to EEG data collected from younger and older adults during a speech perception task, we are able to demonstrate how the time course of speech perception processes changes with age.",
        "link": "http://dx.doi.org/10.1111/biom.13621"
    },
    {
        "id": 24027,
        "title": "Soft Computing Techniques for Predicting Unfrozen Water Content in Copper Contaminated Bentonites: A Comparative Study of Gaussian Process Regression, Support Vector Machine, and Random Forest Models",
        "authors": "Edyta Nartowska, Parveen Sihag",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4706976"
    },
    {
        "id": 24028,
        "title": "Review of Regression Models and Advanced Regression Models",
        "authors": "William P. Fox, William C. Bauldry",
        "published": "2020-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429469626-6"
    },
    {
        "id": 24029,
        "title": "Regression models involving compositional data",
        "authors": "",
        "published": "2018-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429455537-11"
    },
    {
        "id": 24030,
        "title": "Experiment With Multiple Regression Models for Sales Forecast and Location Analysis",
        "authors": "Hetty Fu",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Location is an important consideration for retailers as it is a huge upfront cost and has a large impact on sales. There are many methods that can be used for location analysis, and regression-based modeling is one that explicitly forecast sales performance and allows incorporating a large number of factors. Previous research in this area were limited due to the lack of real sales data for academic researchers. This paper uses data from a furniture retailer operating a large number of locations in Canada. Variables are chosen based on their impacts on furniture sales. Trade areas are delineated using the Thiessen Polygon approach and descriptive trade area method using real sales data. Two sets of sales forecasting models reconstructed, one using real furniture sales data and one without. A reasonably adequate sales projection model is developed with the best model having a range of projection errors of ±40%.</p>",
        "link": "http://dx.doi.org/10.32920/23296004"
    },
    {
        "id": 24031,
        "title": "Regression Analysis and Estimating Regression Models",
        "authors": "John B. Guerard, Anureet Saxena, Mustafa N. Gültekin",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-87269-4_12"
    },
    {
        "id": 24032,
        "title": "Complex-valued gaussian process regression for time series analysis",
        "authors": "Luca Ambrogioni, Eric Maris",
        "published": "2019-7",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.sigpro.2019.02.011"
    },
    {
        "id": 24033,
        "title": "Applications of Gaussian Process Regression in the Aero-Thermo-Servo-Elastic Analysis Towards Integrated Hypersonic Flight Dynamic Analysis",
        "authors": "Daning Huang",
        "published": "2021-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cdc45484.2021.9683576"
    },
    {
        "id": 24034,
        "title": "Further Regression Models",
        "authors": "Thomas Leonard",
        "published": "2020-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003073109-9"
    },
    {
        "id": 24035,
        "title": "Multi-response Gaussian Process Regression for Multidisciplinary Design Analysis and Optimization",
        "authors": "Jangho Park, Seongim Choi, Pradeep Raj",
        "published": "2018-6-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2018-4172"
    },
    {
        "id": 24036,
        "title": "Time-series models",
        "authors": "Jeremy Arkes",
        "published": "2019-1-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781351011099-10"
    },
    {
        "id": 24037,
        "title": "Efficient global sensitivity analysis of biochemical networks using Gaussian process regression",
        "authors": "Tamara Kurdyaeva, Andreas Milias-Argeitis",
        "published": "2018-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cdc.2018.8618902"
    },
    {
        "id": 24038,
        "title": "Time-series models",
        "authors": "Jeremy Arkes",
        "published": "2022-12-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781003285007-10"
    },
    {
        "id": 24039,
        "title": "Experiment With Multiple Regression Models for Sales Forecast and Location Analysis",
        "authors": "Hetty Fu",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Location is an important consideration for retailers as it is a huge upfront cost and has a large impact on sales. There are many methods that can be used for location analysis, and regression-based modeling is one that explicitly forecast sales performance and allows incorporating a large number of factors. Previous research in this area were limited due to the lack of real sales data for academic researchers. This paper uses data from a furniture retailer operating a large number of locations in Canada. Variables are chosen based on their impacts on furniture sales. Trade areas are delineated using the Thiessen Polygon approach and descriptive trade area method using real sales data. Two sets of sales forecasting models reconstructed, one using real furniture sales data and one without. A reasonably adequate sales projection model is developed with the best model having a range of projection errors of ±40%.</p>",
        "link": "http://dx.doi.org/10.32920/23296004.v1"
    },
    {
        "id": 24040,
        "title": "Adam - Bayesian - Gaussian process regression based Monte Carlo simulation reliability analysis of deep soft rock tunnel",
        "authors": "Jiancong Xu, Chengbin Yang, Guorong Rui",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nTo evaluate the reliability of deep soft rock tunnels is a very important issue to be solved. In this paper, we proposed a novel Monte Carlo simulation reliability analysis method (MCS-RAM) integrating adaptive momentum stochastic optimization algorithm (Adam), Bayesian inference theory and Gaussian process regression (GPR) ——ABGPR-MCS-RAM, and implemented it by Python. The proposed method used the Latin hypercube sampling method to generate the dataset sample of geo-mechanical parameters, constructed combined kernel functions of GPR and adopted GPR to establish the surrogate model of the nonlinear mapping relationship between displacements and mechanical parameters of the surrounding rock. Adam was used to optimize the hyper-parameters of the surrogate model. Bayesian inference algorithm was used to obtain the probability distribution of geotechnical parameters and the optimal surrounding rock mechanical parameters. Finally, the failure probability was computed by the MCS-RAM based on the optimized surrogate model. Through the application of engineering case, the results indicate that the proposed method has less prediction error and stronger prediction ability than Kriging or XGBoost, and it can significantly save computational time compared with the traditional polynomial response surface method (PRSM). The proposed method can be used in the reliability analysis of all shapes of tunnels.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3838678/v1"
    },
    {
        "id": 24041,
        "title": "Gaussian Process Regression",
        "authors": "Xiaofeng Wang, Yuryan Yue, Julian J. Faraway",
        "published": "2018-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781351165761-8"
    },
    {
        "id": 24042,
        "title": "Estimation and inference in sparse multivariate regression and conditional Gaussian graphical models under an unbalanced distributed setting",
        "authors": "Ensiyeh Nezakati, Eugen Pircalabelu",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/23-ejs2193"
    },
    {
        "id": 24043,
        "title": "Regression Trees",
        "authors": "Ton J. Cleophas, Aeilko H. Zwinderman",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-61394-5_22"
    },
    {
        "id": 24044,
        "title": "Comparison between Time- and Observation-Based Gaussian Process Regression Models for Global Horizontal Irradiance Forecasting",
        "authors": "Shab Gbémou, Julien Eynard, Stéphane Thil, Stéphane Grieu",
        "published": "2022-10-21",
        "citations": 0,
        "abstract": "With the development of predictive management strategies for power distribution grids, reliable information on the expected photovoltaic power generation, which can be derived from forecasts of global horizontal irradiance (GHI), is needed. In recent years, machine learning techniques for GHI forecasting have proved to be superior to classical approaches. This work addresses the topic of multi-horizon forecasting of GHI using Gaussian process regression (GPR) and proposes an in-depth study on some open questions: should time or past GHI observations be chosen as input? What are the appropriate kernels in each case? Should the model be multi-horizon or horizon-specific? A comparison between time-based GPR models and observation-based GPR models is first made, along with a discussion on the best kernel to be chosen; a comparison between horizon-specific GPR models and multi-horizon GPR models is then conducted. The forecasting results obtained are also compared to those of the scaled persistence model. Four performance criteria and five forecast horizons (10 min, 1 h, 3 h, 5 h, and 24 h) are considered to thoroughly assess the forecasting results. It is observed that, when seeking multi-horizon models, using a quasiperiodic kernel and time as input is favored, while the best horizon-specific model uses an automatic relevance determination rational quadratic kernel and past GHI observations as input. Ultimately, the choice depends on the complexity and computational constraints of the application at hand.",
        "link": "http://dx.doi.org/10.3390/solar2040027"
    },
    {
        "id": 24045,
        "title": "Regression Trees",
        "authors": "Ton J. Cleophas, Aeilko H. Zwinderman",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-71937-5_22"
    },
    {
        "id": 24046,
        "title": "Gaussian transforms modeling and the estimation of distributional regression functions",
        "authors": "",
        "published": "2020-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47004/wp.cem.2020.5320"
    },
    {
        "id": 24047,
        "title": "Modified predictions of basic Gaussian process regression",
        "authors": "Bikash Ranjan Dinda",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>This paper modify the basic Gaussian process regression predictions to get the correct order of magnitude of standard deviation and covariance at some target points different from the data points.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21640472"
    },
    {
        "id": 24048,
        "title": "Modified predictions of basic Gaussian process regression",
        "authors": "Bikash Ranjan Dinda",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>This paper modify the basic Gaussian process regression predictions to get the correct order of magnitude of standard deviation and covariance at some target points different from the data points.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21640472.v1"
    },
    {
        "id": 24049,
        "title": "Gaussian Process Regression",
        "authors": "Robert B. Gramacy",
        "published": "2020-3-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780367815493-5"
    },
    {
        "id": 24050,
        "title": "Gaussian process regression for fatigue reliability analysis of offshore wind turbines",
        "authors": "David Wilkie, Carmine Galasso",
        "published": "2021-1",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.strusafe.2020.102020"
    },
    {
        "id": 24051,
        "title": "Forecasting confirmed cases of Corona patients in India using regression and Gaussian analysis",
        "authors": "Dhyan Chandra Yadav, Saurabh Pal",
        "published": "2021-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/978-0-7503-3815-8ch6"
    },
    {
        "id": 24052,
        "title": "Fast Bayesian Functional Regression for Non-Gaussian Spatial Data",
        "authors": "Hyun Bin Kang, Yeo Jin Jung, Jaewoo Park",
        "published": "2023-1-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/22-ba1354"
    },
    {
        "id": 24053,
        "title": "Extrinsic Gaussian Processes for Regression and Classification on Manifolds",
        "authors": "Lizhen Lin, Niu Mu, Pokman Cheung, David Dunson",
        "published": "2019-9-1",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1214/18-ba1135"
    },
    {
        "id": 24054,
        "title": "Survival Analysis",
        "authors": "",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108923071.016"
    },
    {
        "id": 24055,
        "title": "Linear Regression Models",
        "authors": "Ronald K. Pearson",
        "published": "2018-5-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315382111-5"
    },
    {
        "id": 24056,
        "title": "Gaussian process methods for nonparametric functional regression with mixed predictors",
        "authors": "Bo Wang, Aiping Xu",
        "published": "2019-3",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.csda.2018.07.009"
    },
    {
        "id": 24057,
        "title": "Speaker Feature Modeling Utilizing Constrained Maximum Likelihood Linear Regression and Gaussian Mixture Models",
        "authors": "Elmer R. Magsino",
        "published": "2020-2-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30534/ijatcse/2020/77912020"
    },
    {
        "id": 24058,
        "title": "EVALUATION FOR LONG-TERM TRAFFIC VOLUME FORECASTING, USING MULTIPLE  REGRESSION ANALYSIS AND PRINCIPAL COMPONENT REGRESSION MODELS",
        "authors": "",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.20544/tts2018.p01"
    },
    {
        "id": 24059,
        "title": "What is Robust Regression?",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781473991804"
    },
    {
        "id": 24060,
        "title": "Online Gaussian Process regression with non-Gaussian likelihood",
        "authors": "David Seiferth, G. Chowdhary, M. Muhlegg, F. Holzapfel",
        "published": "2017-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/acc.2017.7963429"
    },
    {
        "id": 24061,
        "title": "Gaussian process regression for radiological contamination mapping [Slides]",
        "authors": "Tony Shin",
        "published": "2021-1-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1760555"
    },
    {
        "id": 24062,
        "title": "Multivariate Student versus Multivariate Gaussian Regression Models with Application to Finance",
        "authors": "Thi Nguyen, Anne Ruiz-Gazen, Christine Thomas-Agnan, Thibault Laurent",
        "published": "2019-2-9",
        "citations": 3,
        "abstract": "To model multivariate, possibly heavy-tailed data, we compare the multivariate normal model (N) with two versions of the multivariate Student model: the independent multivariate Student (IT) and the uncorrelated multivariate Student (UT). After recalling some facts about these distributions and models, known but scattered in the literature, we prove that the maximum likelihood estimator of the covariance matrix in the UT model is asymptotically biased and propose an unbiased version. We provide implementation details for an iterative reweighted algorithm to compute the maximum likelihood estimators of the parameters of the IT model. We present a simulation study to compare the bias and root mean squared error of the ensuing estimators of the regression coefficients and covariance matrix under several scenarios of the potential data-generating process, misspecified or not. We propose a graphical tool and a test based on the Mahalanobis distance to guide the choice between the competing models. We also present an application to model vectors of financial assets returns.",
        "link": "http://dx.doi.org/10.3390/jrfm12010028"
    },
    {
        "id": 24063,
        "title": "Optimization and analysis of bioenergy production using machine learning modeling: Multi-layer perceptron, Gaussian processes regression, K-nearest neighbors, and Artificial neural network models",
        "authors": "Hulin Jin, Yong-Guk Kim, Zhiran Jin, Anastasia Andreevna Rushchitc, Ahmed Salah Al-Shati",
        "published": "2022-11",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.egyr.2022.10.334"
    },
    {
        "id": 24064,
        "title": "Regression and conditional regression quantiles",
        "authors": "Dag Tjøstheim, Håkon Otneim, Bård Støve",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-815861-6.00019-5"
    },
    {
        "id": 24065,
        "title": "Limitations and performance of three approaches to Bayesian inference for Gaussian copula regression models of discrete data",
        "authors": "L. L. Henn",
        "published": "2022-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00180-021-01131-1"
    },
    {
        "id": 24066,
        "title": "Gaussian Process Regression Models for the Prediction of Hydrogen Bond Acceptor Strengths",
        "authors": "Christoph A. Bauer, Gisbert Schneider, Andreas H. Göller",
        "published": "2019-4",
        "citations": 10,
        "abstract": "AbstractWe present two approaches for the computation of hydrogen bond acceptor strengths, one by machine‐learning and one by a composite quantum‐mechanical protocol, both based on the well‐established pKBHX scale and dataset. The QM calculations after a necessary linear fit reproduce the complexation free energies in solution with an RMSE of 2.6 kJ mol−1, not far off the expected error of 2 kJ mol−1 obtained from the comparison of experimental data from two different sources. The second approach is by Gaussian Process Regression (GPR) machine‐learning. We describe the hydrogen bond acceptor atoms by a radial atomic reactivity descriptor that encodes their electronic and steric environment. The performance of the GPR model on an external test set corresponds to 3.3 kJ mol−1, which is also close to the experimental error. We apply the GPR model built on experimental data to model the hydrogen bond acceptor strengths of a series of hydrogen bond acceptor sites of 10 phosphodiesterase 10 A inhibitors. The predicted values correlate well with the experimentally measured IC50 values.",
        "link": "http://dx.doi.org/10.1002/minf.201800115"
    },
    {
        "id": 24067,
        "title": "Data assimilation methods including Gaussian process regression and Kalman filtering",
        "authors": "William Menke",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-443-13794-5.00014-2"
    },
    {
        "id": 24068,
        "title": "Gaussian Regression Models for Evaluation of Network Lifetime and Cluster-Head Selection in Wireless Sensor Devices",
        "authors": "Anna Merine George, S. Y. Kulkarni, Ciji Pearl Kurian",
        "published": "2022",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2022.3152804"
    },
    {
        "id": 24069,
        "title": "Further Topics in Regression Models",
        "authors": "Prabhanjan Narayanachar Tattar, H. J. Vaman",
        "published": "2022-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003306979-6"
    },
    {
        "id": 24070,
        "title": "Exploratory Spatial Data Analysis",
        "authors": "",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781544302096.n2"
    }
]