[
    {
        "id": 401,
        "title": "Parallel Support Vector Machines: The Balanced Cascade SVM",
        "authors": "Yicheng Liu, Xiaoyan Liu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4085547"
    },
    {
        "id": 402,
        "title": "Support Vector Machines (SVM)",
        "authors": "Joseph L. Awange, Béla Paláncz, Robert H. Lewis, Lajos Völgyesi",
        "published": "2018",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-67371-4_10"
    },
    {
        "id": 403,
        "title": "TUMOR CLASSIFICATION AND EXTRACTION FROM MRI IMAGES USING SUPPORT VECTOR MACHINES (SVM)",
        "authors": "",
        "published": "2020-7-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/jcr.07.14.100"
    },
    {
        "id": 404,
        "title": "Support Vector Machine (SVM): Theory",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526469236"
    },
    {
        "id": 405,
        "title": "Prediction of Online Shoppers’ Purchasing Intention Using Support Vector Machines(SVM)",
        "authors": "Li Zhu",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47297/wspciwsp2516-252730.20210506"
    },
    {
        "id": 406,
        "title": "Support Vector Machines (SVM)",
        "authors": "Shriram K. Vasudevan, Nitin Vamsi Dantu, Sini Raj Pulari, T. S. Murugesh",
        "published": "2023-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003393122-7"
    },
    {
        "id": 407,
        "title": "AML-SVM: Adaptive Multilevel Learning with Support Vector Machines",
        "authors": "Ehsan Sadrfaridpour, Korey Palmer, Ilya Safro",
        "published": "2020-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata50022.2020.9378010"
    },
    {
        "id": 408,
        "title": "Support Vector Machines (SVM)",
        "authors": "Joseph L. Awange, Béla Paláncz, Robert H. Lewis, Lajos Völgyesi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-92495-9_11"
    },
    {
        "id": 409,
        "title": "Hate Speech Detection Using Support Vector Machine (SVM) Method",
        "authors": "Mohammad Attar Jibran, Ade Eviyanti",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.2545"
    },
    {
        "id": 410,
        "title": "Evaluation of Support Vector Machines SVM for Classification with Imbalanced Datasets",
        "authors": "",
        "published": "2022-2-7",
        "citations": 0,
        "abstract": "This paper presents the effect of unbalanced data sets on the training of classification models. For this purpose, sensor readings from a wall-following robot dataset available in Kaggle are used. The data was collected as the SCITOS G5 navigated the room using 24 ultrasonic sensors and following the wall clockwise, with 5,456 records distributed unbalanced into four classes. Training is performed by making a 70% to 30% split of the data for training and testing, initially using all the records. The data set is then balanced by sampling and equalizing the records by class. The models are trained with the same percentages for training and testing.",
        "link": "http://dx.doi.org/10.30534/ijeter/2022/111022022"
    },
    {
        "id": 411,
        "title": "Klasifikasi Jenis Pantun Dengan Metode Support Vector Machines (SVM)",
        "authors": "Helena Nurramdhani Irmanda,  Ria Astriratma",
        "published": "2020-10-30",
        "citations": 1,
        "abstract": "This study aims to create a model for categorizing pantun types and analyze the accuracy of support vector machines (SVM). The first stage is collecting pantun that have been labeled with pantun category. The pantun categories consist of pantun for children, pantun for young people, and pantun for elder. After collecting data, the next stage is pre-processing. This pre-processing stage makes data ready to be processed on the extraction stage. The pre-processing stage consists of text segmentation, case folding, tokenization, stop word removal, and stemming. The feature extraction stage is intended to analyze potential information and represent terms as a vector. Separating training data and testing data is necessary to be conducted before the classification process. Then the classification process is done by using multiclass SVM. The results of the classification are evaluated to obtain accuracy and will be analyzed whether the classification model is proper to be used. The results showed that SVM classified the types of pantun with accuracy of 81,91%.\r\n ",
        "link": "http://dx.doi.org/10.29207/resti.v4i5.2313"
    },
    {
        "id": 412,
        "title": "Developing classification-based named entity recognizers (NER) for Sambalpuri and Odia applying support vector machines (SVM)",
        "authors": "Pitambar Behera, Sharmin Muzaffar",
        "published": "2018-11-1",
        "citations": 1,
        "abstract": "This paper demonstrates the development of named Entity Recognizers (NER) applying Support Vector Machines (SVM) for Sambalpuri and Odia. The Sambalpuri corpus amounts to 112k word tokens out of which 5,887 are named entities. On the contrary, 250k ILCI corpus has been applied for Odia out of which 18,447 tokens are named entities. The former accurately recognizes 96.72% whereas the latter provides 98.10% accuracy.",
        "link": "http://dx.doi.org/10.3126/nl.v33i1.41066"
    },
    {
        "id": 413,
        "title": "Support Vector Machine (SVM): Practice",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526469243"
    },
    {
        "id": 414,
        "title": "Handwriting recognition on form document using convolutional neural network and support vector machines (CNN-SVM)",
        "authors": " Darmatasia, Mohamad Ivan Fanany",
        "published": "2017-5",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icoict.2017.8074699"
    },
    {
        "id": 415,
        "title": "Forecasting the Number of Blood Demand Using The Support Vector Machine (SVM) Method",
        "authors": "Novi Prastyanda Putra Pratama, Tedjo Sukmono",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.1138"
    },
    {
        "id": 416,
        "title": "Detection and Classification of Brain Tumors by Analyzing Images from MRI Using the Support Vector Machines (SVM) Algorithm",
        "authors": "Hamidreza Shirzadfar",
        "published": "2019-6-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31031/sbb.2019.03.000563"
    },
    {
        "id": 417,
        "title": "PENGEMBANGAN MODEL SUPPORT VECTOR MACHINES (SVM) DENGAN MEMPERBANYAK DATASET UNTUK PREDIKSI BISNIS FOREX MENGGUNAKAN METODE KERNEL TRICK",
        "authors": "Adi Sucipto, Akhmad Khanif Zyen",
        "published": "2017-9-12",
        "citations": 0,
        "abstract": "There are many types of investments that can be used to generate income, such as in the form of land, houses, gold, precious metals etc., there are also in the form of financial assets such as stocks, mutual funds, bonds and money markets or capital markets. One of the investments that attract enough attention today is the capital market investment. The purpose of this study is to predict and improve the accuracy of foreign exchange rates on forex business by using the Support Vector Machine model as a model for predicting and using more data sets compared with previous research that is as many as 1558 dataset. This study uses currency exchange rate data obtained from PT. Best Profit Future Cab. Surabaya is already in the form of data consisting of open, high, low, close attributes by using the current data of Euro currency exchange rate to USA Dollar with period every 1 minutes from May 12, 2016 at 09.51 until 13 May 2016 at 12:30 As much as 1689 dataset, After conducting research using Support Vector Machine model with kernel trick method to predict Forex using current data of Euro exchange rate to USA Dollar with period every 1 minutes from May 12, 2016 at 09.51 until 13 May 2016 at 12:30 as much as 1689 The dataset yielded a considerable prediction accuracy of 97.86%, with this considerable accuracy indicating that the movement of the Euro currency exchange rate to the USA Dollar on May 12 to May 13, 2016 can be predicted precisely.",
        "link": "http://dx.doi.org/10.26877/jiu.v3i1.1535"
    },
    {
        "id": 418,
        "title": "KOMPARASI MODEL SUPPORT VECTOR MACHINES (SVM) DAN NEURAL NETWORK UNTUK MENGETAHUI TINGKAT AKURASI PREDIKSI TERTINGGI HARGA SAHAM",
        "authors": "R. Hadapiningradja Kusumodestoni, Sarwido Sarwido",
        "published": "2017-9-12",
        "citations": 1,
        "abstract": "There are many types of investments to make money, one of which is in the form of shares. Shares is a trading company dealing with securities in the global capital markets. Stock Exchange or also called stock market is actually the activities of private companies in the form of buying and selling investments. To avoid losses in investing, we need a model of predictive analysis with high accuracy and supported by data - lots of data and accurately. The correct techniques in the analysis will be able to reduce the risk for investors in investing. There are many models used in the analysis of stock price movement prediction, in this study the researchers used models of neural networks (NN) and a model of support vector machine (SVM). Based on the background of the problems that have been mentioned in the previous description it can be formulated the problem as follows: need an algorithm that can predict stock prices, and need a high accuracy rate by adding a data set on the prediction, two algorithms will be investigated expected results last researchers can deduce where the algorithm accuracy rate predictions are the highest or accurate, then the purpose of this study was to mengkomparasi or compare between the two algorithms are algorithms Neural Network algorithm and Support Vector Machine which later on the end result has an accuracy rate forecast stock prices highest to see the error value RMSEnya. After doing research using the model of neural network and model of support vector machine (SVM) to predict the stock using the data value of the shares on the stock index hongkong dated July 20, 2016 at 16:26 pm until the date of 15 September 2016 at 17:40 pm as many as 729 data sets within an interval of 5 minute through a process of training, learning, and then continue the process of testing so the result is that by using a neural network model of the prediction accuracy of 0.503 +/- 0.009 (micro 503) while using the model of support vector machine (SVM) accuracy of the predictions for 0477 + / - 0.008 (micro: 0477) so that after a comparison can be concluded that the neural network models have trend prediction accuracy higher than the model of support vector machine (SVM).",
        "link": "http://dx.doi.org/10.26877/jiu.v3i1.1536"
    },
    {
        "id": 419,
        "title": "Introduction to SVM",
        "authors": "Hadi Veisi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-6553-1_1"
    },
    {
        "id": 420,
        "title": "Basics of SVM Method and Least Squares SVM",
        "authors": "Kourosh Parand, Fatemeh Baharifard, Alireza Afzal Aghaei, Mostafa Jani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-6553-1_2"
    },
    {
        "id": 421,
        "title": "PERBANDINGAN ALGORITMA  SUPPORT VECTOR MACHINES (SVM) DAN NEURAL NETWORK UNTUK KLASIFIKASI PENYAKIT JANTUNG",
        "authors": "Muhammad Dion Febrian Tino,  Herliyani Hasanah,  Tri Djoko Santosa",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "Jantung merupakan salah satu organ terpenting yang ada pada tubuh manusia. Dengan ada nya jantung, darah dapat tersalurkan keseluruh tubuh dengan baik. diperlukannya sebuah pola klasifikasi penyakit jantung. Klasifikasi yang digunakan yaitu dengan metode Support Vector Machines (SVM) dan Neural Net kinerja yang sangat baik. Pada dataset ini memiliki total 416 instance. Confusion Matrix algoritma SVM terdapat 36 + 34 prediksi yang benar dan 7 + 7 prediksi yang salah. Confusion Matrix algoritma Neural Network terdapat 164 + 180 prediksi yang benar dan 41 + 33 prediksi yang salah. Algoritma SVM memiliki tingakat accuracy lebih tinggi dibandingkan algoritma Neural Net. Yang berisi nilai pada AUC 0.833, CA 0.83, F1 0.835, Precision 0.835 dan Recall 0.835.Berdasarkan hasil penelitian pada kedua algoritma, bahwa algoritma SVM dapat menyelesaikan masalah klasifikasi penyakit jantung lebih baik dengan nilai akurasi 83% sedangkan pada algoritma Neural Net memiliki nilai akurasi 82% dalam menyelesaikan penyakit jantung.",
        "link": "http://dx.doi.org/10.31949/infotech.v9i1.5432"
    },
    {
        "id": 422,
        "title": "Signature Verification Using Support Vector Machine (SVM)",
        "authors": "Ravinder kumar,  ",
        "published": "2017-5-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijsrm/v5i5.07"
    },
    {
        "id": 423,
        "title": "ESTIMATION OF ROCK JOINT TRACE LENGTH USING SUPPORT VECTOR MACHINE (SVM)",
        "authors": "Jamal Zadhesh, Abbas Majdi",
        "published": "2022",
        "citations": 1,
        "abstract": "Jointed rock masses modeling needs the geometrical parameters of joints such as orientation, spacing, trace length, shape, and location. The rock joint trace length is one of the most critical design parameters in rock engineering and geotechnics. It controls the stability of the rock slope and tunnels in jointed rock masses by affecting rock mass strength. This parameter is usually determined through a joint survey in the field. Among the parameters, trace length is challenging because a complete joint plane within rock mass cannot be observed directly. The development of predictive models to determine rock joint length seems to be essential in rock engineering. This research made an effort to introduce a support vector machine (SVM) model to estimate rock joint trace length. The SVM is an advanced intelligence method used to solve the problem characterized by a small sample, non-linearity, and high dimension with a good generalization performance. In this study, three data sets from the sedimentary, igneous, and metamorphic rocks were organized, which location of joints on the scanline, aperture, spacing, orientation (D/DD), roughness, Schmidt rebound of the joint’s wall, type of termination, trace lengths in both sides of the scanline and joint sets were measured. The results of SVM prediction demonstrate that predicted and measured results are in good agreement. The SVM model-based results were compared with those obtained from field surveys. The proposed SVM model-based model was very efficient in predicting rock joint trace length values. The actual trace length could be estimated; thus, the expensive, difficult, time-consuming, and destructive joint surveys related to obscured joints could be avoided.",
        "link": "http://dx.doi.org/10.17794/rgn.2022.3.5"
    },
    {
        "id": 424,
        "title": "Decision support system based on the support vector machines and the adaptive support vector machines algorithm for solving chest disease diagnosis problems",
        "authors": "Amani Yahyaoui, Nejat Yumusak",
        "published": "2018",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4066/biomedicalresearch.29-17-3594"
    },
    {
        "id": 425,
        "title": "Optimum Regularization Parameter C in Support Vector Machine (SVM) Binary Classification",
        "authors": "Ishtiaque Ahmed",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Support Vector Machines (SVMs) are widely used learning algorithms for data classification. In machine learning algorithms, such as the SVM approach, one or more parameters control the smoothness of the solution and are required to be tuned for the optimum solution. Such parameters are called regularization parameters, which are critical in building robust and accurate algorithms to prevent overfitting and underfitting. In SVM, the regularization parameter, denoted by C, regularizes the training loss of misclassified data. Traditionally, the value of C is first set to one, and if after training the data, misclassifications are observed, C is tuned by K-fold Cross-Validation (CV) method, which is a time- consuming process. This thesis aims to rigorously analyze and study the behavior of the C value in SVM. The analysis shows that for the case of a linearly separable dataset, setting the value of C to one does not always provide the optimum solution, and in addition, it is shown that there exists a Minimum Acceptance Value (MAV) for C as a function of Separability and Scatteredness (S&S). S&S is a new notion that is defined in this thesis, inspired by the Signal-to-Noise ratio (SNR) definition and is shown to be a critical parameter in the analysis of SVM classifiers. The study is further extended for the case of linearly non-separable dataset, and it has shown that a lookup table based on the analysis of bias-variance tradeoff (BVB C-Table) provides the optimum value of C, which not only outperforms but also is much faster than, the existing k-fold CV. For example, in a simple binary classification scenario, a typical k-fold cross-validation can take more than two hours, whereas the proposed method requires only a couple of minutes in a python-based environment. Due to its efficiency, the proposed method of choosing the regularization parameter enables online binary classification and will have potential benefits in One-vs-All and One-vs-One SVM classification. </p>",
        "link": "http://dx.doi.org/10.32920/24050733.v1"
    },
    {
        "id": 426,
        "title": "Optimum Regularization Parameter C in Support Vector Machine (SVM) Binary Classification",
        "authors": "Ishtiaque Ahmed",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Support Vector Machines (SVMs) are widely used learning algorithms for data classification. In machine learning algorithms, such as the SVM approach, one or more parameters control the smoothness of the solution and are required to be tuned for the optimum solution. Such parameters are called regularization parameters, which are critical in building robust and accurate algorithms to prevent overfitting and underfitting. In SVM, the regularization parameter, denoted by C, regularizes the training loss of misclassified data. Traditionally, the value of C is first set to one, and if after training the data, misclassifications are observed, C is tuned by K-fold Cross-Validation (CV) method, which is a time- consuming process. This thesis aims to rigorously analyze and study the behavior of the C value in SVM. The analysis shows that for the case of a linearly separable dataset, setting the value of C to one does not always provide the optimum solution, and in addition, it is shown that there exists a Minimum Acceptance Value (MAV) for C as a function of Separability and Scatteredness (S&S). S&S is a new notion that is defined in this thesis, inspired by the Signal-to-Noise ratio (SNR) definition and is shown to be a critical parameter in the analysis of SVM classifiers. The study is further extended for the case of linearly non-separable dataset, and it has shown that a lookup table based on the analysis of bias-variance tradeoff (BVB C-Table) provides the optimum value of C, which not only outperforms but also is much faster than, the existing k-fold CV. For example, in a simple binary classification scenario, a typical k-fold cross-validation can take more than two hours, whereas the proposed method requires only a couple of minutes in a python-based environment. Due to its efficiency, the proposed method of choosing the regularization parameter enables online binary classification and will have potential benefits in One-vs-All and One-vs-One SVM classification. </p>",
        "link": "http://dx.doi.org/10.32920/24050733"
    },
    {
        "id": 427,
        "title": "Evaluation of the least square support vector machines (LS-SVM) to predict longitudinal dispersion coefficient",
        "authors": "Mehdi Mohammadi Ghaleni, Mahmood Akbari, Saeed Sharafi, Mohammad Javad Nahvinia",
        "published": "2022-5-1",
        "citations": 0,
        "abstract": "Abstract\nIn this study, the least square support vector machines (LS-SVM) method was used to predict the longitudinal dispersion coefficient (DL) in natural streams in comparison with the empirical equations in various datasets. To do this, three datasets of field data including hydraulic and geometrical characteristics of different rivers, with various statistical characteristics, were applied to evaluate the performance of LS-SVM and 15 empirical equations. The LS-SVM was evaluated and compared with developed empirical equations using statistical indices of root mean square error (RMSE), standard error (SE), mean bias error (MBE), discrepancy ratio (DR), Nash-Sutcliffe efficiency (NSE) and coefficient of determination (R2). The results demonstrated that LS-SVM method has a high capability to predict the DL in different datasets with RMSE = 58–82 m2 s−1, SE = 24–39 m2 s−1, MBE = −1.95–2.6 m2 s−1, DR = 0.08–0.13, R2 = 0.76–0.88, and NSE = 0.75–0.87 as compared with previous empirical equations. It can be concluded that the proposed LS-SVM model can be successfully applied to predict the DL for a wide range of river characteristics.",
        "link": "http://dx.doi.org/10.2166/ws.2022.195"
    },
    {
        "id": 428,
        "title": "Predicting Police Integrity: An Application of Support Vector Machines (SVM) to the Police Integrity Instrument",
        "authors": "David A. Makin, Guangzhen Wu, Matthew Broussard, Bala Krishnamoorthy",
        "published": "2024-2-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11417-024-09417-1"
    },
    {
        "id": 429,
        "title": "Determination of the actual turbocharging characteristics of diesel engines using support vector machines (SVM)",
        "authors": "V.F. Fedorenko, A.B. Ivanov, V.A. Eviev, N. Sazonov",
        "published": "2024",
        "citations": 0,
        "abstract": "The article proposes and justifies a method that allows solving the problem of determining the characteristics of turbocharging of diesel engines of agricultural tractors without the use of test benches. The proposed application of support vector machines (SVM) has a number of advantages over traditional methods for determining the characteristics of turbocharging of diesel engines under operating conditions of agricultural tractors and machines.",
        "link": "http://dx.doi.org/10.1051/e3sconf/202448003026"
    },
    {
        "id": 430,
        "title": "Tutorial on Support Vector Machines",
        "authors": "Raj Bridgelall",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe aim of this tutorial is to help students grasp the theory and applicability of support vector machines (SVMs). The contribution is an intuitive style tutorial that helped students gain insights into SVM from a unique perspective. An internet search will reveal many videos and articles on SVM, but free peer-reviewed tutorials are generally not available or are incomplete. Instructional materials that provide simplified explanations of SVM leave gaps in the derivations that beginning students cannot fill. Most of the free tutorials also lack guidance on practical applications and considerations. The software wrappers in many modern programming libraries of Python and R currently hide the operational complexities. Such software tools often use default parameters that ignore domain knowledge or leave knowledge gaps about the important effects of SVM hyperparameters, resulting in misuse and subpar outcomes. The author uses this tutorial as a course reference for students studying artificial intelligence and machine learning. The tutorial derives the classic SVM classifier from first principles and then derives the practical form that a computer uses to train a classification model. An intuitive explanation about confusion matrices, F1 score, and the AUC metric extend insights into the inherent tradeoff between sensitivity and specificity. A discussion about cross-validation provides a basic understanding of how to select and tune the hyperparameters to maximize generalization by balancing underfitting and overfitting. Even seasoned self-learners with advanced statistical backgrounds have gained insights from this tutorial style of intuitive explanations, with all related considerations for tuning and performance evaluations in one place.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1200362/v1"
    },
    {
        "id": 431,
        "title": "Tutorial On Support Vector Machines",
        "authors": "Raj Bridgelall",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nThe aim of this tutorial is to help students grasp the theory and applicability of support vector machines (SVMs). The contribution is an intuitive style tutorial that helped students gain insights into SVM from a unique perspective. An internet search will reveal many videos and articles on SVM, but many of them give simplified explanations that leave gaps in the derivations that beginning students cannot fill. Most free tutorials lack guidance on practical applications and considerations. The software wrappers in popular programming libraries such as Python and R hide many of the operational complexities. Free software tools often use default parameters that ignore domain knowledge or leave knowledge gaps about the important effects of SVM hyperparameters, resulting in misuse and subpar outcomes. The author uses this tutorial as a course reference for students studying artificial intelligence and machine learning. The tutorial derives the classic SVM classifier from first principles and then derives the practical form that a computer uses to train a classification model. An intuitive explanation about confusion matrices, F1 score, and the AUC metric extend insights into the inherent tradeoff between sensitivity and specificity. A discussion about cross-validation provides a basic understanding of hyperparameter tuning to maximize generalization by balancing underfitting and overfitting. Even seasoned self-learners with advanced statistical backgrounds have gained insights from this tutorial style of intuitive explanations, with all related considerations for tuning and performance evaluations in one place.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1200362/v2"
    },
    {
        "id": 432,
        "title": "Intention estimation via support vector machines (SVM) and convolutional neuron networks (CNN) of brain activity signals",
        "authors": "Minseok Seo, Eugene Jeong, Kyung-Soo Kim",
        "published": "2020-10-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/iccas50221.2020.9268372"
    },
    {
        "id": 433,
        "title": "Detection and mapping of land use land cover with Support vector machines SVM-based change monitoring using Landsat and Sentinel-2 data. The case of Quseir, Red Sea",
        "authors": "",
        "published": "2022-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21608/misj.2022.273084"
    },
    {
        "id": 434,
        "title": "Classification of Mental Workload (MWL) using Support Vector Machines (SVM) and Convolutional Neural Networks (CNN)",
        "authors": "Umer Asgher, Khurram Khalil, Yasar Ayaz, Riaz Ahmad, Muhammad Jawad Khan",
        "published": "2020-1",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icomet48670.2020.9073799"
    },
    {
        "id": 435,
        "title": "Real-Time Material Identification Using Light Spectroscopy and Support Vector Machine (SVM)",
        "authors": "Masoud Shaloo, Gábor Princz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012254400003543"
    },
    {
        "id": 436,
        "title": "Perbandingan Algoritma k-Nearest Neighbors (k-NN) dan Support Vector Machines (SVM) untuk Klasifikasi Pengenalan Citra Wajah",
        "authors": "Parasian DP Silitonga, Romanus Damanik",
        "published": "2021-7-31",
        "citations": 0,
        "abstract": "Abstract- The study of face recognition is one of the areas of computer vision that requires significant research at the moment. Numerous researchers have conducted studies on facial image recognition using a variety of techniques or methods to achieve the highest level of accuracy possible when recognizing a person's face from existing images. However, recognizing the image of a human face is not easy for a computer. As a result, several approaches were taken to resolve this issue. This study compares two (two) machine learning algorithms for facial image recognition to determine which algorithm has the highest level of accuracy, precision, recall, and AUC. The comparison is carried out in the following steps: image acquisition, preprocessing, feature extraction, face classification, training, and testing. Based on the stages and experiments conducted on public image datasets, it is concluded that the SVM algorithm, on average, has a higher level of accuracy, precision, and recall than the k-NN algorithm when the dataset proportion is 90:10. While the k-NN algorithm has the highest similarity in terms of accuracy, precision, and recall at 80%: 20% and 70%: 30% of 99.20. However, for the highest AUC percentage level, the k-NN algorithm outperforms SVM at a dataset proportion of 80%: 20% at 100%.",
        "link": "http://dx.doi.org/10.36054/jict-ikmi.v20i1.354"
    },
    {
        "id": 437,
        "title": "Demand forecasting with color parameter in retail apparel industry using artificial neural networks (ANN) and support vector machines (SVM) methods",
        "authors": "İlker Güven, Fuat Şimşir",
        "published": "2020-9",
        "citations": 69,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cie.2020.106678"
    },
    {
        "id": 438,
        "title": "Improved Weighted Learning Support Vector Machines (SVM) for High Accuracy",
        "authors": "Syahizul Amri Dzulkifli, Mohd Najib Mohd Salleh, Kashif Hussain Talpur",
        "published": "2019-11-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3372422.3372432"
    },
    {
        "id": 439,
        "title": "Social Network Analysis of BSI Data Leakage Using Naive Bayes, Support Vector Machine (SVM), and Random Forest Classification Algorithms",
        "authors": "Mokhamad Diki Armanda, Rohman Dijaya",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.4132"
    },
    {
        "id": 440,
        "title": "Brain Disease Classification using Different Wavelet Analysis for Support Vector Machine (SVM)",
        "authors": "Muhammad Fahrur Rozi, Dian Candra Rini Novitasari, Putroue Keumala Intan",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008523704600465"
    },
    {
        "id": 441,
        "title": "Acoustic Gait Analysis using Support Vector Machines",
        "authors": "Jasper Huang, Fabio Di Troia, Mark Stamp",
        "published": "2018",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006730705450552"
    },
    {
        "id": 442,
        "title": "Prediction of critical flashover voltage of polluted insulators under sec and rain conditions using least squares support vector machines (LS-SVM)",
        "authors": "Mahdjoubi Abdelhalim, Zegnini Boubakeur, Mohammed Belkheiri",
        "published": "2018-11-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.29354/diag/99854"
    },
    {
        "id": 443,
        "title": "Performance Evaluation of Support Vector Machines (SVM) and Convolution Neural Networks (CNN) for Video Tampering Classification",
        "authors": "S.K. Komal, Puneeth Chandrashekar, B.S. Rekha, G.N. Srinivasan",
        "published": "2020-4-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36478/ijscomp.2019.53.60"
    },
    {
        "id": 444,
        "title": "Penerapan data mining dalam analisa profil mahasiswa menggunakan metode support vector machines (SVM)",
        "authors": "Luki Hernando, Vitri Aprilla Handayani, Deosa Putra Caniago, Nadia Widari Nasution",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "decision making. The Support Vector Machine algorithm is a method in supervised learning which is usually used for classifications such as Support Vector Classification and support Vector Regression regression. In this study the SVM algorithm was used in the classification of student data profiles at the Batam Institute of Technology, which can be used as material for consideration in determining and considering decisions to make an effective destination strategy promotion.\r\n ",
        "link": "http://dx.doi.org/10.37859/coscitech.v4i2.5107"
    },
    {
        "id": 445,
        "title": "Chord Recognition in Music Using a Robust Pitch Class Profile (PCP) Feature and Support Vector Machines (SVM)",
        "authors": "Suwatchai Kamonsantiroj",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47738/ijiis.v7i1.191"
    },
    {
        "id": 446,
        "title": "An Insight Into Supervised Learning Using Support Vector Machines",
        "authors": "",
        "published": "2017-8-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23883/ijrter.2017.3391.mezpj"
    },
    {
        "id": 447,
        "title": "Solving Ordinary Differential Equations by LS-SVM",
        "authors": "Mohsen Razzaghi, Simin Shekarpaz, Alireza Rajabi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-6553-1_7"
    },
    {
        "id": 448,
        "title": "Classification of Ettawa Crossbread Goats based on Face using Gray Level Co-Occurrence Matrix (GLCM) and Support Vector Machines (SVM) Methods",
        "authors": "Anna Nur Nazilah Chamim, Alif Fatullah, Yessi Jusman",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iwaiip58158.2023.10462844"
    },
    {
        "id": 449,
        "title": "Solving Partial Differential Equations by LS-SVM",
        "authors": "Mohammad Mahdi Moayeri, Mohammad Hemami",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-6553-1_8"
    },
    {
        "id": 450,
        "title": "Bagging based ensemble of Support Vector Machines with improved elitist GA-SVM features selection for cardiac arrhythmia classification",
        "authors": "Vinod Kadam, Shivajirao Jadhav, Samir Yadav",
        "published": "2020-3-23",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/his-190276"
    },
    {
        "id": 451,
        "title": "Support Vector Machines for Image Spam Analysis",
        "authors": "Aneri Chavda, Katerina Potika, Fabio Di Troia, Mark Stamp",
        "published": "2018",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006921405970607"
    },
    {
        "id": 452,
        "title": "Support Vector Machines for Image Spam Analysis",
        "authors": "Aneri Chavda, Katerina Potika, Fabio Di Troia, Mark Stamp",
        "published": "2018",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006921404310441"
    },
    {
        "id": 453,
        "title": "Web Scraping Social Media Using Support Vector Machine (SVM)",
        "authors": "Osama  Mohammed Qasim, Nada A Rasheed",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4632285"
    },
    {
        "id": 454,
        "title": "Addenda",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0024"
    },
    {
        "id": 455,
        "title": "Cancer Detection using Support Vector Machines Trained with Linear Kernels",
        "authors": "",
        "published": "2017-7-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21275/art20175103"
    },
    {
        "id": 456,
        "title": "Optimization",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0009"
    },
    {
        "id": 457,
        "title": "Tutorial on Support Vector Machines",
        "authors": "Raj Bridgelall",
        "published": "No Date",
        "citations": 0,
        "abstract": "The aim of this tutorial is to help students grasp the theory and applicability of support vector machines (SVMs). The contribution is an intuitive style tutorial that helped students gain insights into SVM from a unique perspective. An internet search will reveal many videos and articles on SVM, but many of them give simplified explanations that leave gaps in the derivations that beginning students cannot fill. Most free tutorials lack guidance on practical applications and considerations. The software wrappers in popular programming libraries such as Python and R hide many of the operational complexities. Free software tools often use default parameters that ignore domain knowledge or leave knowledge gaps about the important effects of SVM hyperparameters, resulting in misuse and subpar outcomes. The author uses this tutorial as a course reference for students studying artificial intelligence and machine learning. The tutorial derives the classic SVM classifier from first principles and then derives the practical form that a computer uses to train a classification model. An intuitive explanation about confusion matrices, F1 score, and the AUC metric extend insights into the inherent tradeoff between sensitivity and specificity. A discussion about cross-validation provides a basic understanding of hyperparameter tuning to maximize generalization by balancing underfitting and overfitting. Even seasoned self-learners with advanced statistical backgrounds have gained insights from this tutorial style of intuitive explanations, with all related considerations for tuning and performance evaluations in one place.",
        "link": "http://dx.doi.org/10.20944/preprints202201.0232.v1"
    },
    {
        "id": 458,
        "title": "Index",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0027"
    },
    {
        "id": 459,
        "title": "Implementation",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0014"
    },
    {
        "id": 460,
        "title": "Regularization",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0007"
    },
    {
        "id": 461,
        "title": "Kernels",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0005"
    },
    {
        "id": 462,
        "title": "References",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0026"
    },
    {
        "id": 463,
        "title": "Intelligent Fault Diagnosis of Bearings Based on Energy Levels in Frequency Bands Using Wavelet and Support Vector Machines (SVM)",
        "authors": "Seyed Yadavar Nikravesh, Hossein Rezaie, Margaret Kilpatrik, Hossein Taheri",
        "published": "2019-1-19",
        "citations": 16,
        "abstract": "In this paper, a new method was introduced for feature extraction and fault diagnosis in bearings based on wavelet packet decomposition and analysis of the energy in different frequency bands. This method decomposes a signal into different frequency bands using different types of wavelets and performs multi-resolution analysis to extract different features of the signals by choosing energy levels in different frequency bands. The support vector machines (SVM) technique was used for faults classifications. Daubechies, biorthogonal, coiflet, symlet, Meyer, and reverse Meyer wavelets were used for feature extraction. The most appropriate decomposition level and frequency band were selected by analyzing the variation in the signal’s energy level. The proposed approach was applied to the fault diagnosis of rolling bearings, and testing results showed that the proposed approach can reliably identify different fault categories and their severities. Moreover, the effectiveness of the proposed feature selection and fault diagnosis method was significant based on the similarity between the wavelet packet and the signal, and effectively reduced the influence of the signal noise on the classification results.",
        "link": "http://dx.doi.org/10.3390/jmmp3010011"
    },
    {
        "id": 464,
        "title": "A Comprehensive Comparative Study of Artificial Neural Network (ANN) and Support Vector Machines (SVM) on Stock Forecasting",
        "authors": "Akshit Kurani, Pavan Doshi, Aarya Vakharia, Manan Shah",
        "published": "2023-2",
        "citations": 130,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s40745-021-00344-x"
    },
    {
        "id": 465,
        "title": "Support Vector Machines",
        "authors": "",
        "published": "2022-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009003933.008"
    },
    {
        "id": 466,
        "title": "Mathematical Prerequisites",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0025"
    },
    {
        "id": 467,
        "title": "Pattern Recognition",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0011"
    },
    {
        "id": 468,
        "title": "Support Vector Machines",
        "authors": "Xiuping Jia",
        "published": "2022-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2625662.ch52"
    },
    {
        "id": 469,
        "title": "Designing Kernels",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0018"
    },
    {
        "id": 470,
        "title": "Support Vector Machines",
        "authors": "Poornachandra Sarang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-45633-6_9"
    },
    {
        "id": 471,
        "title": "On Neural Quantum Support Vector Machines",
        "authors": "Lars Simon, Manuel Radons",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nIn SR23 we introduced four algorithms for the training of neural support vector machines (NSVMs) and demonstrated their feasibility. In this note we introduce neural quantum support vector machines, that is, NSVMs with a quantum kernel, and extend our results to this setting.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3309517/v1"
    },
    {
        "id": 472,
        "title": "Support vector machines",
        "authors": "Jin Li",
        "published": "2022-1-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003091776-9"
    },
    {
        "id": 473,
        "title": "Estimating the frequency and bandwidth of square-split ring resonator (S-SRR) designs via support vector machines (SVM)",
        "authors": "Sultan CAN, Gökhan SOYSAL",
        "published": "2021-12-30",
        "citations": 0,
        "abstract": "In this study Support Vector Machine (SVM) based estimation technique is proposed for estimating the bandstop frequency and bandwidth of square-split ring resonators. Artificially engineered surfaces especially the planar frequency selective surfaces like the SRRs have narrowband properties so that estimating the filtering frequencies and the bandwidth is essential in a cost and design-effective way. The proposed method, which is superior to optimization methods and 3D electromagnetic solvers in terms of cost and computational burden, achieved accurate results via SVMs generalization capability. This study represents two SVM regression models one for predicting frequency and the other for predicting bandwidth having fast response and accuracy. Results of the proposed model reveal that resonance frequency estimation error, in terms of percentage, is bounded in the interval [0.0542, 3.5938], with an overall error of 0.89 % for the test data. The mean and standard deviation of the percentage error is obtained as 0.9861 and 0.9376, respectively. In addition to that -10dB bandwidth is estimated with the bounded error where estimation error in terms of percentage would be lie in the interval [0.068925, 6.876800] with an overall error of 3.68% for the test data.",
        "link": "http://dx.doi.org/10.33769/aupse.992350"
    },
    {
        "id": 474,
        "title": "Regression Estimation",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0013"
    },
    {
        "id": 475,
        "title": "Incorporating Invariances",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0015"
    },
    {
        "id": 476,
        "title": "Sparse Least Squares Twin Support Vector Machines with\nManifold-preserving Graph Reduction",
        "authors": "Xijiong Xie",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006690805630567"
    },
    {
        "id": 477,
        "title": "Towards Poisoning of Federated Support Vector Machines with Data Poisoning Attacks",
        "authors": "Israt Mouri, Muhammad Ridowan, Muhammad Adnan",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011825800003488"
    },
    {
        "id": 478,
        "title": "Support Vector Machines",
        "authors": "",
        "published": "2022-12-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009218276.013"
    },
    {
        "id": 479,
        "title": "Support Vector Machines (SVMs)",
        "authors": "",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781009315647.016"
    },
    {
        "id": 480,
        "title": "Nonlinear Support Vector Machines",
        "authors": "Xiuping Jia",
        "published": "2022-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/3.2625662.ch53"
    },
    {
        "id": 481,
        "title": "Notation and Symbols",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0028"
    },
    {
        "id": 482,
        "title": "A Tutorial Introduction",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0003"
    },
    {
        "id": 483,
        "title": "Kernel Feature Extraction",
        "authors": "",
        "published": "2018",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0019"
    },
    {
        "id": 484,
        "title": "Learning Theory Revisited",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0016"
    },
    {
        "id": 485,
        "title": "Regularized Principal Manifolds",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0022"
    },
    {
        "id": 486,
        "title": "Kernel Fisher Discriminant",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0020"
    },
    {
        "id": 487,
        "title": "Bayesian Kernel Methods",
        "authors": "",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/4175.003.0021"
    },
    {
        "id": 488,
        "title": "Fault Detection in Aircraft Flight Control Actuators Using Support Vector Machines",
        "authors": "Julianne Grehan, Dmitry Ignatyev, Argyrios Zolotas",
        "published": "2023-2-2",
        "citations": 2,
        "abstract": "Future generations of flight control systems, such as those for unmanned autonomous vehicles (UAVs), are likely to be more adaptive and intelligent to cope with the extra safety and reliability requirements due to pilotless operations. An efficient fault detection and isolation (FDI) system is paramount and should be capable of monitoring the health status of an aircraft. Historically, hardware redundancy techniques have been used to detect faults. However, duplicating the actuators in an UAV is not ideal due to the high cost and large mass of additional components. Fortunately, aircraft actuator faults can also be detected using analytical redundancy techniques. In this study, a data-driven algorithm using Support Vector Machine (SVM) is designed. The aircraft actuator fault investigated is the loss-of-effectiveness (LOE) fault. The aim of the fault detection algorithm is to classify the feature vector data into a nominal or faulty class based on the health of the actuator. The results show that the SVM algorithm detects the LOE fault almost instantly, with an average accuracy of 99%.",
        "link": "http://dx.doi.org/10.3390/machines11020211"
    },
    {
        "id": 489,
        "title": "KLASIFIKASI STATUS KEMISKINAN RUMAH TANGGA DENGAN METODE SUPPORT VECTOR MACHINES (SVM) DAN CLASSIFICATION AND REGRESSION TREES (CART) MENGGUNAKAN GUI R  (Studi Kasus di Kabupaten Wonosobo Tahun 2018)",
        "authors": "Lutfia Nuzula, Alan Prahutama, Arief Rachman Hakim",
        "published": "2020-12-7",
        "citations": 0,
        "abstract": "The poor are people who have average monthly expenditures per capita below the poverty line. Wonosobo District became the poorest district in Central Java in 2011-2018, although the percentage of poor people has decreased every year. It cannot be separated from the efforts of the Wonosobo District Government to overcome poverty through various programs. This study classified households in Wonosobo District in 2018 as poor and non-poor based on influencing factors. This study used the Support Vector Machines (SVM) method to be compared with the Classification and Regression Trees (CART) method. It used the data from the 2018 National Socio-Economic Survey of Central Java with a total of 795 observations. Result of the research using the SVM method and the RBF kernel, the classification accuracy reaches 89.82% then the classification accuracy using the CART method reaches 87.08%. GUI designed by RShiny package can make easier for users to analyze the SVM and CART with the valid output. ",
        "link": "http://dx.doi.org/10.14710/j.gauss.v9i4.29449"
    },
    {
        "id": 490,
        "title": "Performance Evaluation of Support Vector Machines and AdaBoost-SVM for Lung Nodule Identification in Chest Radiographs",
        "authors": "Srinivas Samala, Aakash Sreeram, Lakshmi Sree Vindhya Sarva, Sreedhar Kollem, Kedhareshwar Rao Vanamala, Chandrashekar Valishetti",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/confluence60223.2024.10463213"
    },
    {
        "id": 491,
        "title": "Review for \"RF‐SVM : Identification of DNA ‐binding proteins based on comprehensive feature representation methods and support vector machine\"",
        "authors": "",
        "published": "2021-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/prot.26229/v1/review1"
    },
    {
        "id": 492,
        "title": "Review for \"RF‐SVM : Identification of DNA ‐binding proteins based on comprehensive feature representation methods and support vector machine\"",
        "authors": "",
        "published": "2021-8-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/prot.26229/v2/review2"
    },
    {
        "id": 493,
        "title": "Support Vector Machines",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.026"
    },
    {
        "id": 494,
        "title": "Content based Image Retrieval Using Support Vector Machines",
        "authors": "Vishal Goyal, Aasheesh Shukla",
        "published": "2019-10-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v11sp10/20192851"
    },
    {
        "id": 495,
        "title": "A Hybrid Prediction Model Integrating Fuzzy Cognitive Maps with Support Vector Machines",
        "authors": "Panayiotis Christodoulou, Andreas Christoforou, Andreas S. Andreou",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006329405540564"
    },
    {
        "id": 496,
        "title": "Classification with Support Vector Machines",
        "authors": "",
        "published": "2020-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108679930.014"
    },
    {
        "id": 497,
        "title": "Optimal filter bank representation in texture classification using support vector machines",
        "authors": "Samsher Singh Sidhu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Texture analysis has been a field of study for over three decades in many fields including electrical engineering. Today, texture analysis plays a crucial role in many tasks ranging from remote sensing to medical imaging. Researchers in this field have dealt with many different approaches, all trying to achieve the goal of high classification accuracy. The main difficulty of texture analysis was the lack of ability of the tools to characterize adequately different scales of the textures effectively. The development in multi-resolution analysis such as Gabor and Wavelet Transform help to overcome this difficulty. This thesis describes the texture classification algorithm that uses the combination of statistical features and co-occurrence features of the Discrete Wavelet Transformed images. The classification accuracy is increased by using translation-invariant features generated from the Discrete Wavelet Frame Transform. The results are further improved by focussing on the transformed images used for feature extraction by using filters which essentially extract those areas of the image that discriminate themselves from other image classes. In effect, by reducing the spatial characteristics of images that contribute to the features, the texture classification method still has the ability to preserve the classification accuracy. Support Vector Machines has proved excellent performance in the area of pattern recognition problems. We have applied SVMs with the texture classification method described above and, when compared to traditional classifiers, SVM has produced more accurate classification results on the Brodatz texture album.",
        "link": "http://dx.doi.org/10.32920/ryerson.14645844"
    },
    {
        "id": 498,
        "title": "A Novel Covid-19 Detection System Based on PSO and Hybrid Feature Using Support Vector Machines",
        "authors": "Mehmet Fatih OZDEMIR, Davut HANBAY",
        "published": "2022-9-16",
        "citations": 1,
        "abstract": "The world first met the coronavirus (COVID-19) in Wuhan, China in December 2019. It has continued to increase its influence from the first encounter until today. The detection of this virus, which has caused the death of many, is of great importance today. There are many approaches to the detection of this disease. One of the most effective of these approaches is the detection of COVID-19 disease using chest X-Ray images. In this paper, an intelligent system was proposed to classify normal, pneumonia patients and COVID-19 patients using chest X-Ray images. The proposed system was composed of four stage. At first, all images in the dataset were pre-processed. Then for the feature extraction uniform Local Binary Pattern (LBP) and DenseNet201 deep learning models were used. Particle swarm optimization (PSO) algorithm was used to select effective features. The determined effective features were classified by support vector machine (SVM). Accuracy and AUC parameters were used as performance criteria. Evaluated accuracy and AUC values were 99.9%, 1.00, respectively. The dataset and proposed model codes are made publicly available at: https://github.com/mfatiho/covid-detection-chest-xray",
        "link": "http://dx.doi.org/10.53070/bbd.1172671"
    },
    {
        "id": 499,
        "title": "Application of least squares support vector machines in medium-term load forecasting",
        "authors": "Mohammadreza Afshin",
        "published": "No Date",
        "citations": 0,
        "abstract": "Power load forecasting is essential in the task scheduling of every electricity production and distribution facility. In this project, we study the applications of modern artificial intelligence techniques in power load forecasting. We first investigate the application of principal component analysis (PCA) to least squares support vector machines (LS-SVM) in a week-ahead load forecasting problem.\n\nThen, we study a variety of tuning techniques for optimizing the least squares support vector machines' (LS-SVM) hyper-parameters. The construction of any effective and accurate LS-SVM model depends on carefully setting the associated hyper-parameters. Poplular optimization techniques including Genetic Algorithm (GA), Simulated Annealing (SA), Bayesian Evidence Framework and Cross Validation (CV) are applied to the target application and then compared for performance time, accuracy and computational cost.\n\nAnalysis of the experimental results proves that LS-SVM by feature extraction using PCA can achieve greater accuracy and faster speed than other models including LS-SVM without feature extraction and the popular feed forward neural network (FFNN). Also, it is observed that optimized LS-SVM by Bayesian Evidence Framework can achieve greater accuracy and faster speed than other techniques including LS-SVM tuned with genetic algorithm, simulated annealing and 10-fold cross validation.",
        "link": "http://dx.doi.org/10.32920/ryerson.14654613"
    },
    {
        "id": 500,
        "title": "Support Vector Machines",
        "authors": "Harry G. Perros",
        "published": "2021-3-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003139041-11"
    }
]