[
    {
        "id": 2201,
        "title": "Predictive Analytics for Enterprise Innovation of Retail Energy Market Modeling of Integrated Demand Response and Energy Hubs",
        "authors": "Xiangdong Zhong, Yongjie Wang, Reza Khorramnia",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "Many combined heat and power (CHP) energy hubs work within the following heat load mode in the wintertime to supply the request for heat, and renewable energy has been often restricted in the unified energy network (UEN) markets. The power Internet of Things (PIoTs) has enabled UEN to transmit data increasingly frequently. As a result of flexible connections among various UEN networks, renewable energy increases its accommodation capacity considerably. Thus, the purpose of the study is to optimize UEN within the backdrop of PIoTs. According to the impact of PIoTs on UEN, this paper develops the combined demand response (DR) process and the layout of the important parts of UEN. Afterward, this study develops a bi-level economic dispatching process based on the cyber-physical systems of PIoTs and UEN. In the dispatching process, the higher level optimizes the total UEN function; the lower level optimizes the demand-side equipment output and combined DR. Then, the gray wolf optimization scheme is used to solve the bi-level dispatch. Lastly, the standard UEN and the practical network have been used to verify the efficiency of the suggested process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/systems11080432"
    },
    {
        "id": 2202,
        "title": "Retail analytics and firm profitability: How analytics can help retail companies be successful",
        "authors": "Faiyaad Chisis Mohammed",
        "published": "2023",
        "citations": 0,
        "abstract": "Objective: Literature suggests large data is a competitive advantage, and that features a firm 's general performance. With all the rise of big data (BD), e- commerce companies are making use of the resources to interact with much more with clients, provide much better items, moreover innovate far more to obtain a competitive edge. Nevertheless, past empirical studies show conflicting results. Design: Building on the capital based viewpoint as well as the firm 's inertia idea, we made a model to enjoy how BD as well as BD analytics capability influence innovation leads to e commerce companies. We completed a two year empirical investigation project to secure empirical data on 1703 data driven innovation duties from Asia and USA. Findings: We demonstrated that there's a tradeoff among BD as well as BD analytics capability, in that the maximum harmony of BD depends upon the quantity of BD analytics skill. BD analytics ability exerts a very good moderating impact, that's, the greater this capability is, the taller the outcome of BD on gross sales and margin growth. For U.S. development tasks, BD comes with an inverted U shaped connection with sales innovation. For Asian development responsibilities, when main details capital is very little, advertising big data analytics capability betters disgusting margin and sales innovation as much as a certain issue. Policy Implications: Establishing BD analytics capability with that time might stop development effectiveness. Our results provide instruction to e- commerce firms on creating strategic options regarding supply allocations for BD as well as BD analytics skill. Originality: A small investigation is performed to show the effect of utilizing BD analytics tools to push innovation. This's among the very first articles which dive into utilizing BD to foster development in the e-commerce industry.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14311/bit.2023.01.21"
    },
    {
        "id": 2203,
        "title": "Auditing state-owned enterprise through predictive analytics and function transformation",
        "authors": "Bo Zhou, Abu Bakkar Siddik, Zheng Guang-Wen",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "PurposeOne of the best ways to assist China is through infrastructure investment. China might become more resilient to natural calamities by pouring more money into its transport network. Analyzing the relationship between China's degree of planned expansion and the country's current network of transport hubs can help with city development estimates. A wide range of factors were taken into consideration while evaluating China's dominance and the caliber of its transportation infrastructure. Using a geographical autocorrelation model and a coupling coordination model, the dynamic link between China's adaptability and the caliber of its transportation infrastructure is examined.Design/methodology/approachChina's northwest is underdeveloped in comparison to the southeast, which has a high level of resilience and development of its transportation infrastructure. The relationship between the levels of resilience upheld by China's transport infrastructure is suggested to be coordinated.FindingsThe authors find a positive geographical autocorrelation between the degree of coupling coordination and the degree of agglomeration, despite the fact that the distance between cities increases with time. They now believe that there is a connection between an area's population density and the degree of interspousal cooperation within. The consequence is an improvement in both national security and economic prosperity. The facilities for disaster management and transportation in China have received several proposals for improvement.Practical implicationsThe authors' Practical Implications suggests that scale inefficiency is a major contributor to the relatively poor efficiency of China's primary inland river ports. Different types of inland river ports may have vastly different water system efficiencies. Input and output congestion at China's important interior river ports has reached 51%, making it very clear that massive amounts of valuable port resources are being wasted.Originality/valueMany variables, such as climate and human error, affect the total amount of goods that can be moved via inner river ports. Ports situated either higher up or lower down the same canal may perform better or worse, respectively, depending on the circumstances.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ijrdm-02-2023-0113"
    },
    {
        "id": 2204,
        "title": "The Impact of Data Analytics and Retail Metrices in Retail Industry: An Analytical Study",
        "authors": "",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/jcdr.2021.12.02.101"
    },
    {
        "id": 2205,
        "title": "A Case Study on HR Analytics Employee Attrition Using Predictive Analytics",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/eel.v13i5.828"
    },
    {
        "id": 2206,
        "title": "Towards the Creation of a Holistic Video Analytics Platform for Retail Environments",
        "authors": "Christian Daase, Daniel Staegemann, Anastasija Nikiforova, Victor Chang, Johannes Hintsch, Matthias Volk, Klaus Turowski",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012148600003552"
    },
    {
        "id": 2207,
        "title": "MMS Predictive Maintenance Big Data Analytics",
        "authors": "MD. Rakibul Islam Ratul",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.2023.4.4.34665"
    },
    {
        "id": 2208,
        "title": "An Exploration of Clustering Algorithms for Customer Segmentation in the UK Retail Market",
        "authors": "Jeen Mary John, Olamilekan Shobayo, Bayode Ogunleye",
        "published": "2023-10-12",
        "citations": 2,
        "abstract": "Recently, peoples’ awareness of online purchases has significantly risen. This has given rise to online retail platforms and the need for a better understanding of customer purchasing behaviour. Retail companies are pressed with the need to deal with a high volume of customer purchases, which requires sophisticated approaches to perform more accurate and efficient customer segmentation. Customer segmentation is a marketing analytical tool that aids customer-centric service and thus enhances profitability. In this paper, we aim to develop a customer segmentation model to improve decision-making processes in the retail market industry. To achieve this, we employed a UK-based online retail dataset obtained from the UCI machine learning repository. The retail dataset consists of 541,909 customer records and eight features. Our study adopted the RFM (recency, frequency, and monetary) framework to quantify customer values. Thereafter, we compared several state-of-the-art (SOTA) clustering algorithms, namely, K-means clustering, the Gaussian mixture model (GMM), density-based spatial clustering of applications with noise (DBSCAN), agglomerative clustering, and balanced iterative reducing and clustering using hierarchies (BIRCH). The results showed the GMM outperformed other approaches, with a Silhouette Score of 0.80.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/analytics2040042"
    },
    {
        "id": 2209,
        "title": "Harnessing Predictive Modeling and Software Analytics in the Age of LLM-Powered Software Development (Invited Talk)",
        "authors": "Foutse Khomh",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3617555.3634736"
    },
    {
        "id": 2210,
        "title": "Data analytics in retail: envisaging a machine learning-based design thinking approach",
        "authors": "Swapnil Morande, Kanwal Gul",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbda.2023.10059709"
    },
    {
        "id": 2211,
        "title": "Six Practical Recommendations Enabling Ethical Use of Predictive Learning Analytics in Distance Education",
        "authors": "Irina Rets, Christothea Herodotou, Anna Gillespie",
        "published": "2023-2-21",
        "citations": 3,
        "abstract": "The progressive move of higher education institutions (HEIs) towards blended and online environments, accelerated by COVID-19, and their access to a greater variety of student data has heightened the need for ethical learning analytics (LA). This need is particularly salient in light of a lack of comprehensive, evidence-based guidelines on ethics that address gaps voiced in LA ethics research. Studies on the topic are predominantly conceptual, representing mainly institutional rather than stakeholder views, with some areas of ethics remaining underexplored. In this paper, we address this need by using a case of four years of interdisciplinary research in developing the award-winning Early Alerts Indicators (EAI) dashboard at a distance learning university. Through a lens focused on ethical considerations and informed by the practical approach to ethics, we conducted a case study review, using 10 relevant publications that report on the development and implementation of the tool. Our six practical recommendations on how to ethically engage with LA can inform an ethical development of LA that not only protects student privacy, but also ensures that LA tools are used in ways that effectively support student learning and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18608/jla.2023.7743"
    },
    {
        "id": 2212,
        "title": "Predictive Analytics by Integrating Google Analytics and Pega AI",
        "authors": "Praveen kumar Tammana",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Purpose: This paper explores the transformative integration of Google Analytics and Pega AI in predictive analytics, highlighting its potential to revolutionize data-driven decision-making.\r\nMethodology: By harnessing Google Analytics' extensive user interaction data alongside Pega’s advanced AI algorithms, businesses can create predictive models with unprecedented accuracy.\r\nFindings: This integration facilitates enhanced customer behavior predictions, optimized marketing strategies, and improved operational efficiencies. Through real-world case studies, the paper evidences the successful application and significant impacts of this synergy.\r\nUnique Contributor to Theory, Policy and Practice: Ultimately, the integration of Google Analytics with Pega AI emerges as a pivotal advancement, offering businesses unparalleled insights and a competitive edge in today’s data-centric landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47941/jts.1704"
    },
    {
        "id": 2213,
        "title": "Reducing Hospital Readmission Risk Using Predictive Analytics",
        "authors": "Arti Mann, Ben Cleveland, Dan Bumblauskas, Shashidhar Kaparthi",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": " This study highlights the development and application of a predictive analytics system in a Midwestern hospital to assess and manage the risk of patient readmissions within 30 days of discharge. By integrating advanced analytical modeling with electronic health records, the system enables the creation of personalized care plans by accurately predicting patients' readmission risks and the optimal timing for interventions. The results suggest that such models can significantly improve resource allocation and the personalization of care plans, thereby reducing unnecessary readmissions and aligning with value-based, patient-centered healthcare goals. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1287/inte.2022.0086"
    },
    {
        "id": 2214,
        "title": "Ensemble Learning Approaches for Improved Predictive Analytics in Healthcare",
        "authors": "Venugopal. Y. R, Dr. Srikanth V",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0629"
    },
    {
        "id": 2215,
        "title": "AI-DRIVEN PREDICTIVE ANALYTICS IN RETAIL: A REVIEW OF EMERGING TRENDS AND CUSTOMER ENGAGEMENT STRATEGIES",
        "authors": " David Iyanuoluwa Ajiga,  Ndubuisi Leonard Ndubuisi,  Onyeka Franca Asuzu,  Oluwaseyi Rita Owolabi,  Tula Sunday Tubokirifuruar,  Rhoda Adura Adeleye",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "As the retail landscape undergoes a profound transformation in the era of digitalization, the integration of Artificial Intelligence (AI) and predictive analytics has emerged as a pivotal force reshaping the industry. This paper provides a comprehensive review of the latest trends in AI-driven predictive analytics within the retail sector and explores innovative customer engagement strategies that leverage these advanced technologies. The review begins by elucidating the foundational concepts of AI and predictive analytics, highlighting their synergistic role in forecasting consumer behavior, demand patterns, and market trends. The paper then delves into the emerging trends, such as machine learning algorithms, natural language processing, and computer vision, that are revolutionizing the way retailers harness data for strategic decision-making. In addition to outlining technological advancements, the paper emphasizes the crucial role of data quality and ethical considerations in the implementation of AI-driven predictive analytics. It examines the challenges associated with privacy concerns, algorithmic bias, and the need for transparent AI models to ensure responsible and fair use of customer data. Furthermore, the paper explores a spectrum of customer engagement strategies enabled by AI-driven predictive analytics. From personalized shopping experiences and targeted marketing campaigns to dynamic pricing and inventory optimization, retailers are deploying innovative approaches to enhance customer satisfaction and loyalty. The review also discusses case studies of successful AI implementations in leading retail enterprises, showcasing tangible benefits such as improved operational efficiency, increased sales, and enhanced customer retention. These real-world examples illustrate the transformative impact of AI-driven predictive analytics on diverse aspects of the retail value chain. By examining emerging trends and customer engagement strategies, it serves as a valuable resource for industry professionals, researchers, and policymakers seeking to navigate the evolving landscape of AI in the retail sector.\r\nKeywords: AI-driven Predictive Analytics, Retail Industry, Customer Engagement Strategies, Machine Learning Algorithms, Natural Language Processing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51594/ijmer.v6i2.772"
    },
    {
        "id": 2216,
        "title": "Dissecting interRAI Instrument Data Using Visual and Predictive Analytics",
        "authors": "Waqar Haque, Shannon Freeman, Piper Jackson",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011719100003476"
    },
    {
        "id": 2217,
        "title": "Term I Project ‐Predictive Analytics",
        "authors": "Adela Ray",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4680427"
    },
    {
        "id": 2218,
        "title": "Role of Business Analytics in Effective CRM Implementation in Retail Sector: A Cross Sectional Research",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jier.v3i2.224"
    },
    {
        "id": 2219,
        "title": "Business intelligence for Industry 4.0: predictive models for retail and distribution",
        "authors": "Zurong Chen, Jia Zhao, Chen Jin",
        "published": "2023-6-6",
        "citations": 1,
        "abstract": "Purpose Textile and contemporary apparel manufacturers are adopting and integrating cutting-edge technologies to reduce their impact on the environment and gain an advantage in the marketplace. Most previous studies have ignored business intelligence systems (BIS), notably in the textile and apparel industry (T&A), in favor of looking at the larger picture of how big data would affect retail and distribution in a company. This is especially true for the T&As.Design/methodology/approach The authors report that they conducted 14 semi-structured interviews with 12 international luxury tourism service providers. In this case, researchers use snowball features and systematic techniques to select participants. A qualitative content analysis strategy is used to capture the focus of the interviews.Findings Problems with T&A company sustainability, opportunities to increase value creation via use of industry-leading business intelligence (BI) solutions and perceived roadblocks to BIS adoption were all found by the poll. Garment retail and distribution sector has benefited greatly from the increased use of Industry 4.0 technologies, especially those that provide better BI solutions. Determine the extent to which industry participation slows down or speeds up the process. The Company Information System (BIS) will help convince non-tech-savvy business owners of the financial, economic and environmental benefits of adopting certain technologies developed as part of the industry 4.0 movement.Research limitations/implications The authors of this research claim theirs is one of the first to investigate what variables affect the uptake of BIS, ultimately hoping to find out how BIS may be used by T&A businesses to tackle environmental issues through the use of Industry 4.0 technologies. The purpose of this study was to see whether BIS might aid T&A firms with their sustainability issues.Practical implications In the last several years, there has been a meteoric rise in interest in big data and business analytics among firms and educational institutions alike. This paper tries to introduce readers to the concept of business analytics in a way that is both academic and accessible, considering both the present and future of the field. This paper begins with a quick introduction, followed by a summary of the three distinct forms of predictive modeling discussed.Originality/value In an effort to help aspiring analytics professionals, they have identified, categorized and evaluated the nine distinct players that are now active in the analytics market. Following this, they will provide a high-level summary of the many different research projects currently being worked on by their group.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/ijrdm-02-2023-0101"
    },
    {
        "id": 2220,
        "title": "A Gaussian process regression machine learning model for forecasting retail property prices with Bayesian optimizations and cross-validation",
        "authors": "Xiaojie Xu, Yun Zhang",
        "published": "2023-9",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100267"
    },
    {
        "id": 2221,
        "title": "A predictive analytics model for designing deep underground foundations using artificial neural networks",
        "authors": "Atsou Komla Herve Agbemenou, Ramin Motamed, Amir Talaei-Khoei",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100220"
    },
    {
        "id": 2222,
        "title": "A predictive analytics model for forecasting outcomes in the National Football League games using decision tree and logistic regression",
        "authors": "Matt Gifford, Tuncay Bayrak",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100296"
    },
    {
        "id": 2223,
        "title": "A Comparative Study of Data Mining Techniques for Predictive Analytics",
        "authors": "",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2019.17.03.2014"
    },
    {
        "id": 2224,
        "title": "Grundlagenliteratur zu Predictive Analytics im Forecasting",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15358/0935-0381-2023-4-80"
    },
    {
        "id": 2225,
        "title": "NGL Operation Strategy Using Predictive Analytics",
        "authors": "Abdulaziz Qurashi",
        "published": "2023-3-7",
        "citations": 0,
        "abstract": "Abstract\nOil & Gas is a data-rich industry which is prime for data-driven and decision making. The significant growth witnessed in the digital transformation field and the new era of the industrial revolution 4 (IR 4.0), is a direct result of the need within the industry to utilize the large amount of data to make better decisions, improve operation strategy, plan better for preventive maintenance (PM), and process improvement.\nThe uncertainty associated with estimating the incoming feed gas rate to NGL plants has resulted in deviation from optimal compressor recycle rate, missed opportunities of meeting planned PM and imposed urgency during operation. Utilizing machine learning algorithms, namely regression and decision tree model, the incoming feed gas can be predicted which result in the machine learning algorithms which results in the identification of the optimum number of running trains and recycle rate required for efficient operation.\nNGL-Operation Planner (NGL-OP) is the outcome of utilizing ML algorithms which provides the ability of predicting incoming feed gas, identifying optimum number of running trains required as well as estimating the optimal recycle rate. Adopting this approach is a new and strategical way to plan NGL operation. The developed tool also has the ability to advise whether to shut down, maintain existing operation or starting-up a new train.\nThe implementation of the model resulted in a significant improvement in NGL operation. The improvement includes fuel gas consumption reduction of around 449 MMSCF/Year which resulted in a significant cost saving, reduction in emissions around 27 M tons/year, and 10% reduction in operating unnecessary running trains. These savings have been achieved through the utilization of the NGL-OP to minimize uncertainty and improve our planning strategy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/213290-ms"
    },
    {
        "id": 2226,
        "title": "Predictive analytics for business",
        "authors": "",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/ijfans/v11/iss7/333"
    },
    {
        "id": 2227,
        "title": "An investigation of the COVID-19 impact on liver cancer using exploratory and predictive analytics",
        "authors": "Victor Chang, Rameshwari Mukeshkumar Patel, Meghana Ashok Ganatra, Qianwen Ariel Xu",
        "published": "2024-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100309"
    },
    {
        "id": 2228,
        "title": "SHAPING THE FUTURE OF BUSINESS MARKETING: UNVEILING THE POTENTIAL OF PREDICTIVE ANALYTICS AND PREDICTIVE INTELLIGENCE",
        "authors": "",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46344"
    },
    {
        "id": 2229,
        "title": "A machine learning framework for predicting weather impact on retail sales",
        "authors": "H. Chan, M.I.M. Wahab",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.sca.2024.100058"
    },
    {
        "id": 2230,
        "title": "The role of artificial intelligence and predictive analytics in social audio and broader behavioral research",
        "authors": "Renee Garett, Sean D. Young",
        "published": "2023-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100187"
    },
    {
        "id": 2231,
        "title": "A predictive analytics model for crop suitability and productivity with tree-based ensemble learning",
        "authors": "Isaac Kofi Nti, Adib Zaman, Owusu Nyarko-Boateng, Adebayo Felix Adekoya, Frimpong Keyeremeh",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100311"
    },
    {
        "id": 2232,
        "title": "An integration of intelligent approaches and economic criteria for predictive analytics of occupational accidents",
        "authors": "Kamran Gholamizadeh, Esmaeil Zarei, Mohammad Yazdi, Matilde A. Rodrigues, Nasrin shirmohammadi-Khorram, Iraj Mohammadfam",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100357"
    },
    {
        "id": 2233,
        "title": "Data Mining and Predictive Analytics for Injection Molding: An Analysis",
        "authors": "Rani Kumari,  , Kavita Saini",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i45.2567"
    },
    {
        "id": 2234,
        "title": "Subjective Responses to Retail Analytics: Applying AI + Mind Genomics to Thinking about Everyday Issues",
        "authors": "",
        "published": "2023-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31038/psyj.2023551"
    },
    {
        "id": 2235,
        "title": "Consumer retail industry and profitability: The role of analytics",
        "authors": "Kristina Candance Rogermann, Abdel Al Shahtelab",
        "published": "2023",
        "citations": 0,
        "abstract": "As the retail industry gets extensively competitive, the ability to optimize business processes while gratifying customer expectations has never been more essential. Consequently, managing and channelizing info to work to client delight & generate whole revenue is crucial to survive prosperously. In the circumstance of big show players globally and in America, info or perhaps rather big data analytics is now used for every phase of the show progression, tracking emerging items which are common, forecasting potential sales and demand through predictive simulation, optimizing product placements and offers by customer heat mapping, and several others. Alongside this specific, determining the customers are extremely prone to be sharp on certain merchandise sorts based on their prior actions, working out the easiest technique to target them through certain marketing initiatives, and finally working out what to advertise them following will be the point that forms the middle of data analytics. This particular statement will be the product of a descriptive exploration of yesteryear, present and future of the retail industry, and the application of business analytics in shaping suitable marketing methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14311/bit.2023.01.17"
    },
    {
        "id": 2236,
        "title": "Deploying predictive analytics to enhance patient agility and patient value in hospitals: A position paper and research proposal",
        "authors": "Damien S.E. Broekharst, Rogier van de Wetering, Ward Ooms, Remko W. Helms, Nadine Roijakkers",
        "published": "2023-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100141"
    },
    {
        "id": 2237,
        "title": "A predictive approach for myocardial infarction risk assessment using machine learning and big clinical data",
        "authors": "Imen Boudali, Sarra Chebaane, Yassine Zitouni",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100319"
    },
    {
        "id": 2238,
        "title": "Coding Over the Cracks: Predictive Analytics and Child Protection",
        "authors": "Stephanie Glaberson",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4448913"
    },
    {
        "id": 2239,
        "title": "Predicting Consumer In-Store Purchase Using Real-Time Retail Video Analytics",
        "authors": "Rubing Li, Anindya Ghose, Kaiquan Xu, Beibei Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4513385"
    },
    {
        "id": 2240,
        "title": "Predictive Learning Analytics and University Teachers: Usage and perceptions three years post implementation",
        "authors": "Christothea Herodotou, Claire Maguire, Martin Hlosta, Paul Mulholland",
        "published": "2023-3-13",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3576050.3576061"
    },
    {
        "id": 2241,
        "title": "Serious Game Analytics by Design: Feature Generation and Selection Using Game Telemetry and Game Metrics",
        "authors": "Wenyi Lu, Joe Griffin, Troy D. Sadler, James Laffey, Sean P. Goggins",
        "published": "2023-3-5",
        "citations": 1,
        "abstract": "The construction of prediction models reflecting players’ learning performance in serious games currently faces various challenges for learning analytics. In this study, we design, implement, and field test a learning analytics system for a serious game, advancing the field by explicitly showing which in-game features correspond to differences in learner performance. We then deploy and test a system that provides instructors with clear signals regarding student learning and progress in the game, which instructors could depend upon for interventions. Within the study, we examined, coded, and filtered a substantial gameplay corpus, determining expertise in the game. Mission HydroSci (MHS) is a serious game that teaches middle-school students water science. Using our logging system, designed and implemented along with game design and development, we captured around 60 in-game features from the gameplay of 373 students who completed Unit 3 of MHS in its first field test. We tested eight hypotheses during the field test and presented this paper’s results to participating teachers. Our findings reveal several features with statistical significance that will be critical for creating a validated prediction model. We discuss how this work will help future research establish a framework for designing analytics systems for serious games and advancing gaming design and analytics theory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18608/jla.2023.7681"
    },
    {
        "id": 2242,
        "title": "PREDICTIVE MODELING AND ANALYTICS OF EDUCATIONAL DATABASES",
        "authors": "Dunja Višnjić, Maja Cerjan, Dijana Oreški",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/edulearn.2023.0821"
    },
    {
        "id": 2243,
        "title": "A predictive maintenance model using Long Short-Term Memory Neural Networks and Bayesian inference",
        "authors": "Davide Pagano",
        "published": "2023-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2023.100174"
    },
    {
        "id": 2244,
        "title": "Retail Store Analytics Using Facial Recognition",
        "authors": "Nishant Sawant, Akansha Rai, Saiprasad Parab, Bansi Ghanva",
        "published": "2023-4-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46335/ijies.2023.8.3.1"
    },
    {
        "id": 2245,
        "title": "AI-Driven Predictive Analytics for Financial Decision Making and Fraud Detection in Financial Institutions",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jier.v4i1.697"
    },
    {
        "id": 2246,
        "title": "Predictive analytics for project management",
        "authors": "Florian Schützko, Holger Timinger",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ice/itmc58018.2023.10332400"
    },
    {
        "id": 2247,
        "title": "Inferential Survey on Oncology Information Systems Using Predictive Analytics",
        "authors": "Kirtida Naik, Bindu Garg",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4752572"
    },
    {
        "id": 2248,
        "title": "Predictive Analytics im Rahmen von Cash Forecasting",
        "authors": "Carsten Jäkel, Jan Muntermann",
        "published": "2023",
        "citations": 0,
        "abstract": "Im Rahmen der Liquiditätsplanung stellt das Cash Forecasting hohe Anforderungen an Datenverfügbarkeit und -verarbeitung, was auch in Abhängigkeit von der gewünschten Prognosegüte mit einem hohen manuellen Aufwand verbunden ist. Dieser Beitrag beschäftigt sich mit den zu schaffenden organisationalen und technischen Voraussetzungen sowie mit den methodischen und theoretischen Grundlagen des Predictive-Analytics-Einsatzes in diesem Kontext.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15358/0935-0381-2023-4-4"
    },
    {
        "id": 2249,
        "title": "Bayesian hierarchical modelling of sparse count processes in retail analytics",
        "authors": "James Pitkin, Ioanna Manolopoulou, Gordon Ross",
        "published": "2024-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1214/23-aoas1811"
    },
    {
        "id": 2250,
        "title": "Predictive Analytics for Energy Forecasting and Optimization",
        "authors": "Kirti Baliyan, Priyanka Ahlawat",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aic57670.2023.10263838"
    },
    {
        "id": 2251,
        "title": "An XAI Approach to Predictive Analytics of Pancreatic Cancer",
        "authors": "Srinidhi B, M S Bhargavi",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icit58056.2023.10225991"
    },
    {
        "id": 2252,
        "title": "EXPRESS: Retail Platform Analytics: Practice, Literature, and Future Research",
        "authors": "Meng Li, Tao Li, Lili Yu",
        "published": "2024-3-5",
        "citations": 0,
        "abstract": " The explosive growth of retail platforms over the past decade has resulted in a significant amount of customer and seller data that can be leveraged for advanced business analytics. As a result, the management of retail platforms with business analytics capabilities has garnered increased attention in the field of operations management. Despite the recognition of the importance of business analytics techniques for retail platforms, a systematic study of their operations is lacking in the literature. Based on our observations of the industrial practice and understanding of the academic literature, we attempt to address this gap by proposing a framework that broadly categorizes retail platform management into three key themes: demand-side management, supply-side management, and matching. For each theme, we identify critical topics, discuss the current practices of platforms, and review relevant literature. We also propose future research questions with directions for the initial modeling and solution strategy, together with applicable data sources and potential insights. At last, to facilitate future research, we provide a roadmap and datasets for further exploration of business analytics applications of retail platforms. Overall, this paper lays a strong foundation for researchers to delve deeper into the exciting and constantly evolving field of retail platform analytics. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/10591478241238972"
    },
    {
        "id": 2253,
        "title": "A predictive analytics model using machine learning algorithms to estimate the risk of shock development among dengue patients",
        "authors": "Jun Kit Chaw, Sook Hui Chaw, Chai Hoong Quah, Shafrida Sahrani, Mei Choo Ang, Yanfeng Zhao, Tin Tin Ting",
        "published": "2024-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100290"
    },
    {
        "id": 2254,
        "title": "Poverty and distribution of wealth in the USA-a descriptive and predictive analytics approach",
        "authors": "Sushil Sharma, Sajon Dhar, Saeed Tabar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbda.2023.10055790"
    },
    {
        "id": 2255,
        "title": "Modeling independent sales representative performance: application of predictive analytics in direct selling for improved outcomes",
        "authors": "Caroline Glackin, Murat Adivar",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1057/s41270-023-00236-4"
    },
    {
        "id": 2256,
        "title": "Predictive and Prescriptive Analytics in Identifying Opportunities for Improving Sustainable Manufacturing",
        "authors": "Marcin Relich",
        "published": "2023-5-7",
        "citations": 1,
        "abstract": "Environmental issues and sustainability performance are more and more significant in today’s business world. A growing number of manufacturing companies are searching for changes to improve their sustainability in the areas of products and manufacturing processes. These changes should be introduced in the design process and affect the whole product life cycle. This paper is concerned with developing a method based on predictive and prescriptive analytics to identify opportunities for increasing sustainable manufacturing through changes incorporated at the product design stage. Predictive analytics uses parametric models obtained from regression analysis and artificial neural networks in order to predict sustainability performance. In turn, prescriptive analytics refers to the identification of opportunities for improving sustainability performance in manufacturing, and it is based on a constraint programming implemented within a constraint satisfaction problem (CSP). The specification of sustainability performance in terms of a CSP provides a pertinent framework for identifying all admissible solutions (if there are any) of the considered problem. The identified opportunities for improving sustainability performance are dedicated to specialists in product development, and aim to reduce both resources used in manufacturing and negative effects on the environment. The applicability of the proposed method is illustrated through reducing the number of defective products in manufacturing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su15097667"
    },
    {
        "id": 2257,
        "title": "Beyond Predictive Learning Analytics Modelling and onto Explainable Artificial Intelligence with Prescriptive Analytics and ChatGPT",
        "authors": "Teo Susnjak",
        "published": "2023-6-22",
        "citations": 8,
        "abstract": "AbstractA significant body of recent research in the field of Learning Analytics has focused on leveraging machine learning approaches for predicting at-risk students in order to initiate timely interventions and thereby elevate retention and completion rates. The overarching feature of the majority of these research studies has been on the science of prediction only. The component of predictive analytics concerned with interpreting the internals of the models and explaining their predictions for individual cases to stakeholders has largely been neglected. Additionally, works that attempt to employ data-driven prescriptive analytics to automatically generate evidence-based remedial advice for at-risk learners are in their infancy. eXplainable AI is a field that has recently emerged providing cutting-edge tools which support transparent predictive analytics and techniques for generating tailored advice for at-risk students. This study proposes a novel framework that unifies both transparent machine learning as well as techniques for enabling prescriptive analytics, while integrating the latest advances in large language models for communicating the insights to learners. This work demonstrates a predictive modelling framework for identifying learners at risk of qualification non-completion based on a real-world dataset comprising $$\\sim $$\n∼\n7000 learners with their outcomes, covering 2018 - 2022. The study further demonstrates how predictive modelling can be augmented with prescriptive analytics on two case studies to generate human-readable prescriptive feedback for those who are at risk using ChatGPT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s40593-023-00336-3"
    },
    {
        "id": 2258,
        "title": "Predictive Analytics in Healthcare using Machine Learning",
        "authors": " Shruti, Naresh Kumar Trivedi",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306782"
    },
    {
        "id": 2259,
        "title": "Predictive Analytics for Real Estate During COVID-19 Pandemic",
        "authors": "Kanika Sood, Sijie Shang, Nima Nijad",
        "published": "2023-6-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiot58121.2023.10174563"
    },
    {
        "id": 2260,
        "title": "Poverty and distribution of wealth in the USA: a descriptive and predictive analytics approach",
        "authors": "Saeed Tabar, Sushil Sharma, Sajon Dhar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijbda.2023.133298"
    },
    {
        "id": 2261,
        "title": "Predictive Analytics for Stock and Demand Balance Using Deep Q-Learning Algorithm",
        "authors": "",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/datake.2023.010101"
    },
    {
        "id": 2262,
        "title": "Optimized Farming: Crop Recommendation System Using Predictive Analytics",
        "authors": "",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.0630.46"
    },
    {
        "id": 2263,
        "title": "PREDICTIVE ANALYTICS IN CARDIOLOGY:TOWARDS EARLY DETECTION OF HEART DISEASES",
        "authors": "",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets51397"
    },
    {
        "id": 2264,
        "title": "Exploring the plot patterns of the retail landscape: The case of the Helsinki Metropolitan area",
        "authors": "Hulusi Eren Efeoglu, Anssi Joutsiniemi, Skirmante Mozuriunaite",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": " This study examines the impact of the morphological characteristics of plots in the Helsinki Metropolitan Area (HMA) on the retail landscape, with a focus on understanding the ways in which the morphological characteristics potentially influence the distribution, agglomeration and diversity of retail businesses. Although frequently underestimated in contemporary placemaking practices, this research emphasizes the role of the dual nature of plots as an element of urban form and an element of control over the retail landscape of the city. In this sense, the role of the morphological characteristics of plots in shaping the retail landscape of the city was investigated. The compositional (size, frontage ratio) and configurational (integration, betweenness, frequency) features of the plot in the HMA ( n = 77,736) were measured. Thereafter an unsupervised two-step clustering method was applied to reveal the subtle morphological regions through plot patterns. Computational plot characterization with open data sets yielded six plot types having different morphological characteristics and geographic distribution patterns. The spatial capacities of each plot type for retail distribution, agglomeration and diversity were then analysed and compared. This research argues that the interrelationship of the dual nature of plot plays an important role in placemaking processes. The results suggest that the spatial capacity of plots to accommodate street-based retail clusters is improved with spatially integrated, fine-grained urban fabric with independent micro-businesses involving a diversity of uses and actors. The study argues that these spatial conditions might also increase retail resilience and contribute to the vitality and viability of the retail landscape. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/23998083231213695"
    },
    {
        "id": 2265,
        "title": "Advancements in Predictive Medicine: NLRP3 Inflammasome Inhibitors and AI-Driven Predictive Health Analytics",
        "authors": "Robert B. Kargbo",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acsmedchemlett.4c00056"
    },
    {
        "id": 2266,
        "title": "Explore the Application of Predictive Analytics and Machine Learning Algorithms in Identifying and Preventing Cyber Threats and Vulnerabilities within Computer Systems",
        "authors": "Ranadeep Reddy Palle",
        "published": "2023-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/es24101104007"
    },
    {
        "id": 2267,
        "title": "Application of Predictive Algorithms in Informational Learning",
        "authors": "Xue Han, Guanyu Hou",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdacai59742.2023.00101"
    },
    {
        "id": 2268,
        "title": "Artificial Intelligence Engineering for Predictive Analytics",
        "authors": "Sasitorn Issaro, Prachyanun Nilsook, Panita Wannapiroon",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ri2c60382.2023.10355979"
    },
    {
        "id": 2269,
        "title": "Centralized Predictive Analytics and Diagnostics Platform",
        "authors": "Fawaz Hanif, Ahmed S. Al Ameri, Ahmed Abdulla Al Zaabi",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "Abstract\nADNOC Onshore operates 11 oil and gas fields spans around 12,000 km2 concession areas across BAB, NEB, Bu Hasa and South East production assets and two export terminals in Jebel Dhanna and Fujairah. ADNOC Onshore also operates vast pipeline network through which oil is transported from the oil fields to export terminals.\nRotating equipment used in the oil and gas business are the heart of production and processing plants. Rotating equipment are used to mobilize oil and gas throughout the process units to achieve desired production targets. Therefore, maintaining the equipment's reliability with high availability is imperative. The rotating equipment needs to be maintained and operated in a manner that continuous oil/gas production is achieved.\nAny unwanted disruption with the equipment may result in issues like production and revenue loss, process safety concerns, environmental concerns, machine health and availability issues. Therefore, continuous condition monitoring and preventive maintenance of equipment is a key driver for minimizing abrupt equipment downtimes.\nDue to ongoing strategical initiatives of production sustainability and enhancement, the mandate on production critical rotating equipment availability is also growing. It became imperative to predict machine failures in advance to take proactive mitigative actions. ADNOC Onshore collaborated with parent company ADNOC Upstream to deploy machine learning based CPAD solution coupled with thermodynamics first principles, for major rotating equipment condition monitoring across ADNOC Onshore assets while capitalizing on IT-OT existing infrastructure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2118/216980-ms"
    },
    {
        "id": 2270,
        "title": "THE FORMATION OF MARKETING MECHANISMS FOR MANAGING BUSINESS DEVELOPMENT BASED ON PREDICTIVE ANALYTICS",
        "authors": "Yuriy GORODETSKIY",
        "published": "2023-7-13",
        "citations": 0,
        "abstract": "BACKGROUND AND OBJECTIVES. Improving the operation of a commercial enterprise is an integral task of a growing business. In modern conditions of rapid global technological growth, systems of analysis and statistics come out on top in terms of efficiency. The introduction of a business management system through marketing and predictive analysis will allow you to stand out in a competitive environment and make the company more sustainable and competitive. The solutions currently available cannot solve the emerging business problems. These software solutions are often complex, require large amounts of raw data, and end up producing questionable statistics that cannot be further applied. Therefore, the whole business is faced with the task of finding and implementing simple but really working methods of analyzing activities and managing the development of an enterprise.\r\nMETHODS. It is proposed to use a business management system through marketing and analytics. Changes in the hierarchy of the enterprise will allow to unite all structural divisions with a single link, which will help to coordinate and direct the entire business as a whole. The next qualitative change should be called the introduction of a predictive analytics system, which will allow making decisions accurately and on time. Particular importance should be attached to predictive analysis using the SALSA method. The simplicity and adaptability of this method of analysis will allow it to be implemented not only in large, but also in medium and small enterprises.\r\nFINDINGS. It is proposed to present the results of predictive analysis in a simple and understandable form to ensure clarity, comparability and the ability to quickly make the right strategic decisions. To improve the competitiveness of companies, it is proposed to change the structure of the business hierarchy and manage departments using statistical and analytical data obtained by the marketing department.\r\nCONCLUSION. Accurate data and strong interconnection of all departments in the company will be able to ensure stable operation, reduce costs, increase margins and competitiveness of the company. The introduction of a management system based on predictive analysis will help to avoid critical points in the work of the enterprise and respond in time to changes in the internal and external environment. High efficiency of work will help to enter new markets not only in Ukraine but also abroad.\r\nKEYWORDS: marketing; predictive analytics; business management; business efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30857/2415-3206.2022.1.6"
    },
    {
        "id": 2271,
        "title": "Predictive Analytics for Website User Behavior Analysis",
        "authors": "Pawan Vankhede, Sunil Kumar",
        "published": "2024-2-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sceecs61402.2024.10482298"
    },
    {
        "id": 2272,
        "title": "Customer Churn in Subscription Business Model—Predictive Analytics on Customer Churn",
        "authors": "Boyuan Zhang",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "There is a growing tendency for more companies to develop towards a subscription business model. Under such a trend, it is important to learn about the customer churn rate within the business, learn from it and adjust business strategies accordingly. This paper aims to predict customer churn rate in subscription business models using a variety of machine learning algorithms. Through comparing the results from the different algorithms, the best algorithms can be identified so that it provides an insight on which algorithm a subscription business should choose in order to predict customer churn most effectively. In this work, a total of 21 features and 9 algorithms are taken into account. Through a set of rigorous procedure including data preparation, feature engineering, feature selection, model building, and finally, model evaluation, three algorithms, namely Logistic Regression, Gradient Boosting (SMOTE) and Neural Network outperformed other 6 algorithms. The best performing algorithm being Logistic Regression with its 79.6% prediction accuracy, thus the conclusion that when subscription business predicts customer churn rate, Logistic Regression is the most preferable algorithm. During the process of feature engineering, SMOTE did not improve the model performance as it supposed to, so it is not recommended during the model building process.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v44i.4971"
    },
    {
        "id": 2273,
        "title": "Machine Learning-Based Predictive Analytics in Healthcare IoT",
        "authors": "Hariharan V, Sivaraman K",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceca58529.2023.10395465"
    },
    {
        "id": 2274,
        "title": "Reproducing Predictive Learning Analytics in CS1",
        "authors": "Denis Zhidkikh, Ville Heilala, Charlotte Van Petegem, Peter Dawyndt, Miitta Järvinen, Sami Viitanen, Bram De Wever, Bart Mesuere, Vesa Lappalainen, Lauri Kettunen, Raija Hämäläinen",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "Predictive learning analytics has been widely explored in educational research to improve student retention and academic success in an introductory programming course in computer science (CS1). General-purpose and interpretable dropout predictions still pose a challenge. Our study aims to reproduce and extend the data analysis of a privacy-first student pass–fail prediction approach proposed by Van Petegem and colleagues (2022) in a different CS1 course. Using student submission and self-report data, we investigated the reproducibility of the original approach, the effect of adding self-reports to the model, and the interpretability of the model features. The results showed that the original approach for student dropout prediction could be successfully reproduced in a different course context and that adding self-report data to the prediction model improved accuracy for the first four weeks. We also identified relevant features associated with dropout in the CS1 course, such as timely submission of tasks and iterative problem solving. When analyzing student behaviour, submission data and self-report data were found to complement each other. The results highlight the importance of transparency and generalizability in learning analytics and the need for future research to identify other factors beyond self-reported aptitude measures and student behaviour that can enhance dropout prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18608/jla.2024.7979"
    },
    {
        "id": 2275,
        "title": "A Review: Data Quality Problem in Predictive Analytics",
        "authors": "Heru Nugroho",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "As data size continues to grow, there has been a revolution in computational methods and statistics to process and analyze data into insight and knowledge. This change in the paradigm of analytical data from explicit to implicit raises the way to extract knowledge from data through a prospective approach to determine the value of new observations based on the structure of the relationship between input and output. Data preparation is a very important stage in predictive analytics. To run quality analytical data, data with good quality is needed in accordance with the criteria. Data quality plays an important role in strategic decision making and planning before the digital computer era. The main challenge faced is that raw data cannot be directly used for analysis. One problem that arises related to data quality is completeness. Missing data is one that often causes data to become incomplete. As a result, predictive analysis generated from these data becomes inaccurate. In this paper we will discuss the problems related to the quality of data in predictive analytics through a literature study from related research. In addition, challenges and directions that might occur in the predictive analytics domain with problems related to data quality will be presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25124/ijait.v7i02.5980"
    },
    {
        "id": 2276,
        "title": "Predictive Analytics in Marketing: Contribution to Marketing Performance",
        "authors": "Ali Muhajir",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "This systematic literature review explores predictive analytics in marketing decision making and its relationship to key concepts in consumer behavior prediction. Drawing on established theories and empirical studies, this study explores the influence of customer-based brand equity, brand attachment, self-concept, perceived value, and other variables on consumer purchasing behavior and intentions. Additionally, this study investigates the impact of social psychology theory, destination image, sustainability in marketing, and marketing practices that align with consumer values ​​on satisfaction, engagement, loyalty, and long-term relationships with brands. Apart from that, this study also tests the effectiveness of predictive marketing algorithms in improving marketing and sales performance. These findings emphasize the importance of integrating consumer-centric approaches and predictive analytics in forming successful marketing strategies and achieving desired results in today's competitive market landscape.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62207/0qan8b95"
    },
    {
        "id": 2277,
        "title": "Functioning of predictive analytics in business",
        "authors": "",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29119/1641-3466.2023.175.40"
    },
    {
        "id": 2278,
        "title": "An explainable predictive maintenance strategy for multi-fault diagnosis of rotating machines using multi-sensor data fusion",
        "authors": "Shreyas Gawde, Shruti Patil, Satish Kumar, Pooja Kamat, Ketan Kotecha",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dajour.2024.100425"
    },
    {
        "id": 2279,
        "title": "Data Visualization of Big Data for Predictive and Descriptive Analytics for Stroke, COVID-19, and Diabetes",
        "authors": "Richard S. Segall, Soichiro Takashashi",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "Visualization of big data is crucial for meaningful interpretations and especially for healthcare. Brief discussions are made for big data, background for healthcare, and recent work in big data analytics for healthcare. This research pertains to different levels of big data: 5,110 vs. 101,766 vs. 320,200 vs. 1 million data values. Data visualizations and predictive analytics are presented of big data for selected diseases of stroke with 5,110 data values, diabetes with 101,766 data values, and two COVID-19 studies: one with 320,200 data values and another with 1 million data values. Data visualizations are generated for these diseases with big data using Tableau. For stroke patients, an investigation was performed to determine how different living environments affect relationship between strokes. The data visualizations for diabetes showed impact of insulin use yielded reduced hospital stays. Data visualizations for COVID-19 provided temporal trends in confirmed cases, mortality, and recovery rates for 2020-2023. Conclusions and future directions of research are presented.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijbdah.331996"
    },
    {
        "id": 2280,
        "title": "Predictive assessment of Arcobacter butzleri in retail beef and mutton meat",
        "authors": "Nagham Kandeil",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21608/bvmj.2022.162989.1591"
    },
    {
        "id": 2281,
        "title": "Possibilities of Using Predictive Analytics in the Aviation Industry - Case Study",
        "authors": "Edina Jenčová, Iveta Vajdová, Jan Mackulin",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ntad61230.2023.10380137"
    },
    {
        "id": 2282,
        "title": "Predictive Analytics and Machine Learning for Real-Time Supply Chain Risk Mitigation and Agility",
        "authors": "Abeer Aljohani",
        "published": "2023-10-20",
        "citations": 3,
        "abstract": "Supply chain agility has become a key success factor for businesses trying to handle upheavals and uncertainty in today’s quickly changing business environment. Proactive risk reduction is essential for achieving this agility. To facilitate real-time risk prevention and improve agility, this research study proposes an innovative strategy that makes use of machine learning as well as predictive analytics approaches. Traditional supply chain risk management frequently uses post-event analysis as well as historical data, which restricts its ability to address real-time interruptions. This research, on the other hand, promotes a futuristic methodology that uses predictive analytics to foresee possible disruptions. Based on contextual and historical data, machine learning models can be trained to find patterns and correlations as well as anomalies that point to imminent dangers. Organizations can identify risks as they arise and take preventative measures by incorporating these models into a real-time monitoring system. This study examines numerous predictive analytics methods, showing how they can be used to spot supply chain risks. These methods include time series analysis and anomaly detection as well as natural language processing. Additionally, risk assessment models are continuously improved and optimized using machine learning algorithms, assuring their accuracy and adaptability in changing contexts. This research clarifies the symbiotic relationship among predictive analytics and machine learning as well as supply chain agility using a synthesis of theoretical discourse and practical evidence. Case studies from various sectors highlight the usefulness and advantages of the suggested strategy. The advantages of this novel technique include improved risk visibility and quicker response times as well as the capacity to quickly modify operations. The development of a holistic framework that incorporates predictive analytics and machine learning into risk management procedures, setting the path for real-time risk identification as well as mitigation, is one of the theoretical contributions. On the practical side, the case studies offered in this paper show the actual benefits as well as the adaptability of the proposed approach across a wide range of businesses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/su152015088"
    },
    {
        "id": 2283,
        "title": "(Invited) Predictive analytics for cryogenic CMOS in future quantum computing systems",
        "authors": "Rajiv V. Joshi, Sudipto Chakraborty",
        "published": "2023-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dac56929.2023.10247978"
    },
    {
        "id": 2284,
        "title": "Financial Analysis of Retail Brands Under the Framework of Harvard Analytics- Taking the Three Squirrels as an Example",
        "authors": "Yiwen Ding, Xinrui Liu",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "Against the backdrop of China's robust economic growth and elevated living standards, the evolution of leisure food consumption has gained momentum, marked by an elevated emphasis on quality and standards. This study employs the Harvard framework to scrutinize this phenomenon, expanding the conventional financial data analysis to encompass non-financial indicators from pertinent sectors. The research centers on a case study of \"Three Squirrels,\" a prominent leisure food brand. The findings reveal a promising trajectory for The Three Squirrels, characterized by stable and positive development. This analysis not only sheds light on the evolving consumption patterns in China's leisure food sector but also underscores the necessity of comprehensive analysis strategies incorporating both financial and non-financial perspectives to gain a holistic understanding of market dynamics and enterprise growth prospects",
        "keywords": "",
        "link": "http://dx.doi.org/10.54691/bcpbm.v49i.5467"
    },
    {
        "id": 2285,
        "title": "The SEC Does Not Have Statutory Authority To Adopt the Predictive Data Analytics Proposal",
        "authors": "Andrew N. Vollmer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4589415"
    },
    {
        "id": 2286,
        "title": "Interoperable Information Flow as Enabler for Efficient Predictive Maintenance",
        "authors": "Marco Franke, Quan Deng, Zisis Kyroudis, Maria Psarodimou, Jovana Milenkovic, Ioannis Meintanis, Dimitris Lokas, Stefano Borgia, Klaus-Dieter Thoben",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Industry 4.0 enables the modernisation of machines and opens up the digitalisation of processes in the manufacturing industry. As a result, these machines are ready for predictive maintenance as part of Industry 4.0 services. The benefit of predictive maintenance is that it can significantly extend the life of machines. The integration of predictive maintenance into existing production environments faces challenges in terms of data understanding and data preparation for machines and legacy systems. Current AI frameworks lack adequate support for the ongoing task of data integration. In this context, adequate support means that the data analyst does not need to know the technical background of the pilot’s data sources in terms of data formats and schemas. It should be possible to perform data analyses without knowing the characteristics of the pilot’s specific data sources. The aim is to achieve a seamless integration of data as information for predictive maintenance. For this purpose, the developed data-sharing infrastructure enables automatic data acquisition and data integration for AI frameworks using interoperability methods. The evaluation, based on two pilot projects, shows that the step of data understanding and data preparation for predictive maintenance is simplified and that the solution is applicable for new pilot projects.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/analytics3010006"
    },
    {
        "id": 2287,
        "title": "How can big data analytics improve outbound logistics in the UK retail sector? A qualitative study",
        "authors": "Mohammed Ali, Aniekan Essien",
        "published": "2023-7-4",
        "citations": 0,
        "abstract": "PurposeThe purpose of this study is to explore how big data analytics (BDA) as a potential information technology (IT) innovation can facilitate the retail logistics supply chain (SC) from the perspective of outbound logistics operations in the United Kingdom. The authors' goal was to better understand how BDA can be integrated to streamline SCs and logistical networks by using the technology, organisational and environmental model.Design/methodology/approachThe authors applied existing theoretical foundations for theory building based on semi-structured interviews with 15 SC and logistics managers.FindingsThe perceived benefits of using BDA in outbound retail logistics comprised the strongest predictor amongst technological, organisational and environmental issues, followed by top management support (TMS). A framework was proposed for the adoption of BDA in retail logistics. Contextual concepts from previous literature have helped us understand how environmental changes impact BDA decision-making, as such: (i) SC maturity levels and connectivity affect BDA utilisation, (ii) connected SCs improve data accessibility and information exchange, (iii) the benefits of BDAs also affect adoption and (iv) outsourcing complex tasks to experts allows companies to focus on core businesses instead of investing in IT infrastructure.Research limitations/implicationsOutside the key findings listed, this study shows that there is no one-size-fits-it-all approach for use within all organisational settings. The proposed framework reveals that the perceived benefit of BDA is non-transferrable and requires top-level management support for successful implementation.Originality/valueThe existing literature focusses on the approaches to applying BDA in SC and logistics but fails to present a deep dive into retail outbound logistics activity. This study addresses the “how” and proposes a social-inclusive framework for a technology-enabled topic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1108/jeim-08-2022-0282"
    },
    {
        "id": 2288,
        "title": "Risk Assessment Using Predictive Analytics",
        "authors": "Eid Mohammed Alotaibi",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "Purpose: This research paper uses design science methodology to develop and evaluate a predictive analytics model for audit risk assessment. This research therefore contributes to improving the accuracy and efficiency of audit risk assessment through predictive analytics.\n \nTheoretical framework: This study involved developing and evaluating a predictive analytics model for audit risk assessment, with it being tested during the audit of a publicly listed Saudi company.\n \nDesign/methodology/approach: This study adopted the design science research methodology, which is a problem-solving approach that involves the creation of innovative solutions to practical problems. This methodology is particularly relevant for developing and evaluating predictive analytics models for audit risk assessment, because it provides a structured, systematic approach to the problem-solving process. In the context of this research paper, the design science research methodology was used to develop and evaluate a predictive analytics model for audit risk assessment.\n \nFindings: The proposed predictive analytics model for audit risk assessment was found to be an effective tool for helping auditors to make informed decisions based on data analysis. The model accurately identifies high-risk factors associated with an organization, provides valuable insights for decision-making, and highlights areas of potential risk that may require further investigation.\n \nResearch, practical & social implications: Future research could explore several areas related to predictive analytics in audit risk assessment. One important area to investigate would be the impact of using predictive analytics on audit quality. The ethical implications of using predictive analytics in audit risk assessment and the potential biases that could affect a model’s accuracy are also important areas to explore.\n \nOriginality/value: This paper helps improve our understanding of how predictive analytics can be effectively applied to audit risk assessment and how design science methodology can be used to develop and evaluate predictive analytics models. Furthermore, this study provides insights about the effectiveness of predictive analytics for improving audit risk assessment, thus contributing to the existing literature on the topic.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26668/businessreview/2023.v8i5.1723"
    },
    {
        "id": 2289,
        "title": "EmoCityPulse: Revolutionizing Urban Well-being through Emotional Intelligence and Predictive Analytics",
        "authors": "Divya Rajachandran -, Deepa A -",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "In the world of smart cities, emocitypulse stands out for its innovative combination of predictive analytics and emotional/social data analysis in driving urban development. This groundbreaking framework aims to transform urban intelligence by acknowledging and dealing with the mental health of city dwellers, a factor typically disregarded in traditional smart city projects. It presents emocitypulse as a cutting-edge idea that surpasses conventional urban studies by integrating sentiment analysis and emotional cues into predictive analytics. Utilizing extensive data and sophisticated algorithms, emocitypulse seeks to gain a deep insight into city life, facilitating well-informed decision-making in key areas of urban growth. Primary goals of the project involve predicting population patterns, foreseeing obstacles, and cultivating compassionate and human-focused city spaces. Using a comprehensive research approach, the workshop delves into the complex relationship between technology, urban dynamics, and human emotions. It encourages attendees to imagine cities that are not just technologically advanced, but also emotionally intelligent, resilient, and sustainable. This provides an opportunity to examine how emotional data impacts urban planning and development, leading to discussions on the social-emotional aspects of city life. emocitypulse seeks to encourage new ideas in city design and management by exploring unexplored areas, with the goal of enhancing the creation of diverse, lively, and comfortable urban environments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i02.16585"
    },
    {
        "id": 2290,
        "title": "The benefits of smart4RES predictive analytics",
        "authors": "C. Martins, M. I. Marques, R. Bessa, F. Moaidi, S. Camal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.0849"
    },
    {
        "id": 2291,
        "title": "Smart ICU Bed Allocation System - SMARTS Predictive Analytics for Risk Profiling and Triaging COVID-19 Patients",
        "authors": "Sammy Ghansah",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4708104"
    },
    {
        "id": 2292,
        "title": "Unveiling Patterns and Insights in a Retail Dataset: A Data Analytics Approach",
        "authors": "Miss Sahrish Saifi Tandel",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "Abstract: Data analytics plays a crucial role in extracting valuable information from extensive sets of data, empowering companies to make informed choices based on data. This research paper presents a thorough examination of retail data collection using diverse data analytics approaches. The goal is to discover significant patterns, tendencies, and valuable insights that can enhance business strategies and enhance customer contentment. The paper outlines the characteristics of the data set, explores the employed data analytics techniques, showcases the outcomes, and emphasizes the consequences and potential uses of the discoveries.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.54897"
    },
    {
        "id": 2293,
        "title": "Long-term Impact Assessment of Disasters through Predictive Analytics",
        "authors": "S.K. Mishra, S. Rahamatkar",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Disaster is a significant problem that extensively affects society and the community. Predicting the effects of a disaster is difficult for several reasons. The primary aim of this study is to evaluate the effects of disasters across several timeframes, ranging from immediate to long-term. To construct a plausible model, the proposed solution considers the available disaster datasets from various agencies (e.g. SMS, ISC, NDMC etc.).  A methodology for assessing the long-term effects of disasters utilizing well-liked machine learning techniques is presented here. It consists of the algorithms for Decision Tree, Random Forest, Gradient Boost Decision Tree and XG Boost. The algorithms' classification accuracy for the provided data sets is 56%, 63%, 83% and 91% respectively. The proposed work also examines the various levels of disaster severity and suggests solutions for each level to improve preparedness and response measures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25303/173da08015"
    },
    {
        "id": 2294,
        "title": "A Generative Reinforcement Learning Framework for Predictive Analytics",
        "authors": "Erotokritos Skordilis, Ramin Moghaddass, Md Tanzin Farhat",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rams51473.2023.10088246"
    },
    {
        "id": 2295,
        "title": "Model Review: A PROMISEing Opportunity",
        "authors": "Tim Menzies",
        "published": "2023-12-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3617555.3617876"
    },
    {
        "id": 2296,
        "title": "Twitter-patter: how social media drives foot traffic to retail stores",
        "authors": "Thomas J. Weinandy, Kuanchin Chen, Susan Pozo, Michael J. Ryan",
        "published": "2023-2-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1057/s41270-023-00209-7"
    },
    {
        "id": 2297,
        "title": "Applying Predictive Analytics using Clickstream Data for Improving the Students Performance",
        "authors": "Nidhi Sharma -, Ritik Bhardwaj -",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "Student performance analysis is an essential aspect of educational institutions. In recent years, machine learning (ML) has emerged as a promising tool to analyze student performance. To predict learning abilities of students and prescribing them a personalized learning curriculum, it is necessary to estimate their behavior to know about their weaknesses, strengths and help institutions to improve enrollment and retention. If it is possible for the teachers to predict in advance and prescribe ways to the at-risk and dropout students, they can plan more effectively to help them. We are describing in this paper various intelligent tutoring systems with Educational Data Mining, Predictive Learning Analytics, prediction of at-risk students at an earlier basis and how this prediction task is done. Predictive Analytics can also offer insights to help students to make informed decisions about each individual student to improve outcomes by understanding what drives each student behavior and how much the institution can create intensional, specific plans that will positively impact students.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i05.7520"
    },
    {
        "id": 2298,
        "title": "Predictive Analytics and the Enhanced Strategic Role of Management Accountants",
        "authors": "Nilay A. Savla",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33516/maj.v58i9.93-95p"
    },
    {
        "id": 2299,
        "title": "Enhancing Business Performance: A Comprehensive Study of Sales and Distribution Analytics in Speciality Retail Sectors",
        "authors": "K. Kanagaraj, R. Venkatesh",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rmkmate59243.2023.10369436"
    },
    {
        "id": 2300,
        "title": "CONSUMER ANALYTICS TOWARD DEVELOPMENT OF CROSS-SELLING PRODUCTS AT RETAIL BANKING: AN APPROACH ON BIG DATA AT X-BANK",
        "authors": "To Phuc Nguyen Khuong",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/ap04.20230217"
    }
]