[
    {
        "id": 2001,
        "title": "Skin Lesion Classification and Detection Using Machine Learning Techniques: A Systematic Review",
        "authors": "Taye Girma Debelee",
        "published": "2023-10-7",
        "citations": 4,
        "abstract": "Skin lesions are essential for the early detection and management of a number of dermatological disorders. Learning-based methods for skin lesion analysis have drawn much attention lately because of improvements in computer vision and machine learning techniques. A review of the most-recent methods for skin lesion classification, segmentation, and detection is presented in this survey paper. The significance of skin lesion analysis in healthcare and the difficulties of physical inspection are discussed in this survey paper. The review of state-of-the-art papers targeting skin lesion classification is then covered in depth with the goal of correctly identifying the type of skin lesion from dermoscopic, macroscopic, and other lesion image formats. The contribution and limitations of various techniques used in the selected study papers, including deep learning architectures and conventional machine learning methods, are examined. The survey then looks into study papers focused on skin lesion segmentation and detection techniques that aimed to identify the precise borders of skin lesions and classify them accordingly. These techniques make it easier to conduct subsequent analyses and allow for precise measurements and quantitative evaluations. The survey paper discusses well-known segmentation algorithms, including deep-learning-based, graph-based, and region-based ones. The difficulties, datasets, and evaluation metrics particular to skin lesion segmentation are also discussed. Throughout the survey, notable datasets, benchmark challenges, and evaluation metrics relevant to skin lesion analysis are highlighted, providing a comprehensive overview of the field. The paper concludes with a summary of the major trends, challenges, and potential future directions in skin lesion classification, segmentation, and detection, aiming to inspire further advancements in this critical domain of dermatological research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13193147"
    },
    {
        "id": 2002,
        "title": "Epileptic Seizure Detection Using Machine Learning: Taxonomy, Opportunities, and Challenges",
        "authors": "Muhammad Shoaib Farooq, Aimen Zulfiqar, Shamyla Riaz",
        "published": "2023-3-10",
        "citations": 11,
        "abstract": "Epilepsy is a life-threatening neurological brain disorder that gives rise to recurrent unprovoked seizures. It occurs due to abnormal chemical changes in our brains. For many years, studies have been conducted to support the automatic diagnosis of epileptic seizures for clinicians’ ease. For that, several studies entail machine learning methods for early predicting epileptic seizures. Mainly, feature extraction methods have been used to extract the right features from the EEG data generated by the EEG machine. Then various machine learning classifiers are used for the classification process. This study provides a systematic literature review of the feature selection process and classification performance. This review was limited to finding the most used feature extraction methods and the classifiers used for accurate classification of normal to epileptic seizures. The existing literature was examined from well-known repositories such as MDPI, IEEE Xplore, Wiley, Elsevier, ACM, Springer link, and others. Furthermore, a taxonomy was created that recapitulates the state-of-the-art used solutions for this problem. We also studied the nature of different benchmark and unbiased datasets and gave a rigorous analysis of the working of classifiers. Finally, we concluded the research by presenting the gaps, challenges, and opportunities that can further help researchers predict epileptic seizures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061058"
    },
    {
        "id": 2003,
        "title": "Prediction of Heart Disease Based on Machine Learning Using Jellyfish Optimization Algorithm",
        "authors": "Ahmad Ayid Ahmad, Huseyin Polat",
        "published": "2023-7-17",
        "citations": 2,
        "abstract": "Heart disease is one of the most known and deadly diseases in the world, and many people lose their lives from this disease every year. Early detection of this disease is vital to save people’s lives. Machine Learning (ML), an artificial intelligence technology, is one of the most convenient, fastest, and low-cost ways to detect disease. In this study, we aim to obtain an ML model that can predict heart disease with the highest possible performance using the Cleveland heart disease dataset. The features in the dataset used to train the model and the selection of the ML algorithm have a significant impact on the performance of the model. To avoid overfitting (due to the curse of dimensionality) due to the large number of features in the Cleveland dataset, the dataset was reduced to a lower dimensional subspace using the Jellyfish optimization algorithm. The Jellyfish algorithm has a high convergence speed and is flexible to find the best features. The models obtained by training the feature-selected dataset with different ML algorithms were tested, and their performances were compared. The highest performance was obtained for the SVM classifier model trained on the dataset with the Jellyfish algorithm, with Sensitivity, Specificity, Accuracy, and Area Under Curve of 98.56%, 98.37%, 98.47%, and 94.48%, respectively. The results show that the combination of the Jellyfish optimization algorithm and SVM classifier has the highest performance for use in heart disease prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13142392"
    },
    {
        "id": 2004,
        "title": "Prediction of Coronary Artery Disease Using Machine Learning Techniques with Iris Analysis",
        "authors": "Ferdi Özbilgin, Çetin Kurnaz, Ertan Aydın",
        "published": "2023-3-13",
        "citations": 7,
        "abstract": "Coronary Artery Disease (CAD) occurs when the coronary vessels become hardened and narrowed, limiting blood flow to the heart muscles. It is the most common type of heart disease and has the highest mortality rate. Early diagnosis of CAD can prevent the disease from progressing and can make treatment easier. Optimal treatment, in addition to the early detection of CAD, can improve the prognosis for these patients. This study proposes a new method for non-invasive diagnosis of CAD using iris images. In this study, iridology, a method of analyzing the iris to diagnose health conditions, was combined with image processing techniques to detect the disease in a total of 198 volunteers, 94 with CAD and 104 without. The iris was transformed into a rectangular format using the integral differential operator and the rubber sheet methods, and the heart region was cropped according to the iris map. Features were extracted using wavelet transform, first-order statistical analysis, a Gray-Level Co-Occurrence Matrix (GLCM), and a Gray Level Run Length Matrix (GLRLM). The model’s performance was evaluated based on accuracy, sensitivity, specificity, precision, score, mean, and Area Under the Curve (AUC) metrics. The proposed model has a 93% accuracy rate for predicting CAD using the Support Vector Machine (SVM) classifier. With the proposed method, coronary artery disease can be preliminarily diagnosed by iris analysis without needing electrocardiography, echocardiography, and effort tests. Additionally, the proposed method can be easily used to support telediagnosis applications for coronary artery disease in integrated telemedicine systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061081"
    },
    {
        "id": 2005,
        "title": "Healthcare Diagnostics Service Using Federated Learning",
        "authors": "Kristen Pereira, Aman Parikh, Pranav Kumar, Kailas Devadkar",
        "published": "2023-1-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080053"
    },
    {
        "id": 2006,
        "title": "Enhancing Healthcare through Human-Robot Interaction using AI and Machine Learning",
        "authors": "Kumar Animesh, Dr. Srikanth V",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55248/gengpi.5.0324.0831"
    },
    {
        "id": 2007,
        "title": "Improving the Accuracy of Continuous Blood Glucose Measurement Using Personalized Calibration and Machine Learning",
        "authors": "Ranjita Kumari, Pradeep Kumar Anand, Jitae Shin",
        "published": "2023-7-27",
        "citations": 1,
        "abstract": "Despite tremendous developments in continuous blood glucose measurement (CBGM) sensors, they are still not accurate for all patients with diabetes. As glucose concentration in the blood is <1% of the total blood volume, it is challenging to accurately measure glucose levels in the interstitial fluid using CBGM sensors due to within-patient and between-patient variations. To address this issue, we developed a novel data-driven approach to accurately predict CBGM values using personalized calibration and machine learning. First, we scientifically divided measured blood glucose into smaller groups, namely, hypoglycemia (<80 mg/dL), nondiabetic (81–115 mg/dL), prediabetes (116–150 mg/dL), diabetes (151–181 mg/dL), severe diabetes (181–250 mg/dL), and critical diabetes (>250 mg/dL). Second, we separately trained each group using different machine learning models based on patients’ personalized parameters, such as physical activity, posture, heart rate, breath rate, skin temperature, and food intake. Lastly, we used multilayer perceptron (MLP) for the D1NAMO dataset (training to test ratio: 70:30) and grid search for hyperparameter optimization to predict accurate blood glucose concentrations. We successfully applied our proposed approach in nine patients with type 1 diabetes and observed that the mean absolute relative difference (MARD) decreased from 17.8% to 8.3%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13152514"
    },
    {
        "id": 2008,
        "title": "Online Doctor Consultation And Medical Dispenser In Healthcare Using Machine Learning",
        "authors": "",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/nq.2022.20.3.nq22959"
    },
    {
        "id": 2009,
        "title": "A comparative study of retrieval-based and generative-based chatbots using Deep Learning and Machine Learning",
        "authors": "Sumit Pandey, Srishti Sharma",
        "published": "2023-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100198"
    },
    {
        "id": 2010,
        "title": "Classification of optical coherence tomography images using deep machine learning methods",
        "authors": "Alexander Arzamastsev, Oleg Lvovitch Fabrikantov, Elena Valerievna Kulagina, Nataly Alexandrovna Zenkova",
        "published": "2024-3-11",
        "citations": 0,
        "abstract": "Backgraund. Optical coherence tomography (OCT) is a modern high-tech and informative method for detecting pathology of the retina and preretinal layers of the vitreous body. However, the description and interpretation of the research results require high qualifications and special training of an ophthalmologist, and significant time expenditure for the doctor and the patient. At the same time, the use of mathematical models based on artificial neural networks (ANN- models) currently makes it possible to automate many processes associated with image processing. Therefore, solving problems associated with automating the process of classifying OCT images based on ANN models is actual.\r\nAims. To develop architectures of mathematical (computer) models based on deep learning of convolutional neural networks (CNN) for classification of OCT images of the retina. To compare the results of computational experiments conducted using Python tools in the Google Colaboratory with single-model and multi-model approaches and evaluate classification accuracy. To make conclusions about the optimal architecture of ANN models and the values of the hyperparameters used.\r\nMaterials and methods. The original dataset, which was anonymized OCT images of real patients, included more than 2000 images obtained directly from the device in a resolution of 1920 × 969 × 24 BPP. The number of image classes is 12. To create the training and validation data sets, a subject area of 1100 × 550 × 24 BPP was “cut out.” Various approaches were studied: the possibility of using pretrained CNNs with transfer learning, techniques for resizing and augmenting images, as well as various combinations of hyperparameters of ANN-models. When compiling the model, the following parameters were used: Adam optimizer, categorical_crossentropy loss function, accuracy metric. All technological processes with images and ANN-models were carried out using Python language tools in Google Colaboratory.\r\nResults. Single-model and multi-model principles for classifying OCT images of the retina are proposed. Computational experiments on automated classification of such images obtained from a DRI OCT Triton 3D tomograph using various ANN model architectures showed an accuracy of 98-100% during training and validation and 85% during an additional test, which is a satisfactory result. The optimal architecture of the ANN model - a six-layer convolutional network - was selected and the values of its hyperparameters were determined.\r\nConclusions. The results of deep training of convolutional neural network models with various architectures, their validation and testing showed satisfactory classification accuracy of retinal OCT images. These developments can be used in decision support systems in the field of ophthalmology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17816/dd623801"
    },
    {
        "id": 2011,
        "title": "Unlocking Precision Medicine for Prognosis of Chronic Kidney Disease Using Machine Learning",
        "authors": "Yogita Dubey, Pranav Mange, Yash Barapatre, Bhargav Sable, Prachi Palsodkar, Roshan Umate",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "Chronic kidney disease (CKD) is a significant global health challenge that requires timely detection and accurate prognosis for effective treatment and management. The application of machine learning (ML) algorithms for CKD detection and prediction holds promising potential for improving patient outcomes. By incorporating key features which contribute to CKD, these algorithms enhance our ability to identify high-risk individuals and initiate timely interventions. This research highlights the importance of leveraging machine learning techniques to augment existing medical knowledge and improve the identification and management of kidney disease. In this paper, we explore the utilization of diverse ML algorithms, including gradient boost (GB), decision tree (DT), K-nearest neighbor (KNN), random forest (RF), histogram boost (HB), and XGBoost (XGB) to detect and predict chronic kidney disease (CKD). The aim is to improve early detection and prognosis, enhancing patient outcomes and reducing the burden on healthcare systems. We evaluated the performance of the ML algorithms using key metrics like accuracy, precision, recall, and F1 score. Additionally, we conducted feature significance analysis to identify the most influential characteristics in the detection and prediction of kidney disease. The dataset used for training and evaluation contained various clinical and demographic attributes of patients, including serum creatinine level, blood pressure, and age, among others. The proficiency analysis of the ML algorithms revealed consistent predictors across all models, with serum creatinine level, blood pressure, and age emerging as particularly effective in identifying individuals at risk of kidney disease. These findings align with established medical knowledge and emphasize the pivotal role of these attributes in early detection and prognosis. In conclusion, our study demonstrates the effectiveness of diverse machine learning algorithms in detecting and predicting kidney disease. The identification of influential predictors, such as serum creatinine level, blood pressure, and age, underscores their significance in early detection and prognosis. By leveraging machine learning techniques, we can enhance the accuracy and efficiency of kidney disease diagnosis and treatment, ultimately improving patient outcomes and healthcare system effectiveness.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13193151"
    },
    {
        "id": 2012,
        "title": "Retracted: A Novel Diabetes Healthcare Disease Prediction Framework Using Machine Learning Techniques",
        "authors": "",
        "published": "2023-5-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9872970"
    },
    {
        "id": 2013,
        "title": "Systematic Review for Risks of Pressure Injury and Prediction Models Using Machine Learning Algorithms",
        "authors": "Eba’a Dasan Barghouthi, Amani Yousef Owda, Mohammad Asia, Majdi Owda",
        "published": "2023-8-23",
        "citations": 2,
        "abstract": "Pressure injuries are increasing worldwide, and there has been no significant improvement in preventing them. This study is aimed at reviewing and evaluating the studies related to the prediction model to identify the risks of pressure injuries in adult hospitalized patients using machine learning algorithms. In addition, it provides evidence that the prediction models identified the risks of pressure injuries earlier. The systematic review has been utilized to review the articles that discussed constructing a prediction model of pressure injuries using machine learning in hospitalized adult patients. The search was conducted in the databases Cumulative Index to Nursing and Allied Health Literature (CINAHIL), PubMed, Science Direct, the Institute of Electrical and Electronics Engineers (IEEE), Cochrane, and Google Scholar. The inclusion criteria included studies constructing a prediction model for adult hospitalized patients. Twenty-seven articles were included in the study. The defects in the current method of identifying risks of pressure injury led health scientists and nursing leaders to look for a new methodology that helps identify all risk factors and predict pressure injury earlier, before the skin changes or harms the patients. The paper critically analyzes the current prediction models and guides future directions and motivations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13172739"
    },
    {
        "id": 2014,
        "title": "Crohn’s Disease Prediction Using Sequence Based Machine Learning Analysis of Human Microbiome",
        "authors": "Metehan Unal, Erkan Bostanci, Ceren Ozkul, Koray Acici, Tunc Asuroglu, Mehmet Serdar Guzel",
        "published": "2023-9-1",
        "citations": 1,
        "abstract": "Human microbiota refers to the trillions of microorganisms that inhabit our bodies and have been discovered to have a substantial impact on human health and disease. By sampling the microbiota, it is possible to generate massive quantities of data for analysis using Machine Learning algorithms. In this study, we employed several modern Machine Learning techniques to predict Inflammatory Bowel Disease using raw sequence data. The dataset was obtained from NCBI preprocessed graph representations and converted into a structured form. Seven well-known Machine Learning frameworks, including Random Forest, Support Vector Machines, Extreme Gradient Boosting, Light Gradient Boosting Machine, Gaussian Naïve Bayes, Logistic Regression, and k-Nearest Neighbor, were used. Grid Search was employed for hyperparameter optimization. The performance of the Machine Learning models was evaluated using various metrics such as accuracy, precision, fscore, kappa, and area under the receiver operating characteristic curve. Additionally, Mc Nemar’s test was conducted to assess the statistical significance of the experiment. The data was constructed using k-mer lengths of 3, 4 and 5. The Light Gradient Boosting Machine model overperformed over other models with 67.24%, 74.63% and 76.47% accuracy for k-mer lengths of 3, 4 and 5, respectively. The LightGBM model also demonstrated the best performance in each metric. The study showed promising results predicting disease from raw sequence data. Finally, Mc Nemar’s test results found statistically significant differences between different Machine Learning approaches.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13172835"
    },
    {
        "id": 2015,
        "title": "Quantitative Forecasting of Malaria Parasite Using Machine Learning Models: MLR, ANN, ANFIS and Random Forest",
        "authors": "Dilber Uzun Ozsahin, Basil Barth Duwa, Ilker Ozsahin, Berna Uzun",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "Malaria continues to be a major barrier to socioeconomic development in Africa, where its death rate is over 90%. The predictive power of many machine learning models—such as multi-linear regression (MLR), artificial neural networks (ANN), adaptive neuro-fuzzy inference systems (ANFISs) and Random Forest classifier—is investigated in this study using data from 2207 patients. The dataset was reduced from the initial dataset of thirty-two criteria samples to fifteen. Assessment measures such as the root mean square error (RMSE), mean square error (MSE), coefficient of determination (R2), and adjusted correlation coefficient R were used. ANFIS, Random Forest, MLR, and ANN are among the models. After training, ANN outperforms ANFIS (97%), MLR (92%), and Random Forest (68%) with the greatest R (99%) and R2 (99%), respectively. The testing stage confirms the superiority of ANN. The paper also presents a statistical forecasting sheet with few errors and excellent accuracy for MLR models. When the models are assessed with Random Forest, the latter shows the least results, thus broadening the modeling techniques and offering significant insights into the prediction of malaria and healthcare decision making. The outcomes of using machine learning models for precise and efficient illness prediction add to an expanding body of knowledge, assisting healthcare systems in making better decisions and allocating resources more effectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics14040385"
    },
    {
        "id": 2016,
        "title": "Smart HealthCare Consultation Using Machine Learning",
        "authors": "",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49833"
    },
    {
        "id": 2017,
        "title": "Fusion of Machine Learning and Threshold-Based Approaches for Fall Detection in Healthcare Using Inertial Sensors",
        "authors": "Ya Wang, Peiman Sarvari, Djamel Khadraoui",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012250500003657"
    },
    {
        "id": 2018,
        "title": "Improving Utility Cables Diagnostics and Prognostics using Machine Learning",
        "authors": "Shishir Shekhar, Shashwat Shekhar",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/gridedge54130.2023.10102722"
    },
    {
        "id": 2019,
        "title": "Prediction of HELLP Syndrome Severity Using Machine Learning Algorithms—Results from a Retrospective Study",
        "authors": "Marian Melinte-Popescu, Ingrid-Andrada Vasilache, Demetra Socolov, Alina-Sînziana Melinte-Popescu",
        "published": "2023-1-12",
        "citations": 4,
        "abstract": "(1) Background: HELLP (hemolysis, elevated liver enzymes, and low platelets) syndrome is a rare and life-threatening complication of preeclampsia. The aim of this study was to evaluate and compare the predictive performances of four machine learning-based models for the prediction of HELLP syndrome, and its subtypes according to the Mississippi classification; (2) Methods: This retrospective case-control study evaluated pregnancies that occurred in women who attended a tertiary maternity hospital in Romania between January 2007 and December 2021. The patients’ clinical and paraclinical characteristics were included in four machine learning-based models: decision tree (DT), naïve Bayes (NB), k-nearest neighbors (KNN), and random forest (RF), and their predictive performance were assessed; (3) Results: Our results showed that HELLP syndrome was best predicted by RF (accuracy: 89.4%) and NB (accuracy: 86.9%) models, while DT (accuracy: 91%) and KNN (accuracy: 87.1%) models had the highest performance when used to predict class 1 HELLP syndrome. The predictive performance of these models was modest for class 2 and 3 of HELLP syndrome, with accuracies ranging from 65.2% and 83.8%; (4) Conclusions: The machine learning-based models could be useful tools for predicting HELLP syndrome, and its most severe form—class 1.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13020287"
    },
    {
        "id": 2020,
        "title": "How far is too far? Identifying suspicious travel patterns in healthcare claims using machine learning",
        "authors": "Kai Wang, Daniel Lasaga, John Helms, Edward Bowen, Sanmitra Bhattacharya",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00090"
    },
    {
        "id": 2021,
        "title": "Cardiac disease risk prediction using machine learning algorithms",
        "authors": "Albert Alexander Stonier, Rakesh Krishna Gorantla, K Manoj",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "AbstractHeart attack is a life‐threatening condition which is mostly caused due to coronary disease resulting in death in human beings. Detecting the risk of heart diseases is one of the most important problems in medical science that can be prevented and treated with early detection and appropriate medical management; it can also help to predict a large number of medical needs and reduce expenses for treatment. Predicting the occurrence of heart diseases by machine learning (ML) algorithms has become significant work in healthcare industry. This study aims to create a such system that is used for predicting whether a patient is likely to develop heart attacks, by analysing various data sources including electronic health records and clinical diagnosis reports from hospital clinics. ML is used as a process in which computers learn from data in order to make predictions about new datasets. The algorithms created for predictive data analysis are often used for commercial purposes. This paper presents an overview to forecast the likelihood of a heart attack for which many ML methodologies and techniques are applied. In order to improve medical diagnosis, the paper compares various algorithms such as Random Forest, Regression models, K‐nearest neighbour imputation (KNN), Naïve Bayes algorithm etc. It is found that the Random Forest algorithm provides a better accuracy of 88.52% in forecasting heart attack risk, which could herald a revolution in the diagnosis and treatment of cardiovascular illnesses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/htl2.12053"
    },
    {
        "id": 2022,
        "title": "Retracted: Monitoring Cardiovascular Problems in Heart Patients Using Machine Learning",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9760181"
    },
    {
        "id": 2023,
        "title": "The Accuracy of Sex Identification Using CBCT Morphometric Measurements of the Mandible, with Different Machine-Learning Algorithms—A Retrospective Study",
        "authors": "Mohammed Taha Ahmed Baban, Dena Nadhim Mohammad",
        "published": "2023-7-11",
        "citations": 4,
        "abstract": "In forensics, predicting the sex is a crucial step in identification. Many studies have aimed to find an accurate and fast technique to estimate the sex. This study was conducted to determine the accuracy of volumetric and linear measurements of three-dimensional (3D) images of the mandible obtained from cone beam computed tomography (CBCT) radiographs, using different machine-learning (ML) models for sex identification. The CBCTs of 104 males and 104 females were included in this study. The radiographs were converted to 3D images, and the volume, surface area, and ten linear measurements of the mandible were obtained. The data were evaluated using statistical analysis and five different ML algorithms. All results were considered statistically significant at p < 0.05, and the precision, recall, f1-score, training accuracy, and testing accuracy were used to evaluate the performance of the ML models. All the studied parameters showed statistically significant differences between sexes p < 0.05. The right coronoid-to-gonion linear distance had the highest discriminative power of all the parameters. Meanwhile, Gaussian Naive Bayes (GNB) showed the best performance among all the ML models. The results of this study revealed promising outcomes; the sex can be easily determined, with high accuracy (90%).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13142342"
    },
    {
        "id": 2024,
        "title": "A forecasting approach for hospital bed capacity planning using machine learning and deep learning with application to public hospitals",
        "authors": "Younes Mahmoudian, Arash Nemati, Abdul Sattar Safaei",
        "published": "2023-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100245"
    },
    {
        "id": 2025,
        "title": "Disease Prediction Using Graph Machine Learning Based on Electronic Health Data: A Review of Approaches and Trends",
        "authors": "Haohui Lu, Shahadat Uddin",
        "published": "2023-4-4",
        "citations": 13,
        "abstract": "Graph machine-learning (ML) methods have recently attracted great attention and have made significant progress in graph applications. To date, most graph ML approaches have been evaluated on social networks, but they have not been comprehensively reviewed in the health informatics domain. Herein, a review of graph ML methods and their applications in the disease prediction domain based on electronic health data is presented in this study from two levels: node classification and link prediction. Commonly used graph ML approaches for these two levels are shallow embedding and graph neural networks (GNN). This study performs comprehensive research to identify articles that applied or proposed graph ML models on disease prediction using electronic health data. We considered journals and conferences from four digital library databases (i.e., PubMed, Scopus, ACM digital library, and IEEEXplore). Based on the identified articles, we review the present status of and trends in graph ML approaches for disease prediction using electronic health data. Even though GNN-based models have achieved outstanding results compared with the traditional ML methods in a wide range of disease prediction tasks, they still confront interpretability and dynamic graph challenges. Though the disease prediction field using ML techniques is still emerging, GNN-based models have the potential to be an excellent approach for disease prediction, which can be used in medical diagnosis, treatment, and the prognosis of diseases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11071031"
    },
    {
        "id": 2026,
        "title": "Physiological State Evaluation in Working Environment Using Expert System and Random Forest Machine Learning Algorithm",
        "authors": "Eglė Butkevičiūtė, Liepa Bikulčienė, Aušra Žvironienė",
        "published": "2023-1-11",
        "citations": 0,
        "abstract": "Healthy lifestyle is one of the most important factors in the prevention of premature deaths, chronic diseases, productivity loss, obesity, and other economic and social aspects. The workplace plays an important role in promoting the physical activity and wellbeing of employees. Previous studies are mostly focused on individual interviews, various questionnaires that are a conceptual information about individual health state and might change according to question formulation, specialist competence, and other aspects. In this paper the work ability was mostly related to the employee’s physiological state, which consists of three separate systems: cardiovascular, muscular, and neural. Each state consists of several exercises or tests that need to be performed one after another. The proposed data transformation uses fuzzy logic and different membership functions with three or five thresholds, according to the analyzed physiological feature. The transformed datasets are then classified into three stages that correspond to good, moderate, and poor health condition using machine learning techniques. A three-part Random Forest method was applied, where each part corresponds to a separate system. The obtained testing accuracies were 93%, 87%, and 73% for cardiovascular, muscular, and neural human body systems, respectively. The results indicate that the proposed work ability evaluation process may become a good tool for the prevention of possible accidents at work, chronic fatigue, or other health problems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11020220"
    },
    {
        "id": 2027,
        "title": "Fraud Detection in Healthcare Insurance Claims Using Machine Learning",
        "authors": "Eman Nabrawi, Abdullah Alanazi",
        "published": "2023-9-5",
        "citations": 3,
        "abstract": "Healthcare fraud is intentionally submitting false claims or producing misinterpretation of facts to obtain entitlement payments. Thus, it wastes healthcare financial resources and increases healthcare costs. Subsequently, fraud poses a substantial financial challenge. Therefore, supervised machine and deep learning analytics such as random forest, logistic regression, and artificial neural networks are successfully used to detect healthcare insurance fraud. This study aims to develop a health model that automatically detects fraud from health insurance claims in Saudi Arabia. The model indicates the greatest contributing factor to fraud with optimal accuracy. The labeled imbalanced dataset used three supervised deep and machine learning methods. The dataset was obtained from three healthcare providers in Saudi Arabia. The applied models were random forest, logistic regression, and artificial neural networks. The SMOT technique was used to balance the dataset. Boruta object feature selection was applied to exclude insignificant features. Validation metrics were accuracy, precision, recall, specificity, F1 score, and area under the curve (AUC). Random forest classifiers indicated policy type, education, and age as the most significant features with an accuracy of 98.21%, 98.08% precision, 100% recall, an F1 score of 99.03%, specificity of 80%, and an AUC of 90.00%. Logistic regression resulted in an accuracy of 80.36%, 97.62% precision, 80.39% recall, an F1 score of 88.17%, specificity of 80%, and an AUC of 80.20%. ANN revealed an accuracy of 94.64%, 98.00% precision, 96.08% recall, an F1 score of 97.03%, a specificity of 80%, and an AUC of 88.04%. This predictive analytics study applied three successful models, each of which yielded acceptable accuracy and validation metrics; however, further research on a larger dataset is advised.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/risks11090160"
    },
    {
        "id": 2028,
        "title": "Machine-Learning-Based Diagnostics of Cardiac Sarcoidosis Using Multi-Chamber Wall Motion Analyses",
        "authors": "Jan Eckstein, Negin Moghadasi, Hermann Körperich, Rehsan Akkuzu, Vanessa Sciacca, Christian Sohns, Philipp Sommer, Julian Berg, Jerzy Paluszkiewicz, Wolfgang Burchert, Misagh Piran",
        "published": "2023-7-20",
        "citations": 1,
        "abstract": "Background: Hindered by its unspecific clinical and phenotypical presentation, cardiac sarcoidosis (CS) remains a challenging diagnosis. Objective: Utilizing cardiac magnetic resonance imaging (CMR), we acquired multi-chamber volumetrics and strain feature tracking for a support vector machine learning (SVM)-based diagnostic approach to CS. Method: Forty-five CMR-negative (CMR(−), 56.5(53.0;63.0)years), eighteen CMR-positive (CMR(+), 64.0(57.8;67.0)years) sarcoidosis patients and forty-four controls (CTRL, 56.5(53.0;63.0)years)) underwent CMR examination. Cardiac parameters were processed using the classifiers of logistic regression, KNN(K-nearest-neighbor), DT (decision tree), RF (random forest), SVM, GBoost, XGBoost, Voting and feature selection. Results: In a three-cluster analysis of CTRL versus vs. CMR(+) vs. CMR(−), RF and Voting classifier yielded the highest prediction rates (81.82%). The two-cluster analysis of CTRL vs. all sarcoidosis (All Sarc.) yielded high prediction rates with the classifiers logistic regression, RF and SVM (96.97%), and low prediction rates for the analysis of CMR(+) vs. CMR(−), which were augmented using feature selection with logistic regression (89.47%). Conclusion: Multi-chamber cardiac function and strain-based supervised machine learning provides a non-contrast approach to accurately differentiate between healthy individuals and sarcoidosis patients. Feature selection overcomes the algorithmically challenging discrimination between CMR(+) and CMR(−) patients, yielding high accuracy predictions. The study findings imply higher prevalence of cardiac involvement than previously anticipated, which may impact clinical disease management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13142426"
    },
    {
        "id": 2029,
        "title": "Stress Detection Using Machine Learning",
        "authors": "Rohini Hanchate, Harshal Narute, Siddharam Shavage",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Stress management systems are essential to identify and address stress levels that can disrupt our socioeconomic functioning. According to the World Health Organization (WHO), one in four people experience stress, which can result in mental and socioeconomic issues, poor work relationships, and depression, and in severe cases, suicide. Counselling is crucial to help people cope with stress, and while stress cannot be avoided, preventive measures can be taken to mitigate its effects. Currently, only medical and physiological experts can determine whether someone is experiencing stress. Traditional stress detection methods rely on self-reported answers, which can be unreliable. Automated stress detection can minimize health risks and improve societal welfare. Therefore, there is a need for a scientific tool that can automate stress detection using physiological signals. Stress detection is an important social contribution that potential to improve quality of life. As IT industries bring new technologies and products to the market, stress levels in employees are also increasing. While some organizations offer mental health services to their employees, more needs to be done to address this issue.\n\nKeywords: Machine Learning, Stress Detection, Haar cascade algorithm, Convolutional Neural Network",
        "keywords": "",
        "link": "http://dx.doi.org/10.52403/ijshr.20230239"
    },
    {
        "id": 2030,
        "title": "Breast Cancer Detection and Prevention Using Machine Learning",
        "authors": "Arslan Khalid, Arif Mehmood, Amerah Alabrah, Bader Fahad Alkhamees, Farhan Amin, Hussain AlSalman, Gyu Sang Choi",
        "published": "2023-10-2",
        "citations": 4,
        "abstract": "Breast cancer is a common cause of female mortality in developing countries. Early detection and treatment are crucial for successful outcomes. Breast cancer develops from breast cells and is considered a leading cause of death in women. This disease is classified into two subtypes: invasive ductal carcinoma (IDC) and ductal carcinoma in situ (DCIS). The advancements in artificial intelligence (AI) and machine learning (ML) techniques have made it possible to develop more accurate and reliable models for diagnosing and treating this disease. From the literature, it is evident that the incorporation of MRI and convolutional neural networks (CNNs) is helpful in breast cancer detection and prevention. In addition, the detection strategies have shown promise in identifying cancerous cells. The CNN Improvements for Breast Cancer Classification (CNNI-BCC) model helps doctors spot breast cancer using a trained deep learning neural network system to categorize breast cancer subtypes. However, they require significant computing power for imaging methods and preprocessing. Therefore, in this research, we proposed an efficient deep learning model that is capable of recognizing breast cancer in computerized mammograms of varying densities. Our research relied on three distinct modules for feature selection: the removal of low-variance features, univariate feature selection, and recursive feature elimination. The craniocaudally and medial-lateral views of mammograms are incorporated. We tested it with a large dataset of 3002 merged pictures gathered from 1501 individuals who had digital mammography performed between February 2007 and May 2015. In this paper, we applied six different categorization models for the diagnosis of breast cancer, including the random forest (RF), decision tree (DT), k-nearest neighbors (KNN), logistic regression (LR), support vector classifier (SVC), and linear support vector classifier (linear SVC). The simulation results prove that our proposed model is highly efficient, as it requires less computational power and is highly accurate.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13193113"
    },
    {
        "id": 2031,
        "title": "Construct ceRNA Network and Risk Model of Breast Cancer Using Machine Learning Methods under the Mechanism of Cuproptosis",
        "authors": "Jianzhi Deng, Fei Fu, Fengming Zhang, Yuanyuan Xia, Yuehan Zhou",
        "published": "2023-3-22",
        "citations": 2,
        "abstract": "Breast cancer (BRCA) has an undesirable prognosis and is the second most common cancer among women after lung cancer. A novel mechanism of programmed cell death called cuproptosis is linked to the development and spread of tumor cells. However, the function of cuproptosis in BRCA remains unknown. To this date, no studies have used machine learning methods to screen for characteristic genes to explore the role of cuproptosis-related genes (CRGs) in breast cancer. Therefore, 14 cuproptosis-related characteristic genes (CRCGs) were discovered by the feature selection of 39 differentially expressed CRGs using the three machine learning methods LASSO, SVM-RFE, and random forest. Through the PPI network and immune infiltration analysis, we found that PRNP was the key CRCG. The miRTarBase, TargetScan, and miRDB databases were then used to identify hsa-miR-192-5p and hsa-miR-215-5p as the upstream miRNA of PRNP, and the upstream lncRNA, CARMN, was identified by the StarBase database. Thus, the mRNA PRNP/miRNA hsa-miR-192-5p and hsa-miR-215-5p/lncRNA CARMN ceRNA network was constructed. This ceRNA network, which has not been studied before, is extremely innovative. Furthermore, four cuproptosis-related lncRNAs (CRLs) were screened in TCGA-BRCA by univariate Cox, LASSO, and multivariate Cox regression analysis. The risk model was constructed by using these four CRLs, and the risk score = C9orf163 * (1.8365) + PHC2-AS1 * (−2.2985) + AC087741.1 * (−0.9504) + AL109824.1 * (0.6016). The ROC curve and C-index demonstrated the superior predictive capacity of the risk model, and the ROC curve demonstrated that the AUC of 1-, 3-, and 5-year OS in all samples was 0.721, 0.695, and 0.633, respectively. Finally, 50 prospective sensitive medicines were screened with the pRRophetic R package, among which 17-AAG may be a therapeutic agent for high-risk patients, while the other 49 medicines may be suitable for the treatment of low-risk patients. In conclusion, our study constructs a new ceRNA network and a novel risk model, which offer a theoretical foundation for the treatment of BRCA and will aid in improving the prognosis of BRCA.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061203"
    },
    {
        "id": 2032,
        "title": "Prediction of Perforated and Nonperforated Acute Appendicitis Using Machine Learning-Based Explainable Artificial Intelligence",
        "authors": "Sami Akbulut, Fatma Hilal Yagin, Ipek Balikci Cicek, Cemalettin Koc, Cemil Colak, Sezai Yilmaz",
        "published": "2023-3-19",
        "citations": 6,
        "abstract": "Background: The primary aim of this study was to create a machine learning (ML) model that can predict perforated and nonperforated acute appendicitis (AAp) with high accuracy and to demonstrate the clinical interpretability of the model with explainable artificial intelligence (XAI). Method: A total of 1797 patients who underwent appendectomy with a preliminary diagnosis of AAp between May 2009 and March 2022 were included in the study. Considering the histopathological examination, the patients were divided into two groups as AAp (n = 1465) and non-AAp (NA; n = 332); the non-AAp group is also referred to as negative appendectomy. Subsequently, patients confirmed to have AAp were divided into two subgroups: nonperforated (n = 1161) and perforated AAp (n = 304). The missing values in the data set were assigned using the Random Forest method. The Boruta variable selection method was used to identify the most important variables associated with AAp and perforated AAp. The class imbalance problem in the data set was resolved by the SMOTE method. The CatBoost model was used to classify AAp and non-AAp patients and perforated and nonperforated AAp patients. The performance of the model in the holdout test set was evaluated with accuracy, F1- score, sensitivity, specificity, and area under the receiver operator curve (AUC). The SHAP method, which is one of the XAI methods, was used to interpret the model results. Results: The CatBoost model could distinguish AAp patients from non-AAp individuals with an accuracy of 88.2% (85.6–90.8%), while distinguishing perforated AAp patients from nonperforated AAp individuals with an accuracy of 92% (89.6–94.5%). According to the results of the SHAP method applied to the CatBoost model, it was observed that high total bilirubin, WBC, Netrophil, WLR, NLR, CRP, and WNR values, and low PNR, PDW, and MCV values increased the prediction of AAp biochemically. On the other hand, high CRP, Age, Total Bilirubin, PLT, RDW, WBC, MCV, WLR, NLR, and Neutrophil values, and low Lymphocyte, PDW, MPV, and PNR values were observed to increase the prediction of perforated AAp. Conclusion: For the first time in the literature, a new approach combining ML and XAI methods was tried to predict AAp and perforated AAp, and both clinical conditions were predicted with high accuracy. This new approach proved successful in showing how well which demographic and biochemical parameters could explain the current clinical situation in predicting AAp and perforated AAp.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061173"
    },
    {
        "id": 2033,
        "title": "Identifying Effective Feature Selection Methods for Alzheimer’s Disease Biomarker Gene Detection Using Machine Learning",
        "authors": "Hala Alshamlan, Samar Omar, Rehab Aljurayyad, Reham Alabduljabbar",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "Alzheimer’s disease (AD) is a complex genetic disorder that affects the brain and has been the focus of many bioinformatics research studies. The primary objective of these studies is to identify and classify genes involved in the progression of AD and to explore the function of these risk genes in the disease process. The aim of this research is to identify the most effective model for detecting biomarker genes associated with AD using several feature selection methods. We compared the efficiency of feature selection methods with an SVM classifier, including mRMR, CFS, the Chi-Square Test, F-score, and GA. We calculated the accuracy of the SVM classifier using validation methods such as 10-fold cross-validation. We applied these feature selection methods with SVM to a benchmark AD gene expression dataset consisting of 696 samples and 200 genes. The results indicate that the mRMR and F-score feature selection methods with SVM classifier achieved a high accuracy of around 84%, with a number of genes between 20 and 40. Furthermore, the mRMR and F-score feature selection methods with SVM classifier outperformed the GA, Chi-Square Test, and CFS methods. Overall, these findings suggest that the mRMR and F-score feature selection methods with SVM classifier are effective in identifying biomarker genes related to AD and could potentially lead to more accurate diagnosis and treatment of the disease.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13101771"
    },
    {
        "id": 2034,
        "title": "Retracted: Prediction and Analysis of Autism Spectrum Disorder Using Machine Learning Techniques",
        "authors": "",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9815989"
    },
    {
        "id": 2035,
        "title": "Using Machine Learning to Predict Abnormal Carotid Intima-Media Thickness in Type 2 Diabetes",
        "authors": "Chung-Ze Wu, Li-Ying Huang, Fang-Yu Chen, Chun-Heng Kuo, Dong-Feng Yeih",
        "published": "2023-5-23",
        "citations": 2,
        "abstract": "Carotid intima-media thickness (c-IMT) is a reliable risk factor for cardiovascular disease risk in type 2 diabetes (T2D) patients. The present study aimed to compare the effectiveness of different machine learning methods and traditional multiple logistic regression in predicting c-IMT using baseline features and to establish the most significant risk factors in a T2D cohort. We followed up with 924 patients with T2D for four years, with 75% of the participants used for model development. Machine learning methods, including classification and regression tree, random forest, eXtreme gradient boosting, and Naïve Bayes classifier, were used to predict c-IMT. The results showed that all machine learning methods, except for classification and regression tree, were not inferior to multiple logistic regression in predicting c-IMT in terms of higher area under receiver operation curve. The most significant risk factors for c-IMT were age, sex, creatinine, body mass index, diastolic blood pressure, and duration of diabetes, sequentially. Conclusively, machine learning methods could improve the prediction of c-IMT in T2D patients compared to conventional logistic regression models. This could have crucial implications for the early identification and management of cardiovascular disease in T2D patients.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13111834"
    },
    {
        "id": 2036,
        "title": "Data Mining in Healthcare using Machine Learning Techniques",
        "authors": "Honey Goel, Deepak Kumar",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscss57650.2023.10169802"
    },
    {
        "id": 2037,
        "title": "A Hybridized Machine Learning Approach for Predicting COVID-19 Using Adaptive Neuro-Fuzzy Inference System and Reptile Search Algorithm",
        "authors": "Thandra Jithendra, Shaik Sharief Basha",
        "published": "2023-5-6",
        "citations": 5,
        "abstract": "This research is aimed to escalate Adaptive Neuro-Fuzzy Inference System (ANFIS) functioning in order to ensure the veracity of existing time-series modeling. The COVID-19 pandemic has been a global threat for the past three years. Therefore, advanced forecasting of confirmed infection cases is extremely essential to alleviate the crisis brought out by COVID-19. An adaptive neuro-fuzzy inference system-reptile search algorithm (ANFIS-RSA) is developed to effectively anticipate COVID-19 cases. The proposed model integrates a machine-learning model (ANFIS) with a nature-inspired Reptile Search Algorithm (RSA). The RSA technique is used to modulate the parameters in order to improve the ANFIS modeling. Since the performance of the ANFIS model is dependent on optimizing parameters, the statistics of infected cases in China and India were employed through data obtained from WHO reports. To ensure the accuracy of our estimations, corresponding error indicators such as RMSE, RMSRE, MAE, and MAPE were evaluated using the coefficient of determination (R2). The recommended approach employed on the China dataset was compared with other upgraded ANFIS methods to identify the best error metrics, resulting in an R2 value of 0.9775. ANFIS-CEBAS and Flower Pollination Algorithm and Salp Swarm Algorithm (FPASSA-ANFIS) attained values of 0.9645 and 0.9763, respectively. Furthermore, the ANFIS-RSA technique was used on the India dataset to examine its efficiency and acquired the best R2 value (0.98). Consequently, the suggested technique was found to be more beneficial for high-precision forecasting of COVID-19 on time-series data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13091641"
    },
    {
        "id": 2038,
        "title": "Luminescence Study of CdSe Quantum Dots Using Machine Learning Techniques",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55487/29w2p285"
    },
    {
        "id": 2039,
        "title": "Predictive Analytics in Healthcare using Machine Learning",
        "authors": " Shruti, Naresh Kumar Trivedi",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10306782"
    },
    {
        "id": 2040,
        "title": "A predictive approach for myocardial infarction risk assessment using machine learning and big clinical data",
        "authors": "Imen Boudali, Sarra Chebaane, Yassine Zitouni",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2024.100319"
    },
    {
        "id": 2041,
        "title": "Diagnostics of Thyroid Cancer Using Machine Learning and Metabolomics",
        "authors": "Alyssa Kuang, Valentina L. Kouznetsova, Santosh Kesari, Igor F. Tsigelny",
        "published": "2023-12-22",
        "citations": 0,
        "abstract": "The objective of this research is, with the analysis of existing data of thyroid cancer (TC) metabolites, to develop a machine-learning model that can diagnose TC using metabolite biomarkers. Through data mining, pathway analysis, and machine learning (ML), the model was developed. We identified seven metabolic pathways related to TC: Pyrimidine metabolism, Tyrosine metabolism, Glycine, serine, and threonine metabolism, Pantothenate and CoA biosynthesis, Arginine biosynthesis, Phenylalanine metabolism, and Phenylalanine, tyrosine, and tryptophan biosynthesis. The ML classifications’ accuracies were confirmed through 10-fold cross validation, and the most accurate classification was 87.30%. The metabolic pathways identified in relation to TC and the changes within such pathways can contribute to more pattern recognition for diagnostics of TC patients and assistance with TC screening. With independent testing, the model’s accuracy for other unique TC metabolites was 92.31%. The results also point to a possibility for the development of using ML methods for TC diagnostics and further applications of ML in general cancer-related metabolite analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/metabo14010011"
    },
    {
        "id": 2042,
        "title": "Prediction of Fatty Liver Disease in a Chinese Population Using Machine-Learning Algorithms",
        "authors": "Shuwei Weng, Die Hu, Jin Chen, Yanyi Yang, Daoquan Peng",
        "published": "2023-3-18",
        "citations": 3,
        "abstract": "Background: Fatty liver disease (FLD) is an important risk factor for liver cancer and cardiovascular disease and can lead to significant social and economic burden. However, there is currently no nationwide epidemiological survey for FLD in China, making early FLD screening crucial for the Chinese population. Unfortunately, liver biopsy and abdominal ultrasound, the preferred methods for FLD diagnosis, are not practical for primary medical institutions. Therefore, the aim of this study was to develop machine learning (ML) models for screening individuals at high risk of FLD, and to provide a new perspective on early FLD diagnosis. Methods: This study included a total of 30,574 individuals between the ages of 18 and 70 who completed abdominal ultrasound and the related clinical examinations. Among them, 3474 individuals were diagnosed with FLD by abdominal ultrasound. We used 11 indicators to build eight classification models to predict FLD. The model prediction ability was evaluated by the area under the curve, sensitivity, specificity, positive predictive value, negative predictive value, and kappa value. Feature importance analysis was assessed by Shapley value or root mean square error loss after permutations. Results: Among the eight ML models, the prediction accuracy of the extreme gradient boosting (XGBoost) model was highest at 89.77%. By feature importance analysis, we found that the body mass index, triglyceride, and alanine aminotransferase play important roles in FLD prediction. Conclusion: XGBoost improves the efficiency and cost of large-scale FLD screening.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061168"
    },
    {
        "id": 2043,
        "title": "Retracted: Prediction of Multidrug-Resistant Tuberculosis Using Machine Learning Algorithms in SWAT, Pakistan",
        "authors": "",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9892081"
    },
    {
        "id": 2044,
        "title": "A Multi-Classifier-Based Recommender System for Early Autism Spectrum Disorder Detection using Machine Learning",
        "authors": "Anita Vikram Shinde, Dipti Durgesh Patil",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100211"
    },
    {
        "id": 2045,
        "title": "Retracted: Multicentre Study Using Machine Learning Methods in Clinical Diagnosis of Knee Osteoarthritis",
        "authors": "",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9798509"
    },
    {
        "id": 2046,
        "title": "A Novel Medical Image Enhancement Algorithm for Breast Cancer Detection on Mammography Images Using Machine Learning",
        "authors": "Hanife Avcı, Jale Karakaya",
        "published": "2023-1-18",
        "citations": 21,
        "abstract": "Mammography is the most preferred method for breast cancer screening. In this study, computer-aided diagnosis (CAD) systems were used to improve the image quality of mammography images and to detect suspicious areas. The main contribution of this study is to reveal the optimal combination of various pre-processing algorithms to enable better interpretation and classification of mammography images because pre-processing algorithms significantly affect the accuracy of segmentation and classification methods. In this study, the effect of combinations of different preprocessing methods in differentiating benign and malignant breast lesions was investigated. All image processing algorithms used for lesion detection were used in the mini-MIAS database. In the first step, label information and pectoral muscle resulting from the acquisition of mammography images were removed. In the second step, median filter (MF), contrast limited adaptive histogram equalization (CLAHE), and unsharp masking (USM) algorithms with different combinations of the resolution and visibility of images are increased. In the third step, suspicious regions are extracted from the mammograms using the k-means clustering technique. Then, features were extracted from the obtained ROIs. Finally, feature datasets were classified as normal/abnormal, and benign/malign (two class classification) using Machine Learning algorithms. Test performance measures of the classification methods were examined. In both classifications made in the study, lower classification performance values were obtained when the CLAHE algorithm was used alone as a pre-processing method compared to other pre-processing combinations. When the median filter and unsharp masking algorithms are added to the CLAHE algorithm, the performance of the classification methods has increased. In terms of classification success, Support Vector Machines, Random Forest, and Neural Networks showed the best performance. It was found by comparing the performances of the classification methods that different preprocessing algorithms were effective in detecting the presence of breast lesions and distinguishing benign and malignant.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13030348"
    },
    {
        "id": 2047,
        "title": "Comparison of MRI Sequences to Predict ATRX Status Using Radiomics-Based Machine Learning",
        "authors": "Nabila Gala Nacul Mora, Burak Han Akkurt, Dilek Kasap, David Blömer, Walter Heindel, Manoj Mannil, Manfred Musigmann",
        "published": "2023-6-29",
        "citations": 4,
        "abstract": "ATRX is an important molecular marker according to the 2021 WHO classification of adult-type diffuse glioma. We aim to predict the ATRX mutation status non-invasively using radiomics-based machine learning models on MRI and to determine which MRI sequence is best suited for this purpose. In this retrospective study, we used MRI images of patients with histologically confirmed glioma, including the sequences T1w without and with the administration of contrast agent, T2w, and the FLAIR. Radiomics features were extracted from the corresponding MRI images by hand-delineated regions of interest. Data partitioning into training data and independent test data was repeated 100 times to avoid random effects. Feature preselection and subsequent model development were performed using Lasso regression. The T2w sequence was found to be the most suitable and the FLAIR sequence the least suitable for predicting ATRX mutations using radiomics-based machine learning models. For the T2w sequence, our seven-feature model developed with Lasso regression achieved a mean AUC of 0.831, a mean accuracy of 0.746, a mean sensitivity of 0.772, and a mean specificity of 0.697. In conclusion, for the prediction of ATRX mutation using radiomics-based machine learning models, the T2w sequence is the most suitable among the commonly used MRI sequences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13132216"
    },
    {
        "id": 2048,
        "title": "Machine learning technology for predicting intraocular lens power. Diagnostics data generalization",
        "authors": "Александр Анатольевич Арзамасцев, Oleg Fabrikantov, Natalya Zenkova, Sergey Belikov",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Backgraund. Implantation of recent IOLs allows ophthalmologists to effectively solve the problems of surgical rehabilitation of patients with cataracts. The degree of improving the patient's visual functions is directly dependent on the accuracy of the preoperative calculation of the optical power of IOLs. The most famous formulas to calculate this indicator are SRK II, SRK/T, Hoffer-Q, Holladay II, Haigis, Barrett. All of them work well for an \"average patient\", however, they are not adequate enough at the boundaries of input variables ranges.\r\nAims. To study the possibility of using mathematical models obtained as a result of deep learning of artificial neural networks (ANN models) to generalize data and predict the optical power of modern intraocular lenses.\r\nMaterials and methods. ANN models were trained on large-scale samples, including depersonalized data for patients of ophthalmology clinic. Data provided in 2021 by ophthalmologist K.K. Syrykh, and reflect the results of both preoperative and postoperative observation of patients. The source file used to build the ANN model includes 455 records - 26 columns of input factors and one column for the output factor - calculating IOL (diopters). To conveniently build ANN models, we used a simulator program, previously developed by the authors.\r\nResults. The resulting models, in contrast to the traditionally used formulas, reflect the regional specificity of patients to a much greater extent. They also make it possible to retrain and optimize the structure based on newly received data, which allows taking into account the non-stationarity of the object. A distinctive feature of such ANN models in comparison with the well-known formulas SRK II, SRK/T, Hoffer-Q, Holladay II, Haigis, Barrett, widely used in the surgical cataract treatment in ophthalmology, is their ability to take into account a significant number of recorded input quantities, which makes it possible to reduce the mean relative error in calculating the optical power of IOL from 10–12% to 3.5%.\r\nConclusions. This work shows the fundamental possibility of generalizing a significant amount of empirical data on calculating the optical power of the IOL using training ANN models that have a significantly larger number of input variables than when using traditional formulas and methods. The results obtained allow, in principle, to build an intelligent expert system with a continuous flow of new data from a source and a step-by-step retraining of the ANN model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17816/dd623995"
    },
    {
        "id": 2049,
        "title": "Impact of Machine Learning on Healthcare Analytics",
        "authors": "Nithin Narayan Koranchirath",
        "published": "2024-2-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr24210203022"
    },
    {
        "id": 2050,
        "title": "A Diagnostic Classifier Based on Circulating miRNA Pairs for COPD Using a Machine Learning Approach",
        "authors": "Shurui Xuan, Jiayue Zhang, Qinxing Guo, Liang Zhao, Xin Yao",
        "published": "2023-4-17",
        "citations": 0,
        "abstract": "Chronic obstructive pulmonary disease (COPD) is highly underdiagnosed, and early detection is urgent to prevent advanced progression. Circulating microRNAs (miRNAs) have been diagnostic candidates for multiple diseases. However, their diagnostic value has not yet been fully established in COPD. The purpose of this study was to develop an effective model for the diagnosis of COPD based on circulating miRNAs. We included circulating miRNA expression profiles of two independent cohorts consisting of 63 COPD and 110 normal samples, and then we constructed a miRNA pair-based matrix. Diagnostic models were developed using several machine learning algorithms. The predictive performance of the optimal model was validated in our external cohort. In this study, the diagnostic values of miRNAs based on the expression levels were unsatisfactory. We identified five key miRNA pairs and further developed seven machine learning models. The classifier based on LightGBM was selected as the final model with the area under the curve (AUC) values of 0.883 and 0.794 in test and validation datasets, respectively. We also built a web tool to assist diagnosis for clinicians. Enriched signaling pathways indicated the potential biological functions of the model. Collectively, we developed a robust machine learning model based on circulating miRNAs for COPD screening.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13081440"
    },
    {
        "id": 2051,
        "title": "Early Prediction Model of Macrosomia Using Machine Learning for Clinical Decision Support",
        "authors": "Md. Shamshuzzoha, Md. Motaharul Islam",
        "published": "2023-8-25",
        "citations": 1,
        "abstract": "The condition of fetal overgrowth, also known as macrosomia, can cause serious health complications for both the mother and the infant. It is crucial to identify high-risk macrosomia-relevant pregnancies and intervene appropriately. Despite this need, there are several gaps in research related to macrosomia, including limited predictive models, insufficient machine learning applications, ineffective interventions, and inadequate understanding of how to integrate machine learning models into clinical decision-making. To address these gaps, we developed a machine learning-based model that uses maternal characteristics and medical history to predict macrosomia. Three different algorithms, namely logistic regression, support vector machine, and random forest, were used to develop the model. Based on the evaluation metrics, the logistic regression algorithm provided the best results among the three. The logistic regression algorithm was chosen as the final algorithm to predict macrosomia. The hyper parameters of the logistic regression model were tuned using cross-validation to achieve the best possible performance. Our results indicate that machine learning-based models have the potential to improve macrosomia prediction and enable appropriate interventions for high-risk pregnancies, leading to better health outcomes for both mother and fetus. By leveraging machine learning algorithms and addressing research gaps related to macrosomia, we can potentially reduce the health risks associated with this condition and make informed decisions about high-risk pregnancies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13172754"
    },
    {
        "id": 2052,
        "title": "Capability of Machine Learning Algorithms to Classify Safe and Unsafe Postures during Weight Lifting Tasks Using Inertial Sensors",
        "authors": "Giuseppe Prisco, Maria Romano, Fabrizio Esposito, Mario Cesarelli, Antonella Santone, Leandro Donisi, Francesco Amato",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "Occupational ergonomics aims to optimize the work environment and to enhance both productivity and worker well-being. Work-related exposure assessment, such as lifting loads, is a crucial aspect of this discipline, as it involves the evaluation of physical stressors and their impact on workers’ health and safety, in order to prevent the development of musculoskeletal pathologies. In this study, we explore the feasibility of machine learning (ML) algorithms, fed with time- and frequency-domain features extracted from inertial signals (linear acceleration and angular velocity), to automatically and accurately discriminate safe and unsafe postures during weight lifting tasks. The signals were acquired by means of one inertial measurement unit (IMU) placed on the sternums of 15 subjects, and subsequently segmented to extract several time- and frequency-domain features. A supervised dataset, including the extracted features, was used to feed several ML models and to assess their prediction power. Interesting results in terms of evaluation metrics for a binary safe/unsafe posture classification were obtained with the logistic regression algorithm, which outperformed the others, with accuracy and area under the receiver operating characteristic curve values of up to 96% and 99%, respectively. This result indicates the feasibility of the proposed methodology—based on a single inertial sensor and artificial intelligence—to discriminate safe/unsafe postures associated with load lifting activities. Future investigation in a wider study population and using additional lifting scenarios could confirm the potentiality of the proposed methodology, supporting its applicability in the occupational ergonomics field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics14060576"
    },
    {
        "id": 2053,
        "title": "Construction of a Diagnostic Algorithm for Diagnosis of Adult Asthma Using Machine Learning with Random Forest and XGBoost",
        "authors": "Katsuyuki Tomita, Akira Yamasaki, Ryohei Katou, Tomoyuki Ikeuchi, Hirokazu Touge, Hiroyuki Sano, Yuji Tohda",
        "published": "2023-9-27",
        "citations": 1,
        "abstract": "An evidence-based diagnostic algorithm for adult asthma is necessary for effective treatment and management. We present a diagnostic algorithm that utilizes a random forest (RF) and an optimized eXtreme Gradient Boosting (XGBoost) classifier to diagnose adult asthma as an auxiliary tool. Data were gathered from the medical records of 566 adult outpatients who visited Kindai University Hospital with complaints of nonspecific respiratory symptoms. Specialists made a thorough diagnosis of asthma based on symptoms, physical indicators, and objective testing, including airway hyperresponsiveness. We used two decision-tree classifiers to identify the diagnostic algorithms: RF and XGBoost. Bayesian optimization was used to optimize the hyperparameters of RF and XGBoost. Accuracy and area under the curve (AUC) were used as evaluation metrics. The XGBoost classifier outperformed the RF classifier with an accuracy of 81% and an AUC of 85%. A combination of symptom–physical signs and lung function tests was successfully used to construct a diagnostic algorithm on importance features for diagnosing adult asthma. These results indicate that the proposed model can be reliably used to construct diagnostic algorithms with selected features from objective tests in different settings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13193069"
    },
    {
        "id": 2054,
        "title": "A new machine learning method for predicting systolic and diastolic blood pressure using clinical characteristics",
        "authors": "Anurag Shrivastava, Midhun Chakkaravarthy, Mohd Asif Shah",
        "published": "2023-12",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100219"
    },
    {
        "id": 2055,
        "title": "Use Test of Automated Machine Learning in Cancer Diagnostics",
        "authors": "Manfred Musigmann, Nabila Gala Nacul, Dilek N. Kasap, Walter Heindel, Manoj Mannil",
        "published": "2023-7-8",
        "citations": 2,
        "abstract": "Our aim is to investigate the added value of automated machine learning (AutoML) for potential future applications in cancer diagnostics. Using two important diagnostic questions, the non-invasive determination of IDH mutation status and ATRX status, we analyze whether it is possible to use AutoML to develop models that are comparable in performance to conventional machine learning models (ML) developed by experts. For this purpose, we develop AutoML models using different feature preselection methods and compare the results with previously developed conventional ML models. The cohort used for our study comprises T2-weighted MRI images of 124 patients with histologically confirmed gliomas. Using AutoML, we were able to develop sophisticated models in a very short time with only a few lines of computer code. In predicting IDH mutation status, we obtained a mean AUC of 0.7400 and a mean AUPRC of 0.8582. ATRX mutation status was predicted with very similar discriminatory power, with a mean AUC of 0.7810 and a mean AUPRC of 0.8511. In both cases, AutoML was even able to achieve a discriminatory power slightly above that of the respective conventionally developed models in a very short computing time, thus making such methods accessible to non-experts in the near future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13142315"
    },
    {
        "id": 2056,
        "title": "Advanced Production Diagnostics and Optimized Drilling Strategy: Unlocking the True Potential of Production Data Using Physics and Machine Learning",
        "authors": "S. Haider",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract\nReliable well survival statistics forecast for shale wells is crucial for investment decisions, optimized drilling rates, and energy security policies. At present, the industry lacks a standard analytical or data-driven solution for survival probability estimation in both space and time. We present a state-of-the-art physics-guided and data-driven model for well survival statistics forecast with an error of less than 5%. The implications include optimized long-term drilling strategy, robust well production diagnostics, and profitable economic decisions.\nPost pressure interference time, τ, the production rate of an unconventional well declines exponentially. Early and accurate estimation of τ is of utmost importance. Using 5000 wells (from Barnett, Marcellus, Haynesville, and Eagle Ford) as the training sample, we developed a universal neural network model to estimate the pressure interference time, τ, of a well. The estimated τ is coupled with the physics-based physical scaling curve to estimate the well survival statistics with time. Finally, the well survival statistics is used to calculate the residual production rate and its consequences on future well fracking strategy.\nThe robustness of the neural network model (ANN) is tested on a test set comprising 6000 wells from Barnett, Haynesville, Eagle Ford, and Marcellus. Using initial well production data, and a single ANN model the predicted pressure interference time τ, has an R2 of 0.98. The well survival statistics estimates for the next 10 years in the future achieved an accuracy of 95%, 93%, 96%, and 95% for Barnett, Marcellus, Haynesville, and Eagle Ford respectively. We found that with time τ has decreased for all the plays (Barnett, Haynesville, Eagle Ford and Marcellus). The estimated well survival statistics is shown to have a strong effect on the optimized and profitable drilling strategy.\nWe have used production data and a physics-informed neural network to unlock future production diagnostics with high certainty. The new and robust state-of-the- art hybrid model estimates the future pressure interference time of wells with an accuracy of 98%. The model calculates the future well survival statistics with time with an average accuracy of 95%. Early and accurate estimation of future production diagnostics governed future investment decisions, re-fracking strategy, and improved energy security strategy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-23190-ms"
    },
    {
        "id": 2057,
        "title": "BRIDGING TECHNOLOGY AND PATHOLOGY: A DOCTOR'S ROADMAP TO APPLICATION OF ARTIFICIAL INTELLIGENCE &amp; MACHINE LEARNING IN HEALTHCARE AND THEIR ROLE IN DEVELOPMENT OF AUTOMATED DIAGNOSTICS",
        "authors": "Tanuj Rana, Kanishk Ghonge, Manjari Kishore",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "This article delves into the transformative role of Articial Intelligence (AI) and Machine Learning (ML) in healthcare, paralleling it with\nsignicant historical technological shifts such as the Industrial Revolution. Central to the discussion is the integration of AI and ML in pathology\nand the crucial role medical professionals play in this rapidly evolving domain. Through an in-depth analysis and exploration of real-world case\nstudies, the paper illustrates how AI is enhancing diagnostic precision, streamlining patient care, and revolutionizing traditional medical practices.\nA signicant portion of the article is dedicated to providing a comprehensive roadmap for medical professionals, especially those with limited\ntechnical background, to navigate and engage effectively with AI/ML technologies. This guidance encompasses fundamental understanding,\npractical tool adoption, and hands-on application, underscoring the importance of continuous learning and adaptability in the face of technological\nadvancements in healthcare. Additionally, the article explores the challenges and opportunities presented by AI and ML in healthcare. It\nemphasizes the need for medical professionals to actively adapt to these changes. Rather than replacing medical practitioners, AI and ML are\nportrayed as augmentative tools that enhance their capabilities, leading to improved efciency and patient outcomes in healthcare services.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36106/ijsr/3102338"
    },
    {
        "id": 2058,
        "title": "Integrated e-healthcare management system using machine learning and flask",
        "authors": "Sanjeev Kumar, Jaya Ojha, Mayank Mani Tripathi, Kirtika Garg",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijeh.2023.128607"
    },
    {
        "id": 2059,
        "title": "A risk assessment and prediction framework for diabetes mellitus using machine learning algorithms",
        "authors": "Salliah Shafi Bhat, Madhina Banu, Gufran Ahmad Ansari, Venkatesan Selvam",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100273"
    },
    {
        "id": 2060,
        "title": "Performance Evaluation of Quantum-Based Machine Learning Algorithms for Cardiac Arrhythmia Classification",
        "authors": "Zeynep Ozpolat, Murat Karabatak",
        "published": "2023-3-14",
        "citations": 6,
        "abstract": "The electrocardiogram (ECG) is the most common technique used to diagnose heart diseases. The electrical signals produced by the heart are recorded by chest electrodes and by the extremity electrodes placed on the limbs. Many diseases, such as arrhythmia, cardiomyopathy, coronary heart disease, and heart failure, can be diagnosed by examining ECG signals. The interpretation of these signals by experts may take a long time, and there may be differences between expert interpretations. Since technological developments are intertwined with the medical sciences, computer-assisted diagnostic methods have recently come forward. In computer science, machine learning techniques are often preferred for automatic detection. Quantum-based structures have emerged to increase the machine learning algorithm’s speed and classification performance. In this study, a quantum-based machine learning algorithm is applied to classify heart rhythms. The ECG properties were converted to qubit structure using principal component analysis (PCA). The resulting qubits are classified using the quantum support vector machine (QSVM) algorithm. Quantum computer simulation over Qiskit was used for classification studies. Within the scope of experimental studies, comparisons between classical SVM and QSVM were made using different data amounts and qubit numbers. In the results of the analysis, classical SVM achieved 86.96% accuracy, and QSVM achieved 84.64% accuracy. Despite the fact that the entire dataset was not used due to various limitations, these successful performances were achieved. Classification of medical data such as that from ECG has shown that quantum-based machine learning frameworks perform well despite current resource constraints. In this respect, the study includes essential contributions to the use of quantum-based machine learning methods on signal data in medicine.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13061099"
    },
    {
        "id": 2061,
        "title": "Integrated E-healthcare management system using machine learning and flask",
        "authors": "Kritika Garg, Mayank Mani Tripathi, Jaya Ojha, Sanjeev Kumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijeh.2023.10052840"
    },
    {
        "id": 2062,
        "title": "Using machine learning for process improvement in sepsis management",
        "authors": "L.D. Ferreira, D. McCants, S. Velamuri",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jhqr.2022.09.006"
    },
    {
        "id": 2063,
        "title": "Neonatal Disease Prediction Using Machine Learning Techniques",
        "authors": "Yohanes Gutema Robi, Tilahun Melak Sitote",
        "published": "2023-2-23",
        "citations": 3,
        "abstract": "Neonatal diseases are among the main causes of morbidity and a significant contributor to underfive mortality in the world. There is an increase in understanding of the pathophysiology of the diseases and the implementation of different strategies to minimize their burden. However, improvements in outcomes are not adequate. Limited success is due to different factors, including the similarity of symptoms, which can lead to misdiagnosis, and the inability to detect early for timely intervention. In resource-limited countries like Ethiopia, the challenge is more severe. Low access to diagnosis and treatment due to the inadequacy of neonatal health professionals is one of the shortcomings. Due to the shortage of medical facilities, many neonatal health professionals are forced to decide the type of disease only based on interviews. They may not have a complete picture of all variables that have a contributing effect on neonatal disease from the interview. This can make the diagnosis inconclusive and may lead to a misdiagnosis. Machine learning has great potential for early prediction if relevant historical data is available. We have applied a classification stacking model for the following four main neonatal diseases: sepsis, birth asphyxia, necrotizing enter colitis (NEC), and respiratory distress syndrome. These diseases account for 75% of neonatal deaths. The dataset has been obtained from the Asella Comprehensive Hospital. It has been collected between 2018 and 2021. The developed stacking model was compared to three related machine-learning models XGBoost (XGB), Random Forest (RF), and Support Vector Machine (SVM). The proposed stacking model outperformed the other models, with an accuracy of 97.04%. We believe that this will contribute to the early detection and accurate diagnosis of neonatal diseases, especially for resource-limited health facilities.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/3567194"
    },
    {
        "id": 2064,
        "title": "Cervical Cancer Diagnostics Using Machine Learning Algorithms and Class Balancing Techniques",
        "authors": "Matko Glučina, Ariana Lorencin, Nikola Anđelić, Ivan Lorencin",
        "published": "2023-1-12",
        "citations": 7,
        "abstract": "Objectives: Cervical cancer is present in most cases of squamous cell carcinoma. In most cases, it is the result of an infection with human papillomavirus or adenocarcinoma. This type of cancer is the third most common cancer of the female reproductive organs. The risk groups for cervical cancer are mostly younger women who frequently change partners, have early sexual intercourse, are infected with human papillomavirus (HPV), and who are nicotine addicts. In most cases, the cancer is asymptomatic until it has progressed to the later stages. Cervical cancer screening rates are low, especially in developing countries and in some minority groups. Due to these facts, the introduction of a tentative cervical cancer screening based on a questionnaire can enable more diagnoses of cervical cancer in the initial stages of the disease. Methods: In this research, publicly available cervical cancer data collected on 859 female patients are used. Each sample consists of 36 input attributes and four different outputs Hinselmann, Schiller, cytology, and biopsy. Due to the significant unbalance of the data set, class balancing techniques were used, and these are the Synthetic Minority Oversampling Technique, the ADAptive SYNthetic algorithm (ADASYN), SMOTEEN, random oversampling, and SMOTETOMEK. To obtain the mentioned target outputs, multiple artificial intelligence (AI) and machine learning (ML) methods are proposed. In this research, multiple classification algorithms such as logistic regression, multilayer perceptron (MLP), support vector machine (SVM), K-nearest neighbors (KNN), and several naive Bayes methods were used. Results: From the achieved results, it can be seen that the highest performances were achieved if MLP and KNN are used in combination with Random oversampling, SMOTEEN, and SMOTETOMEK. Such an approach has resulted in mean area under the receiver operating characteristic curve (AUC¯) and mean Matthew’s correlation coefficient (MCC¯) scores of higher than 0.95, regardless of which diagnostic method was used for output vector construction. Conclusions: According to the presented results, it can be concluded that there is a possibility for the utilization of artificial intelligence (AI) and machine learning (ML) techniques for the development of a tentative cervical cancer screening method, which is based on a questionnaire and an AI-based algorithm. Furthermore, it can be concluded that by using class balancing techniques, a certain performance boost can be achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13021061"
    },
    {
        "id": 2065,
        "title": "COVID-19 Detection Mechanism in Vehicles Using a Deep Extreme Machine Learning Approach",
        "authors": "Areej Fatima, Tariq Shahzad, Sagheer Abbas, Abdur Rehman, Yousaf Saeed, Meshal Alharbi, Muhammad Adnan Khan, Khmaies Ouahada",
        "published": "2023-1-11",
        "citations": 2,
        "abstract": "COVID-19 is a rapidly spreading pandemic, and early detection is important to halting the spread of infection. Recently, the outbreak of this virus has severely affected people around the world with increasing death rates. The increased death rates are because of its spreading nature among people, mainly through physical interactions. Therefore, it is very important to control the spreading of the virus and detect people’s symptoms during the initial stages so proper preventive measures can be taken in good time. In response to COVID-19, revolutionary automation such as deep learning, machine learning, image processing, and medical images such as chest radiography (CXR) and computed tomography (CT) have been developed in this environment. Currently, the coronavirus is identified via an RT-PCR test. Alternative solutions are required due to the lengthy moratorium period and the large number of false-negative estimations. To prevent the spreading of the virus, we propose the Vehicle-based COVID-19 Detection System to reveal the related symptoms of a person in the vehicles. Moreover, deep extreme machine learning is applied. The proposed system uses headaches, flu, fever, cough, chest pain, shortness of breath, tiredness, nasal congestion, diarrhea, breathing difficulty, and pneumonia. The symptoms are considered parameters to reveal the presence of COVID-19 in a person. Our proposed approach in Vehicles will make it easier for governments to perform COVID-19 tests timely in cities. Due to the ambiguous nature of symptoms in humans, we utilize fuzzy modeling for simulation. The suggested COVID-19 detection model achieved an accuracy of more than 90%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13020270"
    },
    {
        "id": 2066,
        "title": "Using Ultrasound Image Augmentation and Ensemble Predictions to Prevent Machine-Learning Model Overfitting",
        "authors": "Eric J. Snider, Sofia I. Hernandez-Torres, Ryan Hennessey",
        "published": "2023-1-23",
        "citations": 5,
        "abstract": "Deep learning predictive models have the potential to simplify and automate medical imaging diagnostics by lowering the skill threshold for image interpretation. However, this requires predictive models that are generalized to handle subject variability as seen clinically. Here, we highlight methods to improve test accuracy of an image classifier model for shrapnel identification using tissue phantom image sets. Using a previously developed image classifier neural network—termed ShrapML—blind test accuracy was less than 70% and was variable depending on the training/test data setup, as determined by a leave one subject out (LOSO) holdout methodology. Introduction of affine transformations for image augmentation or MixUp methodologies to generate additional training sets improved model performance and overall accuracy improved to 75%. Further improvements were made by aggregating predictions across five LOSO holdouts. This was done by bagging confidences or predictions from all LOSOs or the top-3 LOSO confidence models for each image prediction. Top-3 LOSO confidence bagging performed best, with test accuracy improved to greater than 85% accuracy for two different blind tissue phantoms. This was confirmed by gradient-weighted class activation mapping to highlight that the image classifier was tracking shrapnel in the image sets. Overall, data augmentation and ensemble prediction approaches were suitable for creating more generalized predictive models for ultrasound image analysis, a critical step for real-time diagnostic deployment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13030417"
    },
    {
        "id": 2067,
        "title": "Unipolar and Bipolar Depression Detection and Classification Based on Actigraphic Registration of Motor Activity Using Machine Learning and Uniform Manifold Approximation and Projection Methods",
        "authors": "Mohammed Zakariah, Yousef Ajami Alotaibi",
        "published": "2023-7-10",
        "citations": 4,
        "abstract": "Modern technology frequently uses wearable sensors to monitor many aspects of human behavior. Since continuous records of heart rate and activity levels are typically gathered, the data generated by these devices have a lot of promise beyond counting the number of daily steps or calories expended. Due to the patient’s inability to obtain the necessary information to understand their conditions and detect illness, such as depression, objectively, methods for evaluating various mental disorders, such as the Montgomery–Asberg depression rating scale (MADRS) and observations, currently require a significant amount of effort on the part of specialists. In this study, a novel dataset was provided, comprising sensor data gathered from depressed patients. The dataset included 32 healthy controls and 23 unipolar and bipolar depressive patients with motor activity recordings. Along with the sensor data collected over several days of continuous measurement for each patient, some demographic information was also offered. The result of the experiment showed that less than 70 of the 100 epochs of the model’s training were completed. The Cohen Kappa score did not even pass 0.1 in the validation set, due to an imbalance in the class distribution, whereas in the second experiment, the majority of scores peaked in about 20 epochs, but because training continued during each epoch, it took much longer for the loss to decline before it fell below 0.1. In the second experiment, the model soon reached an accuracy of 0.991, which is as expected given the outcome of the UMAP dimensionality reduction. In the last experiment, UMAP and neural networks worked together to produce the best outcomes. They used a variety of machine learning classification algorithms, including the nearest neighbors, linear kernel SVM, Gaussian process, and random forest. This paper used the UMAP unsupervised machine learning dimensionality reduction without the neural network and showed a slightly lower score (QDA). By considering the ratings of the patient’s depressive symptoms that were completed by medical specialists, it is possible to better understand the relationship between depression and motor activity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13142323"
    },
    {
        "id": 2068,
        "title": "Predicting Mechanical Thrombectomy Outcome and Time Limit through ADC Value Analysis: A Comprehensive Clinical and Simulation Study Using Machine Learning",
        "authors": "Daisuke Oura, Soichiro Takamiya, Riku Ihara, Yoshimasa Niiya, Hiroyuki Sugimori",
        "published": "2023-6-21",
        "citations": 0,
        "abstract": "Predicting outcomes after mechanical thrombectomy (MT) remains challenging for patients with acute ischemic stroke (AIS). This study aimed to explore the usefulness of machine learning (ML) methods using detailed apparent diffusion coefficient (ADC) analysis to predict patient outcomes and simulate the time limit for MT in AIS. A total of 75 consecutive patients with AIS with complete reperfusion in MT were included; 20% were separated to test data. The threshold ranged from 620 × 10−6 mm2/s to 480 × 10−6 mm2/s with a 20 × 10−6 mm2/s step. The mean, standard deviation, and pixel number of the region of interest were obtained according to the threshold. Simulation data were created by mean measurement value of patients with a modified Rankin score of 3–4. The time limit was simulated from the cross point of the prediction score according to the time to perform reperfusion from imaging. The extra tree classifier accurately predicted the outcome (AUC: 0.833. Accuracy: 0.933). In simulation data, the prediction score to obtain a good outcome decreased according to increasing time to reperfusion, and the time limit was longer among younger patients. ML methods using detailed ADC analysis accurately predicted patient outcomes in AIS and simulated tolerance time for MT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13132138"
    },
    {
        "id": 2069,
        "title": "Sustainable and Reliable Healthcare Automation and Digitization using Machine Learning Techniques",
        "authors": "",
        "published": "2023-2",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56042/jsir.v82i2.70222"
    },
    {
        "id": 2070,
        "title": "Analyzing Healthcare Coverage in the United States Using Multivariate Machine Learning Models",
        "authors": "Venkatesh Sumukh",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaica58456.2023.10405550"
    },
    {
        "id": 2071,
        "title": "PAN Card Fraud Detection Using Machine Learning: A Case Study",
        "authors": "Rohini Hanchate, Shreyas Yerole, Nazir Lalloti",
        "published": "2023-4-28",
        "citations": 0,
        "abstract": "Artificial Intelligence research in the area of computer vision teaches machines to comprehend and interpret visual data. Machines can accurately identify and classify objects using digital images from cameras and videos, deep learning models, and then respond to what they “see”. The detection of document manipulation is an area where these technologies are crucial. Everyone in India is given a PAN (Permanent Account Number), which is a 10-character alphanumeric code, especially those who pay taxes. Various organizations make use of identity documents like PAN cards. The PAN Card given by the employee or client may be genuine or fraudulent. This review paper’s main goal is to use computer vision to determine whether the provided PAN card image is authentic or altered (fake). Our goal is to create a method that uses machine learning techniques to categorize PAN cards.\n\nKeywords: Machine Learning, Convolutional Neural Network, Fraud, Image Processing",
        "keywords": "",
        "link": "http://dx.doi.org/10.52403/ijshr.20230225"
    },
    {
        "id": 2072,
        "title": "Using Machine Learning to Identify Product Styles",
        "authors": "Hung-Hsiang Wang, Yen-Ling Chen",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023055039"
    },
    {
        "id": 2073,
        "title": "Empowering Healthcare Systems Using Machine Learning: Working, Classification and Application",
        "authors": "Keshav Raj Thakur, Bharat Bhushan",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccis60361.2023.10425214"
    },
    {
        "id": 2074,
        "title": "Retracted: Financial Fraud Detection in Healthcare Using Machine Learning and Deep Learning Techniques",
        "authors": "",
        "published": "2023-12-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9758612"
    },
    {
        "id": 2075,
        "title": "Intelligent Decision Support System in Healthcare using Machine Learning\nModels",
        "authors": "Anup Patnaik, Krishna Prasad K.",
        "published": "2024-7",
        "citations": 1,
        "abstract": "\nBackground:\nThe use of intelligent decision support systems (IDSS) is widespread in the\nhealthcare industry, particularly for real-time data, client and family history datasets, and prevalent\npatient features.\n\n\nObjective:\nA massive chunk of various kinds of health data sets, including sensor information, medical\nevidence, and omic statistics, are produced by the modern techniques in this field and eventually\ntransferred to a machine learning (ML) element for extracting data, categorization, as well as mining.\n\n\nMethod:\nIn recent times, many patents have been focused on healthcare monitoring; however, they\ndo not adequately incorporate appropriate algorithms for data collection, analysis, and prediction.\nThe data collected is used for predictive modelling, then additionally, machine learning techniques\nare assisting to compare acquired datasets mathematically for decision-making platforms that may\nlearn to recognise the recent trend and anticipated future problems. Depending on the dataset type,\nML-based techniques can assess the circumstances. Training datasets are crucial for correctly anticipating\nboth current and emerging events as well as new challenges.\n\n\nResults:\nSince the importance of data acquisition determines how well learning models function,\nany deformed data of the types of dirty data, noisy data, unstructured data, and inadequate information\nresults in inaccurate detection, estimate, and prediction.\n\n\nConclusion:\nAdditionally, in contrast to other approaches, the experimental findings demonstrate\nthe usefulness of the proposed method as a widespread implementation of machine learning algorithms\nwithin healthcare systems.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1872212118666230606145738"
    },
    {
        "id": 2076,
        "title": "Sarcopenia Prediction for Elderly People Using Machine Learning: A Case Study on Physical Activity",
        "authors": "Minje Seok, Wooseong Kim",
        "published": "2023-5-5",
        "citations": 6,
        "abstract": "Sarcopenia is a well-known age-related disease that can lead to musculoskeletal disorders and chronic metabolic syndromes, such as sarcopenic obesity. Numerous studies have researched the relationship between sarcopenia and various risk factors, leading to the development of predictive models based on these factors. In this study, we explored the impact of physical activity (PA) in daily life and obesity on sarcopenia prediction. PA is easier to measure using personal devices, such as smartphones and watches, or lifelogs, than using other factors that require medical equipment and examination. To demonstrate the feasibility of sarcopenia prediction using PA, we trained various machine learning models, including gradient boosting machine (GBM), xgboost (XGB), lightgbm (LGB), catboost (CAT), logistic regression, support vector classifier, k-nearest neighbors, random forest (RF), multi-layer perceptron, and deep neural network (DNN), using data samples from the Korea National Health and Nutrition Examination Survey. Among the models, the DNN achieved the most precise accuracy on average, 81%, with PA features across all data combinations, and the accuracy increased up to 90% with the addition of obesity information, such as total fat mass and fat percentage. Considering the difficulty of measuring the obesity feature, when adding waist circumference to the PA features, the DNN recorded the highest accuracy of 84%. This model accuracy could be improved by using separate training sets according to gender. As a result of measurement with various metrics for accurate evaluation of models, GBM, XGB, LGB, CAT, RF, and DNN demonstrated significant predictive performance using only PA features including waist circumference, with AUC values at least around 0.85 and often approaching or exceeding 0.9. We also found the key features for a highly performing model such as the quantified PA value and metabolic equivalent score in addition to a simple obesity measure such as body mass index (BMI) and waist circumference using SHAP analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11091334"
    },
    {
        "id": 2077,
        "title": "Prediction Models for Intrauterine Growth Restriction Using Artificial Intelligence and Machine Learning: A Systematic Review and Meta-Analysis",
        "authors": "Riccardo Rescinito, Matteo Ratti, Anil Babu Payedimarri, Massimiliano Panella",
        "published": "2023-6-1",
        "citations": 3,
        "abstract": "Background: IntraUterine Growth Restriction (IUGR) is a global public health concern and has major implications for neonatal health. The early diagnosis of this condition is crucial for obtaining positive outcomes for the newborn. In recent years Artificial intelligence (AI) and machine learning (ML) techniques are being used to identify risk factors and provide early prediction of IUGR. We performed a systematic review (SR) and meta-analysis (MA) aimed to evaluate the use and performance of AI/ML models in detecting fetuses at risk of IUGR. Methods: We conducted a systematic review according to the PRISMA checklist. We searched for studies in all the principal medical databases (MEDLINE, EMBASE, CINAHL, Scopus, Web of Science, and Cochrane). To assess the quality of the studies we used the JBI and CASP tools. We performed a meta-analysis of the diagnostic test accuracy, along with the calculation of the pooled principal measures. Results: We included 20 studies reporting the use of AI/ML models for the prediction of IUGR. Out of these, 10 studies were used for the quantitative meta-analysis. The most common input variable to predict IUGR was the fetal heart rate variability (n = 8, 40%), followed by the biochemical or biological markers (n = 5, 25%), DNA profiling data (n = 2, 10%), Doppler indices (n = 3, 15%), MRI data (n = 1, 5%), and physiological, clinical, or socioeconomic data (n = 1, 5%). Overall, we found that AI/ML techniques could be effective in predicting and identifying fetuses at risk for IUGR during pregnancy with the following pooled overall diagnostic performance: sensitivity = 0.84 (95% CI 0.80–0.88), specificity = 0.87 (95% CI 0.83–0.90), positive predictive value = 0.78 (95% CI 0.68–0.86), negative predictive value = 0.91 (95% CI 0.86–0.94) and diagnostic odds ratio = 30.97 (95% CI 19.34–49.59). In detail, the RF-SVM (Random Forest–Support Vector Machine) model (with 97% accuracy) showed the best results in predicting IUGR from FHR parameters derived from CTG. Conclusions: our findings showed that AI/ML could be part of a more accurate and cost-effective screening method for IUGR and be of help in optimizing pregnancy outcomes. However, before the introduction into clinical daily practice, an appropriate algorithmic improvement and refinement is needed, and the importance of quality assessment and uniform diagnostic criteria should be further emphasized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/healthcare11111617"
    },
    {
        "id": 2078,
        "title": "Early Stage Diabetes Prediction of Patients in Big Data Healthcare Using Sophisticated Machine Learning Approach",
        "authors": "",
        "published": "2023-8-8",
        "citations": 0,
        "abstract": "Diabetes is an illness caused because of high glucose level in a human body. Diabetes should not be ignored if it is untreated then Diabetes may cause some major issues in a person like: heart related problems, kidney problem, blood pressure, eye damage and it can also affects other organs of human body. Diabetes can be controlled if it is predicted earlier. To achieve this goal this project work will do early prediction of Diabetes in a human body or a patient for a higher accuracy through applying, Various Machine Learning Techniques. Machine learning is an emerging scientific field in data science dealing with the ways in which machines learn from experience. The aim of this project is to develop a system which can perform early prediction of diabetes for a patient with a higher accuracy by combining the results of different machine learning techniques. In this work, Boosting decision tree model (BDT) is used to predict the diabetes. The proposed model is used boosting algorithm to enhance the perform ace of the model. The accuracy is different for every model when compared to other models. The Result shows that the proposed model achieved higher accuracy compared to other machine learning techniques.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59544/shxr1973/ngcesi23p137"
    },
    {
        "id": 2079,
        "title": "Predicting Heart Disease Using Machine Learning in Healthcare Based on Several Data Sources",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56452/7-2-551"
    },
    {
        "id": 2080,
        "title": "Integrated Healthcare System Using Machine Learning",
        "authors": "Prof. Archana Ugale",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: In this digital world, data is an asset, and enormous data was generated in all fields. Data in the healthcare industry consists of all the information related to patients. Here a general architecture has been proposed for predicting disease in the healthcare industry. Many of the existing models are concentrating on one disease per analysis. There is no common system present that can analyse more than one disease at a time",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.52536"
    },
    {
        "id": 2081,
        "title": "Electroencephalography-Based Depression Detection Using Multiple Machine Learning Techniques",
        "authors": "Amel Ksibi, Mohammed Zakariah, Leila Jamel Menzli, Oumaima Saidani, Latifah Almuqren, Rosy Awny Mohamed Hanafieh",
        "published": "2023-5-17",
        "citations": 7,
        "abstract": "The growth of biomedical engineering has made depression diagnosis via electroencephalography (EEG) a trendy issue. The two significant challenges to this application are EEG signals’ complexity and non-stationarity. Additionally, the effects caused by individual variances may hamper the generalization of detection systems. Given the association between EEG signals and particular demographics, such as gender and age, and the influences of these demographic characteristics on the incidence of depression, it would be preferable to include demographic factors during EEG modeling and depression detection. The main objective of this work is to develop an algorithm that can recognize depression patterns by studying EEG data. Following a multiband analysis of such signals, machine learning and deep learning techniques were used to detect depression patients automatically. EEG signal data are collected from the multi-modal open dataset MODMA and employed in studying mental diseases. The EEG dataset contains information from a traditional 128-electrode elastic cap and a cutting-edge wearable 3-electrode EEG collector for widespread applications. In this project, resting EEG readings of 128 channels are considered. According to CNN, training with 25 epoch iterations had a 97% accuracy rate. The patient’s status has to be divided into two basic categories: major depressive disorder (MDD) and healthy control. Additional MDD include the following six classes: obsessive-compulsive disorders, addiction disorders, conditions brought on by trauma and stress, mood disorders, schizophrenia, and the anxiety disorders discussed in this paper are a few examples of mental illnesses. According to the study, a natural combination of EEG signals and demographic data is promising for the diagnosis of depression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13101779"
    },
    {
        "id": 2082,
        "title": "Heart Failure Emergency Readmission Prediction Using Stacking Machine Learning Model",
        "authors": "Md. Rahman, Hasib Rahman, Johayra Prithula, Muhammad Chowdhury, Mosabber Ahmed, Jaya Kumar, M. Murugappan, Muhammad Khan",
        "published": "2023-6-2",
        "citations": 2,
        "abstract": "Heart failure is a devastating disease that has high mortality rates and a negative impact on quality of life. Heart failure patients often experience emergency readmission after an initial episode, often due to inadequate management. A timely diagnosis and treatment of underlying issues can significantly reduce the risk of emergency readmissions. The purpose of this project was to predict emergency readmissions of discharged heart failure patients using classical machine learning (ML) models based on Electronic Health Record (EHR) data. The dataset used for this study consisted of 166 clinical biomarkers from 2008 patient records. Three feature selection techniques were studied along with 13 classical ML models using five-fold cross-validation. A stacking ML model was trained using the predictions of the three best-performing models for final classification. The stacking ML model provided an accuracy, precision, recall, specificity, F1-score, and area under the curve (AUC) of 89.41%, 90.10%, 89.41%, 87.83%, 89.28%, and 0.881, respectively. This indicates the effectiveness of the proposed model in predicting emergency readmissions. The healthcare providers can intervene pro-actively to reduce emergency hospital readmission risk and improve patient outcomes and decrease healthcare costs using the proposed model.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13111948"
    },
    {
        "id": 2083,
        "title": "HealthCare Chatbot Using Machine Learning and NLP",
        "authors": "Ronak Surve, Tushar Purohit, Rehan Joseph, Phiroj Shaikh",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icast59062.2023.10455027"
    },
    {
        "id": 2084,
        "title": "Machine Learning Approach for the Prediction of In-Hospital Mortality in Traumatic Brain Injury Using Bio-Clinical Markers at Presentation to the Emergency Department",
        "authors": "Ahammed Mekkodathil, Ayman El-Menyar, Mashhood Naduvilekandy, Sandro Rizoli, Hassan Al-Thani",
        "published": "2023-8-5",
        "citations": 1,
        "abstract": "Background: Accurate prediction of in-hospital mortality is essential for better management of patients with traumatic brain injury (TBI). Machine learning (ML) algorithms have been shown to be effective in predicting clinical outcomes. This study aimed to identify predictors of in-hospital mortality in TBI patients using ML algorithms. Materials and Method: A retrospective study was performed using data from both the trauma registry and electronic medical records among TBI patients admitted to the Hamad Trauma Center in Qatar between June 2016 and May 2021. Thirteen features were selected for four ML models including a Support Vector Machine (SVM), Logistic Regression (LR), Random Forest (RF), and Extreme Gradient Boosting (XgBoost), to predict the in-hospital mortality. Results: A dataset of 922 patients was analyzed, of which 78% survived and 22% died. The AUC scores for SVM, LR, XgBoost, and RF models were 0.86, 0.84, 0.85, and 0.86, respectively. XgBoost and RF had good AUC scores but exhibited significant differences in log loss between the training and testing sets (% difference in logloss of 79.5 and 41.8, respectively), indicating overfitting compared to the other models. The feature importance trend across all models indicates that aPTT, INR, ISS, prothrombin time, and lactic acid are the most important features in prediction. Magnesium also displayed significant importance in the prediction of mortality among serum electrolytes. Conclusions: SVM was found to be the best-performing ML model in predicting the mortality of TBI patients. It had the highest AUC score and did not show overfitting, making it a more reliable model compared to LR, XgBoost, and RF.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13152605"
    },
    {
        "id": 2085,
        "title": "Developing a Pre-Consultation System using Machine Learning for Medical Diagnostics",
        "authors": "Medisetty Likhitha, G Kalyani, Tulluri Naga Vennela, Dharmapuri Mahith Paul",
        "published": "2023-2-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccmc56507.2023.10083792"
    },
    {
        "id": 2086,
        "title": "Validation of Machine Learning Models for Craniofacial Growth Prediction",
        "authors": "Eungyeong Kim, Yasuhiro Kuroda, Yoshiki Soeda, So Koizumi, Tetsutaro Yamaguchi",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "This study identified the most accurate model for predicting longitudinal craniofacial growth in a Japanese population using statistical methods and machine learning. Longitudinal lateral cephalometric radiographs were collected from 59 children (27 boys and 32 girls) with no history of orthodontic treatment. Multiple regression analysis, least absolute shrinkage and selection operator, radial basis function network, multilayer perceptron, and gradient-boosted decision tree were used. The independent variables included 26 coordinated values of skeletal landmarks, 13 linear skeletal parameters, and 17 angular skeletal parameters in children ages 6 to 12 years. The dependent variables were the values of the 26 coordinated skeletal landmarks, 13 skeletal linear parameters, and 17 skeletal angular parameters at 13 years of age. The difference between the predicted and actual measured values was calculated using the root-mean-square error. The prediction model for craniofacial growth using the least absolute shrinkage and selection operator had the smallest average error for all values of skeletal landmarks, linear parameters, and angular parameters. The highest prediction accuracies when predicting skeletal linear and angular parameters for 13-year-olds were 97.87% and 94.45%, respectively. This model incorporates several independent variables and is useful for future orthodontic treatment because it can predict individual growth.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13213369"
    },
    {
        "id": 2087,
        "title": "International Conference on Recent Trends in Applied Sciences and Physical Sciences using Machine Learning Techniques",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.55487/1hbrsm58"
    },
    {
        "id": 2088,
        "title": "Chatbot For Healthcare Using Machine Learning",
        "authors": "R Kaladevi, S Saidineesha, P Keerthi Priya, K.M Nithiya, S Sai Gayatri",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccci56745.2023.10128261"
    },
    {
        "id": 2089,
        "title": "Retracted: An Intelligent and Reliable Hyperparameter Optimization Machine Learning Model for Early Heart Disease Assessment Using Imperative Risk Attributes",
        "authors": "",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9871962"
    },
    {
        "id": 2090,
        "title": "Fair and Equitable Machine Learning Algorithms in Healthcare: A Systematic Mapping",
        "authors": "Marcelo Mattos, Sean Siqueira, Ana Garcia",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012394700003636"
    },
    {
        "id": 2091,
        "title": "An investigation of machine learning algorithms and data augmentation techniques for diabetes diagnosis using class imbalanced BRFSS dataset",
        "authors": "Mohammad Mihrab Chowdhury, Ragib Shahariar Ayon, Md Sakhawat Hossain",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100297"
    },
    {
        "id": 2092,
        "title": "A Medical Cyber-physical system for predicting maternal health in developing countries using machine learning",
        "authors": "Mohammad Mobarak Hossain, Mohammod Abdul Kashem, Nasim Mahmud Nayan, Mohammad Asaduzzaman Chowdhury",
        "published": "2024-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100285"
    },
    {
        "id": 2093,
        "title": "A Current Review of Machine Learning and Deep Learning Models in Oral Cancer Diagnosis: Recent Technologies, Open Challenges, and Future Research Directions",
        "authors": "Shriniket Dixit, Anant Kumar, Kathiravan Srinivasan",
        "published": "2023-4-5",
        "citations": 15,
        "abstract": "Cancer is a problematic global health issue with an extremely high fatality rate throughout the world. The application of various machine learning techniques that have appeared in the field of cancer diagnosis in recent years has provided meaningful insights into efficient and precise treatment decision-making. Due to rapid advancements in sequencing technologies, the detection of cancer based on gene expression data has improved over the years. Different types of cancer affect different parts of the body in different ways. Cancer that affects the mouth, lip, and upper throat is known as oral cancer, which is the sixth most prevalent form of cancer worldwide. India, Bangladesh, China, the United States, and Pakistan are the top five countries with the highest rates of oral cavity disease and lip cancer. The major causes of oral cancer are excessive use of tobacco and cigarette smoking. Many people’s lives can be saved if oral cancer (OC) can be detected early. Early identification and diagnosis could assist doctors in providing better patient care and effective treatment. OC screening may advance with the implementation of artificial intelligence (AI) techniques. AI can provide assistance to the oncology sector by accurately analyzing a large dataset from several imaging modalities. This review deals with the implementation of AI during the early stages of cancer for the proper detection and treatment of OC. Furthermore, performance evaluations of several DL and ML models have been carried out to show that the DL model can overcome the difficult challenges associated with early cancerous lesions in the mouth. For this review, we have followed the rules recommended for the extension of scoping reviews and meta-analyses (PRISMA-ScR). Examining the reference lists for the chosen articles helped us gather more details on the subject. Additionally, we discussed AI’s drawbacks and its potential use in research on oral cancer. There are methods for reducing risk factors, such as reducing the use of tobacco and alcohol, as well as immunization against HPV infection to avoid oral cancer, or to lessen the burden of the disease. Additionally, officious methods for preventing oral diseases include training programs for doctors and patients as well as facilitating early diagnosis via screening high-risk populations for the disease.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13071353"
    },
    {
        "id": 2094,
        "title": "An intelligent SDN-IoT enabled intrusion detection system for healthcare systems using a hybrid deep learning and machine learning approach",
        "authors": "R. Arthi, S. Krishnaveni, Sherali Zeadally",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/jcc.ja.2022-0681"
    },
    {
        "id": 2095,
        "title": "Higgs event classification using Machine Learning",
        "authors": "Mysha Khan, Pushpa Bhat",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1997111"
    },
    {
        "id": 2096,
        "title": "An Integrated Machine Learning Approach for Congestive Heart Failure Prediction",
        "authors": "M. Sheetal Singh, Khelchandra Thongam, Prakash Choudhary, P. K. Bhagat",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "Congestive heart failure (CHF) is one of the primary sources of mortality and morbidity among the global population. Over 26 million individuals globally are affected by heart disease, and its prevalence is rising by 2% yearly. With advances in healthcare technologies, if we predict CHF in the early stages, one of the leading global mortality factors can be reduced. Therefore, the main objective of this study is to use machine learning applications to enhance the diagnosis of CHF and to reduce the cost of diagnosis by employing minimum features to forecast the possibility of a CHF occurring. We employ a deep neural network (DNN) classifier for CHF classification and compare the performance of DNN with various machine learning classifiers. In this research, we use a very challenging dataset, called the Cardiovascular Health Study (CHS) dataset, and a unique pre-processing technique by integrating C4.5 and K-nearest neighbor (KNN). While the C4.5 technique is used to find significant features and remove the outlier data from the dataset, the KNN algorithm is employed for missing data imputation. For classification, we compare six state-of-the-art machine learning (ML) algorithms (KNN, logistic regression (LR), naive Bayes (NB), random forest (RF), support vector machine (SVM), and decision tree (DT)) with DNN. To evaluate the performance, we use seven statistical measurements (i.e., accuracy, specificity, sensitivity, F1-score, precision, Matthew’s correlation coefficient, and false positive rate). Overall, our results reflect our proposed integrated approach, which outperformed other machine learning algorithms in terms of CHF prediction, reducing patient expenses by reducing the number of medical tests. The proposed model obtained 97.03% F1-score, 95.30% accuracy, 96.49% sensitivity, and 97.58% precision.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics14070736"
    },
    {
        "id": 2097,
        "title": "Machine-Learning-Based Diabetes Mellitus Risk Prediction Using Multi-Layer Neural Network No-Prop Algorithm",
        "authors": "J. Jeba Sonia, Prassanna Jayachandran, Abdul Quadir Md, Senthilkumar Mohan, Arun Kumar Sivaraman, Kong Fah Tee",
        "published": "2023-2-14",
        "citations": 3,
        "abstract": "Over the past few decades, the prevalence of chronic illnesses in humans associated with high blood sugar has dramatically increased. Such a disease is referred to medically as diabetes mellitus. Diabetes mellitus can be categorized into three types, namely types 1, 2, and 3. When beta cells do not secrete enough insulin, type 1 diabetes develops. When beta cells create insulin, but the body is unable to use it, type 2 diabetes results. The last category is called gestational diabetes or type 3. This happens during the trimesters of pregnancy in women. Gestational diabetes, however, disappears automatically after childbirth or may continue to develop into type 2 diabetes. To improve their treatment strategies and facilitate healthcare, an automated information system to diagnose diabetes mellitus is required. In this context, this paper presents a novel system of classification of the three types of diabetes mellitus using a multi-layer neural network no-prop algorithm. The algorithm uses two major phases in the information system: the training phase and the testing phase. In each phase, the relevant attributes are identified using the attribute-selection process, and the neural network is trained individually in a multi-layer manner, starting with normal and type 1 diabetes, then normal and type 2 diabetes, and finally healthy and gestational diabetes. Classification is made more effective by the architecture of the multi-layer neural network. To provide experimental analysis and performances of diabetes diagnoses in terms of sensitivity, specificity, and accuracy, a confusion matrix is developed. The maximum specificity and sensitivity values of 0.95 and 0.97 are attained by this suggested multi-layer neural network. With an accuracy score of 97% for the categorization of diabetes mellitus, this proposed model outperforms other models, demonstrating that it is a workable and efficient approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13040723"
    },
    {
        "id": 2098,
        "title": "Specific Binding Ratio Estimation of [123I]-FP-CIT SPECT Using Frontal Projection Image and Machine Learning",
        "authors": "Akinobu Kita, Hidehiko Okazawa, Katsuya Sugimoto, Nobuyuki Kosaka, Eiji Kidoya, Tetsuya Tsujikawa",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "This study aimed to develop a new convolutional neural network (CNN) method for estimating the specific binding ratio (SBR) from only frontal projection images in single-photon emission-computed tomography using [123I]ioflupane. We created five datasets to train two CNNs, LeNet and AlexNet: (1) 128FOV used a 0° projection image without preprocessing, (2) 40FOV used 0° projection images cropped to 40 × 40 pixels centered on the striatum, (3) 40FOV training data doubled by data augmentation (40FOV_DA, left-right reversal only), (4) 40FOVhalf, and (5) 40FOV_DAhalf, split into left and right (20 × 40) images of 40FOV and 40FOV_DA to separately evaluate the left and right SBR. The accuracy of the SBR estimation was assessed using the mean absolute error, root mean squared error, correlation coefficient, and slope. The 128FOV dataset had significantly larger absolute errors compared to all other datasets (p < 0. 05). The best correlation coefficient between the SBRs using SPECT images and those estimated from frontal projection images alone was 0.87. Clinical use of the new CNN method in this study was feasible for estimating the SBR with a small error rate using only the frontal projection images collected in a short time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13081371"
    },
    {
        "id": 2099,
        "title": "Prediction of the Post-Pubertal Mandibular Length and Y Axis of Growth by Using Various Machine Learning Techniques: A Retrospective Longitudinal Study",
        "authors": "Tyler Wood, Justina O. Anigbo, George Eckert, Kelton T. Stewart, Mehmet Murat Dundar, Hakan Turkkahraman",
        "published": "2023-4-26",
        "citations": 7,
        "abstract": "The aim was to predict the post-pubertal mandibular length and Y axis of growth in males by using various machine learning (ML) techniques. Cephalometric data obtained from 163 males with Class I Angle malocclusion, were used to train various ML algorithms. Analysis of variances (ANOVA) was used to compare the differences between predicted and actual measurements among methods and between time points. All the algorithms revealed an accuracy range from 95.80% to 97.64% while predicting post-pubertal mandibular length. When predicting the Y axis of growth, accuracies ranged from 96.60% to 98.34%. There was no significant interaction between methods and time points used for predicting the mandibular length (p = 0.235) and Y axis of growth (p = 0.549). All tested ML algorithms accurately predicted the post-pubertal mandibular length and Y axis of growth. The best predictors for the mandibular length were mandibular and maxillary lengths, and lower face height, while they were Y axis of growth, lower face height, and mandibular plane angle for the post-pubertal Y axis of growth. No significant difference was found among the accuracies of the techniques, except the least squares method had a significantly larger error than all others in predicting the Y axis of growth.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13091553"
    },
    {
        "id": 2100,
        "title": "Identifying Effective Biomarkers for Accurate Pancreatic Cancer Prognosis Using Statistical Machine Learning",
        "authors": "Rasha Abu-Khudir, Noor Hafsa, Badr E. Badr",
        "published": "2023-9-29",
        "citations": 0,
        "abstract": "Pancreatic cancer (PC) has one of the lowest survival rates among all major types of cancer. Consequently, it is one of the leading causes of mortality worldwide. Serum biomarkers historically correlate well with the early prognosis of post-surgical complications of PC. However, attempts to identify an effective biomarker panel for the successful prognosis of PC were almost non-existent in the current literature. The current study investigated the roles of various serum biomarkers including carbohydrate antigen 19-9 (CA19-9), chemokine (C-X-C motif) ligand 8 (CXCL-8), procalcitonin (PCT), and other relevant clinical data for identifying PC progression, classified into sepsis, recurrence, and other post-surgical complications, among PC patients. The most relevant biochemical and clinical markers for PC prognosis were identified using a random-forest-powered feature elimination method. Using this informative biomarker panel, the selected machine-learning (ML) classification models demonstrated highly accurate results for classifying PC patients into three complication groups on independent test data. The superiority of the combined biomarker panel (Max AUC-ROC = 100%) was further established over using CA19-9 features exclusively (Max AUC-ROC = 75%) for the task of classifying PC progression. This novel study demonstrates the effectiveness of the combined biomarker panel in successfully diagnosing PC progression and other relevant complications among Egyptian PC survivors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/diagnostics13193091"
    }
]