[
    {
        "id": 2301,
        "title": "Optimization of Alpha-Beta pruning based on heuristic algorithm",
        "authors": "Don Yitong Ma",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "Games have become an important place for testing Artificial Intelligence (AI). Minimax and Alpha-Beta Pruning are two common and basic algorithms implemented in game AIs. However, there are still limitations of the searching time and searching depth. This paper strives to improve the game AI with a Heuristic Algorithm to optimize both the searching time and depth. The experiment consists of three AIs built with Minimax, Alpha-Beta Pruning, and Heuristic Algorithm to evident the improvement. These AIs are built to play a traditional Chinese zero-sum game, Gobang, which can be seen as an enhanced version of tic-tac-toe but more advanced. The data is collected when AIs compete with each other. Comparing the search time of three AIs, there is significant improvement of AI implemented Heuristic Algorithm; the median search time for Heuristic AI is only half of the Alpha-Beta Pruning AI, and only quarter of the Minimax AI. Moreover, because the search time decreases, the searching depth of the Heuristic AI can also be increased. With the larger searching depth, the Heuristic AI also gains a higher winning rate against the other two AIs.",
        "link": "http://dx.doi.org/10.54254/2755-2721/6/20230498"
    },
    {
        "id": 2302,
        "title": "PERBANDINGAN PERFORMA ALGORITMA  MINIMAX DAN ALPHA-BETA PRUNING PADA GAME CATUR CINA",
        "authors": "Marthin Hokita Kurniawan, Daniel Udjulawa",
        "published": "2020-10-10",
        "citations": 1,
        "abstract": "Algoritma merupakan urutan yang lengkap dan logis, dengan urutan yang logis banyak cara yang dilakukan dengan urutan yang berbeda. Pada kasus ini akan dibandingkan performa dari algoritma Minimax dan Alpha Beta Pruning pada game Catur Cina (XiangQi). Tujuannnya adalah sejauh mana waktu yang digunakan oleh kedua algoritma tersebut efektif dalam permainan Catur Cina. Metodologi yang digunakan dalam membangun aplikasi adalah Rapid Application Development, yaitu merupakan pengembangan dari metodologi Software Development Life Cycle. Kegiatan yang dilakukan antara lain yaitu melakukan perencanaan dan analisis terhadap pengembangan game dan melakukan pembuatan game dengan menggunakan game engine Unity dan bahasa pemograman C#, Editor yang digunakan adalah Atom. Hasil pembuatan game dan koding algoritma akan di uji coba dengan iterasi kedalaman dan preset yang ditentukan sesuai dengan Minimax dan Alpha-Beta Pruning. Data yang didapat yaitu kecepatan dan banyak putaran antara kedua algoritma. Data tersebut akan dibandingkan sehingga performa kedua algoritma akan terlihat jelas.",
        "link": "http://dx.doi.org/10.35957/algoritme.v1i1.443"
    },
    {
        "id": 2303,
        "title": "Comparative study of performance of parallel alpha Beta Pruning for different architectures",
        "authors": "Shubhendra Pal Singhal, M. Sridevi",
        "published": "2019-12",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iacc48062.2019.8971591"
    },
    {
        "id": 2304,
        "title": "Implementation of Alpha-Beta Pruning and Transposition Tables on Checkers Game",
        "authors": "Cristian C. Suancha, Marco J. Suarez, Felipe A. Besoain",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2024.3381958"
    },
    {
        "id": 2305,
        "title": "Tic Tac Toe by Minimax Alpha-Beta Pruning Using Arduino",
        "authors": "Mallikarjun Mudda",
        "published": "2022-2-28",
        "citations": 0,
        "abstract": "Abstract: Heuristic algorithms are put to the test in games. Because they incorporate an unexpected opponent, two-person games are more challenging than a basic puzzle. In a two-player game, you must presume that your opponent has the same information as you and can use it just as well. As a result, you must presume that your opponent will make the best available move at each level of the game. The minimax method is built on this foundation. The players in minimax are referred to as MAX (the player) and MIN (the player) (the opponent). Both aim to get the most out of their actions. The player, MAX, is attempting to maximise her score. And MIN is the opponent attempting to reduce MAX's score to the bare minimum. It is impossible to stretch the graph to its leaf nodes in most games.The number of layers in the state space is increased to n. The heuristic evaluation function assigns a value to each leaf node in this subgraph. The values are then passed back to the root node. The heuristic value of the best state that can be attained from that node is represented by the value propagated back. The process of alpha-beta pruning is used to reduce the amount of computation and searching required during minimax. Minimax is a two-pass search, with the first pass assigning heuristic values to nodes at the lowest depth and the second pass propagating those values up the tree. The depth-first approach is used in alpha-beta search. A MAX node's initial or temporary value is called an alpha value.Because MAX nodes receive the highest value from their descendants, an alpha value can never fall; it can only rise. A beta value is a value linked with a MIN node that is initial or transitory. A beta value can never increase; it can only go down because MIN nodes are assigned the lowest value among their progeny. Assume alpha = 6 for a MAX node. Then any branches originating from a MIN descendant with a beta value less than or equal to 6 won't be included in the search. So, if you know that the MAX node has an alpha of 6 and that one of its MIN children has a beta of less than or equal to 6, you don't need to look any farther down the MIN node. This is called Alpha Beta Pruning. Keywords: component, formatting, style, styling, insert (key words)",
        "link": "http://dx.doi.org/10.22214/ijraset.2022.40115"
    },
    {
        "id": 2306,
        "title": "Overcoming 5G ultra-density with game theory: Alpha-beta pruning aided conflict detection",
        "authors": "Tuğçe Bilen, Berk Canberk",
        "published": "2020-3",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.pmcj.2020.101133"
    },
    {
        "id": 2307,
        "title": "Alpha-Beta Pruning for Games with Simultaneous Moves",
        "authors": "Abdallah Saffidine, Hilmar Finnsson, Michael Buro",
        "published": "2021-9-20",
        "citations": 2,
        "abstract": "\n      \n        Alpha-Beta pruning is one of the most powerful and fundamental MiniMax search improvements. It was designed for sequential two-player zero-sum perfect information games. In this paper we introduce an Alpha-Beta-like sound pruning method for the more general class of “stacked matrix games” that allow for simultaneous moves by both players. This is accomplished by maintaining upper and lower bounds for achievable payoffs in states with simultaneous actions and dominated action pruning based on the feasibility of certain linear programs. Empirical data shows considerable savings in terms of expanded nodes compared to naive depth-first move computation without pruning. \n      \n    ",
        "link": "http://dx.doi.org/10.1609/aaai.v26i1.8148"
    },
    {
        "id": 2308,
        "title": "Peningkatan Kemenangan Non-Playable Character dalam Permainan Triple Triad Menggunakan Alpha-Beta Pruning",
        "authors": "Benedictta Dinda Permatasari, Hanny Haryanto, Erna Zuni Astuti, Erlin Dolphina",
        "published": "2022-4-30",
        "citations": 0,
        "abstract": "Non-Playable Character (NPC) is one of the essential elements in video games. Generally, NPCs provide challenges for players in completing missions in the game, where NPCs mean acting as enemies. The role of the enemy causes the victory rate to be one of the main goals of artificial intelligence applied to NPCs. The challenges that these NPCs provide are significant to keep players going. NPCs must be able to provide a balanced challenge like humans to have an experience that is as enjoyable as when playing with other people. The problem is the low win rate achieved by NPCs so that players can feel bored. The alpha-beta pruning algorithm is one of the decision-making algorithms that is often applied to games that require more than or equal two players. Therefore, this algorithm is suitable for applying to the object of research, namely the Triple Triad game. The Triple Triad game is a board game played by two players. The Triple Triad game was first introduced as a mini-game in the Final Fantasy VIII game. This game is a combination of card games and board games. In this study, the alpha-beta pruning algorithm was proven to increase the win rate of NPCs. It is indicated by comparing the win rate of NPCs who choose a random step, which is 17.5%, with an NPC that has applied the alpha-beta pruning algorithm, which is 55%. Therefore, there is a significant increase in the win rate.  Keywords: Alpha-beta pruning; artificial intelligence; card; game; Non-Playable Character.",
        "link": "http://dx.doi.org/10.23960/komputasi.v10i1.2952"
    },
    {
        "id": 2309,
        "title": "Design of Checkers Game Using Alpha-Beta Pruning Algorithm",
        "authors": "Achmad Naufal Wijaya Jofanda, Mohamad Yasin",
        "published": "2021-8-8",
        "citations": 0,
        "abstract": "Checkers is a board game that is played by two people which has a purpose to defeat the opponent by eating all the opponent's pieces or making the opponent unable to make a move. The sophistication of technology at this modern time makes the checkers game can be used on a computer even with a smartphone. The application of artificial intelligence in checkers games makes the game playable anywhere and anytime. Alpha Beta Pruning is an optimization technique from the Minimax Algorithm that can reduce the number of branch/node extensions to get better and faster step search results. In this study, a checkers game based on artificial intelligence will be developed using the alpha-beta pruning method. This research is expected to explain in detail how artificial intelligence works in a game. Alpha-beta pruning was chosen because it can search for the best steps quickly and precisely. This study tested 10 respondents to play this game. The results show that the player's win rate was 60% at the easy level, 40% at the medium level, and 20% at the hard level. Besides that, the level of interest in this game was 80% being entertained and 20% feeling ordinary.",
        "link": "http://dx.doi.org/10.29407/intensif.v5i2.15863"
    },
    {
        "id": 2310,
        "title": "The Solution for the Branching Factor of the Alpha-Beta Pruning Algorithm and its Optimality",
        "authors": "Judea Pearl",
        "published": "2022-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3501714.3501724"
    },
    {
        "id": 2311,
        "title": "Analysis of Game Tree Search Algorithms Using Minimax Algorithm and Alpha-Beta Pruning",
        "authors": " Prof. Sumit S Shevtekar,  Mugdha Malpe,  Mohammed Bhaila",
        "published": "2022-11-28",
        "citations": 0,
        "abstract": "An important topic of research in computer systems is the optimization of finding the optimum course of action based on different variables, such as the environment's state, the system's goal, etc. The building of the entire state search space, also known as the minimax algorithm, can result from any search algorithm's attempt to find the best feasible solution from among all known possibilities. The recursive backtracking algorithm known as Minimax is used to select the next action in a game of strategy for two players. The algorithm works well because it anticipates that your adversary will play well as well. However, as the tree's depth increases, we observe that minimax frequently investigates repetitive and unlikely situations. We'll also take a look at the minimax extension known as alpha-beta pruning, which prohibits us from considering states that won't be chosen. We will also examine a number of established techniques for resolving two-player games, such as adversarial search and other machine learning-based techniques.",
        "link": "http://dx.doi.org/10.32628/cseit1228644"
    },
    {
        "id": 2312,
        "title": "Analyzing a Chess Engine Based on Alpha–Beta Pruning, Enhanced with Iterative Deepening",
        "authors": "Aayush Parashar, Aayush Kumar Jha, Manoj Kumar",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-2500-9_51"
    },
    {
        "id": 2313,
        "title": "Chess Board: Performance of Alpha–Beta Pruning in Reducing Node Count of Minimax Tree",
        "authors": "Aashrit Garg, Anita Shrotriya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-0769-4_57"
    },
    {
        "id": 2314,
        "title": "The Analysis of Alpha Beta Pruning and MTD(f) Algorithm to Determine the Best Algorithm to be Implemented at Connect Four Prototype",
        "authors": "Lukas Tommy, Mardi Hardjianto, Nazori Agani",
        "published": "2017-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1757-899x/190/1/012044"
    },
    {
        "id": 2315,
        "title": "Comparative Analysis of Minimax Algorithm with Alpha–Beta Pruning Optimization for Chess Engine",
        "authors": "Harshit Choudhary, Aniket Inamdar, Swapnil Kharade, Anunay Maheshwari, Preeti Kale",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-4284-8_19"
    },
    {
        "id": 2316,
        "title": "On the rational difference equation  \\(y_{{n+1}}={\\frac{\\alpha _{{0}}y_{{n}}+\\alpha _{{1}}y_{{n-p}}+\\alpha _{{2}}y_{{n-q}}+\\alpha _{{3}}y_{{n-r}}+\\alpha _{{4}}y_{{n-s}}+\\alpha _{{5}}y_{{n-t}}}{\\beta _{{0}}y_{{n}}+\\beta _{{1}}y_{{n-p}}+\\beta _{{2}}y_{{n-q}}+\\beta _{{3}}y_{{n-r}}+\\beta _{{4}}y_{{n-s}}+\\beta _{{5}}y_{{n-t}}}}\\)",
        "authors": "M. A. El-Moneam, E. S. Aly, M. A. Aiyashi",
        "published": "2018-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22436/jnsa.012.02.04"
    },
    {
        "id": 2317,
        "title": "ENCSR176CXH",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr176cxh"
    },
    {
        "id": 2318,
        "title": "ENCSR757FGN",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr757fgn"
    },
    {
        "id": 2319,
        "title": "ENCSR536AYF",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr536ayf"
    },
    {
        "id": 2320,
        "title": "ENCSR283LWF",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr283lwf"
    },
    {
        "id": 2321,
        "title": "ENCSR231ZZH",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr231zzh"
    },
    {
        "id": 2322,
        "title": "ENCSR830YQW",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr830yqw"
    },
    {
        "id": 2323,
        "title": "ENCSR896PJY",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr896pjy"
    },
    {
        "id": 2324,
        "title": "ENCSR787HDF",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr787hdf"
    },
    {
        "id": 2325,
        "title": "ENCSR114AZZ",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr114azz"
    },
    {
        "id": 2326,
        "title": "ENCSR175IGC",
        "authors": "B Bernstein",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr175igc"
    },
    {
        "id": 2327,
        "title": "ENCSR996DNY",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr996dny"
    },
    {
        "id": 2328,
        "title": "ENCSR486XJK",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr486xjk"
    },
    {
        "id": 2329,
        "title": "ENCSR785RXZ",
        "authors": "B Bernstein",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr785rxz"
    },
    {
        "id": 2330,
        "title": "ENCSR243QSZ",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr243qsz"
    },
    {
        "id": 2331,
        "title": "ENCSR469QEM",
        "authors": "B Bernstein",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr469qem"
    },
    {
        "id": 2332,
        "title": "ENCSR570TYL",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr570tyl"
    },
    {
        "id": 2333,
        "title": "ENCSR540XNK",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr540xnk"
    },
    {
        "id": 2334,
        "title": "ENCSR917PCR",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr917pcr"
    },
    {
        "id": 2335,
        "title": "ENCSR975WTH",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr975wth"
    },
    {
        "id": 2336,
        "title": "ENCSR622ZKD",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr622zkd"
    },
    {
        "id": 2337,
        "title": "ENCSR796MKZ",
        "authors": "B Bernstein",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr796mkz"
    },
    {
        "id": 2338,
        "title": "ENCSR807AXH",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr807axh"
    },
    {
        "id": 2339,
        "title": "ENCSR315MYP",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr315myp"
    },
    {
        "id": 2340,
        "title": "ENCSR274VSS",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr274vss"
    },
    {
        "id": 2341,
        "title": "ENCSR650DHK",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr650dhk"
    },
    {
        "id": 2342,
        "title": "ENCSR391OPI",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr391opi"
    },
    {
        "id": 2343,
        "title": "ENCSR696DVE",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr696dve"
    },
    {
        "id": 2344,
        "title": "ENCSR617MNG",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr617mng"
    },
    {
        "id": 2345,
        "title": "ENCSR934ZBY",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr934zby"
    },
    {
        "id": 2346,
        "title": "ENCSR048ARD",
        "authors": "B Bernstein",
        "published": "2020-9-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr048ard"
    },
    {
        "id": 2347,
        "title": "ENCSR112KIE",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr112kie"
    },
    {
        "id": 2348,
        "title": "ENCSR079JAG",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr079jag"
    },
    {
        "id": 2349,
        "title": "ENCSR546YQN",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr546yqn"
    },
    {
        "id": 2350,
        "title": "ENCSR399EMX",
        "authors": "Z Weng",
        "published": "2017-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr399emx"
    },
    {
        "id": 2351,
        "title": "ENCSR744KLY",
        "authors": "Z Weng",
        "published": "2017-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr744kly"
    },
    {
        "id": 2352,
        "title": "Mucolipidosis type III alpha/beta",
        "authors": " ",
        "published": "2020-2-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32388/05vi1v"
    },
    {
        "id": 2353,
        "title": "ENCSR373MTM",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr373mtm"
    },
    {
        "id": 2354,
        "title": "ENCSR881AOK",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr881aok"
    },
    {
        "id": 2355,
        "title": "ENCSR815YZL",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr815yzl"
    },
    {
        "id": 2356,
        "title": "ENCSR183IQU",
        "authors": "B Bernstein",
        "published": "2020-9-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr183iqu"
    },
    {
        "id": 2357,
        "title": "ENCSR624HJH",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr624hjh"
    },
    {
        "id": 2358,
        "title": "ENCSR019FIH",
        "authors": "B Bernstein",
        "published": "2020-8-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr019fih"
    },
    {
        "id": 2359,
        "title": "ENCSR613UFD",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr613ufd"
    },
    {
        "id": 2360,
        "title": "ENCSR919DFZ",
        "authors": "B Bernstein",
        "published": "2020-9-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr919dfz"
    },
    {
        "id": 2361,
        "title": "Alpha vs beta error",
        "authors": "Stefan Tigges",
        "published": "2023-12-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.53347/rid-179949"
    },
    {
        "id": 2362,
        "title": "ENCSR823PDA",
        "authors": "Z Weng",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr823pda"
    },
    {
        "id": 2363,
        "title": "ENCSR583QRJ",
        "authors": "Z Weng",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr583qrj"
    },
    {
        "id": 2364,
        "title": "ENCSR293KRJ",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr293krj"
    },
    {
        "id": 2365,
        "title": "ENCSR975OGP",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr975ogp"
    },
    {
        "id": 2366,
        "title": "ENCSR149HGL",
        "authors": "A Boyle",
        "published": "2022-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr149hgl"
    },
    {
        "id": 2367,
        "title": "ENCSR550SBN",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr550sbn"
    },
    {
        "id": 2368,
        "title": "ENCSR371HBK",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr371hbk"
    },
    {
        "id": 2369,
        "title": "ENCSR721MNV",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr721mnv"
    },
    {
        "id": 2370,
        "title": "ENCSR648EZX",
        "authors": "A Boyle",
        "published": "2022-3-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr648ezx"
    },
    {
        "id": 2371,
        "title": "ENCSR925YTG",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr925ytg"
    },
    {
        "id": 2372,
        "title": "ENCSR230TMP",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr230tmp"
    },
    {
        "id": 2373,
        "title": "ENCSR267AYS",
        "authors": "A Boyle",
        "published": "2022-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr267ays"
    },
    {
        "id": 2374,
        "title": "ENCSR947NJC",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr947njc"
    },
    {
        "id": 2375,
        "title": "ENCSR065ZSA",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr065zsa"
    },
    {
        "id": 2376,
        "title": "ENCSR338YSN",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr338ysn"
    },
    {
        "id": 2377,
        "title": "ENCSR807YZK",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr807yzk"
    },
    {
        "id": 2378,
        "title": "ENCSR569CDP",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr569cdp"
    },
    {
        "id": 2379,
        "title": "ENCSR807MRJ",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr807mrj"
    },
    {
        "id": 2380,
        "title": "ENCSR507BWE",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr507bwe"
    },
    {
        "id": 2381,
        "title": "ENCSR529MVP",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr529mvp"
    },
    {
        "id": 2382,
        "title": "ENCSR517YMP",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr517ymp"
    },
    {
        "id": 2383,
        "title": "ENCSR489DRG",
        "authors": "A Boyle",
        "published": "2022-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr489drg"
    },
    {
        "id": 2384,
        "title": "ENCSR908LWR",
        "authors": "A Boyle",
        "published": "2022-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr908lwr"
    },
    {
        "id": 2385,
        "title": "ENCSR627UTB",
        "authors": "A Boyle",
        "published": "2022-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr627utb"
    },
    {
        "id": 2386,
        "title": "ENCSR915WTT",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr915wtt"
    },
    {
        "id": 2387,
        "title": "ENCSR753NCC",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr753ncc"
    },
    {
        "id": 2388,
        "title": "ENCSR775ZJN",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr775zjn"
    },
    {
        "id": 2389,
        "title": "ENCSR588ABE",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr588abe"
    },
    {
        "id": 2390,
        "title": "ENCSR587NDC",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr587ndc"
    },
    {
        "id": 2391,
        "title": "ENCSR265KMI",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr265kmi"
    },
    {
        "id": 2392,
        "title": "ENCSR099KZM",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr099kzm"
    },
    {
        "id": 2393,
        "title": "ENCSR826TAH",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr826tah"
    },
    {
        "id": 2394,
        "title": "ENCSR131GOZ",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr131goz"
    },
    {
        "id": 2395,
        "title": "ENCSR848QQZ",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr848qqz"
    },
    {
        "id": 2396,
        "title": "ENCSR588RZI",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr588rzi"
    },
    {
        "id": 2397,
        "title": "ENCSR693KLH",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr693klh"
    },
    {
        "id": 2398,
        "title": "ENCSR054MYM",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr054mym"
    },
    {
        "id": 2399,
        "title": "ENCSR064WQF",
        "authors": "A Boyle",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr064wqf"
    },
    {
        "id": 2400,
        "title": "ENCSR740HIW",
        "authors": "A Boyle",
        "published": "2022-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17989/encsr740hiw"
    }
]