[
    {
        "id": 1,
        "title": "Experimental comparison of PageRank vector calculation algorithms",
        "authors": "Daniel  A Skachkov, Sergey  I Gladyshev, Andrei Mikhailovich Raigorodsky",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20537/2076-7633-2023-15-2-369-379"
    },
    {
        "id": 2,
        "title": "Trustworthiness and Pagerank on the Ethereum Blockchain: Technical Report",
        "authors": "Scott Imig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4590362"
    },
    {
        "id": 3,
        "title": "Extrapolated splitting methods for multilinear PageRank computations",
        "authors": "Maryam Boubekraoui",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.apnum.2023.11.019"
    },
    {
        "id": 4,
        "title": "Evaluation of Taekwondo Players' Ranking Using the PageRank Algorithm",
        "authors": "Hai-Lian Sun, Seong-no Lee, Man-Keun Kim,  ",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "The purpose of this study is to apply the Olympic Kyorugi Ranking system and PageRank algorithm to the results of four world-class taekwondo competitions held from 2020 to 2023, including G20, G14, G10, and G6, to calculate the rankings. Based on the results, a comparison between the two algorithms is conducted to provide basic information for taekwondo ranking calculation methods. For the purpose of this study, information was collected from the official website of the World Taekwondo Federation. Use MS-Excel, PyCharm, and IBM SPSS (ver. 27) programs to process data. The results of this study are as follows. Firstly, using the PageRank algorithm, the gender and weight rankings of taekwondo athletes can be calculated. Secondly, using the PageRank system for ranking calculation is more suitable for considering the relative performance of players than using the Olympic Kyorugi Ranking system for ranking calculation. Thirdly, the ranking consistency calculated using the Olympic Kyorugi Ranking system and PageRank system is relatively low.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18789/jwstc.2023.40.19"
    },
    {
        "id": 5,
        "title": "Extrapolation methods for multilinear PageRank",
        "authors": "Abdeslem Hafid Bentbib, Maryam Boubekraoui, Khalide Jbilou",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11075-024-01823-x"
    },
    {
        "id": 6,
        "title": "A Data-Driven Strategy for Online Hate Speech Spreader Identification using Modified Pagerank",
        "authors": "Smita Ghosh, Shiv Jhalani",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "Social media platforms have become breeding grounds for the dissemination of misinformation and harmful content, including hate speech. This research paper aims to tackle the urgent problem of hate speech circulation on Online Social Networks by primarily focusing on the early identification of users who are prone to spreading it. To achieve this objective, a novel data-driven metric is introduced, referred to as ’Hate Speech Potential’. Additionally, an innovative approach is proposed that leverages a modified version of the PageRank algorithm, termed the ’Hate Speech Potential Rank’ algorithm, to effectively detect and identify malicious users within a network. In a vast network with billions of nodes, the rapid spread of content makes timely detection and mitigation crucial. By assessing a user’s past behaviour of sharing or publishing hate speech, their ’Hate Speech Potential’ can be determined, enabling the identification of sources and spreaders of such content. The modified PageRank algorithm considers both the user’s individual characteristics and the influence of their neighbourhood, thereby capturing a more comprehensive picture of their sharing patterns. A pre-trained machine learning model was employed to accurately classify hate speech posts. By combining the predicted labels and user characteristics and implementing the modified PageRank algorithm, this paper aims to gain deeper insights into the dynamics of information dissemination within a social network, thereby contributing to a better understanding of user sharing behaviour and facilitating the development of effective strategies for addressing hate speech. K-Means clustering was used in experimental evaluations, demonstrating the effectiveness of the proposed approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131916"
    },
    {
        "id": 7,
        "title": "Algorithm Analysis of Trade Gravity Model Based on PageRank Algorithm",
        "authors": "Jiayi Chen",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00043"
    },
    {
        "id": 8,
        "title": "Retracted: Internet Tourism Resource Retrieval Using PageRank Search Ranking Algorithm",
        "authors": " Complexity",
        "published": "2024-1-24",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9758761"
    },
    {
        "id": 9,
        "title": "Node-Centric Random Walk for Fast Index-Free Personalized PageRank",
        "authors": "Kohei Tsuchida, Naoki Matsumoto, Kunitake Kaneko",
        "published": "2023-1-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icoin56518.2023.10049056"
    },
    {
        "id": 10,
        "title": "A Speedup Method for Iterative Computation of Pagerank Centrality",
        "authors": "Chien-Cheng Tseng, Su-Ling Lee",
        "published": "2023-7-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icce-taiwan58799.2023.10226913"
    },
    {
        "id": 11,
        "title": "On-Chain Reputation Ranking by Adaptive Weighted PageRank",
        "authors": "Thuat Do, Dung Do, Linh Nguyen",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rivf60135.2023.10471809"
    },
    {
        "id": 12,
        "title": "Rank NBA teams with Event-Driven PageRank Algorithm",
        "authors": "Liyuan Fan, Liming He",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3624288.3624292"
    },
    {
        "id": 13,
        "title": "Cache-Efficient Approach for Index-Free Personalized PageRank",
        "authors": "Kohei Tsuchida, Naoki Matsumoto, Andrew Shin, Kunitake Kaneko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3237738"
    },
    {
        "id": 14,
        "title": "A Parameterized Multi-Splitting Iterative Method for Solving the PageRank Problem",
        "authors": "Yajun Xie, Lihua Hu, Changfeng Ma",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "In this paper, a new multi-parameter iterative algorithm is proposed to address the PageRank problem based on the multi-splitting iteration method. The proposed method solves two linear subsystems at each iteration by splitting the coefficient matrix, considering therefore inner and outer iteration to find the approximate solutions of these linear subsystems. It can be shown that the iterative sequence generated by the multi-parameter iterative algorithm finally converges to the PageRank vector when the parameters satisfy certain conditions. Numerical experiments show that the proposed algorithm has better convergence and numerical stability than the existing algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11153320"
    },
    {
        "id": 15,
        "title": "On new PageRank computation methods using quantum computing",
        "authors": "Théodore Chapuis-Chkaiban, Zeno Toffano, Benoît Valiron",
        "published": "2023-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11128-023-03856-y"
    },
    {
        "id": 16,
        "title": "LSTM Encoder Decoder Based Text Highlight Abstraction Method Using Summaries Extracted by PageRank",
        "authors": "Turan Goktug Altundogan, Mehmet Karakose",
        "published": "2023-2-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/it57431.2023.10078652"
    },
    {
        "id": 17,
        "title": "Pagerank Algorithms and Multi-Particle Environments Using Pettingzoo: Network Simulation and Validation",
        "authors": "Yi Li",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "This study introduces and investigates two novel algorithms, namely Topic-Specific Crawling PageRank and Motif-Based PageRank, along with their corresponding application scenarios. The former algorithm focuses on targeted web crawling, refining the collection of web pages relevant to specific topics. The latter algorithm addresses higher-order relationships in citation networks, enhancing insights into researcher influence. These algorithms are evaluated within a Multi-Particle Environment, showcasing their capability to simulate necessary scenarios and data for PageRank algorithms. However, the environment's realism is limited due to its use of virtual data. The environment offers controllability through the PettingZoo resource library, providing an efficient experimentation platform. While the Multi-Particle Environment displays potential and advantages, its deviation from real-world data should be carefully considered. The experimental methodology involves constructing a network of agents and their message interactions within a simulated environment. The resulting network undergoes the PageRank algorithm, and the resulting ranking aligns with the expected outcome, confirming the Multi-Particle Environment's compatibility with the algorithm. These experiments furnish empirical evidence for the Multi-Particle Environment's adaptability to algorithmic simulations and real-world scenarios. This research contributes to a deeper comprehension of algorithm behavior in diverse and dynamic settings, paving the way for further advancements in the field",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/zsfnjk16"
    },
    {
        "id": 18,
        "title": "Comprehensive assessment of cable-stayed bridge based on Pagerank algorithm",
        "authors": "Ying Liu, Bing Wang, Xiaoling Liu",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "AbstractThis paper develops an improved structural health assessment method for cable-stayed bridge to address the issue of neglecting component correlations in existing assessment standards. Firstly, the directed graph of fault transmission between components in the cable-stayed bridge system was constructed. The Pagerank algorithm was used to analyze the degree of correlation between these components, and then the influencing degree of and the influenced degree of each component were determined. Secondly, considering the failure rate of individual components and the influenced degree of other component faults, a condition evaluation method with component correlation for cable-stayed bridge was proposed. Finally, the improved assessment method was applied to a super large-span steel cable-stayed bridge as a case study and compared with the relevant assessment specifications. The results show that main girder alignment, cable force and main tower alignment have a greater degree of correlation with other components and are important indicators for bridge health monitoring. Visual inspection of main girder and bridge bearing are the fault appearance components and should be paid attention to in preventive maintenance. The drainage system and electromechanical facilities are the fault source components and must be kept in good condition in daily inspections. The proposed method considers the interrelationships among components more comprehensively and can provide more reliable bridge health assessment results to support bridge maintenance decisions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s43251-023-00111-3"
    },
    {
        "id": 19,
        "title": "DETECTING AND ANALYSIS THIRD PARTY TRACKING ON THE WEB USING A PAGERANK ALGORITHM",
        "authors": "",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46646"
    },
    {
        "id": 20,
        "title": "Weighted PageRank Algorithm Search Engine Ranking Model for Web Pages",
        "authors": "S. Samsudeen Shaffi, I. Muthulakshmi",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/iasc.2023.031494"
    },
    {
        "id": 21,
        "title": "Art appreciation model design based on improved PageRank and ECA-ResNeXt50 algorithm",
        "authors": "Hang Yang, Jingyao Chen",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Image sentiment analysis technology can predict, measure and understand the emotional experience of human beings through images. Aiming at the problem of extracting emotional characteristics in art appreciation, this article puts forward an innovative method. Firstly, the PageRank algorithm is enhanced using tweet content similarity and time factors; secondly, the SE-ResNet network design is used to integrate Efficient Channel Attention (ECA) with the residual network structure, and ResNeXt50 is optimized to enhance the extraction of image sentiment features. Finally, the weight coefficients of overall emotions are dynamically adjusted to select a specific emotion incorporation strategy, resulting in effective bimodal fusion. The proposed model demonstrates exceptional performance in predicting sentiment labels, with maximum classification accuracy reaching 88.20%. The accuracy improvement of 21.34% compared to the traditional deep convolutional neural networks (DCNN) model attests to the effectiveness of this study. This research enriches images and texts’ emotion feature extraction capabilities and improves the accuracy of emotion fusion classification.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj-cs.1734"
    },
    {
        "id": 22,
        "title": "The general tensor regular splitting iterative method for multilinear PageRank problem",
        "authors": "Shuting Tang, Xiuqin Deng, Rui Zhan",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>The paper presents an iterative scheme called the general tensor regular splitting iterative (GTRS) method for solving the multilinear PageRank problem, which is based on a (weak) regular splitting technique and further accelerates the iterative process by introducing a parameter. The method yields familiar iterative schemes through the use of specific splitting strategies, including fixed-point, inner-outer, Jacobi, Gauss-Seidel and successive overrelaxation methods. The paper analyzes the convergence of these solvers in detail. Numerical results are provided to demonstrate the effectiveness of the proposed method in solving the multilinear PageRank problem.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.2024071"
    },
    {
        "id": 23,
        "title": "Medication Knowledge Graph Analysis Using the PageRank Algorithm",
        "authors": "S.M.Shamimul Hasan, Alina Peluso, Heidi A. Hanson, Anuj J. Kapadia",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00082"
    },
    {
        "id": 24,
        "title": "PageRank Algorithm Based on Dynamic Damping Factor",
        "authors": "Zheng HaoLin, Hu Jin, Li WeiKai",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsi58851.2023.10303849"
    },
    {
        "id": 25,
        "title": "PCMeans: community detection using local PageRank, clustering, and K-means",
        "authors": "Wafa Louafi, Faiza Titouna",
        "published": "2023-8-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13278-023-01109-5"
    },
    {
        "id": 26,
        "title": "A Scientific Paper Recommendation Framework Based on Multi-Topic Communities and Modified PageRank",
        "authors": "Agung Hadhiatma, Azhari Azhari, Yohanes Suyanto",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3251189"
    },
    {
        "id": 27,
        "title": "MHPR: Identification of Key Nodes in Multilayer Heterogeneous Combat Network Based on Improved PageRank Algorithm",
        "authors": "Chaoqing Xiao, Lina Lu, Chengyi Zeng, Jing Chen",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451431"
    },
    {
        "id": 28,
        "title": "Research on PageRank Based Core User Classification Algorithm for Digital Marketing",
        "authors": "Jie Yang",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceib57887.2023.10170524"
    },
    {
        "id": 29,
        "title": "A Structural and Semantic Evaluation Method for Social Media Datasets Based on PageRank Algorithm with Cluster Analysis",
        "authors": "Xinwei Yuan",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00065"
    },
    {
        "id": 30,
        "title": "Research on I-PageRank algorithm model of Process knowledge graph based on K-Shell decomposition algorithm",
        "authors": "Yanwei Huo, Hongyu Cheng",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnlp58431.2023.00082"
    },
    {
        "id": 31,
        "title": "Network Capacity Bound for Personalized PageRank in Multimodal Networks",
        "authors": "Mieczysław A. Kłopotek, Sławomir T. Wierzchoń, Robert A. Kłopotek",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "In a former paper [1] the concept of Bipartite PageRank was introduced and a theorem on the limit of authority flowing between nodes for personalized PageRank has been generalized. In this paper we want to extend those results to multimodal networks. In particular we deal with a hypergraph type that may be used for describing multimodal network where a hyperlink connects nodes from each of the modalities. We introduce a generalisation of PageRank for such graphs and define the respective random walk model that can be used for computations. We state and prove theorems on the limit of outflow of authority for cases where individual modalities have identical and distinct damping factors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/fi-222151"
    },
    {
        "id": 32,
        "title": "PageRank Centrality Computation Using Gradient Descent Algorithm",
        "authors": "Su-Ling Lee, Chien-Cheng Tseng",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecice59523.2023.10383107"
    },
    {
        "id": 33,
        "title": "Enhancing a User Matchmaking Algorithm using Personalized PageRank",
        "authors": "Santipong Thaiprayoon, Herwig Unger",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3639233.3639346"
    },
    {
        "id": 34,
        "title": "The application of PageRank model in urban epidemic prevention and control",
        "authors": "Rouzhi Wang",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2672203"
    },
    {
        "id": 35,
        "title": "Reputation and Pagerank on the Ethereum Blockchain: Technical Report",
        "authors": "Scott K. Imig,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "Motivated by the need for a credibly neutral reputation mechanism on the blockchain, we study Pagerank and other properties of two Ethereum addresses, considering one address as trustworthy and the other as problematic. We show that an unmodified Pagerank algorithm does not distinguish these cases, while asserting that Pagerank is nonetheless an important starting point for such a mechanism. We give several directions for extending or modifying the mechanism to cover such cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/ijbta.2023.1.2.89-94"
    },
    {
        "id": 36,
        "title": "Retracted: PageRank Topic Finder based Algorithm for Multimedia Resources in Preschool Education",
        "authors": "",
        "published": "2023-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9867326"
    },
    {
        "id": 37,
        "title": "Real-Time PageRank on Dynamic Graphs",
        "authors": "Scott Sallinen, Juntong Luo, Matei Ripeanu",
        "published": "2023-8-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3588195.3593004"
    },
    {
        "id": 38,
        "title": "PageRank centrality with non-local random walk-based teleportation",
        "authors": "David Bowater, Emmanuel Stefanakis",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "Abstract\nPageRank is a popular measure of centrality that is often applied to rank nodes in real-world networks. However, in many cases, the notion of teleportation is counterintuitive because it implies that whatever is moving around the network will jump or ‘teleport’ directly from one node to any other, without considering how far apart the nodes are. To overcome this issue, we propose here a general measure of PageRank centrality whereby the teleportation probabilities depend, in some way, on the distance separating the nodes. We accomplish this by drawing upon recent advances in non-local random walks, which allow the proposed measure to be tailored for various real-world networks and applications. To illustrate the flexibility of the proposed measure and to demonstrate how it differs from PageRank centrality, we present and discuss experimental results for a selection of real-world spatial and social networks, including an air transportation network, a collaboration network and an urban street network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/comnet/cnad024"
    },
    {
        "id": 39,
        "title": "Multi-hop Attention-based Graph Pooling: A Personalized PageRank Perspective",
        "authors": "Parsa Haddadian, Roya Booryaee, Rooholah Abedian, Ali Moeini",
        "published": "2024-5-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dchpc60845.2024.10454077"
    },
    {
        "id": 40,
        "title": "Implementation of PageRank Algorithm for Visualization and Weighting of Keyword Networks in Scientific Papers",
        "authors": "Adyanata Lubis",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47738/jads.v4i4.138"
    },
    {
        "id": 41,
        "title": "Everything Evolves in Personalized PageRank",
        "authors": "Zihao Li, Dongqi Fu, Jingrui He",
        "published": "2023-4-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3543507.3583474"
    },
    {
        "id": 42,
        "title": "Optimizing Hindi Paragraph Summarization through PageRank Method",
        "authors": "Sheshang Degadwala, Dhairya Vyas, Khush Nilaykumar Patel, Mukesh Soni, Pavitar Parkash Singh, Ramya Maranan",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212107"
    },
    {
        "id": 43,
        "title": "Design and Algorithm Implementation of Visualization Platform to Promote Enterprise Listing Based on E-commerce Big Data Analysis Based on Quantum PageRank Algorithm",
        "authors": "",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijsea1212.1003"
    },
    {
        "id": 44,
        "title": "Improved Key Node Recognition Method of Social Network Based on PageRank Algorithm",
        "authors": "Lei Hong, Yiji Qian, Chaofan Gong, Yurui Zhang, Xin Zhou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.029180"
    },
    {
        "id": 45,
        "title": "Accelerating Personalized PageRank Vector Computation",
        "authors": "Zhen Chen, Xingzhi Guo, Baojian Zhou, Deqing Yang, Steven Skiena",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3580305.3599251"
    },
    {
        "id": 46,
        "title": "Retracted: SM-PageRank Algorithm-Based User Interest Model for Mobile Smart Tourism Platform",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9850362"
    },
    {
        "id": 47,
        "title": "Effective Computation of a Feedback Arc Set Using PageRank",
        "authors": "Vasileios Geladaris, Panagiotis Lionakis, Ioannis G. Tollis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7155/jgaa.00641"
    },
    {
        "id": 48,
        "title": "PageRank vs. ANP: A Comparative Analysis for Prioritizing Maintenance Activities in Industrial Water Distribution Systems",
        "authors": "Giulia Marcon, Silvia Carpitella, Antonella Certa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.12.068"
    },
    {
        "id": 49,
        "title": "A Comparative Analysis of Retrievability and PageRank Measures",
        "authors": "Aman Sinha, Priyanshu Raj Mall, Dwaipayan Roy, Kripabandhu Ghosh",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3632754.3632760"
    },
    {
        "id": 50,
        "title": "Analysis and Application of Knowledge Points in English Network Course Teaching by Using PageRank",
        "authors": "Lianmei Deng N.A.",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijnvo.2023.10058074"
    },
    {
        "id": 51,
        "title": "Recursive reordering and elimination method for efficient computation of PageRank problems",
        "authors": "Zhao-Li Shen, Yu-Tong Liu, Bruno Carpentieri, Chun Wen, Jian-Jun Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "<abstract><p>The PageRank model is widely utilized for analyzing a variety of scientific issues beyond its original application in modeling web search engines. In recent years, considerable research effort has focused on developing high-performance iterative methods to solve this model, particularly when the dimension is exceedingly large. However, due to the ever-increasing extent and size of data networks in various applications, the computational requirements of the PageRank model continue to grow. This has led to the development of new techniques that aim to reduce the computational complexity required for the solution. In this paper, we present a recursive 5-type lumping algorithm combined with a two-stage elimination strategy that leverage characteristics about the nonzero structure of the underlying network and the nonzero values of the PageRank coefficient matrix. This method reduces the initial PageRank problem to the solution of a remarkably smaller and sparser linear system. As a result, it leads to significant cost reductions for computing PageRank solutions, particularly in scenarios involving large and/or multiple damping factors. Numerical experiments conducted on over 50 real-world networks demonstrate that the proposed methods can effectively exploit characteristics of PageRank problems for efficient computations.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/math.20231282"
    },
    {
        "id": 52,
        "title": "Analysis and application of knowledge points in English network course teaching by using PageRank",
        "authors": "Lianmei Deng",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijnvo.2023.133875"
    },
    {
        "id": 53,
        "title": "Importance Identification of Distribution Network Nodes based on Improved PageRank Algorithm",
        "authors": "Zhou Zhu, Zhifeng Qiu, Yanan Zhao",
        "published": "2023-1-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsie55183.2023.10175255"
    },
    {
        "id": 54,
        "title": "Zebra: When Temporal Graph Neural Networks Meet Temporal Personalized PageRank",
        "authors": "Yiming Li, Yanyan Shen, Lei Chen, Mingxuan Yuan",
        "published": "2023-2",
        "citations": 2,
        "abstract": "\n            Temporal graph neural networks (T-GNNs) are state-of-the-art methods for learning representations over dynamic graphs. Despite the superior performance, T-GNNs still suffer from high computational complexity caused by the tedious recursive temporal message passing scheme, which hinders their applicability to large dynamic graphs. To address the problem, we build the theoretical connection between the temporal message passing scheme adopted by T-GNNs and the temporal random walk process on dynamic graphs. Our theoretical analysis indicates that it would be possible to select a few influential temporal neighbors to compute a target node's representation without compromising the predictive performance. Based on this finding, we propose to utilize T-PPR, a parameterized metric for estimating the influence score of nodes on evolving graphs. We further develop an efficient single-scan algorithm to answer the top-\n            k\n            T-PPR query with rigorous approximation guarantees. Finally, we present Zebra, a scalable framework that accelerates the computation of T-GNN by directly aggregating the features of the most prominent temporal neighbors returned by the top-\n            k\n            T-PPR query. Extensive experiments have validated that Zebra can be up to two orders of magnitude faster than the state-of-the-art T-GNNs while attaining better performance.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.14778/3583140.3583150"
    },
    {
        "id": 55,
        "title": "An improved risk prioritization method for propulsion system based on heterogeneous information and PageRank algorithm",
        "authors": "Zhen Hua, Liguo Fei, Xiaochuan Jing",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2022.118798"
    },
    {
        "id": 56,
        "title": "Axiomatic characterization of PageRank",
        "authors": "Tomasz Wąs, Oskar Skibski",
        "published": "2023-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.artint.2023.103900"
    },
    {
        "id": 57,
        "title": "Enumerating class relations weights to assess their importance in a graph representation model for detecting key classes using PageRank",
        "authors": "Ciprian-Bogdan Chirila, Ioana Sora",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icstcc59206.2023.10308446"
    },
    {
        "id": 58,
        "title": "A flexible PageRank-based graph embedding framework closely related to spectral eigenvector embeddings",
        "authors": "Disha Shur, Yufan Huang, David F. Gleich",
        "published": "2023-7-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41468-023-00129-6"
    },
    {
        "id": 59,
        "title": "Node importance evaluation in multi-platform avionics architecture based on TOPSIS and PageRank",
        "authors": "Chang Liu, Jinyan Wang, Rui Xia",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": "AbstractWith the development of avionics industry, it is difficult for traditional combat equipment node evaluation method to meet our requirements under complex combat system. This paper presents a method of node importance evaluation which is suitable for modern avionics field and can be used for reference in other combat fields. In order to make better use of the different features of the node itself and the different connections between nodes, we use TOPSIS algorithm to model the characteristics of the node itself, and PageRank to measure the interdependence of all nodes. Therefore, a novel node contribution evaluation algorithm based on TOPSIS and PageRank is proposed in this paper. In addition, after the evaluation of node contribution, we found that there was also a functional relationship between the operational information entropy in the whole graph and the contribution of these nodes. On this basis, information entropy evaluation algorithm of the overall combat map is further proposed. After a lot of experiments, the reliability of our algorithm is evaluated on the indexes of the node's destruction-resistant performance and information transfer efficiency. Compared with the traditional universal algorithm, our proposed algorithm shows more interpretable and robust results in the field of avionics.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13634-023-00979-3"
    },
    {
        "id": 60,
        "title": "Association of the PageRank algorithm with similarity-based methods for link prediction in complex networks",
        "authors": "Mourad Charikhi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2024.129552"
    },
    {
        "id": 61,
        "title": "PageRank talent mining algorithm of power system based on cognitive load and DPCNN",
        "authors": "Kan Feng, Changliang Yang, Wenqiang Zhu, Kun Li, Ya Chen",
        "published": "2024-1",
        "citations": 0,
        "abstract": "AbstractPageRank talent mining in power system is an effective means for enterprises to recruit talents, which can correctly recommend talents in practical applications. At present, the mining evaluation index system is not perfect, and the consistency coefficient between the evaluation results and the actual situation is low in practical applications. Therefore, PageRank talent mining algorithm in power system based on cognitive load and dilated convolutional neural network (DPCNN) is proposed. The cognitive load and DPCNN are used to establish a talent capability evaluation system, calculate the index weight value, construct the PageRank talent capability evaluation model of the power system according to the corresponding weight of the index, determine the membership range of the index, calculate the comprehensive score of the appraiser's ability, and determine the ability level of the appraiser, thus realizing the PageRank talent mining algorithm of the power system. The experimental results show that the algorithm has high accuracy and objectivity, good encryption effect, cannot crack the attack node, the prediction error and the prediction relative error are closest to the standard value, the maximum error is 0.51, the maximum relative error is 0.82, and can achieve the accurate prediction of talent demand.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/cmu2.12721"
    },
    {
        "id": 62,
        "title": "Simple hierarchical PageRank graph neural networks",
        "authors": "Fei Yang, Huyin Zhang, Shiming Tao, Xiying Fan",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11227-023-05666-6"
    },
    {
        "id": 63,
        "title": "GPPR: Geo-distributed Personalized PageRank Algorithm",
        "authors": "Zijun Chen,  , Delong Ma, Yishu Wang, Ye Yuan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21655/ijsi.1673-7288.00320"
    },
    {
        "id": 64,
        "title": "Research on identification of key processes in machining process based on PageRank algorithm",
        "authors": "Dongyue Qu, Chao Li, Chaoyun Gu, Yuzhi Yao, Yong Zhan",
        "published": "2024-2",
        "citations": 0,
        "abstract": " Aiming at the difficulty of quantitatively evaluating the critical processes in the manufacturing process of complex mechanical products, a critical process identification method based on the PageRank algorithm is proposed with the goal of identifying key processes in the machining process. Based on the complex network theory, the error transfer network model of the machining process is established in this paper. Adopting the actual machining process as the data set of the complex network, the weights of the machining feature nodes are calculated by the PageRank ranking algorithm, and the nodes are ranked according to the weight values to assess the influence and importance of the nodes in the network model. Finally, taking the connecting rod machining process of a medium-speed marine diesel engine as an example, the results show that the method can quickly and effectively identify the key processes in the machining process. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/16878132241229988"
    },
    {
        "id": 65,
        "title": "HedgeRank: Heterogeneity-Aware, Energy-Efficient Partitioning of Personalized PageRank at the Edge",
        "authors": "Young-Ho Gong",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "Personalized PageRank (PPR) is a widely used graph processing algorithm used to calculate the importance of source nodes in a graph. Generally, PPR is executed by using a high-performance microprocessor of a server, but it needs to be executed on edge devices to guarantee data privacy and network latency. However, since PPR has a variety of computation/memory characteristics that vary depending on the graph datasets, it causes performance/energy inefficiency when it is executed on edge devices with limited hardware resources. In this paper, we propose HedgeRank, a heterogeneity-aware, energy-efficient, partitioning technique of personalized PageRank at the edge. HedgeRank partitions the PPR subprocesses and allocates them to appropriate edge devices by considering their computation capability and energy efficiency. When combining low-power and high-performance edge devices, HedgeRank improves the execution time and energy consumption of PPR execution by up to 26.7% and 15.2% compared to the state-of-the-art PPR technique.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/mi14091714"
    },
    {
        "id": 66,
        "title": "Efficient Algorithms for Personalized PageRank Computation: A Survey",
        "authors": "Mingji Yang, Hanzhi Wang, Zhewei Wei, Sibo Wang, Ji-Rong Wen",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tkde.2024.3376000"
    },
    {
        "id": 67,
        "title": "Estimating Single-Node PageRank in\n            <i>Õ</i>\n            (min{\n            <i>\n              d\n              <sub>t</sub>\n            </i>\n            , √\n            <i>m</i>\n            }) Time",
        "authors": "Hanzhi Wang, Zhewei Wei",
        "published": "2023-7",
        "citations": 0,
        "abstract": "\n            PageRank is a famous measure of graph centrality that has numerous applications in practice. The problem of computing a single node's PageRank has been the subject of extensive research over a decade. However, existing methods still incur large time complexities despite years of efforts. Even on undirected graphs where several valuable properties held by PageRank scores, the problem of locally approximating the PageRank score of a target node remains a challenging task. Two commonly adopted techniques, Monte-Carlo based random walks and backward push, both cost\n            O\n            (\n            n\n            ) time in the worst-case scenario, which hinders existing methods from achieving a sublinear time complexity like\n            O\n            (√\n            m\n            ) on an undirected graph with\n            n\n            nodes and\n            m\n            edges.\n          \n\n            In this paper, we focus on the problem of single-node PageRank computation on undirected graphs. We propose a novel algorithm,\n            SetPush\n            , for estimating single-node PageRank specifically on undirected graphs. With non-trival analysis, we prove that our\n            SetPush\n            achieves the Õ (min {\n            \n              d\n              t\n\n            , √\n            m\n            ]}) time complexity for estimating the target node\n            t\n            's PageRank with constant relative error and constant failure probability on undirected graphs. We conduct comprehensive experiments to demonstrate the effectiveness of\n            SetPush.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.14778/3611479.3611500"
    },
    {
        "id": 68,
        "title": "Improvement of full consistency multiple objective optimization based on concept of stratification theory and PageRank and linguistic polytopic hesitant fuzzy sets",
        "authors": "Xu Zhang, Mark Goh, Sijun Bai, Dragan Pamucar, Libiao Bai",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2024.120221"
    },
    {
        "id": 69,
        "title": "Research on Transmission Relationship of Grid Green Development Assessment Indicators Based on Improved PageRank ISM Big Data Algorithm",
        "authors": "Jihong Ye, Han Chen, Maojie Lai, Yinan Li, Hanxing Lin, Wenxin Chen, Bo Li",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icbta60381.2023.00029"
    },
    {
        "id": 70,
        "title": "Truncated and Sparse Power Methods with Partially Updating for Large and Sparse Higher-Order PageRank Problems",
        "authors": "Jun Huang, Gang Wu",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10915-023-02146-0"
    },
    {
        "id": 71,
        "title": "Extending the Adapted PageRank Algorithm centrality model for urban street networks using non-local random walks",
        "authors": "David Bowater, Emmanuel Stefanakis",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.amc.2023.127888"
    },
    {
        "id": 72,
        "title": "Research on the Optimization Method of Power Grid Financial Class Index Based on Random Walk Pagerank",
        "authors": "Liang Tian, Xiaoli Zhao, Bo Li, Meichen Guo",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.17-11-2023.2342760"
    },
    {
        "id": 73,
        "title": "Knowledge diffusion trajectories of PageRank: A main path analysis",
        "authors": "Dejian Yu, Zhaoping Yan",
        "published": "2024-2",
        "citations": 1,
        "abstract": " In the era of the Internet and big data, the PageRank (PR) algorithm is a constantly evolving research field. However, there is no systematic research to explore the overall development trend of the PR domain. This article evaluates 1446 articles related to the PR algorithm and provides a thorough understanding of the PR field through the main path analysis (MPA). Through two basic main paths, a number of papers that play a leading role have been identified, which outline the backbone of the PR domain. Based on the analysis of multiple main paths, four main subareas have been investigated. There are accelerating the computation of PR, comprehensive applications of PR, researches on academic impact assessment and age preference in network evolution. Finally, this article discusses the research findings and the future directions of the PR field. It is the first attempt to identify the development trend of the PR domain through MPA, thus providing an insight into the knowledge evolution of the PR field over the past two decades. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/01655515231167388"
    },
    {
        "id": 74,
        "title": "A Novel Link Prediction Approach for MOOC Forum Thread Recommendation Using Personalized PageRank and Machine Learning",
        "authors": "Junfu He, Zhi Liu, Xi Kong",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icet59358.2023.10424086"
    },
    {
        "id": 75,
        "title": "Detection approach for unusable shared bikes enabled by reinforcement learning and PageRank algorithm",
        "authors": "Yu Zhou, Ran Zheng, Gang Kou",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jnlssr.2023.02.001"
    },
    {
        "id": 76,
        "title": "Efficient Personalized PageRank Computation: The Power of Variance-Reduced Monte Carlo Approaches",
        "authors": "Meihao Liao, Rong-Hua Li, Qiangqiang Dai, Hongyang Chen, Hongchao Qin, Guoren Wang",
        "published": "2023-6-13",
        "citations": 1,
        "abstract": "Personalized PageRank (PPR) computation is a fundamental problem in graph analysis. The state-of-the-art algorithms for PPR computation are based on a bidirectional framework which include a deterministic forward push and a Monte Carlo sampling procedure. The Monte Carlo sampling procedure, however, often has a relatively-large variance, thus reducing the performance of the PPR computation algorithms. To overcome this issue, we develop two novel variance-reduced Monte Carlo techniques for PPR computation. Our first technique is to apply power iterations to reduce the variance of the Monte Carlo sampling procedure. We prove that conducting few power iterations can significantly reduce the variance of existing Monte Carlo estimators, only with few additional costs. Moreover, we show that such a simple and novel variance-reduced Monte Carlo technique can achieve comparable estimation accuracy and the same time complexity as the state-of-the-art bidirectional algorithms. Our second technique is a novel progressive sampling method which uses the historical information of former samples to reduce the variance of the Monte Carlo estimator. We develop several novel PPR computation algorithms by integrating both of these variance reduction techniques with two existing Monte Carlo sampling approaches, including random walk sampling and spanning forests sampling. Finally, we conduct extensive experiments on 5 real-life large graphs to evaluate our solutions. The results show that our algorithms can achieve much higher PPR estimation accuracy by using much less time, compared to the state-of-the-art bidirectional algorithms.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3589305"
    },
    {
        "id": 77,
        "title": "A Method for Assessing the Security of Energy Trading Data Based on Big Data and the Pagerank Algorithm",
        "authors": "Weibin Ding, Deqi Zhang, Junjia Yang, Yanzuo Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4108/eai.19-5-2023.2334237"
    },
    {
        "id": 78,
        "title": "An improved gravity centrality for finding important nodes in multi-layer networks based on multi-PageRank",
        "authors": "Laishui Lv, Ting Zhang, Peng Hu, Dalal Bardou, Shanzhou Niu, Zijun Zheng, Gaohang Yu, Heng Wu",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122171"
    },
    {
        "id": 79,
        "title": "Pagerank SEO Algorithm : Issues, Complexity and Implementation",
        "authors": "Mpemba Ngoma Luz -, Kanyinda Kayembe Kam's -, Mayala Lemba Francis -, Likotelo Binene Camile -, Engombe Wedi Boniface -, Nsumbu Lukamba Telesphore -, Mbikayi Mpanya Jean Marcel -, Nlandu Ngunda Jean -, Mande Kumwimba Hydryce -, Balanga Koko Joe -",
        "published": "2023-4-5",
        "citations": 0,
        "abstract": "Today, the Internet users need an optimal search for information on the web. The display of web pages within a search engine is not a mystery. This implies good mathematical modeling and good knowledge of computer science for its implementation. The web is a directed graph that must be exploited. The matrices of its graph contain a structure of the links and the navigation of the Internet user. Considering the billions of hosted websites and the dynamism of the web, its links can be added at any time. Changing this link structure impacts the PageRank. Thus, for good stability, the algorithms must be improved.  PageRank algorithm that displays a good web page Search Engine Optimization (SEO) taking into account the score of each page, pay attention to many researches that make improvements day by day. Even though it is a basic formula, the PageRank algorithm makes a successful business. In this paper, we had not only implemented this algorithm in python but also explain how it works and calculated its complexity",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2023.v05i02.2147"
    },
    {
        "id": 80,
        "title": "Efficient Node PageRank Improvement via Link-building using Geometric Deep Learning",
        "authors": "Vincenza Carchiolo, Marco Grassia, Alessandro Longheu, Michele Malgeri, Giuseppe Mangioni",
        "published": "2023-6-30",
        "citations": 4,
        "abstract": "\n            Centrality is a relevant topic in the field of network research, due to its various theoretical and practical implications. In general, all centrality metrics aim at measuring the importance of nodes (according to some definition of importance), and such importance scores are used to rank the nodes in the network, therefore the rank improvement is a strictly related topic. In a given network, the rank improvement is achieved by establishing new links, therefore the question shifts to which and how many links should be collected to get a desired rank. This problem, also known as\n            link-building\n            has been shown to be NP-hard, and most heuristics developed failed in obtaining good performance with acceptable computational complexity. In this article, we present\n            LB–GDM\n            , a novel approach that leverages Geometric Deep Learning to tackle the link-building problem. To validate our proposal, 31 real-world networks were considered; tests show that\n            LB–GDM\n            performs significantly better than the state-of-the-art heuristics, while having a comparable or even lower computational complexity, which allows it to scale well even to large networks.\n          ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3551642"
    },
    {
        "id": 81,
        "title": "An effective fault localization approach based on PageRank and mutation analysis",
        "authors": "Yue Yan, Shujuan Jiang, Yanmei Zhang, Cheng Zhang",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jss.2023.111799"
    },
    {
        "id": 82,
        "title": "Influential process nodes identification strategy for aircraft assembly system based on complex network and improved PageRank",
        "authors": "Ji-Yue Zhu, Wei Qin, Jin-Hua Hu, Yan-Ning Sun, Yu Chen",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.aei.2023.102187"
    },
    {
        "id": 83,
        "title": "A method for assessing the productivity trends of collective scientific subjects based on the modified PageRank algorithm",
        "authors": "Yurii Andrashko, Oleksandr Kuchanskyi, Andrii Biloshchytskyi, Oleksandr Pohoriliak, Myroslava Gladka, Ganna Slyvka-Tylyshchak, Dmytro Khlaponin, Ivan Chychkan",
        "published": "2023-2-28",
        "citations": 2,
        "abstract": "The task of calculating the productivity of collective scientific subjects is a relevant issue in scientometrics. This study formalized the problem of assessing productivity trends of collective scientific subjects. The TWPR-CI method for calculating the performance based on the modified PageRank algorithm is described. Formulas for calculating productivity have been derived that make it possible to take into account a change in the productivity of collective scientific subjects over time. The indicators of the basic average absolute change in performance and the chain average relative change in performance were chosen as the basis. To select promising, from the point of view of scientific work, collective subjects, preference is given to those whose basic average absolute change in productivity is positive or the chain average relative change in productivity exceeds unity. Verification of the method for assessing performance trends of collective scientific entities based on the modified PageRank algorithm using the public dataset Citation Network Dataset was carried out. The dataset includes more than 5 million scientific publications and 48 million citations. The citation of scientific publications of 27,500 collective scientific subjects for the period from 2000 to 2022 was analyzed. For this period, for 15 selected collective scientific subjects, performance is calculated using the TWPR-CI method, as well as estimates of productivity trends based on their average relative change. There are three classes of collective scientific subjects according to productivity trends. The results indicate the relevance of the proposed method for quantifying the productivity trends of collective scientific entities (higher education institutions, scientific institutes, laboratories, and other institutions engaged in scientific activities)",
        "keywords": "",
        "link": "http://dx.doi.org/10.15587/1729-4061.2023.273929"
    },
    {
        "id": 84,
        "title": "Adaptive graph generation based on generalized pagerank graph neural network for traffic flow forecasting",
        "authors": "Xiaoyu Guo, Xiangyuan Kong, Weiwei Xing, Xiang Wei, Jian Zhang, Wei Lu",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10489-023-05137-8"
    },
    {
        "id": 85,
        "title": "PPRTGI: A Personalized PageRank Graph Neural Network for TF-target Gene Interaction Detection",
        "authors": "Ke Ma, Jiawei Li, Mengyuan Zhao, Ibrahim Zamit, Bin Lin, Fei Guo, Jijun Tang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcbb.2024.3374430"
    },
    {
        "id": 86,
        "title": "Multi-Linear Pseudo-PageRank for Hypergraph Partitioning",
        "authors": "Yannan Chen, Wen Li, Jingya Chang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10915-024-02460-1"
    },
    {
        "id": 87,
        "title": "A novel approach of full state tendency measurement for complex systems based on information causality and PageRank: A case study of a hydropower generation system",
        "authors": "Pengfei Wang, Yixuan Guo, Zhenkun Xu, Weihao Wang, Diyi Chen",
        "published": "2023-3",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ymssp.2022.109956"
    },
    {
        "id": 88,
        "title": "Reliability modeling for failure correlations to a CNC lathe subsystem based on Pagerank Algorithm",
        "authors": "Dongwei Gu, Jin Guo, Wenbo Han, Song Gao, Xilu Zhao, Zhen Xu",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/08982112.2023.2208664"
    },
    {
        "id": 89,
        "title": "Anderson accelerated fixed‐point iteration for multilinear PageRank",
        "authors": "Fuqi Lai, Wen Li, Xiaofei Peng, Yannan Chen",
        "published": "2023-10",
        "citations": 2,
        "abstract": "AbstractIn this paper, we apply the Anderson acceleration technique to the existing relaxation fixed‐point iteration for solving the multilinear PageRank. In order to reduce computational cost, we further consider the periodical version of the Anderson acceleration. The convergence of the proposed algorithms is discussed. Numerical experiments on synthetic and real‐world datasets are performed to demonstrate the advantages of the proposed algorithms over the relaxation fixed‐point iteration and the extrapolated shifted fixed‐point method. In particular, we give a strategy for choosing the quasi‐optimal parameters of the associated algorithms when they are applied to solve the test problems with different sizes but the same structure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/nla.2499"
    },
    {
        "id": 90,
        "title": "Identifying Key Node with Motif-Based PageRank on Acupoint-Disease Network",
        "authors": "Xuelong Yu, Xiao Liu, Li Luo, Hai Zhao",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "Existing research combines acupuncture theory with network science and proposes a new paradigm for the study of acupoint selection patterns—a key acupoint mining algorithm based on acupoint networks. However, the basic idea of this study for finding key acupoints is based on binary acupoint synergy relationships, which ignores the higher-order synergy among multiple acupoints and does not truly reflect the implicit patterns of each acupoint among meridian systems. Moreover, the mining results assessment method, which this new paradigm involves, does not have wide applicability and universality. In this paper, with the introduction of higher-order interactions between multiple acupoints, a high-specificity key acupoint mining algorithm based on 3-node motif is proposed in the acupoint-disease network (ADN). In response to the narrow applicability of the new research paradigm involving the evaluation of algorithms’ measures, new and widely applicable and universal evaluation criteria are introduced in terms of resolution, network loss, and accuracy, respectively. Based on the principles of acupoint selection involved in acupuncture clinics in Chinese medicine, the acupoints involved in the data were divided into a total of 19 regions according to their distribution characteristics. From these 19 regions, we selected the key acupoints that have a large impact on the global network. Finally, we compared this algorithm with five other acupoint importance assessment algorithms in terms of resolution, network loss, and accuracy, respectively. The comprehensive results show that the algorithm identifies key acupoints with an accuracy of 63%, which is 14% to 21% higher than other existing methods. The key acupoints identified by the algorithm have a significant disruptive effect on the connectivity of the network, indicating that the key acupoints are at the core of the acupoint-disease network topology. They have a significant propagation influence on other acupoints, which means that the key acupoints have high-synergistic cooperation with other acupoints. Meanwhile, the stability and specificity of the algorithm ensure the reliability of the key acupoints. We believe that the key acupoints identified by the algorithm can be used as core acupoints from the perspective of network topology and high synergy of other acupoints, respectively, and help researchers explore targeted and high-impact combinations of acupoints to optimize existing acupuncture prescriptions under condition constraints.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/6101751"
    },
    {
        "id": 91,
        "title": "Identification of Critical Nodes in Power Grid Based on Improved PageRank Algorithm and Power Flow Transfer Entropy",
        "authors": "Jinhui Zeng, Yisong Wu, Jie Liu, Dong He, Zheng Lan",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Identifying critical nodes in the power grid is a crucial aspect of power system security and stability analysis. However, the current methods for identification fall short in fully accounting for the power transfer characteristics between nodes and the consequences of node removal on the security and stability of power grid operation. To enhance the effective and accurate identification of critical nodes in the power grid, a method is proposed. This method is based on improved PageRank algorithm and node-weighted power flow transfer entropy, referred to as IPRA-PFTE. Firstly, based on the power flow and equivalent impedance between nodes, and the introduction of virtual nodes, an improved PageRank algorithm is obtained. Then the node-weighted power flow transfer entropy is derived by considering the uniformity of the transfer power flow distribution in the system following the removal of a node. Finally, the importance of nodes is obtained by combining the improved PageRank algorithm with the node-weighted power flow transfer entropy. The method’s effectiveness and accuracy are validated through simulation using the IEEE 39-bus example and subsequent comparison with existing methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13010184"
    },
    {
        "id": 92,
        "title": "A distributed PageRank-based dynamic partition algorithm to improve distributed energy storages participation in frequency regulation",
        "authors": "Yujun Lin, Xuanang Lei, Qiufan Yang, Jianyu Zhou, Xia Chen, Jinyu Wen",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijepes.2023.109105"
    },
    {
        "id": 93,
        "title": "Overlapping community detection in software ecosystem based on pheromone guided personalized PageRank algorithm",
        "authors": "Simin Wang, Xiangjuan Yao, Dunwei Gong, Huijie Tu",
        "published": "2023-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.infsof.2023.107283"
    },
    {
        "id": 94,
        "title": "Generalized quantum PageRank algorithm with arbitrary phase rotations",
        "authors": "Sergio A. Ortega, Miguel A. Martin-Delgado",
        "published": "2023-1-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1103/physrevresearch.5.013061"
    },
    {
        "id": 95,
        "title": "Effective and Efficient PageRank-based Positioning for Graph Visualization",
        "authors": "Shiqi Zhang, Renchi Yang, Xiaokui Xiao, Xiao Yan, Bo Tang",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "Graph visualization is a vital component in many real-world applications (e.g., social network analysis, web mining, and bioinformatics) that enables users to unearth crucial insights from complex data. Lying in the core of graph visualization is the node distance measure, which determines how the nodes are placed on the screen. A favorable node distance measure should be informative in reflecting the full structural information between nodes and effective in optimizing visual aesthetics. However, existing node distance measures yield sub-par visualization quality as they fall short of these requirements. Moreover, most existing measures are computationally inefficient, incurring a long response time when visualizing large graphs. To overcome such deficiencies, we propose a new node distance measure, PDist, geared towards graph visualization by exploiting a well-known node proximity measure,personalized PageRank. Moreover, we propose an efficient algorithm Tau-Push for estimating PDist under both single- and multi-level visualization settings. With several carefully-designed techniques, TauPush offers non-trivial theoretical guarantees for estimation accuracy and computation complexity. Extensive experiments show that our proposal significantly outperforms 13 state-of-the-art graph visualization solutions on 12 real-world graphs in terms of both efficiency and effectiveness (including aesthetic criteria and user feedback). In particular, our proposal can interactively produce satisfactory visualizations within one second for billion-edge graphs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3588930"
    },
    {
        "id": 96,
        "title": "Improved centrality measure based on the adapted PageRank algorithm for urban transportation multiplex networks",
        "authors": "Zhitao Li, Jinjun Tang, Chuyun Zhao, Fan Gao",
        "published": "2023-2",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chaos.2022.112998"
    },
    {
        "id": 97,
        "title": "Multi-Mode SpMV Accelerator for Transprecision PageRank With Real-World Graphs",
        "authors": "Whijin Kim, Hana Kim, Jihye Lee, Hyunji Kim, Ji-Hoon Kim",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3237079"
    },
    {
        "id": 98,
        "title": "GHGPR-PPIS: A graph convolutional network for identifying protein-protein interaction site using heat kernel with Generalized PageRank techniques and edge self-attention feature processing block",
        "authors": "Xin Zeng, Fan-Fang Meng, Xin Li, Kai-Yang Zhong, Bei Jiang, Yi Li",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2023.107683"
    },
    {
        "id": 99,
        "title": "Can the PageRank centrality be manipulated to obtain any desired ranking?",
        "authors": "Gonzalo Contreras-Aso, Regino Criado, Miguel Romance",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "The significance of the PageRank algorithm in shaping the modern Internet cannot be overstated, and its complex network theory foundations continue to be a subject of research. In this article, we carry out a systematic study of the structural and parametric controllability of PageRank’s outcomes, translating a spectral graph theory problem into a geometric one, where a natural characterization of its rankings emerges. Furthermore, we show that the change of perspective employed can be applied to the biplex PageRank proposal, performing numerical computations on both real and synthetic network datasets to compare centrality measures used.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0156226"
    },
    {
        "id": 100,
        "title": "Preconditioned weighted full orothogonalization method for solving singular linear systems from PageRank problems",
        "authors": "Zhao‐Li Shen, Bruno Carpentieri, Chun Wen, Jian‐Jun Wang, Stefano Serra‐Capizzano, Shi‐Ping Du",
        "published": "2024-5",
        "citations": 0,
        "abstract": "AbstractThe PageRank model, which was first proposed by Google for its web search engine application, has since become a popular computational tool in a wide range of scientific fields, including chemistry, bioinformatics, neuroscience, bibliometrics, social networks, and others. PageRank calculations necessitate the use of fast computational techniques with low algorithmic and memory complexity. In recent years, much attention has been paid to Krylov subspace algorithms for solving difficult PageRank linear systems, such as those with large damping parameters close to one. In this article, we examine the full orthogonalization method (FOM). We present a convergence study of the method that extends and clarifies part of the conclusions reached in Zhang et al. (J Comput Appl Math. 2016; 296:397–409.). Furthermore, we demonstrate that FOM is breakdown free when solving singular PageRank linear systems with index one and we investigate the effect of using weighted inner‐products instead of conventional inner‐products in the orthonormalization procedure on FOM convergence. Finally, we develop a shifted polynomial preconditioner that takes advantage of the special structure of the PageRank linear system and has a good ability to cluster most of the eigenvalues, making it a good choice for an iterative method like FOM or GMRES. Numerical experiments are presented to support the theoretical findings and to evaluate the performance of the new weighted preconditioned FOM PageRank solver in comparison to other established solvers for this class of problem, including conventional stationary methods, hybrid combinations of stationary and Krylov subspace methods, and multi‐step splitting strategies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/nla.2541"
    },
    {
        "id": 101,
        "title": "A parallel PageRank algorithm for undirected graph",
        "authors": "Qi Zhang, Rongxia Tang, Zhengan Yao, Zan-Bo Zhang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.amc.2023.128276"
    },
    {
        "id": 102,
        "title": "The Role of the Domestic Market Scale in Enhancing Self-Resilience: Analysis based on the PageRank centrality of RCEP and G7 Countries",
        "authors": "Lei Wang, Xinya Gao, Thomas Stephen Ramsey, Geoffrey J. D. Hewings",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/1226508x.2023.2215807"
    },
    {
        "id": 103,
        "title": "Pride: Prioritizing Documentation Effort Based on a PageRank-Like Algorithm and Simple Filtering Rules",
        "authors": "Weifeng Pan, Hua Ming, Dae-Kyoo Kim, Zijiang Yang",
        "published": "2023-3-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tse.2022.3171469"
    },
    {
        "id": 104,
        "title": "Personalized PageRank on Evolving Graphs with an Incremental Index-Update Scheme",
        "authors": "Guanhao Hou, Qintian Guo, Fangyuan Zhang, Sibo Wang, Zhewei Wei",
        "published": "2023-5-26",
        "citations": 3,
        "abstract": "\\em Personalized PageRank (PPR) stands as a fundamental proximity measure in graph mining. Given an input graph G with the probability of decay α, a source node s and a target node t, the PPR score π(s,t) of target t with respect to source s is the probability that an α-decay random walk starting from s stops at t. A \\em single-source PPR (SSPPR) query takes an input graph G with decay probability α and a source s, and then returns the PPR π(s,v) for each node v ∈ V. Since computing an exact SSPPR query answer is prohibitive, most existing solutions turn to approximate queries with guarantees. The state-of-the-art solutions for approximate SSPPR queries are index-based and mainly focus on static graphs, while real-world graphs are usually dynamically changing. However, existing index-update schemes can not achieve a sub-linear update time. Motivated by this, we present an efficient indexing scheme for single-source PPR queries on evolving graphs. Our proposed solution is based on a classic framework that combines the forward-push technique with a random walk index for approximate PPR queries. Thus, our indexing scheme is similar to existing solutions in the sense that we store pre-sampled random walks for efficient query processing. One of our main contributions is an incremental updating scheme to maintain indexed random walks in expected O(1) time after each graph update. To achieve O(1) update cost, we need to maintain auxiliary data structures for both vertices and edges. To reduce the space consumption, we further revisit the sampling methods and propose a new sampling scheme to remove the auxiliary data structure for vertices while still supporting O(1) index update cost on evolving graphs. Extensive experiments show that our update scheme achieves orders of magnitude speed-up on update performance over existing index-based dynamic schemes without sacrificing the query efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3588705"
    }
]