[
    {
        "id": 7401,
        "title": "Bigisayarlı Görü Tabanlı AutoML Platformu",
        "authors": "Burak ŞAHİN, Aytuğ BOYACI",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "The rapid increase in data production, thanks to technological developments and scientific research, leads to the development of Machine Learning (ML) and similar new data analysis tools. It was announced that Amazon Web Services (AWS), a cloud service provider, stored 500EB of data in 2021 [1]. ML is an alternative to traditional engineering methods and does not require field knowledge of the problem to obtain a solution. However, the implementation of ML Algorithms can be complex depending on the content of the data set, and expert knowledge is the most important factor to use these algorithms effectively. Various methods have been developed to find a solution to this problem. There are many different areas and problems that machine learning can be applied to. We have limited our research to problems that can be solved using computer vision and AutoML. We have used AutoML and computer vision-based solutions to solve object classification, detection and segmentation problems. Our goal is to develop a platform that will work without the intervention of any expert. Users can load their datasets, choose the method they want, and train their models according to the problem they choose without any other intervention. After the training process is over, they can use their models in real time by transferring them over the platform in real time with their own hardware.",
        "link": "http://dx.doi.org/10.55525/tjst.1266144"
    },
    {
        "id": 7402,
        "title": "Automated Feature Engineering for AutoML Using Genetic Algorithms",
        "authors": "Kevin Shi, Sherif Saad",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012090400003555"
    },
    {
        "id": 7403,
        "title": "COVID19 Diagnosis using AutoML from 3D CT scans",
        "authors": "Talha Anwar",
        "published": "No Date",
        "citations": 6,
        "abstract": "Coronavirus is a pandemic that affects the respiratory system causing cough, shortness of breath, and death in severe cases. Polymerase chain reaction (PCR) tests are used to diagnose coronavirus. The false-negative rate of these tests is high, so there needs a supporting method for an accurate diagnosis. CT scan provides a detailed examination of the chest to diagnose COVID but a single CT scan comprises hundreds of slices. Expert and experienced radiologists and pulmonologists can diagnose COVID from these hundreds of slices, but this is very time-consuming. So an automatic artificial intelligence (AI) based method is required to diagnose coronavirus with high accuracy. Developing this AI-based technique requires a lot of resources and time, but once it is developed, it can significantly help the clinicians. This paper used an Automated machine learning (AutoML) technique that requires fewer resources (optimal architecture trials) and time to develop, resulting in the best diagnosis. The AutoML models are trained on 2D slices instead of 3D CT scans, and the predictions on unknown data (slices of CT scan) are aggregated to form a prediction of 3D CT scan. The aggregation process picked the most occurred case, whether COVID or non-COVID from all CT scan slices and labeled the 3D CT scan accordingly. Different thresholds are also used to label COVID or non-COVID 3D CT scans from 2D slices. The approach resulted in accuracy and F1-score of 89% and 88%, respectively. Implementation is available at github.com/talhaanwarch/mia-covid19",
        "link": "http://dx.doi.org/10.36227/techrxiv.14914851.v1"
    },
    {
        "id": 7404,
        "title": "Zaman serisi tahminlemede otomatikleştirilmiş makine öğrenmesi (AutoML) kütüphanelerinin karşılaştırılması",
        "authors": "Nagihan AKKURT, Servet HASGÜL",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "Firmaların bulunduğu konumu koruması veya geliştirebilmesi, ileride meydana gelebilecek durumlara karşı önceden tedbir alabilmesi ve diğer firmalar ile rekabet edebilmesi açısından geleceğe yönelik tahminleme gerçekleştirmesi gereklidir. Gelişen veri teknolojileri ile anlamlı veriye ulaşabilmek kolaylaşmıştır ve yapay zekâ, makine öğrenmesi, derin öğrenme gibi yöntemlerle birlikte bu verilerin analiz edilmesiyle geleceğe yönelik tahminlemede oldukça başarılı sonuçlar elde edilebilmektedir. Ancak literatürde birçok farklı yöntemin bulunması, araştırmacıların hangi yöntemi kullanacağı, model ve hiper-parametre seçimi için hangi teknikleri kullanacağı gibi birçok problem oluşturabilmektedir. Model ve hiper-parametre seçimde farklı değerlerin karşılaştırılması zahmetli ve uzun süreli olabilir. Bu doğrultuda gerçekleştirilen çalışmanın amacı, makine öğrenmesinin gelişmiş bir versiyonu olan otomatikleştirilmiş makine öğrenmesi (AutoML) yöntemini kullanmaktır. AutoML, makine öğrenmesi modellerini otomatikleştirerek bu alanda uzmanlık gerektirmeden makine öğrenmesi algoritmalarının kullanımına ve geliştirilmesine olanak tanır. Çalışmada, tek değişkenli bir zaman serisi verisi üzerinde 6 farklı AutoML kütüphanesi ile tahminleme çalışması gerçekleştirilmiştir ve tahminleme başarıları çeşitli performans metrikleri üzerinden karşılaştırılmıştır. Kullanılan veri seti üzerinde elde edilen sonuçlara göre seçilen kütüphanelerden tahminleme başarısı en yüksek olanın Auto_ARIMA kütüphanesi olduğu gözlenmiştir.",
        "link": "http://dx.doi.org/10.17341/gazimmfd.1286720"
    },
    {
        "id": 7405,
        "title": "COVID19 Diagnosis using AutoML from 3D CT scans",
        "authors": "Talha Anwar",
        "published": "No Date",
        "citations": 0,
        "abstract": "Coronavirus is a pandemic that affects the respiratory system causing cough, shortness of breath, and death in severe cases. Polymerase chain reaction (PCR) tests are used to diagnose coronavirus. The false-negative rate of these tests is high, so there needs a supporting method for an accurate diagnosis. CT scan provides a detailed examination of the chest to diagnose COVID but a single CT scan comprises hundreds of slices. Expert and experienced radiologists and pulmonologists can diagnose COVID from these hundreds of slices, but this is very time-consuming. So an automatic artificial intelligence (AI) based method is required to diagnose coronavirus with high accuracy. Developing this AI-based technique requires a lot of resources and time, but once it is developed, it can significantly help the clinicians. This paper used an Automated machine learning (AutoML) technique that requires fewer resources (optimal architecture trials) and time to develop, resulting in the best diagnosis. The AutoML models are trained on 2D slices instead of 3D CT scans, and the predictions on unknown data (slices of CT scan) are aggregated to form a prediction of 3D CT scan. The aggregation process picked the most occurred case, whether COVID or non-COVID from all CT scan slices and labeled the 3D CT scan accordingly. Different thresholds are also used to label COVID or non-COVID 3D CT scans from 2D slices. The approach resulted in accuracy and F1-score of 89% and 88%, respectively. Implementation is available at github.com/talhaanwarch/mia-covid19",
        "link": "http://dx.doi.org/10.36227/techrxiv.14914851"
    },
    {
        "id": 7406,
        "title": "Can AutoML outperform humans? An evaluation on popular OpenML datasets using AutoML Benchmark",
        "authors": "Marc Hanussek, Matthias Blohm, Maximilien Kintz",
        "published": "2020-12-12",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3448326.3448353"
    },
    {
        "id": 7407,
        "title": "Interpretable Feedback for AutoML and a Proposal for Domain-customized AutoML for Networking",
        "authors": "Behnaz Arzani, Kevin Hsieh, Haoxian Chen",
        "published": "2021-11-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3484266.3487373"
    },
    {
        "id": 7408,
        "title": "CurL-AutoML: Curriculum Learning-based AutoML",
        "authors": "Lucas Nildaimon Dos Santos Silva, Lucas Cardoso Silva, Fernando Rezende Zagatti, Bruno Silva Sette, Helena De Medeiros Caseli, Daniel Lucredio, Diego Furtado Silva",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmla52953.2021.00127"
    },
    {
        "id": 7409,
        "title": "Serving Very Large Numbers of Low Latency AutoML Models",
        "authors": "Manoj Agarwal",
        "published": "2020-10-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ieeeconf47748.2020.9377614"
    },
    {
        "id": 7410,
        "title": "Online AutoML: an adaptive AutoML framework for online learning",
        "authors": "Bilge Celik, Prabhant Singh, Joaquin Vanschoren",
        "published": "2023-6",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10994-022-06262-0"
    },
    {
        "id": 7411,
        "title": "Democratizing Policy Analytics with AutoML",
        "authors": "Danilo Freire",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3812593"
    },
    {
        "id": 7412,
        "title": "A Review of AutoML Software Tools for Time Series Forecasting and Anomaly Detection",
        "authors": "Christian O’Leary, Farshad Toosi, Conor Lynch",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011683000003393"
    },
    {
        "id": 7413,
        "title": "Building an AutoML System for Fun and Non-profit",
        "authors": "Niels Bantilan",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.25080/majora-342d178e-027"
    },
    {
        "id": 7414,
        "title": "AutoML im Controlling",
        "authors": "Max Schlicher, Klaus Möller",
        "published": "2022",
        "citations": 0,
        "abstract": "Mit der Demokratisierung von künstlicher Intelligenz bekommen auch Controller die Möglichkeit, automatisiertes Maschinelles Lernen einzusetzen. AutoML-Systeme (Automated Machine Learning) können in endnutzer- und expertenorientierte Systeme unterteilt werden. Als Startpunkt für das Controlling eignen sich endnutzerorientierte AutoML-Systeme am besten.",
        "link": "http://dx.doi.org/10.15358/0935-0381-2022-2-39"
    },
    {
        "id": 7415,
        "title": "Results from using an Automl Tool for Error Analysis in Manufacturing",
        "authors": "Alexander Gerling, Oliver Kamper, Christian Seiffer, Holger Ziekow, Ulf Schreier, Andreas Hess, Djaffar Abdeslam",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010998100003179"
    },
    {
        "id": 7416,
        "title": "WITHDRAWN: H 2 O AutoML-LIME: an integrated modelling approach for predicting cervical cancer in Women",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe full text of this preprint has been withdrawn, as it was submitted in error. Therefore, the authors do not wish this work to be cited as a reference. Questions should be directed to the corresponding author.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2001207/v2"
    },
    {
        "id": 7417,
        "title": "An improved hyperparameter optimization framework for AutoML systems using evolutionary algorithms",
        "authors": "Amala Mary Vincent, Jidesh P.",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nMachine learning strategy has changed the face of automated models by integrating themselves into many application domains. The spectrum of applications ranges over various domains, from atmospheric analysis to medical diagnosis. All these applications are design-sensitive, implying that the model's performance depends highly on the selected machine learning algorithm, training procedures, regularization methods, and most importantly, how the hyperparameters are tuned. With the advent of AutoML systems, all these processes including hyperparameter optimization can be automated, producing better performance and faster results. The ideal hyperparameter setting for machine learning models has a direct and significant impact on the model's performance. This paper studies different AutoML models and the hyperparameter techniques used by them for image classification problems. We also discuss some of the libraries for hyperparameter optimization and analyse how they work for different image classification problems. Moreover, the paper proposes a framework for hyperparameter optimization that combines Bayesian optimization and evolutionary algorithms. Experiments are carried out on image classification benchmark datasets to assess the performance of different optimization approaches including the proposed model.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1781731/v1"
    },
    {
        "id": 7418,
        "title": "Stochastic Schemata Exploiter-Based AutoML",
        "authors": "Hiroya Makino, Eisuke Kita",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw53433.2021.00037"
    },
    {
        "id": 7419,
        "title": "Comparative Study of AutoML Approach, Conventional Ensemble Learning Method, and KNearest Oracle-AutoML Model for Predicting Student Dropouts in Sub-Saharan African Countries",
        "authors": "Yuda N Mnyawami, Hellen H Maziku, Joseph C Mushi",
        "published": "2022-12-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/08839514.2022.2145632"
    },
    {
        "id": 7420,
        "title": "Challenges and Future Directions for Intrusion Detection Systems Based on AutoML",
        "authors": "",
        "published": "2021-1-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.58496/mjcs/2021/004"
    },
    {
        "id": 7421,
        "title": "Performance Comparison of Microsoft’s AutoML API",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.46354/i3m.2023.emss.028"
    },
    {
        "id": 7422,
        "title": "AutoML as Facilitator of AI Adoption in SMEs: An Analysis of AutoML Use Cases",
        "authors": "Anna K. Polzer, Johannes P. Zeiringer, Stefan Thalmann",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "While the uptake of AI and ML has been rising in recent years, SMEs still face various adoption challenges. In contrast to large enterprises, SMEs struggle to adopt AI as already the identification of suitable AI use cases requires substantial technical expertise. At the same time, productivity tools like AutoML promise easy access to AI capabilities to non-experts. This research-in-progress aims to investigate how AutoML tools can be utilised to facilitate the adoption of AI in SMEs. In a focus group with 11 representatives from SMEs, we identified and discussed potential AutoML use cases in detail. Results show that the identification of potential use cases rarely focused on existing and available data but rather repeated known use cases and success stories from large enterprises. We argue that a paradigm shift towards a data-centric approach would be beneficial to exhaust the capabilities of AutoML for SMEs.",
        "link": "http://dx.doi.org/10.18690/um.fov.6.2023.45"
    },
    {
        "id": 7423,
        "title": "Oracle AutoML",
        "authors": "Anatoly Yakovlev, Hesam Fathi Moghadam, Ali Moharrer, Jingxiao Cai, Nikan Chavoshi, Venkatanathan Varadarajan, Sandeep R. Agrawal, Sam Idicula, Tomas Karnagel, Sanjay Jinturkar, Nipun Agarwal",
        "published": "2020-8",
        "citations": 21,
        "abstract": "\n            Machine learning (ML) is at the forefront of the rising popularity of data-driven software applications. The resulting rapid proliferation of ML technology, explosive data growth, and shortage of data science expertise have caused the industry to face increasingly challenging demands to keep up with fast-paced develop-and-deploy model lifecycles. Recent academic and industrial research efforts have started to address this problem through automated machine learning (AutoML) pipelines and have focused on model performance as the first-order design objective. We present Oracle AutoML, a novel\n            iteration-free\n            AutoML pipeline designed to not only provide accurate models, but also in a shorter runtime. We are able to achieve these objectives by eliminating the need to continuously iterate over various pipeline configurations. In our feed-forward approach, each pipeline stage makes decisions based on metalearned proxy models that can predict candidate pipeline configuration performances before building the full final model. Our approach, which builds and tunes only the best candidate pipeline, achieves better scores at a fraction of the time compared to state-of-the-art open source AutoML tools, such as H2O and Auto-sklearn. This makes Oracle AutoML a prime candidate for addressing current industry challenges.\n          ",
        "link": "http://dx.doi.org/10.14778/3415478.3415542"
    },
    {
        "id": 7424,
        "title": "AutoClass: AutoML for Data Stream Classification",
        "authors": "Maroua Bahri, Nikolaos Georgantas",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386362"
    },
    {
        "id": 7425,
        "title": "Leveraging Automated Machine Learning for Text Classification: Evaluation of AutoML Tools and Comparison with Human Performance",
        "authors": "Matthias Blohm, Marc Hanussek, Maximilien Kintz",
        "published": "2021",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010331411311136"
    },
    {
        "id": 7426,
        "title": "ChaLearn AutoML Challenges",
        "authors": "Hugo Escalante, Jorge Madrid, Eduardo Morales",
        "published": "2018-12-3",
        "citations": 0,
        "abstract": "Academic challenges comprise effective means to rapidly advance the state of the art and solve problems of practical relevance. We elaborate on the benefits of challenges for the LatinX community and summarize ChaLearn challenges on Autonomous Machine Learning.",
        "link": "http://dx.doi.org/10.52591/lxai201812035"
    },
    {
        "id": 7427,
        "title": "AutoML – Optimal K Procedure",
        "authors": "Oded Koren, Michal Koren, Amit Sabban",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/aeis59450.2022.00023"
    },
    {
        "id": 7428,
        "title": "Arabic Topic Classification in the Generative and AutoML Era",
        "authors": "Doha Albared, Hadi Hamoud, Fadi Zaraket",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.32"
    },
    {
        "id": 7429,
        "title": "Beef quality assessment using AutoML",
        "authors": "Talha Anwar, Hassan Anwar",
        "published": "2021-7-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/majicc53071.2021.9526256"
    },
    {
        "id": 7430,
        "title": "Meta features for anomaly detection in AutoML",
        "authors": "Milos Kotlar, Marija Punt, Zaharije Radivojevic, Milos Cvetanovic",
        "published": "2022-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/telfor56187.2022.9983735"
    },
    {
        "id": 7431,
        "title": "Assisting Educational Analytics with AutoML Functionalities",
        "authors": "Spyridon Garmpis, Manolis Maragoudakis, Aristogiannis Garmpis",
        "published": "2022-6-15",
        "citations": 2,
        "abstract": "The plethora of changes that have taken place in policy formulations on higher education in recent years in Greece has led to unification, the abolition of departments or technological educational institutions (TEI) and mergers at universities. As a result, many students are required to complete their studies in departments of the abolished TEI. Dropout or a delay in graduation is a significant problem that results from newly joined students at the university, in addition to the provision of studies. There are various reasons for this, with student performance during studies being one of the major contributing factors. This study was aimed at predicting the time required for weak students to pass their courses so as to allow the university to develop strategic programs that will help them improve performance and graduate in time. This paper presents various components of educational data mining incorporating a new state-of-the-art strategy, called AutoML, which is used to find the best models and parameters and is capable of predicting the length of time required for students to pass their courses using their past course performance and academic information. A dataset of 23,687 “Computer Networking” module students was used to train and evaluate the classification of a model developed in the KNIME Analytics (open source) data science platform. The accuracy of the model was measured using well-known evaluation criteria, such as precision, recall, and F-measure. The model was applied to data related to three basic courses and correctly predicted approximately 92% of students’ performance and, specifically, students who are likely to drop out or experience a delay before graduating.",
        "link": "http://dx.doi.org/10.3390/computers11060097"
    },
    {
        "id": 7432,
        "title": "COVID19 Diagnosis using AutoML from 3D CT scans",
        "authors": "Talha Anwar",
        "published": "2021-10",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccvw54120.2021.00061"
    },
    {
        "id": 7433,
        "title": "Medical Image Classification with On-Premise AutoML: Unveiling Insights through Comparative Analysis",
        "authors": "Kabilan Elangovan, Gilbert Lim, Daniel Ting",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAutomated machine learning (AutoML) allows for the simplified application of machine learning to real-world problems, by the implicit handling of necessary steps such as data pre-processing, feature engineering, model selection and hyperparameter optimization. This has encouraged its use in medical applications such as imaging. However, the impact of common parameter choices such as the number of trials allowed, and the resolution of the input images, has not been comprehensively explored in existing literature. We therefore benchmark AutoKeras (AK), an open-source AutoML framework, against several bespoke deep learning architectures, on five public medical datasets representing a wide range of imaging modalities. It was found that AK could outperform the bespoke models in general, although at the cost of increased training time. Moreover, our experiments suggest that a large number of trials and higher resolutions may not be necessary for optimal performance to be achieved.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3172493/v1"
    },
    {
        "id": 7434,
        "title": "A Comparative Analysis of Student Grade Prediction and Classification Using Default, Onevsone, and H2o Automl Ensemble Analysis",
        "authors": "Yagyanath Rimal",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4524927"
    },
    {
        "id": 7435,
        "title": "Automated machine learning and explainable AI (AutoML-XAI) for metabolomics: improving cancer diagnostics",
        "authors": "Olatomiwa O. Bifarin, Facundo M. Fernández",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractMotivationMetabolomics generates complex data necessitating advanced computational methods for generating biological insight. While machine learning (ML) is promising, the challenges of selecting the best algorithms and tuning hyperparameters, particularly for nonexperts, remain. Automated machine learning (AutoML) can streamline this process; however, the issue of interpretability could persist. This research introduces a unified pipeline that combines AutoML with explainable AI (XAI) techniques to optimize metabolomics analysis.ResultsWe tested our approach on two datasets: renal cell carcinoma (RCC) urine metabolomics and ovarian cancer (OC) serum metabolomics. AutoML, using auto-sklearn, surpassed standalone ML algorithms such as SVM and random forest in differentiating between RCC and healthy controls, as well as OC patients and those with other gynecological cancers (Non-OC). Autosklearn employed a mix of algorithms and ensemble techniques, yielding a superior performance (AUC of 0.97 for RCC and 0.85 for OC). Shapley Additive Explanations (SHAP) provided a global ranking of feature importance, identifying dibutylamine and ganglioside GM(d34:1) as the top discriminative metabolites for RCC and OC, respectively. Waterfall plots offered local explanations by illustrating the influence of each metabolite on individual predictions. Dependence plots spotlighted metabolite interactions, such as the connection between hippuric acid and one of its derivatives in RCC, and between GM3(d34:1) and GM3(18:1_16:0) in OC, hinting at potential mechanistic relationships. Through decision plots, a detailed error analysis was conducted, contrasting feature importance for correctly versus incorrectly classified samples. In essence, our pipeline emphasizes the importance of harmonizing AutoML and XAI, facilitating both simplified ML application and improved interpretability in metabolomics data science.Availabilityhttps://github.com/obifarin/automl-xai-metabolomicsContact:facundo.fernandez@chemistry.gatech.edu",
        "link": "http://dx.doi.org/10.1101/2023.10.26.564244"
    },
    {
        "id": 7436,
        "title": "Enhancing Network Intrusion Detection: An AutoML Pipeline with Efficient Digital Twin Synchronization",
        "authors": "Mirna El Rajab, Li Yang, Abdallah Shami",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36227/techrxiv.170475326.65758197/v1"
    },
    {
        "id": 7437,
        "title": "AutoML und Guided Analytics",
        "authors": "Robert Weber, Peter Seeberg",
        "published": "2020-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3139/9783446464278.003"
    },
    {
        "id": 7438,
        "title": "Towards an AutoML System for Fair Classifications<sup>∗</sup>",
        "authors": "Nico Lässig",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icde55515.2023.00380"
    },
    {
        "id": 7439,
        "title": "A Review on Automated Machine Learning (AutoML) Systems",
        "authors": "Thiloshon Nagarajah, Guhanathan Poravi",
        "published": "2019-3",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/i2ct45611.2019.9033810"
    },
    {
        "id": 7440,
        "title": "Leveraging AutoML to provide NAFLD screening diagnosis: Proposed machine learning models",
        "authors": "Ali Haider Bangash",
        "published": "No Date",
        "citations": 1,
        "abstract": "AbstractNAFLD is reported to be the only hepatic ailment increasing in its prevalence concurrently with both; obesity & T2DM. In the wake of a massive strain on global health resources due to COVID 19 pandemic, NAFLD is bound to be neglected & shelved. Abdominal ultrasonography is done for NAFLD screening diagnosis which has a high monetary cost associated with it. We utilized MLjar, an autoML web platform, to propose machine learning models that require no coding whatsoever & take in only easy-to-measure anthropometric measures for coming up with a screening diagnosis for NAFLD with considerably high AUC. Further studies are suggested to validate the generalization of the presented models.",
        "link": "http://dx.doi.org/10.1101/2020.10.20.20216291"
    },
    {
        "id": 7441,
        "title": "Designing Machine Learning Pipeline Toolkit for AutoML Surrogate Modeling Optimization",
        "authors": "",
        "published": "2023-6-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21105/jcon.00129"
    },
    {
        "id": 7442,
        "title": "Using a DEA–AutoML Approach to Track SDG Achievements",
        "authors": "Bodin Singpai, Desheng Wu",
        "published": "2020-12-4",
        "citations": 8,
        "abstract": "Each country needs to monitor progress on their Sustainable Development Goals (SDGs) to develop strategies that meet the expectations of the United Nations. Data envelope analysis (DEA) can help identify best practices for SDGs by setting goals to compete against. Automated machine learning (AutoML) simplifies machine learning for researchers who need less time and manpower to predict future situations. This work introduces an integrative method that integrates DEA and AutoML to assess and predict performance in SDGs. There are two experiments with different data properties in their interval and correlation to demonstrate the approach. Three prediction targets are set to measure performance in the regression, classification, and multi-target regression algorithms. The back-propagation neural network (BPNN) is used to validate the outputs of the AutoML. As a result, AutoML can outperform BPNN for regression and classification prediction problems. Low standard deviation (SD) data result in poor prediction performance for the BPNN, but does not have a significant impact on AutoML. Highly correlated data result in a higher accuracy, but does not significantly affect the R-squared values between the actual and predicted values. This integrative approach can accurately predict the projected outputs, which can be used as national goals to transform an inefficient country into an efficient country.",
        "link": "http://dx.doi.org/10.3390/su122310124"
    },
    {
        "id": 7443,
        "title": "84.51° and Kroger: AutoML to Improve Data Science Productivity",
        "authors": "",
        "published": "2022-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7551/mitpress/14453.003.0015"
    },
    {
        "id": 7444,
        "title": "Enabling AutoML for Zero-Touch Network Security: Use-Case Driven Analysis",
        "authors": "Li Yang, Mirna El Rajab, Abdallah Shami, Sami Muhaidat",
        "published": "No Date",
        "citations": 0,
        "abstract": "Zero-Touch Networks (ZTNs) represent a state-of-the-art paradigm shift\ntowards fully automated and intelligent network management, enabling the\nautomation and intelligence required to manage the complexity, scale,\nand dynamic nature of next-generation (6G) networks. ZTNs leverage\nArtificial Intelligence (AI) and Machine Learning (ML) to enhance\noperational efficiency, support intelligent decision-making, and ensure\neffective resource allocation. However, the implementation of ZTNs is\nsubject to security challenges that need to be resolved to achieve their\nfull potential. In particular, two critical challenges arise: the need\nfor human expertise in developing AI/ML-based security mechanisms, and\nthe threat of adversarial attacks targeting AI/ML models. In this survey\npaper, we provide a comprehensive review of current security issues in\nZTNs, emphasizing the need for advanced AI/ML-based security mechanisms\nthat require minimal human intervention and protect AI/ML models\nthemselves. Furthermore, we explore the potential of Automated ML\n(AutoML) technologies in developing robust security solutions for ZTNs.\nThrough case studies, we illustrate practical approaches to securing\nZTNs against both conventional and AI/ML-specific threats, including the\ndevelopment of autonomous intrusion detection systems and strategies to\ncombat Adversarial ML (AML) attacks. The paper concludes with a\ndiscussion of the future research directions for the development of ZTN\nsecurity approaches. Abstract content goes here",
        "link": "http://dx.doi.org/10.36227/techrxiv.23981331.v2"
    },
    {
        "id": 7445,
        "title": "A Comparison of AutoML Hyperparameter Optimization Tools For Tabular Data",
        "authors": "Prativa Pokhrel, Alina Lazar",
        "published": "2023-5-8",
        "citations": 0,
        "abstract": "The performance of machine learning (ML) methods for classification and regression tasks applied to tabular datasets is sensitive to hyperparameters values. Therefore, finding the optimal values of these hyperparameters is integral in improving the prediction accuracy of an ML algorithm and the model selection. However, manually searching for the best configuration is a tedious task, and many AutoML (Automated Machine Learning) frameworks have been proposed recently to help practitioners solve this problem. Hyperparameters are the values or configurations that control the algorithm’s behavior while building the model. Hyperparameter optimization (HPO) is the guided process of finding the best combination of hyperparameters that delivers the best performance on the data and task at hand in a reasonable amount of time. In this work, we compare the performance of two frequently used AutoML HPO frameworks, Optuna and HyperOpt, on popular OpenML tabular datasets to identify the best framework for tabular data. The results of the experiments show that Optuna performs better than HyperOpt, whereas HyperOpt is the fastest for hyperparameter optimization.",
        "link": "http://dx.doi.org/10.32473/flairs.36.133357"
    },
    {
        "id": 7446,
        "title": "Towards AutoML in the presence of Drift",
        "authors": "Jorge Madrid, Hugo Escalante, Eduardo Moales",
        "published": "2018-12-3",
        "citations": 5,
        "abstract": "In many real-world scenarios AutoML systems are necessary due to the limited expertise in Machine Learning by developers. Research in this field has lead to the development of state-of-the-art solutions for supervised Machine Learning tasks that work effectively in different application areas. However, these don’t consider the changing nature inherent to several real-world situations (e.g. recommendation systems, spam-filtering). We briefly describe a first attempt to cope with such situation. We extended Auto-Sklearn with intuitive mechanisms to allow it to cope with data distributions that change over time. Results demonstrate the effectiveness of the proposed methodology. An extended version of this work was presented in AutoML Workshop @ ICML2018.",
        "link": "http://dx.doi.org/10.52591/lxai201812039"
    },
    {
        "id": 7447,
        "title": "Auto Machine Learning dengan Menggunakan H2O AutoML untuk Prediksi Harga Bitcoin",
        "authors": "",
        "published": "2021-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32409/jikstik.20.2.2738"
    },
    {
        "id": 7448,
        "title": "An Automated Machine Learning-Genetic Algorithm (AutoML-GA) Framework With Active Learning for Design Optimization",
        "authors": "Opeoluwa Owoyele, Pinaki Pal, Alvaro Vidal Torreira",
        "published": "No Date",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1115/1.0003772v"
    },
    {
        "id": 7449,
        "title": "AutoFL: Towards AutoML in a Federated Learning Context",
        "authors": "Davy Preuveneers",
        "published": "2023-7-9",
        "citations": 1,
        "abstract": "Federated learning (FL) is a decentralized machine learning (ML) technique that learns from distributed data by moving the training process from a centralized server towards many clients rather than centralizing the client data, as is common with classical machine learning. The recent literature on federated learning often focuses on domain-specific use cases (e.g., IoT), investigates various privacy concerns (e.g., membership inference), or analyzes the impact of adversarial attacks (e.g., poisoning) and possible countermeasures. In these works, it is common for the server to have already chosen a specific machine-learning model and predefined hyperparameters prior to initiating the distributed training process. This decision is based on the server’s ability to accomplish the task by either reusing well-established neural network architectures suitable for the specific task (e.g., ResNet-50 for image classification) or evaluating the adequacy of a model using the limited data it has access to. Additionally, the server may also assess publicly available datasets, which may or may not accurately represent real-world data distributions. In this paper, we address the challenge where this step—i.e., the ML model selection and hyperparameter optimization—is not possible in a centralized manner. In such a context, the data of a single client may not be sufficient or not representative enough to construct an ML model configuration that is effective for all clients. In real-world deployments, the data on the different clients may be imbalanced and heterogeneously distributed, and the performance impact of countermeasures is often unclear upfront. While various automated machine learning (AutoML) frameworks have been proposed for classical machine learning and deep learning in a centralized setting, we investigated the practical feasibility of AutoML in a federated learning context while taking into account the presence of security and privacy countermeasures. We implemented and validated our proof-of-concept framework, called AutoFL, on top of open-source libraries for machine learning, federated learning, and hyperparameter optimization, and have demonstrated the added value of our framework with public datasets in different scenarios.",
        "link": "http://dx.doi.org/10.3390/app13148019"
    },
    {
        "id": 7450,
        "title": "Hardware-Aware AutoML for Exploration of Custom FPGA Accelerators for RadioML",
        "authors": "Felix Jentzsch",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/fpl60245.2023.00066"
    },
    {
        "id": 7451,
        "title": "Classification of ECG Signals with Different Lead Systems Using AutoML",
        "authors": "Matteo Bodini, Massimo W Rivolta, Roberto Sassi",
        "published": "2021-9-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/cinc53138.2021.9662802"
    },
    {
        "id": 7452,
        "title": "Autoencoders and AutoML for intrusion detection",
        "authors": "Alina Florina Glavan, Victor Croitoru",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecai58194.2023.10194229"
    },
    {
        "id": 7453,
        "title": "Diabetic retinopathy identification using autoML",
        "authors": "V.K. Harikrishnan, Meenu Vijarania, Ashima Gambhir",
        "published": "2020",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-820604-1.00012-1"
    },
    {
        "id": 7454,
        "title": "Öğrencilerin Akademik Performanslarının Tahmin Edilmesi için AutoML Tekniğinin Uygulanması",
        "authors": "Sevda AGHALAROVA, Sinem BOZKURT KESER",
        "published": "2021-8-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31202/ecjse.946505"
    },
    {
        "id": 7455,
        "title": "Ontology-based Meta AutoML",
        "authors": "Alexander Zender, Bernhard G. Humm",
        "published": "2022-8-26",
        "citations": 5,
        "abstract": "Automated machine learning (AutoML) supports ML engineers and data scientist by automating single tasks like model selection and hyperparameter optimization, automatically generating entire ML pipelines. This article presents a survey of 20 state-of-the-art AutoML solutions, open source and commercial. There is a wide range of functionalities, targeted user groups, support for ML libraries, and degrees of maturity. Depending on the AutoML solution, a user may be locked into one specific ML library technology or one product ecosystem. Additionally, the user might require some expertise in data science and programming for using the AutoML solution. We propose a concept called OMA-ML (Ontology-based Meta AutoML) that combines the features of existing AutoML solutions by integrating them (Meta AutoML). OMA-ML can incorporate any AutoML solution allowing various user groups to generate ML pipelines with the ML library of choice. An ontology is the information backbone of OMA-ML. OMA-ML is being implemented as an open source solution with currently third-party 7 AutoML solutions being integrated.",
        "link": "http://dx.doi.org/10.3233/ica-220684"
    },
    {
        "id": 7456,
        "title": "Communication-Computation Efficient Device-Edge Co-Inference via AutoML",
        "authors": "Xinjie Zhang, Jiawei Shao, Yuyi Mao, Jun Zhang",
        "published": "2021-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/globecom46510.2021.9685432"
    },
    {
        "id": 7457,
        "title": "Challenges of Accurate and Efficient AutoML",
        "authors": "Swarnava Dey, Avik Ghose, Soumik Das",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ase56229.2023.00182"
    },
    {
        "id": 7458,
        "title": "SML-AutoML: A Smart Meta-Learning Automated Machine Learning Framework",
        "authors": "Ibrahim Gomaa, Ali Zidane, Hoda M. O. Mokhtar, Neamat El-Tazi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nMachine Learning (ML) and Automated Machine Learning (Auto-ML) had attracted more attention and interest in industrial applications in recent years. Machine learning pipeline includes repetitive tasks such as data pre-processing, feature engineering, model selection and hyper-parameter optimization. Building a machine learning model requires extensive time for development, stress-testing, and multiple experiments. Besides, building a model with a small search space of pipeline steps with multiple algorithms and hyper-parameters takes hours. Hence, Auto-ML has been widely adapted to save time and efforts on such tasks. Nevertheless, there are many limitations in the existing Auto-ML frameworks. Most of the existing Auto-ML pipeline frameworks focus only on a part of the ML pipeline which does not always result in the optimum overall pipeline for the given dataset. Moreover, several Auto-ML pipeline frameworks ignore integrating meta-learning, thus they recommend a well-performing pipeline for a single task and not a global and generic optimal pipeline. Thus, for new tasks they must search for a new pipeline. Furthermore, although there are Auto-ML frameworks that consider the complete pipeline but imbalanced datasets did not receive much attention from the proposed Auto-ML frameworks. To tackle these challenges, we propose a new efficient Auto-ML framework that is equipped with a meta learning mechanism for automated algorithm selection which also handles imbalanced datasets efficiently. This paper also demonstrates how the proposed framework outperforms the-state-of-the-art frameworks.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2085778/v1"
    },
    {
        "id": 7459,
        "title": "A Decision Support Framework for AutoML Systems: A Meta-Learning Approach",
        "authors": "Salijona Dyrmishi, Radwa Elshawi, Sherif Sakr",
        "published": "2019-11",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw.2019.00025"
    },
    {
        "id": 7460,
        "title": "AutoML for Outlier Detection with Optimal Transport Distances",
        "authors": "Prabhant Singh, Joaquin Vanschoren",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Automated machine learning (AutoML) has been widely researched and adopted for supervised problems, but progress in unsupervised settings has been limited. We propose `\"LOTUS\", a novel framework to automate outlier detection based on meta-learning. Our premise is that the selection of the optimal outlier detection technique depends on the inherent properties of the data distribution. We leverage optimal transport to find the dataset with the most similar underlying distribution, and then apply the outlier detection techniques that proved to work best for that data distribution. We evaluate the robustness of our framework and find that it outperforms all state-of-the-art automated outlier detection tools. This approach can also be easily generalized to automate other unsupervised settings.",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/843"
    },
    {
        "id": 7461,
        "title": "Robustness of AutoML for Time Series Forecasting in Sensor Networks",
        "authors": "Tuomas Halvari, Jukka K. Nurminen, Tommi Mikkonen",
        "published": "2021-6-21",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/ifipnetworking52078.2021.9472199"
    },
    {
        "id": 7462,
        "title": "Detection of anomalous NO2 emitting ships using AutoML on TROPOMI satellite data",
        "authors": "Solomiia Kurchaba, Jasper van Vliet, Fons J. Verbeek, Cor J. Veenman",
        "published": "No Date",
        "citations": 0,
        "abstract": "Starting from 2021 International Maritime Organization (IMO) introduced more demanding NOx emission restrictions for ships operating in waters of the North and Baltic Seas. All methods currently used for ship compliance monitoring are financially and time-demanding. Thus, it is important to prioritize the inspection of ships that have a high chance of being non-compliant.&#160;&#160;TROPOMI/S5P instrument for the first time allows a distinction of NO2 plumes from individual ships. Here, we present a method for the selection of potentially non-compliant ships using automated machine learning (AutoML) on TROPOMI/S5P satellite data. The study is based on the analysis of 20 months of data in the Mediterranean Sea region. To each ship, we assign a Region of Interest (RoI), where we expect the ship plume to be located. We then train a regression model to predict the amount of NO2 that is expected to be produced by a ship with specific properties operating in the given atmospheric conditions. We use a genetic algorithm-based AutoML for the automatic selection and configuration of a machine-learning pipeline that maximizes prediction accuracy. The difference between the predicted and actual amount of produced NO2 is a measure of inspection worthiness. We rank the analyzed ships accordingly.&#160;&#160;We cross-check the obtained ranks using a previously developed method for supervised ship plume segmentation.&#160; We quantify the amount of NO2 produced by a given ship by summing up concentrations within the pixels identified as a &#8220;plume&#8221;. We rank the ships based on the difference between the obtained concentrations and the ship emission proxy.&#160;Ships that are also ranked as highly deviating by the segmentation method need further attention. For example, by checking their data for other explanations. If no other explanations are found, these ships are advised to be the candidates for fuel inspection.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-1183"
    },
    {
        "id": 7463,
        "title": "A Genetic Algorithm-based AutoML Approach for Large-scale Traffic Speed Prediction",
        "authors": "Junwei You",
        "published": "2020-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icite50838.2020.9231486"
    },
    {
        "id": 7464,
        "title": "AutoML Hyperparameter Tuning of Generative DNN Architecture for Nanophotonic Device Design",
        "authors": "Toshiaki Koike-Akino, Keisuke Kojima, Ye Wang",
        "published": "2022",
        "citations": 0,
        "abstract": "We introduce an automated machine learning (AutoML) framework to construct a deep neural network model relevant for inverse design of nanophotonic devices without relying on manual trial-and-error hyperparameter tuning.",
        "link": "http://dx.doi.org/10.1364/cleo_at.2022.jw3a.44"
    },
    {
        "id": 7465,
        "title": "Hazardous Behavior Identification Based on BIM and AutoML Applied to Prefabricated Construction",
        "authors": "Nairui Hou",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wccct56755.2023.10052373"
    },
    {
        "id": 7466,
        "title": "Genens: An AutoML System for Ensemble Optimization Based on Developmental Genetic Programming",
        "authors": "Gabriela Suchoparova, Roman Neruda",
        "published": "2020-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci47803.2020.9308582"
    },
    {
        "id": 7467,
        "title": "Trustless AutoML for the Age of Internet of Things",
        "authors": "Luis Angel D. Bathen, Divyesh Jadav",
        "published": "2022-5-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbc54727.2022.9805535"
    },
    {
        "id": 7468,
        "title": "Graph Neural Networks: AutoML",
        "authors": "Kaixiong Zhou, Zirui Liu, Keyu Duan, Xia Hu",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-6054-2_17"
    },
    {
        "id": 7469,
        "title": "Efficient Multimedia Computing: Unleashing the Power of AutoML",
        "authors": "Debanjan Datta, Gerald Friedland",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3581783.3613858"
    },
    {
        "id": 7470,
        "title": "Benchmarking Automated Machine Learning (AutoML) Frameworks for Object Detection",
        "authors": "Samuel de Oliveira, Oguzhan Topsakal, Onur Toker",
        "published": "2024-1-21",
        "citations": 0,
        "abstract": "Automated Machine Learning (AutoML) is a subdomain of machine learning that seeks to expand the usability of traditional machine learning methods to non-expert users by automating various tasks which normally require manual configuration. Prior benchmarking studies on AutoML systems—whose aim is to compare and evaluate their capabilities—have mostly focused on tabular or structured data. In this study, we evaluate AutoML systems on the task of object detection by curating three commonly used object detection datasets (Open Images V7, Microsoft COCO 2017, and Pascal VOC2012) in order to benchmark three different AutoML frameworks—namely, Google’s Vertex AI, NVIDIA’s TAO, and AutoGluon. We reduced the datasets to only include images with a single object instance in order to understand the effect of class imbalance, as well as dataset and object size. We used the metrics of the average precision (AP) and mean average precision (mAP). Solely in terms of accuracy, our results indicate AutoGluon as the best-performing framework, with a mAP of 0.8901, 0.8972, and 0.8644 for the Pascal VOC2012, COCO 2017, and Open Images V7 datasets, respectively. NVIDIA TAO achieved a mAP of 0.8254, 0.8165, and 0.7754 for those same datasets, while Google’s VertexAI scored 0.855, 0.793, and 0.761. We found the dataset size had an inverse relationship to mAP across all the frameworks, and there was no relationship between class size or imbalance and accuracy. Furthermore, we discuss each framework’s relative benefits and drawbacks from the standpoint of ease of use. This study also points out the issues found as we examined the labels of a subset of each dataset. Labeling errors in the datasets appear to have a substantial negative effect on accuracy that is not resolved by larger datasets. Overall, this study provides a platform for future development and research on this nascent field of machine learning.",
        "link": "http://dx.doi.org/10.3390/info15010063"
    },
    {
        "id": 7471,
        "title": "From Conventional Machine Learning to AutoML",
        "authors": "Ziqiao Weng",
        "published": "2019-4",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1742-6596/1207/1/012015"
    },
    {
        "id": 7472,
        "title": "End-to-End AutoML Implementation Framework",
        "authors": "Muhammet Ali KADIOGLU",
        "published": "2022-12-14",
        "citations": 0,
        "abstract": "Automated machine learning (AutoML) has been an active research area in recent years. Researchers investigate the potential of AutoML as more stakeholders want to maximize the value of their data. The methods are designed to increase the effectiveness of machine learning (ML), accelerate model development processes, and make it accessible for domain experts that are not ML professionals. The systems without the aid of humans are feasible with AutoML, an area that has been increasingly studied recently. Even though efficiency and automation are two of AutoML's key points, a number of critical steps still require human involvement, such as understanding the characteristics of domain-specific data, defining prediction problems, creating a suitable training dataset, and choosing a promising ML technique. A comprehensive and updated analysis of the state-of-the-art in AutoML is presented in the study. AutoML techniques, including hyperparameter optimization (HPO), feature engineering, and data preparation are presented. As-is prediction structure and AutoML-based benchmark model are compared to show how to implement these methods. It is stated what a real end-to-end machine learning pipeline looks like and which parts of the pipeline have already been automated. Our AutoML implementation framework has been introduced and presented as a road map for the entire ML pipeline. Several unresolved issues with the current AutoML techniques are discussed. The obstacles have been outlined that must be overcome in order to achieve this objective.",
        "link": "http://dx.doi.org/10.55549/epstem.1218713"
    },
    {
        "id": 7473,
        "title": "AutoML for NLP",
        "authors": "Kevin Duh, Xuan Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-tutorials.5"
    },
    {
        "id": 7474,
        "title": "AutoML-based neural network for the detection of keratoconus",
        "authors": "Daimin Li",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "For many years, the diagnosis of Keratoconus (KCN) has heavily relied upon the expertise and subjective judgment of clinicians. However, this study represents a pioneering effort to revolutionize KCN identification through the integration of Convolutional Neural Network (CNN) classification. In this innovative approach, the model is specifically designed to process corneal images as its primary input data, categorizing them into one of three distinct classes: KCN, suspect, or normal. Remarkably, this CNN model, meticulously implemented on the Edge Impulse platform, has achieved an astounding accuracy rate of 98.2% in correctly identifying KCN cases. Nevertheless, there remains substantial potential for improvement in the accurate classification of the suspect and normal categories. In conclusion, this study exemplifies the vast potential of CNNs to transform the diagnosis of keratoconus. With ongoing refinements, including enhanced data preprocessing, attention mechanisms, and quantitative integration, this approach could herald a transformative era in KCN identification and management.",
        "link": "http://dx.doi.org/10.54254/2755-2721/40/20230638"
    },
    {
        "id": 7475,
        "title": "Framed: An Automl Approach for Structural Performance Prediction of Bicycle Frames",
        "authors": "Lyle Regenwetter, Colin Weaver, Faez Ahmed",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4132282"
    },
    {
        "id": 7476,
        "title": "AUTOML: ИССЛЕДОВАНИЕ СУЩЕСТВУЮЩИХ ПРОГРАММНЫХ РЕАЛИЗАЦИЙ И ОПРЕДЕЛЕНИЕ ОБЩЕЙ ВНУТРЕННЕЙ СТРУКТУРЫ РЕШЕНИЙ",
        "authors": "",
        "published": "2023-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14357/20790279230106"
    },
    {
        "id": 7477,
        "title": "Survey on Automated Machine Learning (AutoML) and Meta learning",
        "authors": "Ashwini Doke, Madhava Gaikwad",
        "published": "2021-7-6",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt51525.2021.9579526"
    },
    {
        "id": 7478,
        "title": "Automl Approach to Classification of Candidate Solutions for Simulation Models of Logistic Systems",
        "authors": "Ilya Jackson, Josue C. Velazquez-Martinez",
        "published": "2021-12-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wsc52266.2021.9715416"
    },
    {
        "id": 7479,
        "title": "AutoML Approach to Stock Keeping Units Segmentation",
        "authors": "Ilya Jackson",
        "published": "2022-11-15",
        "citations": 1,
        "abstract": "A typical retailer carries 10,000 stock-keeping units (SKUs). However, these numbers may exceed hundreds of millions for giants such as Walmart and Amazon. Besides the volume, SKU data can also be high-dimensional, which means that SKUs can be segmented on the basis of various attributes. Given the data volumes and the multitude of potentially important dimensions to consider, it becomes computationally impossible to individually manage each SKU. Even though the application of clustering for SKU segmentation is common, previous studies do not address the problem of parametrization and model finetuning, which may be extremely tedious and time-consuming in real-world applications. Our work closes the research gap by proposing a solution that leverages automated machine learning for the automated cluster analysis of SKUs. The proposed framework for automated SKU segmentation incorporates minibatch K-means clustering, principal component analysis, and grid search for parameter tuning. It operates on top of the Apache Parquet file format, an efficient, structured, compressed, column-oriented, and big-data-friendly format. The proposed solution was tested on the basis of a real-world dataset that contained data at the pallet level.",
        "link": "http://dx.doi.org/10.3390/jtaer17040076"
    },
    {
        "id": 7480,
        "title": "Optuna and AutoML",
        "authors": "Tanay Agrawal",
        "published": "2021",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-6579-6_5"
    },
    {
        "id": 7481,
        "title": "WITHDRAWN: H 2 O AutoML-LIME: an integrated modelling approach for predicting cervical cancer in Women",
        "authors": "Sashikanta Prusty, Srikanta Patnaik, Sujit Kumar Dash",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nBackground\n Cancer positioning a major disease, particularly for middle-aged people, which remains a global concern that can be developed in the form of abnormal growth of body cells at any place in the human body. Cervical cancer, often known as cervix cancer, is cancer present at the female cervix. In the area where the endocervix (upper two-thirds of the cervix) and ectocervix (lower third of the cervix) meet, the majority of cervical cancers begin.\nObjective\n Despite an influx of people entering the healthcare industry, the demand for Machine Learning (ML) specialists has recently outpaced the supply. To close the gap, user-friendly application, such as H2O, has made significant progress these days. However, the traditional ML technique handles each stage of the process separately; whereas H2O AutoML can automate a major portion of the ML workflow, such as automatic training and tuning of multiple models within a user-defined timeframe.\nMethods\n Thus, this work aims at implementing the H2O AutoML-LIME technique, to predict cervical cancer at its early stages. Moreover, this model has capable of training the best model in less amount of time which helps in reducing the human effort over traditional ML techniques. The Stacked Ensembles approach, on the other hand, will be automatically trained H2O models to create a highly predictive ensemble model that will outperform the AutoML Leaderboard in most instances. Additionally, LIME (Local Interpretable Model-Agnostic Explanations) has been implemented over the H2O AutoML model, to uncover black boxes and to explain every individual prediction in our model.\nResults\n After predicting our proposed model with three different probabilities, gives 0.13, 0.05, and 0.13 percent of chances cervical cancer respectively.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2001207/v1"
    },
    {
        "id": 7482,
        "title": "Author Correction: Hierarchical automated machine learning (AutoML) for advanced unconventional reservoir characterization",
        "authors": "Yousef Mubarak, Ardiansyah Koeshidayatullah",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1038/s41598-023-46975-3"
    },
    {
        "id": 7483,
        "title": "Leveraging Classification Through AutoML and Microservices",
        "authors": "M. Keerthivasan, V. Krishnaveni",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781394175253.ch11"
    },
    {
        "id": 7484,
        "title": "AutoML and Neural Architecture Search for Gaze Estimation",
        "authors": "Adrian Bublea, Catalin Daniel Caleanu",
        "published": "2022-5-25",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/saci55618.2022.9919471"
    },
    {
        "id": 7485,
        "title": "An improved hyperparameter optimization framework for AutoML systems using evolutionary algorithms",
        "authors": "Amala Mary Vincent, P. Jidesh",
        "published": "2023-3-23",
        "citations": 17,
        "abstract": "AbstractFor any machine learning model, finding the optimal hyperparameter setting has a direct and significant impact on the model’s performance. In this paper, we discuss different types of hyperparameter optimization techniques. We compare the performance of some of the hyperparameter optimization techniques on image classification datasets with the help of AutoML models. In particular, the paper studies Bayesian optimization in depth and proposes the use of genetic algorithm, differential evolution and covariance matrix adaptation—evolutionary strategy for acquisition function optimization. Moreover, we compare these variants of Bayesian optimization with conventional Bayesian optimization and observe that the use of covariance matrix adaptation—evolutionary strategy and differential evolution improves the performance of standard Bayesian optimization. We also notice that Bayesian optimization tends to perform poorly when genetic algorithm is used for acquisition function optimization.",
        "link": "http://dx.doi.org/10.1038/s41598-023-32027-3"
    },
    {
        "id": 7486,
        "title": "AutoDispNet: Improving Disparity Estimation With AutoML",
        "authors": "Tonmoy Saikia, Yassine Marrakchi, Arber Zela, Frank Hutter, Thomas Brox",
        "published": "2019-10",
        "citations": 38,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv.2019.00190"
    },
    {
        "id": 7487,
        "title": "Privacy-Preserving AutoML.",
        "authors": "Alycia Carey, Nicholas Pattengale",
        "published": "2021-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1881695"
    },
    {
        "id": 7488,
        "title": "Efficient AutoML via Combinational Sampling",
        "authors": "Duc Anh Nguyen, Anna V. Kononova, Stefan Menzel, Bernhard Sendhoff, Thomas Back",
        "published": "2021-12-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ssci50451.2021.9660073"
    },
    {
        "id": 7489,
        "title": "AutoML for Multilayer Perceptron and FPGA Co-design",
        "authors": "Philip Colangelo, Oren Segal, Alex Speicher, Martin Margala",
        "published": "2020-9-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/socc49529.2020.9524785"
    },
    {
        "id": 7490,
        "title": "An AutoML-driven Antenna Performance Prediction Model in the Autonomous Driving Radar Manufacturing Process",
        "authors": "",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3837/tiis.2023.12.006"
    },
    {
        "id": 7491,
        "title": "Baseline Machine Learning Approach in Predicting Glutopeak Test Parameters from Image Data with AutoML and Transfer Learning",
        "authors": "Takehiro Murai, Yoshitaka Inoue, Assey Nambirige, George  A. Annor",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4515097"
    },
    {
        "id": 7492,
        "title": "Applying AutoML to Colorectal Lesion Classification: A Comparison of Three Commercial Platforms",
        "authors": "Neal Mahajan, Sriya Muralidharan*, Erik  A. Holzwanger, Tyler M Berzin, Jeremy  R. Glissen Brown",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4458023"
    },
    {
        "id": 7493,
        "title": "Google AutoML: Cloud Vision",
        "authors": "Ekaba Bisong",
        "published": "2019",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-4470-8_42"
    },
    {
        "id": 7494,
        "title": "aMLLibrary: An AutoML Approach For Performance Prediction",
        "authors": "Bruno Guindani, Marco Lattuada, Danilo Ardagna",
        "published": "2023-6-23",
        "citations": 2,
        "abstract": "aMLLibrary is an open-source, high-level Python package that allows the parallel building of multiple Machine Learning (ML) regression models. It is focused on performance modeling and supports several methods for feature engineering/selection and hyperparameter tuning. The library implements fault tolerance mechanisms to recover from system crashes, and only a simple declarative text file is required to launch a full experimental campaign for all required models. Its modular structure allows users to implement their own plugins and model-building wrappers and easily add them to the library. We test aMLLibrary on building the performance models of neural networks and image processing applications, with the best model produced often having less than 20% prediction error.",
        "link": "http://dx.doi.org/10.7148/2023-0215"
    },
    {
        "id": 7495,
        "title": "Non-expert AI Users Building Machine Learning Models: A Short Survey of AutoML Systems",
        "authors": "Camilo Palazuelos, Rafael Duque, Cristina Tîrnȃucȃ, Alejandro Pérez, Abraham Casas",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36227/techrxiv.170619255.52099254/v1"
    },
    {
        "id": 7496,
        "title": "Human-Centered AI Product Prototyping with No-Code AutoML: Conceptual Framework, Potentials and Limitations",
        "authors": "Mario Truss, Marc Schmitt",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4718681"
    },
    {
        "id": 7497,
        "title": "Time Series Data Modeling Using Advanced Machine Learning and AutoML",
        "authors": "Ahmad Alsharef, Sonia Sonia, Karan Kumar, Celestine Iwendi",
        "published": "2022-11-17",
        "citations": 14,
        "abstract": "A prominent area of data analytics is “timeseries modeling” where it is possible to forecast future values for the same variable using previous data. Numerous usage examples, including the economy, the weather, stock prices, and the development of a corporation, demonstrate its significance. Experiments with time series forecasting utilizing machine learning (ML), deep learning (DL), and AutoML are conducted in this paper. Its primary contribution consists of addressing the forecasting problem by experimenting with additional ML and DL models and AutoML frameworks and expanding the AutoML experimental knowledge. In addition, it contributes by breaking down barriers found in past experimental studies in this field by using more sophisticated methods. The datasets this empirical research utilized were secondary quantitative data of the real prices of the currently most used cryptocurrencies. We found that AutoML for timeseries is still in the development stage and necessitates more study to be a viable solution since it was unable to outperform manually designed ML and DL models. The demonstrated approaches may be utilized as a baseline for predicting timeseries data.",
        "link": "http://dx.doi.org/10.3390/su142215292"
    },
    {
        "id": 7498,
        "title": "AutoML for Stream k-Nearest Neighbors Classification",
        "authors": "Maroua Bahri, Bruno Veloso, Albert Bifet, Joao Gama",
        "published": "2020-12-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bigdata50022.2020.9378396"
    },
    {
        "id": 7499,
        "title": "AutoML for Video Analytics with Edge Computing",
        "authors": "Apostolos Galanopoulos, Jose A. Ayala-Romero, Douglas J. Leith, George Iosifidis",
        "published": "2021-5-10",
        "citations": 35,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/infocom42981.2021.9488704"
    },
    {
        "id": 7500,
        "title": "Comparison of supervised AutoML and supervised ML methods for solving image recognition problems",
        "authors": "N.A. Andriyanov, Y.B. Kamalova, G.V Moiseev",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18127/j19998554-202205-02"
    }
]