[
    {
        "id": 23271,
        "title": "Efficient optimization algorithms for various machine learning tasks, including classification, regression, and clustering",
        "authors": "Hengki Tamando Sihotang, Marc Albert, Fristi Riandari, Larry Rendell",
        "published": "2023-1-30",
        "citations": 0,
        "abstract": "The research on efficient optimization algorithms for machine learning is novel because it addresses several gaps in previous research and proposes new solutions to improve the efficiency and accuracy of machine learning models. Firstly, the proposed research focuses on developing more efficient algorithms for large-scale deep learning. While there have been many optimization algorithms proposed for deep learning, the proposed research aims to develop new algorithms that can handle the complexity and scale of these models and improve their efficiency. Secondly, the proposed research aims to explore the effectiveness of optimization algorithms for different types of machine learning tasks. While many studies have focused on deep learning, the proposed research aims to evaluate the effectiveness of optimization algorithms for other types of machine learning tasks, such as reinforcement learning, unsupervised learning, and semi-supervised learning. Thirdly, the proposed research aims to develop optimization algorithms that can handle noisy and incomplete data, which is a significant challenge for machine learning models. The proposed research aims to develop algorithms that can handle noisy and incomplete data and improve the accuracy of machine learning models. Fourthly, the proposed research aims to develop optimization algorithms that can handle non-convex objective functions. While some optimization techniques have been proposed for non-convex optimization, the proposed research aims to develop new algorithms that can handle these functions and improve the accuracy of machine learning models. The proposed research aims to investigate the trade-off between optimization efficiency and model performance. While previous research has explored this trade-off to some extent, the proposed research aims to develop algorithms that can balance these factors and optimize both efficiency and performance. The proposed research is novel because it addresses several gaps in previous research and proposes new solutions to improve the efficiency and accuracy of machine learning models for various tasks, including classification, regression, and clustering. By developing new algorithms and evaluating their effectiveness for different types of machine learning tasks, the proposed research can advance the field of machine learning and improve the accuracy and efficiency of machine learning models.",
        "link": "http://dx.doi.org/10.35335/idea.v1i1.3"
    },
    {
        "id": 23272,
        "title": "Selection of Suitable Machine Learning Algorithms for Classification Tasks in Reverse Logistics",
        "authors": "Hannah Lickert, Aleksandra Wewer, Sören Dittmann, Pinar Bilge, Franz Dietrich",
        "published": "2021",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.procir.2021.01.086"
    },
    {
        "id": 23273,
        "title": "Data Augmentation Methods for Enhancing Robustness in Text Classification Tasks",
        "authors": "Huidong Tang, Sayaka Kamei, Yasuhiko Morimoto",
        "published": "2023-1-16",
        "citations": 3,
        "abstract": "Text classification is widely studied in natural language processing (NLP). Deep learning models, including large pre-trained models like BERT and DistilBERT, have achieved impressive results in text classification tasks. However, these models’ robustness against adversarial attacks remains an area of concern. To address this concern, we propose three data augmentation methods to improve the robustness of such pre-trained models. We evaluated our methods on four text classification datasets by fine-tuning DistilBERT on the augmented datasets and exposing the resulting models to adversarial attacks to evaluate their robustness. In addition to enhancing the robustness, our proposed methods can improve the accuracy and F1-score on three datasets. We also conducted comparison experiments with two existing data augmentation methods. We found that one of our proposed methods demonstrates a similar improvement in terms of performance, but all demonstrate a superior robustness improvement.",
        "link": "http://dx.doi.org/10.3390/a16010059"
    },
    {
        "id": 23274,
        "title": "Research on eight machine learning algorithms applicability on different characteristics data sets in medical classification tasks",
        "authors": "Yiyan Zhang, Qin Li, Yi Xin",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "With the vigorous development of data mining field, more and more algorithms have been proposed or improved. How to quickly select a data mining algorithm that is suitable for data sets in medical field is a challenge for some medical workers. The purpose of this paper is to study the comparative characteristics of the general medical data set and the general data sets in other fields, and find the applicability rules of the data mining algorithm suitable for the characteristics of the current research data set. The study quantified characteristics of the research data set with 26 indicators, including simple indicators, statistical indicators and information theory indicators. Eight machine learning algorithms with high maturity, low user involvement and strong family representation were selected as the base algorithms. The algorithm performances were evaluated by three aspects: prediction accuracy, running speed and memory consumption. By constructing decision tree and stepwise regression model to learn the above metadata, the algorithm applicability knowledge of medical data set is obtained. Through cross-verification, the accuracy of all the algorithm applicability prediction models is above 75%, which proves the validity and feasibility of the applicability knowledge.",
        "link": "http://dx.doi.org/10.3389/fncom.2024.1345575"
    },
    {
        "id": 23275,
        "title": "Classification of Heart Rate Time Series Using Machine Learning Algorithms",
        "authors": "",
        "published": "2021-9-10",
        "citations": 1,
        "abstract": "An important diagnostic method for diagnosing abnormalities in the human heart is the electrocardiogram (ECG). A large number of heart patients increase the assignment of physicians. To reduce their assignment, an automatic computer detection system is needed. In this study, a computer system for classifying ECG signals is presented. The MIT-BIH, ECG arrhythmia database is used for analysis. After the ECG signal is noisy in the preprocessing stage, the data feature is extracted. In the feature extraction step, the decision tree is used and the support vector machine (SVM) is constructed to classify the ECG signal into two categories. It is normal or abnormal. The results show that the system classifies the given ECG signal with 90% sensitivity.",
        "link": "http://dx.doi.org/10.33140/amlai.02.01.09"
    },
    {
        "id": 23276,
        "title": "Evaluation of Machine Learning Algorithms for Text Classification Tasks",
        "authors": "Aravindan MK, X. Mercilin Raajini, Yashwant S. Ingle, Pradeep Kumar Jangid, Ashu Katyal, Preeti Naval",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442925"
    },
    {
        "id": 23277,
        "title": "Classification of EEG Motor Imagery Tasks Utilizing 2D Temporal Patterns with Deep Learning",
        "authors": "Anup Ghimire, Kazim Sekeroglu",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011069400003209"
    },
    {
        "id": 23278,
        "title": "Comparison of Machine Learning Algorithms for Somatotype Classification",
        "authors": "Darko Katović, Miljenko Cvjetko",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008368002170223"
    },
    {
        "id": 23279,
        "title": "Impact of tasks classification and virtual machines categorization on tasks scheduling algorithms in cloud computing",
        "authors": "Tahani Aladwani",
        "published": "2017-3-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3018896.3056775"
    },
    {
        "id": 23280,
        "title": "Classification Algorithms",
        "authors": "",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4899-7687-1_112"
    },
    {
        "id": 23281,
        "title": "Enhancing Machine Learning Algorithms using GPT Embeddings for Binary Classification",
        "authors": "MSVPJ SATHVIK",
        "published": "No Date",
        "citations": 1,
        "abstract": "<p>The Language Model Models (LLMs) have demonstrated their ability to process and understand natural language inputs accurately. This indicates that LLMs are capable of superior natural language processing capabilities. The GPT embeddings are words generated from the GPT backend of the ChatGPT developed by OpenAI, which can produce accurate outputs for user inputs. In this paper, we generate GPT embeddings and apply machine learning algorithms for fake news prediction and sentiment analysis. The proposed method produces remarkable results with an improvement of approximately 12.59% in accuracy compared to traditional embeddings. For fake news detection, GPT embeddings with SVM outperformed LSTM with Glove embeddings. We evaluated 10 machine learning models using 4 versions of GPT embeddings, namely Ada, Babbage, Curie, and Davinci. The sentiment analysis execution resulted in an impressive accuracy of 98.6%. We made our embeddings publicly available for both datasets. We believe that this is a valuable contribution since generating such embeddings requires access to GPT, which is not freely available to researchers.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22331053.v1"
    },
    {
        "id": 23282,
        "title": "Classification",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.022"
    },
    {
        "id": 23283,
        "title": "Incremental Learning for Classification of Unstructured Data Using Extreme Learning Machine",
        "authors": "Sathya Madhusudhanan, Suresh Jaganathan, Jayashree L S",
        "published": "2018-10-17",
        "citations": 17,
        "abstract": "Unstructured data are irregular information with no predefined data model. Streaming data which constantly arrives over time is unstructured, and classifying these data is a tedious task as they lack class labels and get accumulated over time. As the data keeps growing, it becomes difficult to train and create a model from scratch each time. Incremental learning, a self-adaptive algorithm uses the previously learned model information, then learns and accommodates new information from the newly arrived data providing a new model, which avoids the retraining. The incrementally learned knowledge helps to classify the unstructured data. In this paper, we propose a framework CUIL (Classification of Unstructured data using Incremental Learning) which clusters the metadata, assigns a label for each cluster and then creates a model using Extreme Learning Machine (ELM), a feed-forward neural network, incrementally for each batch of data arrived. The proposed framework trains the batches separately, reducing the memory resources, training time significantly and is tested with metadata created for the standard image datasets like MNIST, STL-10, CIFAR-10, Caltech101, and Caltech256. Based on the tabulated results, our proposed work proves to show greater accuracy and efficiency.",
        "link": "http://dx.doi.org/10.3390/a11100158"
    },
    {
        "id": 23284,
        "title": "Classification Tasks Solving with Machine Learning Methods",
        "authors": "Ginka Marinova, Maya Todorova",
        "published": "2020-9-16",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/et50336.2020.9238218"
    },
    {
        "id": 23285,
        "title": "ON TRANSFER LEARNING METHODS IN BIOMEDICAL IMAGES CLASSIFICATION TASKS",
        "authors": "",
        "published": "2021-12-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14357/19922264210408"
    },
    {
        "id": 23286,
        "title": "Electrofacies classification using Supervised learning algorithms",
        "authors": "J.C. Murillo Silva",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3997/2214-4609.202084004"
    },
    {
        "id": 23287,
        "title": "Hyperspectral Image Classification Using Unsupervised Learning Algorithms",
        "authors": "Wafa Fatima, Iqra Ejaz",
        "published": "No Date",
        "citations": 0,
        "abstract": "Hyperspectral image (HSI) classification is a mechanism of analyzing differentiated land cover in remotely sensed hyperspectral images. In the last two decades, a number of different types of classification algorithms have been proposed for classifying hyperspectral data. These algorithms include supervised as well as unsupervised methods. Each of these algorithms has its own limitations. In this research, three different types of unsupervised classification methods are used to classify different datasets i-e Pavia Center, Pavia University, Cuprite, Moffett Field. The main objective is to assess the performance of all three classifiers K-Means, Spectral Matching, and Abundance Mapping, and observing their applicability on different datasets. This research also includes spectral feature extraction for hyperspectral datasets.",
        "link": "http://dx.doi.org/10.20944/preprints202106.0706.v1"
    },
    {
        "id": 23288,
        "title": "Enhancing Machine Learning Algorithms using GPT Embeddings for Binary Classification",
        "authors": "MSVPJ SATHVIK",
        "published": "No Date",
        "citations": 1,
        "abstract": "<p>The Language Model Models (LLMs) have demonstrated their ability to process and understand natural language inputs accurately. This indicates that LLMs are capable of superior natural language processing capabilities. The GPT embeddings are words generated from the GPT backend of the ChatGPT developed by OpenAI, which can produce accurate outputs for user inputs. In this paper, we generate GPT embeddings and apply machine learning algorithms for fake news prediction and sentiment analysis. The proposed method produces remarkable results with an improvement of approximately 12.59% in accuracy compared to traditional embeddings. For fake news detection, GPT embeddings with SVM outperformed LSTM with Glove embeddings. We evaluated 10 machine learning models using 4 versions of GPT embeddings, namely Ada, Babbage, Curie, and Davinci. The sentiment analysis execution resulted in an impressive accuracy of 98.6%. We made our embeddings publicly available for both datasets. We believe that this is a valuable contribution since generating such embeddings requires access to GPT, which is not freely available to researchers.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22331053"
    },
    {
        "id": 23289,
        "title": "A survey of automated data augmentation algorithms for deep learning-based image classification tasks",
        "authors": "Zihan Yang, Richard O. Sinnott, James Bailey, Qiuhong Ke",
        "published": "2023-7",
        "citations": 8,
        "abstract": "AbstractIn recent years, one of the most popular techniques in the computer vision community has been the deep learning technique. As a data-driven technique, deep model requires enormous amounts of accurately labelled training data, which is often inaccessible in many real-world applications. A data-space solution is Data Augmentation (DA), that can artificially generate new images out of original samples. Image augmentation strategies can vary by dataset, as different data types might require different augmentations to facilitate model training. However, the design of DA policies has been largely decided by the human experts with domain knowledge, which is considered to be highly subjective and error-prone. To mitigate such problem, a novel direction is to automatically learn the image augmentation policies from the given dataset using Automated Data Augmentation (AutoDA) techniques. The goal of AutoDA models is to find the optimal DA policies that can maximize the model performance gains. This survey discusses the underlying reasons of the emergence of AutoDA technology from the perspective of image classification. We identify three key components of a standard AutoDA model: a search space, a search algorithm and an evaluation function. Based on their architecture, we provide a systematic taxonomy of existing image AutoDA approaches. This paper presents the major works in AutoDA field, discussing their pros and cons, and proposing several potential directions for future improvements.",
        "link": "http://dx.doi.org/10.1007/s10115-023-01853-2"
    },
    {
        "id": 23290,
        "title": "WITHDRAWN: Performance Analysis of Personalized Federated Learning Algorithms for Image Classification",
        "authors": "",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe full text of this preprint has been withdrawn by the authors due to author disagreement with the posting of the preprint. Therefore, the authors do not wish this work to be cited as a reference. Questions should be directed to the corresponding author.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3056513/v2"
    },
    {
        "id": 23291,
        "title": "Linear Two-Class Classification",
        "authors": "",
        "published": "2020-1-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108690935.010"
    },
    {
        "id": 23292,
        "title": "Probabilistic Classification",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.023"
    },
    {
        "id": 23293,
        "title": "Classification Assessment",
        "authors": "",
        "published": "2020-1-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108564175.027"
    },
    {
        "id": 23294,
        "title": "Linear Multi-Class Classification",
        "authors": "",
        "published": "2020-1-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108690935.011"
    },
    {
        "id": 23295,
        "title": "Ensemble Machine Learning Algorithms for Prediction and Classification of Medical Images",
        "authors": "Racheal S. Akinbo, Oladunni A. Daramola",
        "published": "2021-12-22",
        "citations": 4,
        "abstract": "The employment of machine learning algorithms in disease classification has evolved as a precision medicine for scientific innovation. The geometric growth in various machine learning systems has paved the way for more research in the medical imaging process. This research aims to promote the development of machine learning algorithms for the classification of medical images. Automated classification of medical images is a fascinating application of machine learning and they have the possibility of higher predictability and accuracy. The technological advancement in the processing of medical imaging will help to reduce the complexities of diseases and some existing constraints will be greatly minimized. This research exposes the main ensemble learning techniques as it covers the theoretical background of machine learning, applications, comparison of machine learning and deep learning, ensemble learning with reviews of state-of the art literature, framework, and analysis. The work extends to medical image types, applications, benefits, and operations. We proposed the application of the ensemble machine learning approach in the classification of medical images for better performance and accuracy. The integration of advanced technology in clinical imaging will help in the prompt classification, prediction, early detection, and a better interpretation of medical images, this will, in turn, improves the quality of life and expands the clinical bearing for machine learning applications.",
        "link": "http://dx.doi.org/10.5772/intechopen.100602"
    },
    {
        "id": 23296,
        "title": "Cal-Net: Jointly Learning Classification and Calibration On Imbalanced Binary Classification Tasks",
        "authors": "Arghya Datta, Noah R. Flynn, S. Joshua Swamidass",
        "published": "2021-7-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534411"
    },
    {
        "id": 23297,
        "title": "Evaluation of COVID-19 Cases based on Classification Algorithms in Machine Learning",
        "authors": "Oqbah Salim Atiyah, Saadi Hamad Thalij",
        "published": "2022-1-20",
        "citations": 0,
        "abstract": "COVID-19 has appeared in china, spread rapidly the world wide and caused with many injuries, deaths between humans. It is possible to avoid the spread of the disease or reduce its spread with the machine learning and the diagnostic techniques, where the use classification algorithms are one of the fundamental issues for prediction and decision-making to help of the early detection, diagnose COVID-19 cases and identify dangerous cases that need admit Intensive Care Unit to provide treatment in a timely manner. In this paper, we use the machine learning algorithms to classify the COVID-19 cases, the dataset got from dataset search on google and used four algorithms, as (Logistic Regression, Naive Bayes, Random Forest, Stochastic Gradient Descent), the result of algorithms accuracy was 94.82%, 96.57%, 98.37%, 99.61% respectively and the execution time of each algorithm were 0.7s, 0.04s, 0.20s,0.02s respectively, and with the mislabeling Stochastic Gradient Descent algorithm was better.",
        "link": "http://dx.doi.org/10.14704/web/v19i1/web19326"
    },
    {
        "id": 23298,
        "title": "Classification of Fruits using Deep Learning Algorithms",
        "authors": "K. B. Mirra, Rajakumari R",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nClassification of variety of fruits is an important framework in agriculture field for import and export. Many algorithms were employed for classification of fruits. To remove the noises from the images Gaussian filter is applied during the pre-processing. Bunch of fruits are classified into different classes such as apple, orange and banana. Also their quality is taken into account for preventing health hazards. In this work, the various combinations of fruits are classified into proper variety and after that the quality of the fruit is checked as whether it is defect or non-defect. For the first part, Convolutional Neural Network, AlexNet and MobileNetV2 are employed. MobileNetV2 achieved 100% accuracy for fruit type classification. In the second part, the same kind of fruits are fed into classifier for quality checking. The above said classifiers are used for defect classification also. For defect classification, MobileNetV2 gives 99.89% accuracy for orange and 100% for apple.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1495878/v1"
    },
    {
        "id": 23299,
        "title": "News Text Classification Using Machine Learning Algorithms",
        "authors": "",
        "published": "2021-6-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17051/ilkonline.2021.02.282"
    },
    {
        "id": 23300,
        "title": "Feature selection using genetic algorithms for improving accuracy in image classification tasks",
        "authors": "Andrei Dugaesescu, David-Traian Iancu",
        "published": "2023-6-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ecai58194.2023.10194193"
    },
    {
        "id": 23301,
        "title": "Evaluation of Class Activation Methods for Understanding Image Classification Tasks",
        "authors": "Andrei Dugăeșescu, Adina Magda Florea",
        "published": "2022-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/synasc57785.2022.00033"
    },
    {
        "id": 23302,
        "title": "Enhancing Logistic Regression Using Neural Networks for Classification in Actuarial Learning",
        "authors": "George Tzougas, Konstantin Kutzkov",
        "published": "2023-2-9",
        "citations": 4,
        "abstract": "We developed a methodology for the neural network boosting of logistic regression aimed at learning an additional model structure from the data. In particular, we constructed two classes of neural network-based models: shallow–dense neural networks with one hidden layer and deep neural networks with multiple hidden layers. Furthermore, several advanced approaches were explored, including the combined actuarial neural network approach, embeddings and transfer learning. The model training was achieved by minimizing either the deviance or the cross-entropy loss functions, leading to fourteen neural network-based models in total. For illustrative purposes, logistic regression and the alternative neural network-based models we propose are employed for a binary classification exercise concerning the occurrence of at least one claim in a French motor third-party insurance portfolio. Finally, the model interpretability issue was addressed via the local interpretable model-agnostic explanations approach.",
        "link": "http://dx.doi.org/10.3390/a16020099"
    },
    {
        "id": 23303,
        "title": "Brain Tumor Classification Using Various Machine Learning Algorithms",
        "authors": "Ms.  Vidhya A, Dr. Parameswari R, Ms. Sathya S",
        "published": "2019-8-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.9756/bp2019.1002/25"
    },
    {
        "id": 23304,
        "title": "An Ensemble Extreme Learning Machine for Data Stream Classification",
        "authors": "Rui Yang, Shuliang Xu, Lin Feng",
        "published": "2018-7-17",
        "citations": 12,
        "abstract": "Extreme learning machine (ELM) is a single hidden layer feedforward neural network (SLFN). Because ELM has a fast speed for classification, it is widely applied in data stream classification tasks. In this paper, a new ensemble extreme learning machine is presented. Different from traditional ELM methods, a concept drift detection method is embedded; it uses online sequence learning strategy to handle gradual concept drift and uses updating classifier to deal with abrupt concept drift, so both gradual concept drift and abrupt concept drift can be detected in this paper. The experimental results showed the new ELM algorithm not only can improve the accuracy of classification result, but also can adapt to new concept in a short time.",
        "link": "http://dx.doi.org/10.3390/a11070107"
    },
    {
        "id": 23305,
        "title": "Research on machine learning classification algorithms for diabetes data",
        "authors": "Minshan Yi",
        "published": "2022-5-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2636526"
    },
    {
        "id": 23306,
        "title": "Automatic Classification of Foot Thermograms Using Machine Learning Techniques",
        "authors": "Vítor Filipe, Pedro Teixeira, Ana Teixeira",
        "published": "2022-7-6",
        "citations": 6,
        "abstract": "Diabetic foot is one of the main complications observed in diabetic patients; it is associated with the development of foot ulcers and can lead to amputation. In order to diagnose these complications, specialists have to analyze several factors. To aid their decisions and help prevent mistakes, the resort to computer-assisted diagnostic systems using artificial intelligence techniques is gradually increasing. In this paper, two different models for the classification of thermograms of the feet of diabetic and healthy individuals are proposed and compared. In order to detect and classify abnormal changes in the plantar temperature, machine learning algorithms are used in both models. In the first model, the foot thermograms are classified into four classes: healthy and three categories for diabetics. The second model has two stages: in the first stage, the foot is classified as belonging to a diabetic or healthy individual, while, in the second stage, a classification refinement is conducted, classifying diabetic foot into three classes of progressive severity. The results show that both proposed models proved to be efficient, allowing us to classify a foot thermogram as belonging to a healthy or diabetic individual, with the diabetic ones divided into three classes; however, when compared, Model 2 outperforms Model 1 and allows for a better performance classification concerning the healthy category and the first class of diabetic individuals. These results demonstrate that the proposed methodology can be a tool to aid medical diagnosis.",
        "link": "http://dx.doi.org/10.3390/a15070236"
    },
    {
        "id": 23307,
        "title": "Machine Learning",
        "authors": "Anil Kumar, Priyadarshi Upadhyay, A. Senthil Kumar",
        "published": "2020-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429340369-1"
    },
    {
        "id": 23308,
        "title": "Classification of Toxic Comments Based on Textual Data Using Deep Learning Algorithms",
        "authors": "Savarimuthu Robinson",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4609428"
    },
    {
        "id": 23309,
        "title": "Classification",
        "authors": "Bogdan Dumitrescu, Paul Irofti",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-78674-2_8"
    },
    {
        "id": 23310,
        "title": "Heart Disease Classification using Machine Learning Algorithms",
        "authors": "",
        "published": "2021-1-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/sr8.1/035"
    },
    {
        "id": 23311,
        "title": "Fingerprints Classification through Image Analysis and Machine Learning Method",
        "authors": "Huong Thu Nguyen, Long The Nguyen",
        "published": "2019-11-11",
        "citations": 23,
        "abstract": "The system that automatically identifies the anthropometric fingerprint is one of the systems that interact directly with the user, which every day will be provided with a diverse database. This requires the system to be optimized to handle the process to meet the needs of users such as fast processing time, almost absolute accuracy, no errors in the real process. Therefore, in this paper, we propose the application of machine learning methods to develop fingerprint classification algorithms based on the singularity feature. The goal of the paper is to reduce the number of comparisons in automatic fingerprint recognition systems with large databases. The combination of using computer vision algorithms in the image pre-processing stage increases the calculation time, improves the quality of the input images, making the process of feature extraction highly effective and the classification process fast and accurate. The classification results on 3 datasets with the criteria for Precision, Recall, Accuracy evaluation and ROC analysis of algorithms show that the Random Forest (RF) algorithm has the best accuracy (≥96.75%) on all 3 databases, Support Vector Machine (SVM) has the best results (≥95.5%)     2 / 3     databases.",
        "link": "http://dx.doi.org/10.3390/a12110241"
    },
    {
        "id": 23312,
        "title": "Learning Based Classifiers",
        "authors": "Anil Kumar, Priyadarshi Upadhyay, A. Senthil Kumar",
        "published": "2020-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429340369-4"
    },
    {
        "id": 23313,
        "title": "Classification of Various Diseases Using Machine Learning And Deep Learning Algorithms",
        "authors": "",
        "published": "2021-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.48047/jst.2021.v6.i04.pp25-31"
    },
    {
        "id": 23314,
        "title": "Research and Application of Deep Learning Based on Transfer Learning in Image Classification Tasks",
        "authors": "Jingyuan Bai",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpeca60615.2024.10471046"
    },
    {
        "id": 23315,
        "title": "Machine Learning Algorithms for Mouse LFP Data Classification in Epilepsy",
        "authors": "Antonis Golfidis, Michael Vinos, Nikos Vassilopoulos, Eirini Papadaki, Irini Skaliora, Vassilis Cutsuridis",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011625600003414"
    },
    {
        "id": 23316,
        "title": "Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael C. Kolios",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring\napoptosis and classifying clusters of apoptotic cells based on\nthe changes in ultrasound backscatter signals from the tissues.\nThe backscatter from normal and apoptotic cells, using a high\nfrequency ultrasound instrument are modeled through an\nAutoregressive (AR) modeling technique. The proper model\norder is calculated by tracking the error criteria in the\nreconstruction of the original signal. The AR model\ncoefficients, which are assumed to contain the main statistical\nfeatures of the signal, are passed as the input to Linear and\nNonlinear machine classifiers (Fisher Linear Discriminant,\nConditional Gaussian Classifier, Naive Bayes Classifier and\nNeural Networks with nonlinear activation functions). In\naddition, an adaptive signal segmentation method ,(Least\nSquares Lattice Filter) is used to differentiate the data from\nlayers of different cell types into stationary parts ready for\nmodeling and classification. <div>Keywords: Apoptosis, Ultrasound Backscatter </div>",
        "link": "http://dx.doi.org/10.32920/ryerson.14639328"
    },
    {
        "id": 23317,
        "title": "Classification Algorithms",
        "authors": "T V Geetha, S Sendhilkumar",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003290100-6"
    },
    {
        "id": 23318,
        "title": "Comparative Analysis of Machine Learning Algorithms in Breast Cancer Classification",
        "authors": "Satish Chaurasiya, Ranjit Rajak",
        "published": "No Date",
        "citations": 2,
        "abstract": "Abstract\nNow days breast cancer has emerged as a diseases effecting women to suffer a life threating phase and eventually lead to death world wide. The prediction of breast cancer in woman at the initial stage can aggrandize recovery and chance of abidance considerably as the essential medical treatments can be adapted on time and stop its further growth. Moreover the precise categorization of tumor eliminates the avoidable treatments and patients skips from witnessing the medical emergencies. Thus the exact categorization of breast cancer either benign or malignant and the precised analysis of each is a matter of important exploration. Machine learning have extensively beneficial aspects in critical feature extraction from the breast cancer dataset. Thus the machine learning can be astronomically honored as a alternative methodology in breast cancer pattern categorization and forecast modeling. In this paper ML techniques namely Support vector machines (SVM), logistic Regression, Random forest tree (RDT) and k-nearest neighbours (k-Nns) are over viewed and later performance measures compared for breast cancer analysis and prognosis.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1772158/v1"
    },
    {
        "id": 23319,
        "title": "Classification of Breast Cancer Data Using Machine Learning Algorithms",
        "authors": "Burak Akbugday",
        "published": "2019-10",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tiptekno.2019.8895222"
    },
    {
        "id": 23320,
        "title": "Deep Learning-Based Approach for Classification Of Mental Tasks From Electroencephalogram Signals",
        "authors": "",
        "published": "2023-5-14",
        "citations": 0,
        "abstract": "Background and Objective: Electroencephalography (EEG) analysis is an important tool for neuroscience, brain-computer interface studies, and biomedical studies. The primary purpose of Brain-Computer Interface (BCI) studies is to establish communication between disabled individuals, other individuals, and machines with brain signals. Interpreting and classifying the brain's response during different cognitive tasks will contribute to brain-computer interface studies. Therefore, in this study, five cognitive tasks were classified from EEG signals.\nMaterial and Methods: In this study, five neuropsychological tests (Öktem Verbal Memory Processes Test, WMS-R Visual Memory Subtest, Digit Span Test, Corsi Block Test, and Stroop Test) were administered to 30 healthy individuals. The tests assess the volunteers' abilities in verbal memory, visual memory, attention, concentration, working memory, and reaction time. The EEG signals were recorded while the tests were administered to the volunteers. The tests were classified using two different deep learning algorithms, 1D Convolutional Neural Networks (CNN) and Long Short-Term Memory (LSTM), from the recorded EEG signals.\nResults: When the success of the tests was evaluated, classification success was achieved with an accuracy of 88.53% in the CNN deep learning algorithm and 89.80% in the LSTM deep algorithm. Precision, recall, and F1-score values for CNN were calculated at 0.88, 0.87, and 0.87, respectively, while precision, recall, and f1-score values for the LSTM network were obtained at 0.90, 0.89, and 0.89.\nConclusion: Following the findings of the present study, five different cognitive tasks were able to be classified with high accuracy from EEG signals using deep learning algorithms.",
        "link": "http://dx.doi.org/10.32592/ajnpp.2023.10.1.102"
    },
    {
        "id": 23321,
        "title": "Characterization and Classification Using Autoregressive Modeling and Machine Learning Algorithms",
        "authors": "Noushin R. Farnoud, Michael C. Kolios",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research explores the possibility of monitoring\napoptosis and classifying clusters of apoptotic cells based on\nthe changes in ultrasound backscatter signals from the tissues.\nThe backscatter from normal and apoptotic cells, using a high\nfrequency ultrasound instrument are modeled through an\nAutoregressive (AR) modeling technique. The proper model\norder is calculated by tracking the error criteria in the\nreconstruction of the original signal. The AR model\ncoefficients, which are assumed to contain the main statistical\nfeatures of the signal, are passed as the input to Linear and\nNonlinear machine classifiers (Fisher Linear Discriminant,\nConditional Gaussian Classifier, Naive Bayes Classifier and\nNeural Networks with nonlinear activation functions). In\naddition, an adaptive signal segmentation method ,(Least\nSquares Lattice Filter) is used to differentiate the data from\nlayers of different cell types into stationary parts ready for\nmodeling and classification. <div>Keywords: Apoptosis, Ultrasound Backscatter </div>",
        "link": "http://dx.doi.org/10.32920/ryerson.14639328.v1"
    },
    {
        "id": 23322,
        "title": "Classification of Program Texts Represented as Markov Chains with Biology-Inspired Algorithms-Enhanced Extreme Learning Machines",
        "authors": "Liliya A. Demidova, Artyom V. Gorchakov",
        "published": "2022-9-15",
        "citations": 5,
        "abstract": "The massive nature of modern university programming courses increases the burden on academic workers. The Digital Teaching Assistant (DTA) system addresses this issue by automating unique programming exercise generation and checking, and provides means for analyzing programs received from students by the end of semester. In this paper, we propose a machine learning-based approach to the classification of student programs represented as Markov chains. The proposed approach enables real-time student submissions analysis in the DTA system. We compare the performance of different multi-class classification algorithms, such as support vector machine (SVM), the k nearest neighbors (KNN) algorithm, random forest (RF), and extreme learning machine (ELM). ELM is a single-hidden layer feedforward network (SLFN) learning scheme that drastically speeds up the SLFN training process. This is achieved by randomly initializing weights of connections among input and hidden neurons, and explicitly computing weights of connections among hidden and output neurons. The experimental results show that ELM is the most computationally efficient algorithm among the considered ones. In addition, we apply biology-inspired algorithms to ELM input weights fine-tuning in order to further improve the generalization capabilities of this algorithm. The obtained results show that ELMs fine-tuned with biology-inspired algorithms achieve the best accuracy on test data in most of the considered problems.",
        "link": "http://dx.doi.org/10.3390/a15090329"
    },
    {
        "id": 23323,
        "title": "Assessment of Accuracy for Soft Classification",
        "authors": "Anil Kumar, Priyadarshi Upadhyay, A. Senthil Kumar",
        "published": "2020-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429340369-7"
    },
    {
        "id": 23324,
        "title": "Prediction of diabetes using voting classification algorithms",
        "authors": "",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1049/pbhe057e_ch5"
    },
    {
        "id": 23325,
        "title": "Classification of Skin Lesions Using Weighted Majority Voting Ensemble Deep Learning",
        "authors": "Damilola A. Okuboyejo, Oludayo O. Olugbara",
        "published": "2022-11-24",
        "citations": 5,
        "abstract": "The conventional dermatology practice of performing noninvasive screening tests to detect skin diseases is a source of escapable diagnostic inaccuracies. Literature suggests that automated diagnosis is essential for improving diagnostic accuracies in medical fields such as dermatology, mammography, and colonography. Classification is an essential component of an assisted automation process that is rapidly gaining attention in the discipline of artificial intelligence for successful diagnosis, treatment, and recovery of patients. However, classifying skin lesions into multiple classes is challenging for most machine learning algorithms, especially for extremely imbalanced training datasets. This study proposes a novel ensemble deep learning algorithm based on the residual network with the next dimension and the dual path network with confidence preservation to improve the classification performance of skin lesions. The distributed computing paradigm was applied in the proposed algorithm to speed up the inference process by a factor of 0.25 for a faster classification of skin lesions. The algorithm was experimentally compared with 16 deep learning and 12 ensemble deep learning algorithms to establish its discriminating prowess. The experimental comparison was based on dermoscopic images congregated from the publicly available international skin imaging collaboration databases. We propitiously recorded up to 82.52% average sensitivity, 99.00% average specificity, 98.54% average balanced accuracy, and 92.84% multiclass accuracy without prior segmentation of skin lesions to outstrip numerous state-of-the-art deep learning algorithms investigated.",
        "link": "http://dx.doi.org/10.3390/a15120443"
    },
    {
        "id": 23326,
        "title": "Analysis of Quantum Machine Learning Algorithms in Noisy Channels for Classification Tasks in the IoT Extreme Environment",
        "authors": "Sritam Kumar Satpathy, Vallabh Vibhu, Bikash K. Behera, Saif Al-Kuwari, Shahid Mumtaz, Ahmed Farouk",
        "published": "2024-2-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/jiot.2023.3300577"
    },
    {
        "id": 23327,
        "title": "Ensemble Deep Learning for Multilabel Binary Classification of User-Generated Content",
        "authors": "Giannis Haralabopoulos, Ioannis Anagnostopoulos, Derek McAuley",
        "published": "2020-4-1",
        "citations": 39,
        "abstract": "Sentiment analysis usually refers to the analysis of human-generated content via a polarity filter. Affective computing deals with the exact emotions conveyed through information. Emotional information most frequently cannot be accurately described by a single emotion class. Multilabel classifiers can categorize human-generated content in multiple emotional classes. Ensemble learning can improve the statistical, computational and representation aspects of such classifiers. We present a baseline stacked ensemble and propose a weighted ensemble. Our proposed weighted ensemble can use multiple classifiers to improve classification results without hyperparameter tuning or data overfitting. We evaluate our ensemble models with two datasets. The first dataset is from Semeval2018-Task 1 and contains almost 7000 Tweets, labeled with 11 sentiment classes. The second dataset is the Toxic Comment Dataset with more than 150,000 comments, labeled with six different levels of abuse or harassment. Our results suggest that ensemble learning improves classification results by     1.5 %     to     5.4 %    .",
        "link": "http://dx.doi.org/10.3390/a13040083"
    },
    {
        "id": 23328,
        "title": "Combining Machine Learning and Genetic Algorithms to Solve the Independent Tasks Scheduling Problem",
        "authors": "Bernabe Dorronsoro, Frederic Pinel",
        "published": "2017-6",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cybconf.2017.7985766"
    },
    {
        "id": 23329,
        "title": "In-Vehicle Speech Text Classification based on Multiple Machine Learning Algorithms",
        "authors": "",
        "published": "2020-3-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.38007/ml.2020.010102"
    },
    {
        "id": 23330,
        "title": "Machine learning behind classification tasks in various engineering and science domains",
        "authors": "Tilottama Goswami",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-12-819443-0.00016-7"
    },
    {
        "id": 23331,
        "title": "Classification Model Simulator: A simulator for different Machine Learning Classification Algorithms",
        "authors": "Abhinandan Singla, Unnati Chaturvedi, Preet Kanwal",
        "published": "2021-5-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/incet51464.2021.9456348"
    },
    {
        "id": 23332,
        "title": "Classification of Mobile Phone Price Dataset Using Machine Learning Algorithms",
        "authors": "Ningyuan Hu",
        "published": "2022-7-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/prml56267.2022.9882236"
    },
    {
        "id": 23333,
        "title": "Task independent transfer learning in EEG deep-learning classification tasks: Sex classification and anti-depressant response prediction",
        "authors": "Hamish Binnie, Kristi Griffiths, Evian Gordon, Mayuresh Korgaonkar, Martijn Arns, Hanneke van Dijk",
        "published": "2021-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.brs.2021.10.492"
    },
    {
        "id": 23334,
        "title": "A Multitask Learning Framework for Abuse Detection and Emotion Classification",
        "authors": "Yucheng Huang, Rui Song, Fausto Giunchiglia, Hao Xu",
        "published": "2022-3-28",
        "citations": 3,
        "abstract": "The rapid development of online social media makes abuse detection a hot topic in the field of emotional computing. However, most natural language processing (NLP) methods only focus on linguistic features of posts and ignore the influence of users’ emotions. To tackle the problem, we propose a multitask framework combining abuse detection and emotion classification (MFAE) to expand the representation capability of the algorithm on the basis of the existing pretrained language model. Specifically, we use bidirectional encoder representation from transformers (BERT) as the encoder to generate sentence representation. Then, we used two different decoders for emotion classification and abuse detection, respectively. To further strengthen the influence of the emotion classification task on abuse detection, we propose a cross-attention (CA) component in the decoder, which further improves the learning effect of our multitask learning framework. Experimental results on five public datasets show that our method is superior to other state-of-the-art methods.",
        "link": "http://dx.doi.org/10.3390/a15040116"
    },
    {
        "id": 23335,
        "title": "Fuzzy Machine Learning Algorithms for Remote Sensing Image Classification",
        "authors": "Anil Kumar, Priyadarshi Upadhyay, A. Senthil Kumar",
        "published": "2020-7-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429340369"
    },
    {
        "id": 23336,
        "title": "Using machine learning in sound classification tasks",
        "authors": "Mykola Glybovets, Anastasiia Zhyrkova",
        "published": "2019-12-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18523/2617-3808.2019.2.22-31"
    },
    {
        "id": 23337,
        "title": "Boosting Classification Tasks with Federated Learning: Concepts, Experiments and Perspectives",
        "authors": "Yan Hu, Ahmad Chaddad",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bibe60311.2023.00031"
    },
    {
        "id": 23338,
        "title": "Investigation of Combining Logitboost(M5P) under Active Learning Classification Tasks",
        "authors": "Vangjel Kazllarof, Stamatis Karlos, Sotiris Kotsiantis",
        "published": "2020-11-3",
        "citations": 3,
        "abstract": "Active learning is the category of partially supervised algorithms that is differentiated by its strategy to combine both the predictive ability of a base learner and the human knowledge so as to exploit adequately the existence of unlabeled data. Its ambition is to compose powerful learning algorithms which otherwise would be based only on insufficient labelled samples. Since the latter kind of information could raise important monetization costs and time obstacles, the human contribution should be seriously restricted compared with the former. For this reason, we investigate the use of the Logitboost wrapper classifier, a popular variant of ensemble algorithms which adopts the technique of boosting along with a regression base learner based on Model trees into 3 different active learning query strategies. We study its efficiency against 10 separate learners under a well-described active learning framework over 91 datasets which have been split to binary and multi-class problems. We also included one typical Logitboost variant with a separate internal regressor for discriminating the benefits of adopting a more accurate regression tree than one-node trees, while we examined the efficacy of one hyperparameter of the proposed algorithm. Since the application of the boosting technique may provide overall less biased predictions, we assume that the proposed algorithm, named as Logitboost(M5P), could provide both accurate and robust decisions under active learning scenarios that would be beneficial on real-life weakly supervised classification tasks. Its smoother weighting stage over the misclassified cases during training as well as the accurate behavior of M5P are the main factors that lead towards this performance. Proper statistical comparisons over the metric of classification accuracy verify our assumptions, while adoption of M5P instead of weak decision trees was proven to be more competitive for the majority of the examined problems. We present our results through appropriate summarization approaches and explanatory visualizations, commenting our results per case.",
        "link": "http://dx.doi.org/10.3390/informatics7040050"
    },
    {
        "id": 23339,
        "title": "Feature Reduction in Classification Tasks using Bio-inspired Optimization Algorithms",
        "authors": "Rachna Kulhare, S Veenadhari",
        "published": "2022-12-31",
        "citations": 0,
        "abstract": "In big data, there is a major difficulty that requires data mining to be conducted with elevated data in big technology, which would be gaining a lot of traction nowadays. When it comes to Big Data, feature selection approaches are seen to be a game changer since they can assist minimize the complexity of data, making it simpler to study and translate it into meaningful information. To enhance classification performance, feature selection removes unnecessary and redundant characteristics from the dataset. In this paper, Grey Wolf Approaches based on Quantum leaping neighbor memeplexes termed as QLGWONM is proposed. The result shows that when compared to the some bio-inspired algorithms such as PSO, GWO, ABA, CSA models, the suggested model performed well in terms of accuracy and have accuracy of 100% for Brain Tumor, CNS, Lung dataset and 97.1% for Ionosphere dataset and 99% for NSL-KDD.",
        "link": "http://dx.doi.org/10.18090/samriddhi.v14i04.12"
    },
    {
        "id": 23340,
        "title": "Datasets classification using deep learning and machine learning classification algorithms",
        "authors": "Maysaa H. Abdulameer, Mahmood Z. Abdullah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0120454"
    },
    {
        "id": 23341,
        "title": "Ground Truth Data for Remote Sensing Image Classification",
        "authors": "Anil Kumar, Priyadarshi Upadhyay, A. Senthil Kumar",
        "published": "2020-7-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429340369-2"
    },
    {
        "id": 23342,
        "title": "Fog-Computing-Based Heartbeat Detection and Arrhythmia Classification Using Machine Learning",
        "authors": "Alessandro Scirè, Fabrizio Tropeano, Aris Anagnostopoulos, Ioannis Chatzigiannakis",
        "published": "2019-2-2",
        "citations": 27,
        "abstract": "Designing advanced health monitoring systems is still an active research topic. Wearable and remote monitoring devices enable monitoring of physiological and clinical parameters (heart rate, respiration rate, temperature, etc.) and analysis using cloud-centric machine-learning applications and decision-support systems to predict critical clinical states. This paper moves from a totally cloud-centric concept to a more distributed one, by transferring sensor data processing and analysis tasks to the edges of the network. The resulting solution enables the analysis and interpretation of sensor-data traces within the wearable device to provide actionable alerts without any dependence on cloud services. In this paper, we use a supervised-learning approach to detect heartbeats and classify arrhythmias. The system uses a window-based feature definition that is suitable for execution within an asymmetric multicore embedded processor that provides a dedicated core for hardware assisted pattern matching. We evaluate the performance of the system in comparison with various existing approaches, in terms of achieved accuracy in the detection of abnormal events. The results show that the proposed embedded system achieves a high detection rate that in some cases matches the accuracy of the state-of-the-art algorithms executed in standard processors.",
        "link": "http://dx.doi.org/10.3390/a12020032"
    },
    {
        "id": 23343,
        "title": "Deep Learning in Solar Image Classification Tasks",
        "authors": "Long Xu, Yihua Yan, Xin Huang",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-19-2746-1_3"
    },
    {
        "id": 23344,
        "title": "Application of Supervised Machine Learning Algorithms for Lithofacies Classification.",
        "authors": "Subhadeep Sarkar, Chandan Majumdar",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2523/19349-ms"
    },
    {
        "id": 23345,
        "title": "Edge Computing Environment for Real-Time Automated Satellite Image Classification using Deep Learning Algorithms",
        "authors": "Praneesh M",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nClassification of image is one of the decisive processes in image processing. When the classification is coursed up manually, may extend inaccuracy in analysis methods. Consequently, sensing the satellite images leads to more complexity; it has become an important problem unconcealed by technologists and researchers globally. Prevalently, space-to-ground observation technique confining the surface of the earth, civil security and remote sensing for ocean monitoring were included. In order to afford a clear pixel composition a classified image is required. It confers a high computational cost if a high pixel composition of data with a high sustainable feature in order to establish a highly accurate image classification with proper data representation. To ascertain the above mentioned properties we require a better architectural model for finest classification. The righteous delivery of remote sensing images is the upmost utility of satellite images which renders an outcome of less cost effectiveness by a long way. In this paper, we encompass an integrate feature for classifying remote sensing images that is Support Vector Machine with Genetic Algorithm (HGA-SVM) architecture with 3D-CNN and SE-Net. The network Model initiates advents a straightforward and uncomplicated learning model that helps to encompass our proposed architecture that help the model to achieve an even classification of landscapes, a manageable pushover of accuracy and a reasonable computational cost to classify remote sensing images. In this work, we first train the features based on proposed deep learning model in agriculture fields using visible spectrum camera. After that, we develop an AI based edge computing system to fully automate the classification process. For the classification, SVM exemplify with SE-Net based CNN ultimately offshoot an optimal solution and enhanced classification of remote sensing images.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3281614/v1"
    },
    {
        "id": 23346,
        "title": "Twenty Years of Machine-Learning-Based Text Classification: A Systematic Review",
        "authors": "Ashokkumar Palanivinayagam, Claude Ziad El-Bayeh, Robertas Damaševičius",
        "published": "2023-4-29",
        "citations": 8,
        "abstract": "Machine-learning-based text classification is one of the leading research areas and has a wide range of applications, which include spam detection, hate speech identification, reviews, rating summarization, sentiment analysis, and topic modelling. Widely used machine-learning-based research differs in terms of the datasets, training methods, performance evaluation, and comparison methods used. In this paper, we surveyed 224 papers published between 2003 and 2022 that employed machine learning for text classification. The Preferred Reporting Items for Systematic Reviews (PRISMA) statement is used as the guidelines for the systematic review process. The comprehensive differences in the literature are analyzed in terms of six aspects: datasets, machine learning models, best accuracy, performance evaluation metrics, training and testing splitting methods, and comparisons among machine learning models. Furthermore, we highlight the limitations and research gaps in the literature. Although the research works included in the survey perform well in terms of text classification, improvement is required in many areas. We believe that this survey paper will be useful for researchers in the field of text classification.",
        "link": "http://dx.doi.org/10.3390/a16050236"
    },
    {
        "id": 23347,
        "title": "Automated Design of Classification Algorithms",
        "authors": "Nelishia Pillay, Thambo Nyathi",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-72069-8_10"
    },
    {
        "id": 23348,
        "title": "EMG-Based Hand Gestures Classification Using Machine Learning Algorithms",
        "authors": "Nafiseh Ghaffar Nia, Erkan Kaplanoglu, Ahad Nasab",
        "published": "2023-4-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/southeastcon51012.2023.10115158"
    },
    {
        "id": 23349,
        "title": "A Comparative Study of Enhanced Machine Learning Algorithms for Brain Tumor Detection and Classification",
        "authors": "ANKIT GHOSH, ALOK KOLE",
        "published": "No Date",
        "citations": 3,
        "abstract": "<p>The improvement of Artificial Intelligence\n(AI) and Machine Learning (ML) can help radiologists in tumor diagnostics\nwithout invasive measures. Magnetic resonance imaging (MRI) is a very useful\nmethod for diagnosis of tumors in human brain. In this paper, brain MRI images\nhave been analyzed to detect the regions containing tumors and classify these\nregions into three different tumor categories: meningioma, glioma, and\npituitary. This paper presents the implementation and comparison of various\nenhanced ML algorithms for the detection and classification of brain tumors. A\nbrain tumor is the growth of abnormal cells in the human brain. Brain tumors\ncan be cancerous or non-cancerous. Cancerous or malignant brain tumors can be\nlife threatening. Hence, detection and classification of brain tumors at an\nearly stage is extremely important. In this paper, enhanced ML algorithms have\nbeen implemented to predict the presence or the absence of brain tumors using\nbinary classification and to predict whether a patient has brain tumor or not\nand if he does, detect the type of brain tumor using multi-class\nclassification. The dataset that has been used to perform the binary\nclassification task comprises of two types of brain MRI images with tumor and\nwithout tumor. Here nine ML algorithms namely, Support Vector Machine (SVM),\nLogistic Regression, K-Nearest Neighbor (KNN), Naïve Bayes (NB), Decision Tree\n(DT) classifier, Random Forest classifier, XGBoost classifier, Stochastic\nGradient Descent (SGD) classifier and Gradient Boosting classifier have been\nused to classify the MRI images. A comparative analysis of the ML algorithms\nhas been performed based on a few performance metrics such as accuracy, recall,\nand precision, F1-score, AUC-ROC curve and AUC-PR curve. Gradient Boosting\nclassifier has outperformed all the other algorithms with an accuracy of 92.4%,\nrecall of 94.4%, precision of 85%, F1-score of 89.5%, AUC-ROC of 97.2% and an\nAUC-PR of 91.4%. To address the multi-class classification problem, four ML\nalgorithms namely, SVM, KNN, Random Forest classifier and XGBoost classifier\nhave been employed. In this case, the dataset that has been used consists of\nfour types of brain MRI images with glioma tumor,   meningioma tumor, and pituitary tumor and\nwith no tumor. The performances of\nthe ML algorithms have been compared based on accuracy, recall, precision and\nthe F1-score.  XGBoost\nclassifier has surpassed all the other algorithms in terms of accuracy,\nprecision, recall and F1-score. XGBoost has produced an accuracy of 90%,\nprecision of 90%, and recall of 90% and F1-score of 90%.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.16863136.v1"
    },
    {
        "id": 23350,
        "title": "Possible bias in supervised deep learning algorithms for CT lung nodule detection and classification",
        "authors": "Nikolaos Sourlos, Jingxuan Wang",
        "published": "No Date",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26226/m.630643c2fa816f364423c77b"
    },
    {
        "id": 23351,
        "title": "A Comparative Study of Enhanced Machine Learning Algorithms for Brain Tumor Detection and Classification",
        "authors": "ANKIT GHOSH, ALOK KOLE",
        "published": "No Date",
        "citations": 1,
        "abstract": "<p>The improvement of Artificial Intelligence\n(AI) and Machine Learning (ML) can help radiologists in tumor diagnostics\nwithout invasive measures. Magnetic resonance imaging (MRI) is a very useful\nmethod for diagnosis of tumors in human brain. In this paper, brain MRI images\nhave been analyzed to detect the regions containing tumors and classify these\nregions into three different tumor categories: meningioma, glioma, and\npituitary. This paper presents the implementation and comparison of various\nenhanced ML algorithms for the detection and classification of brain tumors. A\nbrain tumor is the growth of abnormal cells in the human brain. Brain tumors\ncan be cancerous or non-cancerous. Cancerous or malignant brain tumors can be\nlife threatening. Hence, detection and classification of brain tumors at an\nearly stage is extremely important. In this paper, enhanced ML algorithms have\nbeen implemented to predict the presence or the absence of brain tumors using\nbinary classification and to predict whether a patient has brain tumor or not\nand if he does, detect the type of brain tumor using multi-class\nclassification. The dataset that has been used to perform the binary\nclassification task comprises of two types of brain MRI images with tumor and\nwithout tumor. Here nine ML algorithms namely, Support Vector Machine (SVM),\nLogistic Regression, K-Nearest Neighbor (KNN), Naïve Bayes (NB), Decision Tree\n(DT) classifier, Random Forest classifier, XGBoost classifier, Stochastic\nGradient Descent (SGD) classifier and Gradient Boosting classifier have been\nused to classify the MRI images. A comparative analysis of the ML algorithms\nhas been performed based on a few performance metrics such as accuracy, recall,\nand precision, F1-score, AUC-ROC curve and AUC-PR curve. Gradient Boosting\nclassifier has outperformed all the other algorithms with an accuracy of 92.4%,\nrecall of 94.4%, precision of 85%, F1-score of 89.5%, AUC-ROC of 97.2% and an\nAUC-PR of 91.4%. To address the multi-class classification problem, four ML\nalgorithms namely, SVM, KNN, Random Forest classifier and XGBoost classifier\nhave been employed. In this case, the dataset that has been used consists of\nfour types of brain MRI images with glioma tumor,   meningioma tumor, and pituitary tumor and\nwith no tumor. The performances of\nthe ML algorithms have been compared based on accuracy, recall, precision and\nthe F1-score.  XGBoost\nclassifier has surpassed all the other algorithms in terms of accuracy,\nprecision, recall and F1-score. XGBoost has produced an accuracy of 90%,\nprecision of 90%, and recall of 90% and F1-score of 90%.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.16863136"
    },
    {
        "id": 23352,
        "title": "Searching for Robustness: Loss Learning for Noisy Classification Tasks",
        "authors": "Boyan Gao, Henry Gouk, Timothy M. Hospedales",
        "published": "2021-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccv48922.2021.00660"
    },
    {
        "id": 23353,
        "title": "Closed Boundary Learning for Classification Tasks with the Universum Class",
        "authors": "Hanzhang Zhou, Zijian Feng, Kezhi Mao",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.1038"
    },
    {
        "id": 23354,
        "title": "GeoAI: A Model-Agnostic Meta-Ensemble Zero-Shot Learning Method for Hyperspectral Image Analysis and Classification",
        "authors": "Konstantinos Demertzis, Lazaros Iliadis",
        "published": "2020-3-7",
        "citations": 22,
        "abstract": "Deep learning architectures are the most effective methods for analyzing and classifying Ultra-Spectral Images (USI). However, effective training of a Deep Learning (DL) gradient classifier aiming to achieve high classification accuracy, is extremely costly and time-consuming. It requires huge datasets with hundreds or thousands of labeled specimens from expert scientists. This research exploits the MAML++ algorithm in order to introduce the Model-Agnostic Meta-Ensemble Zero-shot Learning (MAME-ZsL) approach. The MAME-ZsL overcomes the above difficulties, and it can be used as a powerful model to perform Hyperspectral Image Analysis (HIA). It is a novel optimization-based Meta-Ensemble Learning architecture, following a Zero-shot Learning (ZsL) prototype. To the best of our knowledge it is introduced to the literature for the first time. It facilitates learning of specialized techniques for the extraction of user-mediated representations, in complex Deep Learning architectures. Moreover, it leverages the use of first and second-order derivatives as pre-training methods. It enhances learning of features which do not cause issues of exploding or diminishing gradients; thus, it avoids potential overfitting. Moreover, it significantly reduces computational cost and training time, and it offers an improved training stability, high generalization performance and remarkable classification accuracy.",
        "link": "http://dx.doi.org/10.3390/a13030061"
    },
    {
        "id": 23355,
        "title": "Kohonen Map Modification for Classification Tasks",
        "authors": "Jiří Jelínek",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007361405840591"
    },
    {
        "id": 23356,
        "title": "Detecting Health Misinformation: A Comparative Analysis of Machine Learning and Graph Convolutional Networks in Classification Tasks",
        "authors": "Bharti Khemani, Shruti Patil, Ketan Kotecha, Deepali Vora",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4715918"
    },
    {
        "id": 23357,
        "title": "Weight Learning in Weighted ELM Classification Model Based on Genetic Algorithms",
        "authors": "Peng Yao, Xi-Zhao Wang",
        "published": "2018-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmlc.2018.8526986"
    },
    {
        "id": 23358,
        "title": "Deep Learning in Medical Image Classification",
        "authors": "A. Suganya, S. L. Aarthy",
        "published": "2021-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781003038450-9"
    },
    {
        "id": 23359,
        "title": "Diagnosis and Classification of the Diabetes Using Machine Learning Algorithms",
        "authors": "Prasannavenkatesan Theerthagiri, Usha Ruby A, Vidya J",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nDiabetes mellitus is characterized as a chronic disease may cause many complications. The machine learning algorithms are used to diagnosis and predict the diabetes. The learning based algorithms plays a vital role on supporting decision making in disease diagnosis and prediction. In this paper, traditional classification algorithms and neural network based machine learning are investigated for the diabetes dataset. Also, various performance methods with different aspects are evaluated for the K-nearest neighbor, Naive Bayes, extra trees, decision trees, radial basis function, and multilayer perceptron algorithms. It supports the estimation on patients suffering from diabetes in future. The results of this work shows that the multilayer perceptron algorithm gives the highest prediction accuracy with lowest MSE of 0.19. The MLP gives the lowest false positive rate and false negative rate with highest area under curve of 86 %.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-514771/v3"
    },
    {
        "id": 23360,
        "title": "Supervised Machine Learning Classification Algorithms for Detection of Fracture Location in Dissimilar Friction Stir Welded Joints",
        "authors": "Akshansh Mishra",
        "published": "No Date",
        "citations": 0,
        "abstract": "Machine Learning focuses on the study of algorithms that are mathematical or statistical in nature in order to extract the required information pattern from the available data. Supervised Machine Learning algorithms are further sub-divided into two types i.e. regression algorithms and classification algorithms. In the present study, four supervised machine learning-based classification models i.e. Decision Trees algorithm, K- Nearest Neighbors (KNN) algorithm, Support Vector Machines (SVM) algorithm, and Ada Boost algorithm were subjected to the given dataset for the determination of fracture location in dissimilar Friction Stir Welded AA6061-T651 and AA7075-T651 alloy. In the given dataset, rotational speed (RPM), welding speed (mm/min), pin profile, and axial force (kN) were the input parameters while Fracture location is the output parameter. The obtained results showed that the Support Vector Machine (SVM) algorithm classified the fracture location with a good accuracy score of 0.889 in comparison to the other algorithms.",
        "link": "http://dx.doi.org/10.33774/chemrxiv-2021-cn2z8"
    },
    {
        "id": 23361,
        "title": "Diagnosis and Classification of the Diabetes Using Machine Learning Algorithms",
        "authors": "Prasannavenkatesan Theerthagiri, Usha Ruby A, Vidya J",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nDiabetes mellitus is characterized as a chronic disease may cause many complications. The machine learning algorithms are used to diagnosis and predict the diabetes. The learning based algorithms plays a vital role on supporting decision making in disease diagnosis and prediction. In this paper, traditional classification algorithms and neural network based machine learning are investigated for the diabetes dataset. Also, various performance methods with different aspects are evaluated for the K-nearest neighbor, Naive Bayes, extra trees, decision trees, radial basis function, and multilayer perceptron algorithms. It supports the estimation on patients suffering from diabetes in future. The results of this work shows that the multilayer perceptron algorithm gives the highest prediction accuracy with lowest MSE of 0.19. The MLP gives the lowest false positive rate and false negative rate with highest area under curve of 86 %.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-514771/v2"
    },
    {
        "id": 23362,
        "title": "Plankton Classification with Deep Learning",
        "authors": "Betül Sömek, Seniha Esen Yuksel",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/spa59660.2023.10274456"
    },
    {
        "id": 23363,
        "title": "A Comparative Study of Machine Learning Algorithms for the Prediction of Drug-Abuse - A Classification Approach",
        "authors": "Ali Siddiqui",
        "published": "No Date",
        "citations": 0,
        "abstract": "This research was conducted as part of ENGIN-298 at Contra Costa College\nby Ali Ahmad Siddiqui with the assistance of Dr. Chao Liu from Fall 2022\nto Fall 2023. Drug-use is a societal crisis that is in-need of desperate\nmitigation and alleviation. In this paper, we claim that machine\nlearning algorithms are highly effective in assessing the likelihood for\nan individual to engage in the use of certain drugs. In particular, we\nshow how machine learning algorithms can be trained using real-world\ndata collected from users who consume a variety of different drugs in\norder to give insight into the drug-use for unknown individuals.",
        "link": "http://dx.doi.org/10.22541/au.170432939.97395381/v1"
    },
    {
        "id": 23364,
        "title": "Classification of Fruits Using Deep Learning Algorithms",
        "authors": "Mirra K B, R. Rajakumari",
        "published": "No Date",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4068366"
    },
    {
        "id": 23365,
        "title": "Technical Analysis with Machine Learning Classification Algorithms: Can it Still ‘Beat’ the Buy-and-Hold Strategy?",
        "authors": "Ba Chu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4765615"
    },
    {
        "id": 23366,
        "title": "Diagnosis and Classification of the Diabetes Using Machine Learning Algorithms",
        "authors": "Prasannavenkatesan Theerthagiri, Usha Ruby A, Vidya J",
        "published": "No Date",
        "citations": 1,
        "abstract": "Abstract\nDiabetes mellitus is characterized as a chronic disease may cause many complications. The machine learning algorithms are used to diagnosis and predict the diabetes. The learning based algorithms plays a vital role on supporting decision making in disease diagnosis and prediction. In this paper, traditional classification algorithms and neural network based machine learning are investigated for the diabetes dataset. Also, various performance methods with different aspects are evaluated for the K-nearest neighbor, Naive Bayes, extra trees, decision trees, radial basis function, and multilayer perceptron algorithms. It supports the estimation on patients suffering from diabetes in future. The results of this work shows that the multilayer perceptron algorithm gives the highest prediction accuracy with lowest MSE of 0.19. The MLP gives the lowest false positive rate and false negative rate with highest area under curve of 86 %.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-514771/v1"
    },
    {
        "id": 23367,
        "title": "Classification of Historical Anatolian Coins with Machine Learning Algorithms",
        "authors": "Ramazan ÜNLÜ",
        "published": "2019-12-31",
        "citations": 2,
        "abstract": "To find out which period the historical coins belong to requires a number of scientific procedures that archaeologists or experts can do. These operations can often be time-consuming and demanding operations. From this point on, in this study, the automatically classification of historical coins by using machine learning methods is discussed.Being able to use machine learning methods to classify historical coins can help experts and can become an analysis tool without the need for scientific tests for non-experts. For this purpose, some physical properties of different coins used in Anatolian geography were collected and classified by various machine learning methods named SVM, Random Forest, Bagging, and Decision Trees. Also, two different missing values strategies are deployed in conjunction with each chosen method. Based on our findings, random forest method together with imputing missing values with mean gives an acceptable results with the accuracy rate of %71, although there are some limitations such as high rate of missing values and working with a small dataset.",
        "link": "http://dx.doi.org/10.17093/alphanumeric.620095"
    },
    {
        "id": 23368,
        "title": "Text Generation, Machine Translation, and Other Recurrent Language Modeling Tasks",
        "authors": "Taweh Beysolow II",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3733-5_5"
    },
    {
        "id": 23369,
        "title": "Performance Analysis of Machine Learning Algorithms for Text Classification",
        "authors": "",
        "published": "2020-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/jxu14.6/257"
    },
    {
        "id": 23370,
        "title": "CLASSIFICATION AND PREDICTION OF LIVER DISEASE DIAGNOSIS VIA MACHINE LEARNING ALGORITHMS",
        "authors": "",
        "published": "2021-6-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/aj10.5/022"
    }
]