[
    {
        "id": 27705,
        "title": "Single-Class Instance Segmentation for Vectorization of Line Drawings",
        "authors": "Rhythm Vohra, Amanda Dash, Alexandra Branzan Albu",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012465900003660"
    },
    {
        "id": 27706,
        "title": "Instance Segmentation of Event Camera Streams in Outdoor Monitoring Scenarios",
        "authors": "Tobias Bolten, Regina Pohle-Fröhlich, Klaus Tönnies",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012369100003660"
    },
    {
        "id": 27707,
        "title": "UNETRIS: transformer-based nuclear instance segmentation for three-dimensional fluorescence microscopy images",
        "authors": "Alain Chen, Liming Wu, Seth Winfree, Kenneth W. Dunn, Paul Salama, Edward J. Delp",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005440"
    },
    {
        "id": 27708,
        "title": "Eosinophils instance object segmentation on whole slide imaging using multi-label circle representation",
        "authors": "Yilin Liu, Ruining Deng, Juming Xiong, Regina N. Tyree, Hernan Correa, Girish Hiremath, Yaohong Wang, Yuankai Huo",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005995"
    },
    {
        "id": 27709,
        "title": "N-MuPeTS: Event Camera Dataset for Multi-Person Tracking and Instance Segmentation",
        "authors": "Tobias Bolten, Christian Neumann, Regina Pohle-Fröhlich, Klaus Tönnies",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011680300003417"
    },
    {
        "id": 27710,
        "title": "Automated Generation of Instance Segmentation Labels for Traffic Surveillance Models",
        "authors": "D. Scholte, T. T. G. Urselmann, M. H. Zwemer, E. Bondarev, P. H. N. de With",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012319500003660"
    },
    {
        "id": 27711,
        "title": "Nuclei instance segmentation from histopathology images using Bayesian dropout based deep learning",
        "authors": "Naga Raju Gudhe, Veli-Matti Kosma, Hamid Behravan, Arto Mannermaa",
        "published": "2023-10-19",
        "citations": 1,
        "abstract": "Abstract\nBackground\nThe deterministic deep learning models have achieved state-of-the-art performance in various medical image analysis tasks, including nuclei segmentation from histopathology images. The deterministic models focus on improving the model prediction accuracy without assessing the confidence in the predictions.\n\nMethods\nWe propose a semantic segmentation model using Bayesian representation to segment nuclei from the histopathology images and to further quantify the epistemic uncertainty. We employ Bayesian approximation with Monte-Carlo (MC) dropout during the inference time to estimate the model’s prediction uncertainty.\n\nResults\nWe evaluate the performance of the proposed approach on the PanNuke dataset, which consists of 312 visual fields from 19 organ types. We compare the nuclei segmentation accuracy of our approach with that of a fully convolutional neural network, U-Net, SegNet, and the state-of-the-art Hover-net. We use F1-score and intersection over union (IoU) as the evaluation metrics. The proposed approach achieves a mean F1-score of 0.893 ± 0.008 and an IoU value of 0.868 ± 0.003 on the test set of the PanNuke dataset. These results outperform the Hover-net, which has a mean F1-score of 0.871 ± 0.010 and an IoU value of 0.840 ± 0.032.\n\nConclusions\nThe proposed approach, which incorporates Bayesian representation and Monte-Carlo dropout, demonstrates superior performance in segmenting nuclei from histopathology images compared to existing models such as U-Net, SegNet, and Hover-net. By considering the epistemic uncertainty, our model provides a more reliable estimation of the prediction confidence. These findings highlight the potential of Bayesian deep learning for improving medical image analysis tasks and can contribute to the development of more accurate and reliable computer-aided diagnostic systems.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12880-023-01121-3"
    },
    {
        "id": 27712,
        "title": "Image Synthesis and Modified BlendMask Instance Segmentation for Automated Nanoparticle Phenotyping",
        "authors": "Xiaoqin Tang, Lingpeng Lv, Shima Javanmardi, Yunfeng Wang, Jingchuan Fan, Fons J. Verbeek, Guoqiang Xiao",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3299119"
    },
    {
        "id": 27713,
        "title": "Cell Instance Segmentation VIA Multi-Scale Non-Local Correlation",
        "authors": "Bin Duan, Jianfeng Cao, Wei Wang, Dawen Cai, Yan Yan",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230512"
    },
    {
        "id": 27714,
        "title": "Generalizations of the Jaccard index and Sørensen index for assessing agreement across multiple readers in object detection and instance segmentation in biomedical imaging",
        "authors": "Madeleine S. Durkee, Kyle Lleras, Karen Drukker, Junting Ai, Thao Cao, Gabriel Casella, Deepjyoti Ghosh, Marcus R. Clark, Maryellen L. Giger",
        "published": "2023-12-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.6.065503"
    },
    {
        "id": 27715,
        "title": "BreastSAM: adapting the segmentation anything model for breast tumor segmentation in ultrasound imaging",
        "authors": "Mingzhe Hu, Yuheng Li, Xiaofeng Yang",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006773"
    },
    {
        "id": 27716,
        "title": "Multi-class instance segmentation of renal structures in highly multiplexed immunofluorescence microscopy images",
        "authors": "Thao Cao, Madeleine S. Durkee, Junting Ai, Gabriel Casella, Deepjyoti Ghosh, Anthony Chang, Michael S. Andrade, Maryellen L. Giger, Marcus R. Clark",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3008544"
    },
    {
        "id": 27717,
        "title": "Semantic segmentation-assisted instance feature fusion for multi-level 3D part instance segmentation",
        "authors": "Chun-Yu Sun, Xin Tong, Yang Liu",
        "published": "2023-12",
        "citations": 1,
        "abstract": "AbstractRecognizing 3D part instances from a 3D point cloud is crucial for 3D structure and scene understanding. Several learning-based approaches use semantic segmentation and instance center prediction as training tasks and fail to further exploit the inherent relationship between shape semantics and part instances. In this paper, we present a new method for 3D part instance segmentation. Our method exploits semantic segmentation to fuse nonlocal instance features, such as center prediction, and further enhances the fusion scheme in a multi- and cross-level way. We also propose a semantic region center prediction task to train and leverage the prediction results to improve the clustering of instance points. Our method outperforms existing methods with a large-margin improvement in the PartNet benchmark. We also demonstrate that our feature fusion scheme can be applied to other existing methods to improve their performance in indoor scene instance segmentation tasks.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41095-022-0300-x"
    },
    {
        "id": 27718,
        "title": "Instance Segmentation Based Graph Extraction for Handwritten Circuit Diagram Images",
        "authors": "Johannes Bayer, Amit Roy, Andreas Dengel",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011752600003411"
    },
    {
        "id": 27719,
        "title": "UCITransNet: A Deep Neural Model with FC-CRFs and Object-Level Data Augmentation for Cell Instance Segmentation",
        "authors": "Zequan Liu, Suhong Wang, Zidong Chen, Zhifeng Xiao",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230712"
    },
    {
        "id": 27720,
        "title": "Adapting Video Instance Segmentation for Instance Search",
        "authors": "An Thi Nguyen",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3617233.3617249"
    },
    {
        "id": 27721,
        "title": "Deep Learning-Based Architectures For Multimodal Instance Segmentation",
        "authors": "Md Omar Faruk, Behnood Rasti, Margret Fuchs, Richard Gloaguen, Pedram Ghamisi",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/whispers61460.2023.10431001"
    },
    {
        "id": 27722,
        "title": "Multiple instance learning for digital pathology: A review of the state-of-the-art, limitations &amp; future potential",
        "authors": "Michael Gadermayr, Maximilian Tschuchnig",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102337"
    },
    {
        "id": 27723,
        "title": "Video Instance Segmentation by Instance Flow Assembly",
        "authors": "Xiang Li, Jinglu Wang, Xiao Li, Yan Lu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmm.2022.3222643"
    },
    {
        "id": 27724,
        "title": "Survey of Denoising, Segmentation and Classification of Pancreatic Cancer\nImaging",
        "authors": "Harjinder Kaur, Sumindar Kaur  Saini, Niharika Thakur, Mamta Juneja",
        "published": "2023-7-7",
        "citations": 1,
        "abstract": "\nBackground:\nPancreatic cancer is one of the most serious problems that has taken many lives worldwide. The diagnostic procedure using the traditional approaches was manual by visually analyzing the large volumes of the dataset, making it time-consuming and prone to subjective errors. Hence the need for the computer-aided diagnosis system (CADs) emerged that comprises the machine and deep learning approaches for denoising, segmentation and classification of pancreatic cancer.\n\n\nIntroduction:\nThere are different modalities used for the diagnosis of pancreatic cancer, such as Positron Emission Tomography/Computed Tomography (PET/CT), Magnetic Resonance Imaging (MRI), Multiparametric-MRI (Mp-MRI), Radiomics and Radio-genomics. Although these modalities gave remarkable results in diagnosis on the basis of different criteria. CT is the most commonly used modality that produces detailed and fine contrast images of internal organs of the body. However, it may also contain a certain amount of gaussian and rician noise that is necessary to be preprocessed before segmentation of the required region of interest (ROI)  from the images and classification of cancer.\n\n\nMethods:\nThis paper analyzes different methodologies used for the complete diagnosis of pancreatic cancer, including the denoising, segmentation and classification, along with the challenges and future scope for the diagnosis of pancreatic cancer.\n\n\nResults:\nVarious filters are used for denoising and image smoothening and filters as gaussian scale mixture process, non-local means, median filter, adaptive filter and average filter have been used more for better results.\n\n\nConclusion:\nIn terms of segmentation, atlas based region-growing method proved to give better results as compared to the state of the art whereas, for the classification, deep learning approaches outperformed other methodologies to classify the images as cancerous and non- cancerous. These methodologies have proved that CAD systems have become a better solution to the ongoing research proposals for the detection of pancreatic cancer worldwide.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230515090523"
    },
    {
        "id": 27725,
        "title": "MilInst: Enhanced Instance Segmentation Framework for Military Camouflaged Targets Using Sparse Instance Activation",
        "authors": "Bing Li, Enze Zhu, Rongqian Zhou, Huang Cheng",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3318486"
    },
    {
        "id": 27726,
        "title": "MISS-tool: medical image segmentation synthesis tool to emulate segmentation errors",
        "authors": "Shuyue Guan, Ravi K. Samala, Arian Arab, Weijie Chen",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2653650"
    },
    {
        "id": 27727,
        "title": "A robust and lightweight deep attention multiple instance learning algorithm for predicting genetic alterations",
        "authors": "Bangwei Guo, Xingyu Li, Miaomiao Yang, Hong Zhang, Xu Steven Xu",
        "published": "2023-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102189"
    },
    {
        "id": 27728,
        "title": "A comparison of histopathology imaging comprehension algorithms based on multiple instance learning",
        "authors": "Adam Saunders, Sajal Dash, Aristeidis Tsaris, Hong-Jun Yoon",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654265"
    },
    {
        "id": 27729,
        "title": "Transforming Semantic Segmentation into Instance Segmentation with a Guided U-Net",
        "authors": "Roman Lavrynenko, Nataliya Ryabova",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csit61576.2023.10324276"
    },
    {
        "id": 27730,
        "title": "Learning Vector Quantized Shape Code for Amodal Blastomere Instance Segmentation",
        "authors": "Won-Dong Jang, Donglai Wei, Xingxuan Zhang, Brian Leahy, Helen Yang, James Tompkin, Dalit Ben-Yosef, Daniel Needleman, Hanspeter Pfister",
        "published": "2023-4-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230774"
    },
    {
        "id": 27731,
        "title": "Weakly Supervised Cell-Instance Segmentation with Two Types of Weak Labels by Single Instance Pasting",
        "authors": "Kazuya Nishimura, Ryoma Bise",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00320"
    },
    {
        "id": 27732,
        "title": "IAN: Instance-Augmented Net for 3D Instance Segmentation",
        "authors": "Zihao Wan, Jianhua Hu, Haojian Zhang, Yunkuan Wang",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/lra.2023.3281905"
    },
    {
        "id": 27733,
        "title": "Collaborative Propagation on Multiple Instance Graphs for 3D Instance Segmentation with Single-point Supervision",
        "authors": "Shichao Dong, Ruibo Li, Jiacheng Wei, Fayao Liu, Guosheng Lin",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01528"
    },
    {
        "id": 27734,
        "title": "Instance Segmentation and Detection of Children to Safeguard Vulnerable Traffic User by Infrastructure",
        "authors": "Shiva Agrawal, Savankumar Bhanderi, Sumit Amanagi, Kristina Doycheva, Gordon Elger",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011825400003479"
    },
    {
        "id": 27735,
        "title": "Railway Infrastructure Instance Segmentation Based on Convolutional Neural Networks",
        "authors": "V. A. Fedorov",
        "published": "2023-9-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rusautocon58002.2023.10272908"
    },
    {
        "id": 27736,
        "title": "A new family of instance-level loss functions for improving instance-level segmentation and detection of white matter hyperintensities in routine clinical brain MRI",
        "authors": "Muhammad Febrian Rachmadi, Michal Byra, Henrik Skibbe",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compbiomed.2024.108414"
    },
    {
        "id": 27737,
        "title": "Kernel-weighted contribution: a method of visual attribution for 3D deep learning segmentation in medical imaging",
        "authors": "Sean Mullan, Milan Sonka",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.5.054001"
    },
    {
        "id": 27738,
        "title": "Tumor segmentation via enhanced area growth algorithm for lung CT images",
        "authors": "Abdollah Khorshidi",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "Abstract\nBackground\nSince lung tumors are in dynamic conditions, the study of tumor growth and its changes is of great importance in primary diagnosis.\n\nMethods\nEnhanced area growth (EAG) algorithm is introduced to segment the lung tumor in 2D and 3D modes on 60 patients CT images from four different databases by MATLAB software. The contrast augmentation, color intensity and maximum primary tumor radius determination, thresholding, start and neighbor points’ designation in an array, and then modifying the points in the braid on average are the early steps of the proposed algorithm. To determine the new tumor boundaries, the maximum distance from the color-intensity center point of the primary tumor to the modified points is appointed via considering a larger target region and new threshold. The tumor center is divided into different subsections and then all previous stages are repeated from new designated points to define diverse boundaries for the tumor. An interpolation between these boundaries creates a new tumor boundary. The intersections with the tumor boundaries are firmed for edge correction phase, after drawing diverse lines from the tumor center at relevant angles. Each of the new regions is annexed to the core region to achieve a segmented tumor surface by meeting certain conditions.\n\nResults\nThe multipoint-growth-starting-point grouping fashioned a desired consequence in the precise delineation of the tumor. The proposed algorithm enhanced tumor identification by more than 16% with a reasonable accuracy acceptance rate. At the same time, it largely assurances the independence of the last outcome from the starting point. By significance difference of p < 0.05, the dice coefficients were 0.80 ± 0.02 and 0.92 ± 0.03, respectively, for primary and enhanced algorithms. Lung area determination alongside automatic thresholding and also starting from several points along with edge improvement may reduce human errors in radiologists’ interpretation of tumor areas and selection of the algorithm’s starting point.\n\nConclusions\nThe proposed algorithm enhanced tumor detection by more than 18% with a sufficient acceptance ratio of accuracy. Since the enhanced algorithm is independent of matrix size and image thickness, it is very likely that it can be easily applied to other contiguous tumor images.\n\nTrial registration\nPAZHOUHAN, PAZHOUHAN98000032. Registered 4 January 2021, http://pazhouhan.gerums.ac.ir/webreclist/view.action?webreclist_code=19300\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12880-023-01126-y"
    },
    {
        "id": 27739,
        "title": "Multiple Instance Learning with Critical Instance for Whole Slide Image Classification",
        "authors": "Yuanpin Zhou, Yao Lu",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230595"
    },
    {
        "id": 27740,
        "title": "Multi-modality GLCM image texture feature for segmentation and tissue classification",
        "authors": "Diego Andrade, Howard Gifford, Mini Das",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2659078"
    },
    {
        "id": 27741,
        "title": "SIM: Semantic-aware Instance Mask Generation for Box-Supervised Instance Segmentation",
        "authors": "Ruihuang Li, Chenhang He, Yabin Zhang, Shuai Li, Liyi Chen, Lei Zhang",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00695"
    },
    {
        "id": 27742,
        "title": "Deep learning volumetric brain segmentation based on spectral CT",
        "authors": "Veronica Fransson, Soren Christensen, Kristina Ydström, Johan Wassélius",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654161"
    },
    {
        "id": 27743,
        "title": "An Instance Segmentation Algorithm Based On Signed Distance Field",
        "authors": "Hongbao Sun, Hongbo Yang",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10240547"
    },
    {
        "id": 27744,
        "title": "A Comprehensive Review on MRI-based Knee Joint Segmentation and Analysis\nTechniques",
        "authors": "Pavan Mahendrakar, Dileep Kumar, Uttam Patil",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "\nAbstract:\nUsing magnetic resonance imaging (MRI) in osteoarthritis pathogenesis research has proven extremely beneficial. However, it is always\nchallenging for both clinicians and researchers to detect morphological changes in knee joints from magnetic resonance (MR) imaging since the\nsurrounding tissues produce identical signals in MR studies, making it difficult to distinguish between them. Segmenting the knee bone, articular\ncartilage and menisci from the MR images allows one to examine the complete volume of the bone, articular cartilage, and menisci. It can also be\nused to assess certain characteristics quantitatively. However, segmentation is a laborious and time-consuming operation that requires sufficient\ntraining to complete correctly. With the advancement of MRI technology and computational methods, researchers have developed several\nalgorithms to automate the task of individual knee bone, articular cartilage and meniscus segmentation during the last two decades. This systematic\nreview aims to present available fully and semi-automatic segmentation methods for knee bone, cartilage, and meniscus published in different\nscientific articles. This review provides a vivid description of the scientific advancements to clinicians and researchers in this field of image\nanalysis and segmentation, which helps the development of novel automated methods for clinical applications. The review also contains the\nrecently developed fully automated deep learning-based methods for segmentation, which not only provides better results compared to the\nconventional techniques but also open a new field of research in Medical Imaging.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230515090557"
    },
    {
        "id": 27745,
        "title": "Using a Monocular Camera for 360∘ Dynamic Object Instance Segmentation in Traffic",
        "authors": "Goran Oreski, Lucija Babic",
        "published": "2023-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023041006"
    },
    {
        "id": 27746,
        "title": "FlySeg: an Automated Volumetric Instance Segmentation Algorithm for Dense Cell Populations in Drosophila Melanogaster Nervous System",
        "authors": "Andrea Vaccari, Mark Dombrovski",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ieeeconf59524.2023.10476819"
    },
    {
        "id": 27747,
        "title": "IAST: Instance Association Relying on Spatio-Temporal Features for Video Instance Segmentation",
        "authors": "Junhao Chen, Sheng Liu, Ruixiang Chen, Bingnan Guo, Feng Zhang",
        "published": "2023-6-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10095641"
    },
    {
        "id": 27748,
        "title": "Synchronous Medical Image Augmentation framework for deep learning-based image segmentation",
        "authors": "Jianguo Chen, Nan Yang, Yuhui Pan, Hailing Liu, Zhaolei Zhang",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2022.102161"
    },
    {
        "id": 27749,
        "title": "Unsupervised Learning of Object-Centric Embeddings for Cell Instance Segmentation in Microscopy Images",
        "authors": "Steffen Wolf, Manan Lalit, Katie McDole, Jan Funke",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01944"
    },
    {
        "id": 27750,
        "title": "Review on Deep Learning Methodologies in Medical Image Restoration\nand Segmentation",
        "authors": "Hepzibah Christinal Anandharaj, R. Hephzibah, G. Kowsalya, R. Jayanthi, D. Abraham Chandy",
        "published": "2023-7",
        "citations": 0,
        "abstract": "\nAbstract:\nThis paper presents a comprehensive review of two major image processing tasks such as restoration and segmentation in the medical field on deep learning perspective. These processes are essential as restoration helps in the removal of noise and segmentation helps in extracting the particular region of interest of an image which is essential for accurate diagnosis and treatment. This paper mainly focuses on deep learning techniques as it plays a prominent role over other conventional techniques in handling a large number of datasets in the medical field and also provides accurate results. In this paper, we reviewed the application of different convolutional neural network architectures in the restoration and segmentation processes. Based on the results in the case of image restoration, TLR-CNN and Stat-CNN are promising in achieving better PSNR, noise suppression, artifact suppression and improves the overall image quality. For segmentation process, LCP net achieves the Dice score as 98.12% and sensitivity as 98.95% in the cell contour segmentation;3D FCNN model is found to be the best method for segmentation of brain tumors. This review work shows that deep learning methodologies can be a better alternative for medical image restoration and segmentation tasks as the data size is an important concern as on today.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405618666220407112825"
    },
    {
        "id": 27751,
        "title": "Integrating deep learning algorithm for the lung segmentation with body-part-specific anatomical classification of medical imaging data hosted by Medical Imaging and Data Resource Center (MIDRC)",
        "authors": "Nadya Shusharina, Deepa Krishnaswamy, Paul Kinahan, Andrey Fedorov",
        "published": "2023-4-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2653606"
    },
    {
        "id": 27752,
        "title": "Model-Heterogeneous Semi-Supervised Federated Learning for Medical Image Segmentation",
        "authors": "Yuxi Ma, Jiacheng Wang, Jing Yang, Liansheng Wang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3348982"
    },
    {
        "id": 27753,
        "title": "Shortcomings and areas for improvement in digital pathology image segmentation challenges",
        "authors": "Adrien Foucart, Olivier Debeir, Christine Decaestecker",
        "published": "2023-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2022.102155"
    },
    {
        "id": 27754,
        "title": "ISBNet: a 3D Point Cloud Instance Segmentation Network with Instance-aware Sampling and Box-aware Dynamic Convolution",
        "authors": "Tuan Duc Ngo, Binh-Son Hua, Khoi Nguyen",
        "published": "2023-6",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01302"
    },
    {
        "id": 27755,
        "title": "Attention U-net for Cell Instance Segmentation",
        "authors": "Qianze Liu, Tong Mo, Yiya Yao, Yufei Zhang",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450733"
    },
    {
        "id": 27756,
        "title": "High Throughput Deep Model of 3D Nucleus Instance Segmentation by Stereo Stitching Contextual Gaps",
        "authors": "Ziquan Wei, Tingting Dan, Jiaqi Ding, Carolyn McCormick, Felix A. Kyere, Minjeong Kim, David Borland, Jason L. Stein, Guorong Wu",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230745"
    },
    {
        "id": 27757,
        "title": "TT-Net: Tensorized Transformer Network for 3D medical image segmentation",
        "authors": "Jing Wang, Aixi Qu, Qing Wang, Qibin Zhao, Ju Liu, Qiang Wu",
        "published": "2023-7",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102234"
    },
    {
        "id": 27758,
        "title": "A novel cost function for nuclei segmentation and classification in imbalanced histopathology data-sets",
        "authors": "Luke Johnston, Zhangsheng Yu",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102296"
    },
    {
        "id": 27759,
        "title": "Instance segmentation nei tumori delle vie areo-digestive superiori",
        "authors": "Alberto Paderno, Francesca Pia Villani, Milena Fior, Giulia Berretti, Francesca Gennarini, Gabriele Zigliani, Emanuela Ulaj, Claudia Montenegro, Alessandra Sordi, Claudio Sampieri, Giorgio Peretti, Sara Moccia, Cesare Piazza",
        "published": "2023-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14639/0392-100x-n2336"
    },
    {
        "id": 27760,
        "title": "3D metal segmentation from few x-ray images for metal artifact avoidance",
        "authors": "Maximilian Rohleder, Holger Kunze, Andreas Maier, Bjoern Kreher",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005260"
    },
    {
        "id": 27761,
        "title": "Multiple instance learning with random sampling for whole slide image classification",
        "authors": "Hassan Keshvarikhojasteh, Josien Pluim, Mitko Veta",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004713"
    },
    {
        "id": 27762,
        "title": "GSM-Net: A global sequence modelling network for the segmentation of short axis CINE MRI images",
        "authors": "Fatmatülzehra Uslu",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102266"
    },
    {
        "id": 27763,
        "title": "Review for Optimal Human-gesture Design Methodology and Motion\nRepresentation of Medical Images using Segmentation from Depth Data and\nGesture Recognition",
        "authors": "Anju Gupta, Sanjeev Kumar, Sanjeev Kumar",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "\nAbstract:\nHuman gesture recognition and motion representation has become a vital base of current intelligent human-machine interfaces because of ubiquitous and more comfortable interaction. Human-Gesture recognition chiefly deals with recognizing meaningful, expressive body movements involving physical motions of face, head, arms, fingers, hands or body. This review article presents a concise overview of optimal human-gesture and motion representation of medical images. This paper surveys various works undertaken on human gesture design and discusses various design methodologies used for image segmentation and gesture recognition. It further provides a general idea of modeling techniques for analyzing hand gesture images and even discusses the diverse techniques involved in motion recognition. This survey provides an insight into various efforts and developments made in the gesture/motion recognition domain through analyzing and reviewing the procedures and approaches employed for identifying diverse human motions and gestures for supporting better and devising improved applications in near future.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230530093026"
    },
    {
        "id": 27764,
        "title": "NG-NAS: Node growth neural architecture search for 3D medical image segmentation",
        "authors": "Shixi Qin, Zixun Zhang, Yuncheng Jiang, Shuguang Cui, Shenghui Cheng, Zhen Li",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102268"
    },
    {
        "id": 27765,
        "title": "Sparse Shape Encoding for Topologically Improved Instance Segmentation",
        "authors": "Keyi Liu, James H. Elder",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/crv60082.2023.00014"
    },
    {
        "id": 27766,
        "title": "Deep learning-based whole heart segmentation from CT images",
        "authors": "Yunfeng Li, Sandeep Dutta, Amy Deubig",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006624"
    },
    {
        "id": 27767,
        "title": "CenterInst: Center-Based Real-Time Instance Segmentation",
        "authors": "Shu Tian, Liang Ren",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "Instance segmentation is a computer vision task that aims to give each pixel in an image an instance-specific label. Recently, researchers have shown growing interest in real-time instance segmentation. In this paper, we propose a novel center-based real-time instance segmentation method (CenterInst), which follows the FastInst meta-architecture. Key design aspects include a center-guided query selector, a center-guided sampling-based query decoder, and a lightweight dual-path decoder. The center-guided query selector selects queries via the per-pixel prediction of center point probabilities, avoiding excessive query proposals for single instances. The center-guided sampling-based query decoder adaptively generates local sampling points based on center positions, employing adaptive mixing to update queries without irrelevant sampling disturbances. The lightweight dual-path decoder enhances inference speed and maintains accuracy via pixel decoding on every layer during training but only utilizing the final layer’s decoder during inference. The experimental results show CenterInst achieves superior accuracy and speed compared to state-of-the-art real-time instance segmentation methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14051999"
    },
    {
        "id": 27768,
        "title": "Coreset Based Medical Image Anomaly Detection and Segmentation",
        "authors": "Ciprian-Mihai Ceaușescu, Bogdan Alexe, Riccardo Volpi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012395900003660"
    },
    {
        "id": 27769,
        "title": "<scp>cyto‐Knet</scp>: An instance segmentation approach for multiple myeloma plasma cells using conditional kernels",
        "authors": "Massimo Salvi, Nicola Michielli, Kristen M. Meiburger, Cristina Cattelino, Bruna Cotrufo, Matteo Giacosa, Chiara Giovanzana, Filippo Molinari",
        "published": "2024-1",
        "citations": 1,
        "abstract": "AbstractMultiple myeloma disrupts normal blood cell production, requiring early detection due to the increased risk of bone metastases. Although various artificial intelligence (AI) methods have been developed to assist pathologists, they often lack comprehensive metrics to measure both detection and segmentation errors. This study presents a hybrid framework that combines deep learning and heuristic techniques to achieve accurate instance segmentation of individual plasma cells in Giemsa‐stained cytology images. Our proposed network, called cyto‐Knet, incorporates an innovative color‐balancing method as a preprocessing step to standardize the appearance of cytological images. Our network leverages a 4‐class segmentation strategy with conditional kernels to enhance segmentation performance and accuracy. Additionally, a marker‐based watershed algorithm is employed in the postprocessing step to address the challenge of merged objects. Extensive validation at both pixel and object‐based levels demonstrates superior performance compared with state‐of‐the‐art techniques. Our method achieves pixel‐based metrics (precision, recall, and F1‐score) of approximately 0.90. The object‐based evaluation reveals an average Dice coefficient of 0.9130 and an aggregated Jaccard index of 0.8237. Importantly, our solution is designed for integration into an end‐to‐end system for diagnosis support and can be easily extended to other applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/ima.22984"
    },
    {
        "id": 27770,
        "title": "Magnetic Resonance Images Segmentation of Multifidus based on Dense-unet\nand Superpixel",
        "authors": "Rui Xu, Xin Guo, Zimin Wang, Tingqiang Guan, Yue Zhou",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "\nBackground::\nLumbar disc herniation (LDH) is a common clinical condition causing lower back and leg pain. Accurate segmentation of the lumbar discs is\ncrucial for assessing and diagnosing LDH. Magnetic resonance imaging (MRI) can reveal the condition of articular cartilage. However, manual\nsegmentation of MRI images is burdensome for physicians and needs to be more efficient.\n\n\nObjective::\nIn this study, we propose a method that combines UNet and superpixel segmentation to address the problem of loss of detailed information in the\nfeature extraction phase, leading to poor segmentation results at object edges. The aim is to provide a reproducible solution for diagnosing patients\nwith lumbar disc herniation.\n\n\nMethods::\nWe suggest using the network structure of UNet. Firstly, dense blocks are inserted into the UNet network, and training is performed using the\nSwish activation function. The Dense-UNet model extracts semantic features from the images and obtains rough semantic segmentation results.\nThen, an adaptive-scale superpixel segmentation algorithm is applied to segment the input images into superpixel images. Finally, high-level\nabstract semantic features are fused with the detailed information of the superpixels to obtain edge-optimized semantic segmentation results.\n\n\nResults::\nEvaluation of a private dataset of multifidus muscles in magnetic resonance images demonstrates that compared to other segmentation algorithms,\nthis algorithm exhibits better semantic segmentation performance in detailed areas such as object edges. Compared to UNet, it achieves a 9.5%\nimprovement in the Dice Similarity Coefficient (DSC) and an 11.3% improvement in the Jaccard Index (JAC).\n\n\nConclusion::\nThe experimental results indicate that this algorithm improves segmentation performance while reducing computational complexity.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/0115734056280128240201081830"
    },
    {
        "id": 27771,
        "title": "Evaluation of an old-fashioned style picture transformation system using generative adversarial networks and instance segmentation",
        "authors": "hiraku matsuda, Mutsuo Sano",
        "published": "2023-3-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2666724"
    },
    {
        "id": 27772,
        "title": "Point-Supervised Single-Cell Segmentation via Collaborative Knowledge Sharing",
        "authors": "Ji Yu",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3312988"
    },
    {
        "id": 27773,
        "title": "Scale-aware dense residual retinal vessel segmentation network with multi-output weighted loss",
        "authors": "Jiwei Wu, Shibin Xuan",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "Abstract\nBackground\nRetinal vessel segmentation provides an important basis for determining the geometric characteristics of retinal vessels and the diagnosis of related diseases. The retinal vessels are mainly composed of coarse vessels and fine vessels, and the vessels have the problem of uneven distribution of coarse and fine vessels. At present, the common retinal blood vessel segmentation network based on deep learning can easily extract coarse vessels, but it ignores the more difficult to extract fine vessels.\n\nMethods\nScale-aware dense residual model, multi-output weighted loss and attention mechanism are proposed and incorporated into the U-shape network. The model is proposed to extract image features through residual module, and using a multi-scale feature aggregation method to extract the deep information of the network after the last encoder layer, and upsampling output at each decoder layer, compare the output results of each decoder layer with the ground truth separately to obtain multiple output losses, and the last layer of the decoder layers is used as the final prediction output.\n\nResult\nThe proposed network is tested on DRIVE and STARE. The evaluation indicators used in this paper are dice, accuracy, mIoU and recall rate. On the DRIVE dataset, the four indicators are respectively 80.40%, 96.67%, 82.14% and 88.10%; on the STARE dataset, the four indicators are respectively 83.41%, 97.39%, 84.38% and 88.84%.\n\nConclusion\nThe experiment result proves that the network in this paper has better performance, can extract more continuous fine vessels, and reduces the problem of missing segmentation and false segmentation to a certain extent.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12880-023-01061-y"
    },
    {
        "id": 27774,
        "title": "Dynamic Anchor Box-based Instance Decoding and Position-aware Instance Association for Online Video Instance Segmentation",
        "authors": "Hyun-Jin Chun, Incheol Kim",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5302/j.icros.2023.23.0086"
    },
    {
        "id": 27775,
        "title": "SkinSAM: adapting the segmentation anything model for skin cancer segmentation",
        "authors": "Mingzhe Hu, Yuheng Li, Xiaofeng Yang",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006837"
    },
    {
        "id": 27776,
        "title": "Vertebrae localization, segmentation and identification using a graph optimization and an anatomic consistency cycle",
        "authors": "Di Meng, Edmond Boyer, Sergi Pujades",
        "published": "2023-7",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102235"
    },
    {
        "id": 27777,
        "title": "Exploiting the Joint Potential of Instance Segmentation and Semantic Segmentation in Autonomous Driving",
        "authors": "Mohammed Usman, Thirumala Akash K, Mohammed Riyaz Ahmed, Raveendra Gudodagi, Nitesh Kumar T",
        "published": "2023-1-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080167"
    },
    {
        "id": 27778,
        "title": "Instance segmentation with pyramid integrated context for aerial objects",
        "authors": "",
        "published": "2023-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3837/tiis.2023.03.002"
    },
    {
        "id": 27779,
        "title": "Self-supervised contrastive learning with random walks for medical image segmentation with limited annotations",
        "authors": "Marc Fischer, Tobias Hepp, Sergios Gatidis, Bin Yang",
        "published": "2023-3",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2022.102174"
    },
    {
        "id": 27780,
        "title": "Radar Instance Transformer: Reliable Moving Instance Segmentation in Sparse Radar Point Clouds",
        "authors": "Matthias Zeller, Vardeep S. Sandhu, Benedikt Mersch, Jens Behley, Michael Heidingsfeld, Cyrill Stachniss",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tro.2023.3338972"
    },
    {
        "id": 27781,
        "title": "Dense rebar end face segmentation based on YOLACT_REBAR instance segmentation network",
        "authors": "Li Yuan, Yu Zhou, Hua Deng, Long Ouyang",
        "published": "2024-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3020960"
    },
    {
        "id": 27782,
        "title": "MP-Net: A Multi-Center Privacy-Preserving Network for Medical Image Segmentation",
        "authors": "Enjun Zhu, Haiyu Feng, Long Chen, Yongqiang Lai, Senchun Chai",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2024.3377248"
    },
    {
        "id": 27783,
        "title": "Optimization Technique Based Approach for Image Segmentation",
        "authors": "Manjula Poojary, Yarramalle Srinivas",
        "published": "2023-9",
        "citations": 0,
        "abstract": "\nObjective:\nThe study's goal was to diagnose the condition at an earlier stage by employing the\noptimization-based technique for image segmentation to find deformities in MRI and Aura images.\n\n\nMethods:\nOur methodology was based on two case studies. The diseased data set of MRI images obtained from\nthe UCI data set and Aura images from Bio-Well were taken into consideration. Using the Relevance Feedback\nMechanism (RFM), the sick images that are most pertinent are determined. The optimization-based Cuckoo\nSearch (CS) algorithm is used to find the best features. The resulting model utilising the Truncated Gaussian Mixture\nModel (TGMM) is used to compare the extracted characteristics. The most relevant images are chosen based\non the likely hood estimation.\n\n\nResults:\nThe suggested methodology is tested using 150 retrieved Aura images, 50 trained photos, and\nprocessing of the input image utilizing morphological techniques like dilation, erosion, opening, and\nclosing to improve the image quality. Together with segmentation quality measurements including\nGlobal Consistency Error (GCE), Probability Random Index (PRI), and Volume of Symmetry(VOS),\nthe results are assessed using image quality metrics such as Average Difference (AD), Maximum Difference\n(MD), and Image Fidelity (IF).\n\n\nConclusion:\nThe TGMM algorithm is used to conduct the experiment. The outcomes demonstrate the\neffectiveness of the suggested approaches in locating various injured tissues inside medical images obtained\nusing MRI technology as well as in locating high-intensity energy zones in which a potential deformity\nis associated in Aura images. The outcomes reveal a respectable recognition accuracy of about 93%.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405619666221104161441"
    },
    {
        "id": 27784,
        "title": "Non-local Dense RepPoints for Instance Segmentation in Remote Sensing",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18178/wcse.2023.06.019"
    },
    {
        "id": 27785,
        "title": "Self-Supervised Instance Segmentation by Grasping",
        "authors": "YuXuan Liu, Xi Chen, Pieter Abbeel",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iros55552.2023.10342432"
    },
    {
        "id": 27786,
        "title": "Instance Segmentation Combined CMT and Swin Transformer in Driving Scenes",
        "authors": "Zhengyi Zha",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccece58074.2023.10135453"
    },
    {
        "id": 27787,
        "title": "An amalgamation of vision transformer with convolutional neural network for automatic lung tumor segmentation",
        "authors": "Shweta Tyagi, Devidas T. Kushnure, Sanjay N. Talbar",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102258"
    },
    {
        "id": 27788,
        "title": "Image- and Instance-Level Data Augmentation for Occluded Instance Segmentation",
        "authors": "Jun Yu, Shenshen Du, Ruiqiang Yang, Lei Wang, Minchuan Chen, Qingying Zhu, Shaojun Wang, Jing Xiao",
        "published": "2023-10-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3606038.3616166"
    },
    {
        "id": 27789,
        "title": "Automatic tooth periodontal ligament segmentation of cone beam computed tomography based on instance segmentation network",
        "authors": "Sha Su, Xueting Jia, Liping Zhan, Siyuan Gao, Qing Zhang, Xiaofeng Huang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.heliyon.2024.e24097"
    },
    {
        "id": 27790,
        "title": "Segmentation of Brain MRI Images Using Multi-Kernel FCM EHO Method",
        "authors": "Sreedhar Kollem, Ch Rajendra Prasad, J Ajayan, Sreejith S, LMI Leo Joseph, Patteti Krishna",
        "published": "2023-8-22",
        "citations": 0,
        "abstract": "\nBackground:\nIn image processing, image segmentation is a more challenging task due to different shapes, locations, image intensities, etc. Brain tumors are one of the most common diseases in the world. So, the detection and segmentation of brain tumors are important in the medical field.\n\n\nObjective:\nThe primary goal of this work is to use the proposed methodology to segment brain MRI images into tumor and non-tumor segments or pixels.\n\n\nMethods:\nIn this work, we first selected the MRI medical images from the BraTS2020 database and transferred them to the contrast enhancement phase. Then, we applied thresholding for contrast enhancement to enhance the visibility of structures like blood arteries, tumors, or abnormalities. After the contrast enhancement process, the images were transformed into the image denoising phase. In this phase, a fourth-order partial differential equation was used for image denoising. After the image denoising process, these images were passed on to the segmentation phase. In this segmentation phase, we used an elephant herding algorithm for centroid optimization and then applied the multi-kernel fuzzy c-means clustering for image segmentation.\n\n\nResults:\nPeak signal-to-noise ratio, mean square error, sensitivity, specificity, and accuracy were used to assess the performance of the proposed methods. According to the findings, the proposed strategy produced better outcomes than the conventional methods.\n\n\nConclusion:\nOur proposed methodology was reported to be a more effective technique than existing techniques.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230822114029"
    },
    {
        "id": 27791,
        "title": "MLP-UNEXT for brain metastasis detection and segmentation in multiparametric MRI",
        "authors": "Yuheng Li, Chih-Wei Chang, Xiaofeng Yang",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006802"
    },
    {
        "id": 27792,
        "title": "Automated Data Labeling for Object Detection via Iterative Instance Segmentation",
        "authors": "Jinyoon Kim, Md Faisal Kabir",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00124"
    },
    {
        "id": 27793,
        "title": "Semantic-Based Clustering for 3D Instance Segmentation In Sparse Radar Point Clouds",
        "authors": "Qingwen Yuan",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdp59959.2023.00041"
    },
    {
        "id": 27794,
        "title": "VB-SOLO: single-stage instance segmentation of overlapping epithelial cells",
        "authors": "Lichuan Li, Wei Chen, Jie Qi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2024.3387832"
    },
    {
        "id": 27795,
        "title": "Deep Learning-Based Instance Segmentation of Aircraft in Aerial Images using Detectron2",
        "authors": "Akshayanivashini C V, Krisvanth P",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4485468"
    },
    {
        "id": 27796,
        "title": "Contour-Assisted Long-Range Perceptual Network for Camouflaged Instance Segmentation",
        "authors": "Junjie Cui, Fengming Sun, Xia Yuan",
        "published": "2023-10-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icip49359.2023.10221951"
    },
    {
        "id": 27797,
        "title": "All answers are in the images: A review of deep learning for cerebrovascular segmentation",
        "authors": "Cheng Chen, Kangneng Zhou, Zhiliang Wang, Qian Zhang, Ruoxiu Xiao",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102229"
    },
    {
        "id": 27798,
        "title": "Why complete medical data curation matters: challenges faced while comparing two deep-learning-based CT segmentation methods",
        "authors": "Haoqi Wang, Mia Markey, Nicolas Pannetier, Mehul Sampat",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3009174"
    },
    {
        "id": 27799,
        "title": "Cerebrovascular segmentation in phase-contrast magnetic resonance angiography by a Radon projection composition network",
        "authors": "Wenhai Weng, Hui Ding, Jianjun Bai, Wenjing Zhou, Guangzhi Wang",
        "published": "2023-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102228"
    },
    {
        "id": 27800,
        "title": "Improving abdominal image segmentation with overcomplete shape priors",
        "authors": "Amine Sadikine, Bogdan Badic, Jean-Pierre Tasu, Vincent Noblet, Pascal Ballet, Dimitris Visvikis, Pierre-Henri Conze",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102356"
    },
    {
        "id": 27801,
        "title": "Information maximized U-Nets for vestibular schwannoma segmentation using MRI with missing modality",
        "authors": "Mojtaba Safari, Xiaofeng Yang, Ali Fatemi",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3000647"
    },
    {
        "id": 27802,
        "title": "BoxSnake: Polygonal Instance Segmentation with Box Supervision",
        "authors": "Rui Yang, Lin Song, Yixiao Ge, Xiu Li",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00077"
    },
    {
        "id": 27803,
        "title": "Deep Learning Method for Heliostat Instance Segmentation",
        "authors": "Benjamin Liu, Alexander Sonn, Anthony Roy, Brian Brewington",
        "published": "2024-2-2",
        "citations": 0,
        "abstract": "Heliostat instance segmentation (HST-IS) is a crucial component of the heliostat tracking system at Heliogen’s Lancaster test facility. The system estimates the mirror normal of each heliostat by performing a nonlinear optimization-based fitting strategy using approximations of the non-shaded, non-blocked sunlit pixels on each heliostat, and the tracking system uses these estimates to improve performance.\r\nHST-IS is fundamentally challenging due to variability in lighting conditions and heliostat size relative to the capturing camera. Deep learning-based convolutional neural networks (CNN) have emerged in recent years by demonstrating noteworthy precision in tasks such as object recognition, detection, and segmentation. CNN-based methods offer a robust augmentation to HST-IS methods as they capture a context-less hierarchy of image features.\r\nIn this study, we developed deep learning models to automatically segment heliostat instances from elevated images taken from the field. We study various image parameters and architectural customizations to optimize for scalability, robustness, and accuracy in our predictions. We perform robust evaluations of our best model to quantify gaps between model development and real-world deployment and provide evidence for utility in the field.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52825/solarpaces.v1i.735"
    },
    {
        "id": 27804,
        "title": "CATS v2: hybrid encoders for robust medical segmentation",
        "authors": "Hao Li, Han Liu, Dewei Hu, Xing Yao, Jiacheng Wang, Ipek Oguz",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006820"
    },
    {
        "id": 27805,
        "title": "ADC-Net: adaptive detail compensation network for prostate segmentation in 3D transrectal ultrasound images",
        "authors": "Mengqing Liu, Kaizhi Wu, Liping Jiang",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2652048"
    },
    {
        "id": 27806,
        "title": "Medical volume segmentation by overfitting sparsely annotated data",
        "authors": "Tristan Payer, Faraz Nizamani, Meinrad Beer, Michael Götz, Timo Ropinski",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.4.044007"
    },
    {
        "id": 27807,
        "title": "CaraNet: context axial reverse attention network for segmentation of small medical objects",
        "authors": "Ange Lou, Shuyue Guan, Murray Loew",
        "published": "2023-2-18",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jmi.10.1.014005"
    },
    {
        "id": 27808,
        "title": "Self-supervised-RCNN for medical image segmentation with limited data annotation",
        "authors": "Banafshe Felfeliyan, Nils D. Forkert, Abhilash Hareendranathan, David Cornel, Yuyue Zhou, Gregor Kuntze, Jacob L. Jaremko, Janet L. Ronsky",
        "published": "2023-10",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102297"
    },
    {
        "id": 27809,
        "title": "Correspondence-based Generative Bayesian Deep Learning for semi-supervised volumetric medical image segmentation",
        "authors": "Yuzhou Zhao, Xinyu Zhou, Tongxin Pan, Shuyong Gao, Wenqiang Zhang",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102352"
    },
    {
        "id": 27810,
        "title": "DIM: long-tailed object detection and instance segmentation via dynamic instance memory",
        "authors": "Zhao-Min Chen, Xin Jin, Xiaoqin Zhang, Chaoqun Xia, Zhiyong Pan, Ruoxi Deng, Jie Hu, Heng Chen",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Abstract\nObject detection and instance segmentation have been successful on benchmarks with relatively balanced category distribution (e.g. MSCOCO). However, state-of-the-art object detection and segmentation methods still struggle to generalize on long-tailed datasets (e.g. LVIS), where a few classes (head classes) dominate the instance samples, while most classes (tailed classes) have only a few samples. To address this challenge, we propose a plug-and-play module within the Mask R-CNN framework called dynamic instance memory (DIM). Specifically, we augment Mask R-CNN with an auxiliary branch for training. It maintains a dynamic memory bank storing an instance-level prototype representation for each category, and shares the classifier with the existing instance branch. With a simple metric loss, the representations in DIM can be dynamically updated by the instance proposals in the mini-batch during training. Our DIM introduces a bias toward tailed classes to the classifier learning along with a class frequency reversed sampler, which learns generalizable representations from the original data distribution, complementing the existing instance branch. Comprehensive experiments on LVIS demonstrate the effectiveness of DIM, as well as the significant advantages of DIM over the baseline Mask R-CNN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2632-2153/acf362"
    },
    {
        "id": 27811,
        "title": "Application of deep learning in medical imaging segmentation",
        "authors": "Keke Huang",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "The increasing demand for segmentation of lesions in medical images necessitates research on automatic segmentation. Manual segmentation is inefficient due to training time and energy constraints. Deep learning-based image segmentation technology can improve efficiency and aid in diagnosing conditions. This technology provides accurate and detailed data support for clinical medicine, making it a crucial field in medical image processing. This essay introduces image segmentation and its classification, and explains the differences between two segmentation methods, semantic segmentation and instance segmentation and their respective application fields. Additionally, it introduces several well-known deep neural networks for segmenting medical images using deep learning. Regarding the models, this article introduces the structure and characteristics of each model as well as their respective advantages and disadvantages. This essay also introduces examples of deep learning using different deep neural network models to segment specific medical images, including image segmentation based on FCN for the heart and U-Net for the kidneys.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/17/20240702"
    },
    {
        "id": 27812,
        "title": "Multi-part deviation assessment in ship assembly structures through instance segmentation",
        "authors": "Jian Liu, Deyu Wang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.oceaneng.2024.116941"
    },
    {
        "id": 27813,
        "title": "Diffusioninst: Diffusion Model for Instance Segmentation",
        "authors": "Zhangxuan Gu, Haoxing Chen, Zhuoer Xu",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10447191"
    },
    {
        "id": 27814,
        "title": "CylinGCN: Cylindrical structures segmentation in 3D biomedical optical imaging by a contour-based graph convolutional network",
        "authors": "Zhichao Liang, Shuangyang Zhang, Anqi Wei, Zhenyang Liu, Yang Wang, Haoyu Hu, Wufan Chen, Li Qi",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102316"
    },
    {
        "id": 27815,
        "title": "Marine Debris Detection Model with Custom Dataset Using Instance Segmentation",
        "authors": "Ariful Islam, Kang Dongshik",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvmi59935.2023.10464964"
    },
    {
        "id": 27816,
        "title": "SortedAP: Rethinking evaluation metrics for instance segmentation",
        "authors": "Long Chen, Yuli Wu, Johannes Stegmaier, Dorit Merhof",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00424"
    },
    {
        "id": 27817,
        "title": "Evaluation of multi-modal image segmentation for radiotherapy planning",
        "authors": "Sreeja Malladi, Sanket Purohit, Advait Brahme, Julia A. Scott",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3023419"
    },
    {
        "id": 27818,
        "title": "Deep learning-based head and neck segmentation in CT angiography",
        "authors": "Prakhar Prakash, Theodore Colwell, Mara Noskowiak, Michail Fanariotis, Sandeep Dutta",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006798"
    },
    {
        "id": 27819,
        "title": "Privacy-Preserving Synthetic Continual Semantic Segmentation for Robotic Surgery",
        "authors": "Mengya Xu, Mobarakol Islam, Long Bai, Hongliang Ren",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2024.3364969"
    },
    {
        "id": 27820,
        "title": "ANet: Nuclei Instance Segmentation and Classification with Attention-Based Network",
        "authors": "Mukul Kadaskar, Nagamma Patil",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-024-02661-3"
    },
    {
        "id": 27821,
        "title": "Improved Block Merging for 3D Point Cloud Instance Segmentation",
        "authors": "Leon Denis, Remco Royen, Adrian Munteanu",
        "published": "2023-6-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsp58604.2023.10167976"
    },
    {
        "id": 27822,
        "title": "Point Cloud Instance Segmentation with Inaccurate Bounding-Box Annotations",
        "authors": "Yinyin Peng, Hui Feng, Tao Chen, Bo Hu",
        "published": "2023-2-20",
        "citations": 0,
        "abstract": "Most existing point cloud instance segmentation methods require accurate and dense point-level annotations, which are extremely laborious to collect. While incomplete and inexact supervision has been exploited to reduce labeling efforts, inaccurate supervision remains under-explored. This kind of supervision is almost inevitable in practice, especially in complex 3D point clouds, and it severely degrades the generalization performance of deep networks. To this end, we propose the first weakly supervised point cloud instance segmentation framework with inaccurate box-level labels. A novel self-distillation architecture is presented to boost the generalization ability while leveraging the cheap but noisy bounding-box annotations. Specifically, we employ consistency regularization to distill self-knowledge from data perturbation and historical predictions, which prevents the deep network from overfitting the noisy labels. Moreover, we progressively select reliable samples and correct their labels based on the historical consistency. Extensive experiments on the ScanNet-v2 dataset were used to validate the effectiveness and robustness of our method in dealing with inexact and inaccurate annotations.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23042343"
    },
    {
        "id": 27823,
        "title": "Exemplar-FreeSOLO: Enhancing Unsupervised Instance Segmentation with Exemplars",
        "authors": "Taoseef Ishtiak, Qing En, Yuhong Guo",
        "published": "2023-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01480"
    },
    {
        "id": 27824,
        "title": "A study of attention information from transformer layers in hybrid medical image segmentation networks",
        "authors": "Syed Nouman Hasany, Caroline Petitjean, Fabrice Meriaudeau",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2652215"
    },
    {
        "id": 27825,
        "title": "LE-UDA: Label-Efficient Unsupervised Domain Adaptation for Medical Image Segmentation",
        "authors": "Ziyuan Zhao, Fangcheng Zhou, Kaixin Xu, Zeng Zeng, Cuntai Guan, S. Kevin Zhou",
        "published": "2023-3",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2022.3214766"
    },
    {
        "id": 27826,
        "title": "Invasion depth estimation of carcinoma cells using adaptive stain normalization to improve epidermis segmentation accuracy",
        "authors": "Md. Ziaul Hoque, Anja Keskinarkaus, Pia Nyberg, Hongming Xu, Tapio Seppänen",
        "published": "2023-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102276"
    },
    {
        "id": 27827,
        "title": "Deep-active-learning approach towards accurate right ventricular segmentation using a two-level uncertainty estimation",
        "authors": "Asma Ammari, Ramzi Mahmoudi, Badii Hmida, Rachida Saouli, Mohamed Hedi Bedoui",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2022.102168"
    },
    {
        "id": 27828,
        "title": "Bilateral Supervision Network for Semi-supervised Medical Image Segmentation",
        "authors": "Along He, Tao Li, Juncheng Yan, Kai Wang, Huazhu Fu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3347689"
    },
    {
        "id": 27829,
        "title": "Unsupervised Domain Adaptation for Medical Image Segmentation Using Transformer With Meta Attention",
        "authors": "Wen Ji, Albert C. S. Chung",
        "published": "2024-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3322581"
    },
    {
        "id": 27830,
        "title": "A literature survey of MR-based brain tumor segmentation with missing modalities",
        "authors": "Tongxue Zhou, Su Ruan, Haigen Hu",
        "published": "2023-3",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2022.102167"
    },
    {
        "id": 27831,
        "title": "Segmentation of Marine Targets Instance Based on Improved Mask R-CNN",
        "authors": "Dexin Xu, Xiaowei Zhu, Zhaohua Wang",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icma57826.2023.10215999"
    },
    {
        "id": 27832,
        "title": "A Pose Estimation Method Combining Instance Segmentation and Point Pair Features",
        "authors": "Yu Xin, Hao Peng",
        "published": "2023-4-9",
        "citations": 0,
        "abstract": "For the traditional pose estimation method based on point pair features, both the preprocessing of scene point cloud and the construction of point pair features of scene point cloud have serious time-consuming problems, which cannot meet the needs of actual industry. Therefore, this paper proposes a pose estimation method that combines instance segmentation and point pair features. Therefore, this paper proposes a pose estimation method that combines instance segmentation and point pair features. First, use the Mask R-CNN-based instance segmentation network to obtain the location of the target object in the two-dimensional image of the scene; then, obtain the local point cloud data of the space where the target object is located from this position and the depth information of the scene; finally, the local the point cloud data is used as the scene point cloud based on point pair feature pose estimation to perform feature matching with the point cloud of the target object.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7753/ijcatr1204.1010"
    },
    {
        "id": 27833,
        "title": "QR code beautification by instance segmentation (IS-QR)",
        "authors": "Min-Jen Tsai, Shao-Lun Peng",
        "published": "2023-3",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dsp.2022.103887"
    },
    {
        "id": 27834,
        "title": "Adaptive Entropy Regularization for Unsupervised Domain Adaptation in Medical Image Segmentation",
        "authors": "Andrew Shi, Wei Feng",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230637"
    },
    {
        "id": 27835,
        "title": "A lightweight multi-modality medical image semantic segmentation network base on the novel UNeXt and Wave-MLP",
        "authors": "Yi He, Zhijun Gao, Yi Li, Zhiming Wang",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102311"
    },
    {
        "id": 27836,
        "title": "ClickSAM: fine-tuning Segment Anything Model using click prompts for ultrasound image segmentation",
        "authors": "Aimee W. Guo, Grace Fei, Hemanth Pasupuleti, Jing Wang",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3005879"
    },
    {
        "id": 27837,
        "title": "Hierarchical Approach for Joint Semantic, Plant Instance, and Leaf Instance Segmentation in the Agricultural Domain",
        "authors": "Gianmarco Roggiolani, Matteo Sodano, Tiziano Guadagnino, Federico Magistri, Jens Behley, Cyrill Stachniss",
        "published": "2023-5-29",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160918"
    },
    {
        "id": 27838,
        "title": "THE APPLICATION OF ARTIFICIAL INTELLIGENCE ON SCAR SEGMENTATION IN CARDIAC MAGNETIC RESONANCE IMAGING: A SYSTEMATIC LITERATURE REVIEW",
        "authors": "Roslan Nurul Ashikin, Setiawan Agung Nugroho, Norzan Muhammad Ammar, Jasmin Nur Hayati",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jmir.2023.06.117"
    },
    {
        "id": 27839,
        "title": "Polyp-SAM: transfer SAM for polyp segmentation",
        "authors": "Yuheng Li, Mingzhe Hu, Xiaofeng Yang",
        "published": "2024-4-3",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006809"
    },
    {
        "id": 27840,
        "title": "Robust Engineering-based Unified Biomedical Imaging Framework for\nLiver Tumor Segmentation",
        "authors": "Hien Nguyen, Vuong Pham, Hai Nguyen, Bao Pham, Thien Nguyen",
        "published": "2023-1",
        "citations": 4,
        "abstract": "\nBackground:\nComputer vision in general and semantic segmentation has experienced\nmany achievements in recent years. Consequently, the emergence of medical imaging has provided\nnew opportunities for conducting artificial intelligence research. Since cancer is the second-leading\ncause of death in the world, early-stage diagnosis is an essential process that directly slows down\nthe development speed of cancer.\n\n\nMethods:\nDeep neural network-based methods are anticipated to reduce diagnosis time for pathologists.\n\n\nResults:\nIn this research paper, an approach to liver tumor identification based on two types of medical\nimages has been presented: computed tomography scans and whole-slide. It is constructed\nbased on the improvement of U-Net and GLNet architectures. It also includes sub-modules that are\ncombined with segmentation models to boost up the overall performance during inference phases.\n\n\nConclusion:\nBased on the experimental results, the proposed unified framework has been emerging\nto be used in the production environment.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405617666210804151024"
    },
    {
        "id": 27841,
        "title": "Adaptive loss engine for x-ray segmentation (ALEXS) for scoliosis intervention: assess digital segmentation and angle approximation",
        "authors": "Yunbo Shao, Shuo Li",
        "published": "2024-3-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3008795"
    },
    {
        "id": 27842,
        "title": "Reimagining 3D Visual Grounding: Instance Segmentation and Transformers for Fragmented Point Cloud Scenarios",
        "authors": "Zehan Tan, Weidong Yang, Zhiwei Wang",
        "published": "2023-12-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3595916.3626405"
    },
    {
        "id": 27843,
        "title": "Developing an enhanced UNet-based architecture for breast tumor segmentation in ultrasound images",
        "authors": "Donya Khaledyan, Thomas J. Marini, Avice O’Connell, Kevin Parker",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006770"
    },
    {
        "id": 27844,
        "title": "Ultra-TransUNet: ultrasound segmentation framework with spatial-temporal context feature fusion",
        "authors": "Bowen Li, Zongwei Zhou, Alan L. Yuille, Max Allan, Jonathan McLeod",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006940"
    },
    {
        "id": 27845,
        "title": "Occlusion Resilient Similar-Colored Separable Food Item Instance Segmentation",
        "authors": "Rukshan Karannagoda, Yomal Perera, Dion Weiman, Subha Fernando",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitr61062.2023.10382804"
    },
    {
        "id": 27846,
        "title": "Instance Segmentation-Based Markerless Tracking of Fencing Sword Tips",
        "authors": "Takehiro Sawahata, Alessandro Moro, Sarthak Pathak, Kazunori Umeda",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sii58957.2024.10417603"
    },
    {
        "id": 27847,
        "title": "Zero-shot Unsupervised Transfer Instance Segmentation",
        "authors": "Gyungin Shin, Samuel Albanie, Weidi Xie",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvprw59228.2023.00513"
    },
    {
        "id": 27848,
        "title": "Video Instance Segmentation via Spatial Feature Enhancement and Temporal Fusion",
        "authors": "Hongyu Zhu, Chen Li, Baoqing Zhang, Guang Yang",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acie61839.2024.00017"
    },
    {
        "id": 27849,
        "title": "Guided Distillation for Semi-Supervised Instance Segmentation",
        "authors": "Tariq Berrada, Camille Couprie, Karteek Alahari, Jakob Verbeek",
        "published": "2024-1-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00053"
    },
    {
        "id": 27850,
        "title": "CoDA-Few: Few Shot Domain Adaptation for Medical Image Semantic Segmentation",
        "authors": "Arthur Pinto, Jefersson Santos, Hugo Oliveira, Alexei Machado",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011616800003417"
    },
    {
        "id": 27851,
        "title": "Self-Training with High-Dimensional Markers for Cell Instance Segmentation",
        "authors": "Kuang-Cheng Lo, Cheng-Wei Lin, Hsin-Ying Lee, Hao Hsu, Winston H. Hsu, Tung-Hung Su, Shih-Yu Chen, Yung-Ming Jeng",
        "published": "2023-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230837"
    },
    {
        "id": 27852,
        "title": "Using simulated breast lesions based on Perlin noise for evaluation of lesion segmentation",
        "authors": "Hanna Tomic, Zhikai Yang, Anders Tingberg, Sophia Zackrisson, Rodrigo Moreno, Örjan Smedby, Magnus Dustler, Predrag Bakic",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3008840"
    },
    {
        "id": 27853,
        "title": "Multi-modal medical Transformers: A meta-analysis for medical image segmentation in oncology",
        "authors": "Gustavo Andrade-Miranda, Vincent Jaouen, Olena Tankyevych, Catherine Cheze Le Rest, Dimitris Visvikis, Pierre-Henri Conze",
        "published": "2023-12",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102308"
    },
    {
        "id": 27854,
        "title": "Research on Improved Attentional Video Instance Segmentation Algorithm",
        "authors": "Wen Zhang, Konghao Mei, Zhexuan Sun, Guangkun Chen, Shengrong Lv",
        "published": "2023-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icma57826.2023.10215956"
    },
    {
        "id": 27855,
        "title": "Feature Alignment and Contrastive Learning for Dense Instance Segmentation",
        "authors": "Feng He, Ziyang Rong, Yehao Jiang, Fuchuan Ni",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cccai59026.2023.00018"
    },
    {
        "id": 27856,
        "title": "Weakly supervised airway orifice segmentation in video bronchoscopy",
        "authors": "Ron Keuth, Mattias Heinrich, Martin Eichenlaub, Marian Himstedt",
        "published": "2023-4-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654229"
    },
    {
        "id": 27857,
        "title": "Developing classification and segmentation algorithms for GAN-generated mammographic artifacts based on radiologist annotation",
        "authors": "Tamerlan Mustafaev, Robert Nishikawa, Juhun Lee",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3023223"
    },
    {
        "id": 27858,
        "title": "Federated learning: how the world's biggest federation is training state-of-the-art brain tumor segmentation models",
        "authors": "Prashant Shah",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2660864"
    },
    {
        "id": 27859,
        "title": "3D Vascular Segmentation Supervised by 2D Annotation of Maximum Intensity Projection",
        "authors": "Zhanqiang Guo, Zimeng Tan, Jianjiang Feng, Jie Zhou",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2024.3362847"
    },
    {
        "id": 27860,
        "title": "Evaluation Of An Algorithm For The Segmentation Of Lung Nodules In Computerized Tomography Images Based On The Automatic Location Of A Threshold",
        "authors": "Enguo Wang, Jun Li, Lei Liu, Yankun Liu",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "\nBACKGROUND:\nEarly detection of pulmonary nodules is critical for the clinical diagnosis and management of pulmonary nodules. Computed tomography imaging is currently the best imaging method for detecting pulmonary nodules.\n\n\nOBJECTIVE:\nThis study proposes and applies a new thresholding-based method for identifying pulmonary nodules in computed tomography images.\n\n\nMETHODS:\nThe proposed method involves segmenting the lung volume and identifying candidate nodules based on their intensity levels, which are higher than those of the lung parenchyma. Reference points on the histogram curve are used to determine a threshold value, and filtering by geometric characteristics is applied to reduce false positives. The performance of the proposed method is evaluated on a training set consisting of 35 nodules distributed among 16 cases with ground truth using the SPIE-AAPM Lung CT Challenge Database and ELCAP Public Lung Image Database.\n\n\nRESULTS:\nThe proposed method shows a significant reduction in false positives, filtering from an average of 12,380 candidate nodules to 19 detected nodules. The method also demonstrates a sensitivity of 88.6% for detecting pulmonary nodules with an error of 1 nodule in cases where complete detection is not reached.\n\n\nCONCLUSION:\nThe proposed thresholding-based method improves the sensitivity of identifying pulmonary nodules in computed tomography images while reducing false positives.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/1573405620666230801125013"
    },
    {
        "id": 27861,
        "title": "Knowledge distillation on individual vertebrae segmentation exploiting 3D U-Net",
        "authors": "Luís Serrador, Francesca Pia Villani, Sara Moccia, Cristina P. Santos",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102350"
    },
    {
        "id": 27862,
        "title": "Dual-task kidney MR segmentation with transformers in autosomal-dominant polycystic kidney disease",
        "authors": "Pierre-Henri Conze, Gustavo Andrade-Miranda, Yannick Le Meur, Emilie Cornec-Le Gall, François Rousseau",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102349"
    },
    {
        "id": 27863,
        "title": "A transformer-based pyramid network for coronary calcified plaque segmentation in intravascular optical coherence tomography images",
        "authors": "Yiqing Liu, Farhad R. Nezami, Elazer R. Edelman",
        "published": "2024-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2024.102347"
    },
    {
        "id": 27864,
        "title": "Boundary-enhanced semi-supervised retinal layer segmentation in optical coherence tomography images using fewer labels",
        "authors": "Ye Lu, Yutian Shen, Xiaohan Xing, Chengwei Ye, Max Q.-H. Meng",
        "published": "2023-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102199"
    },
    {
        "id": 27865,
        "title": "Investigation and benchmarking of U-Nets on prostate segmentation tasks",
        "authors": "Shrajan Bhandary, Dejan Kuhn, Zahra Babaiee, Tobias Fechter, Matthias Benndorf, Constantinos Zamboglou, Anca-Ligia Grosu, Radu Grosu",
        "published": "2023-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102241"
    },
    {
        "id": 27866,
        "title": "Self and mixed supervision to improve training labels for multi-class medical image segmentation",
        "authors": "Jianfei Liu, Christopher Parnell, Ronald M. Summers",
        "published": "2024-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3008782"
    },
    {
        "id": 27867,
        "title": "Discriminative 3D Shape Modeling for Few-Shot Instance Segmentation",
        "authors": "Anoop Cherian, Siddarth Jain, Tim K. Marks, Alan Sullivan",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icra48891.2023.10160644"
    },
    {
        "id": 27868,
        "title": "Instance Segmentation of Dislocations in TEM Images",
        "authors": "Karina Ruzaeva, Kishan Govind, Marc Legros, Stefan Sandfeld",
        "published": "2023-7-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nano58406.2023.10231169"
    },
    {
        "id": 27869,
        "title": "A general approach to improve adversarial robustness of DNNs for medical image segmentation and detection",
        "authors": "Linhai Ma, Jiasong Chen, Linchen Qian, Liang Liang",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006534"
    },
    {
        "id": 27870,
        "title": "Lifelong learning with dynamic convolutions for glioma segmentation from multi-modal MRI",
        "authors": "Subhashis Banerjee, Robin Strand",
        "published": "2023-4-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654200"
    },
    {
        "id": 27871,
        "title": "Amodal Intra-class Instance Segmentation: Synthetic Datasets and Benchmark",
        "authors": "Jiayang Ao, Qiuhong Ke, Krista A. Ehinger",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00035"
    },
    {
        "id": 27872,
        "title": "Research on trash detection based on instance segmentation",
        "authors": "Yu Sheng, Ye Fei",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2684267"
    },
    {
        "id": 27873,
        "title": "Architecture Heritage Recognition Using YOLACT Instance Segmentation",
        "authors": "Deepak Kumar, Vinay Kukreja, Anuj kumar Jain, Ankit Bansal",
        "published": "2023-8-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icirca57980.2023.10220587"
    },
    {
        "id": 27874,
        "title": "Satellite Image Augmentation Via Seamless Instance Blending For Building Damage Segmentation",
        "authors": "Sebastian Gapp, Nina Merkle, Corentin Henry",
        "published": "2023-7-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/igarss52108.2023.10282254"
    },
    {
        "id": 27875,
        "title": "A Contour-Based Instance Segmentation Method for Copper Tube",
        "authors": "Deyu Chen, Shiwen Xie, Yongfang Xie",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450490"
    },
    {
        "id": 27876,
        "title": "OSIS: Efficient One-Stage Network for 3D Instance Segmentation",
        "authors": "Chuan Tang, Xi Yang",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icvr57957.2023.10169430"
    },
    {
        "id": 27877,
        "title": "Instance-Specific Feature Propagation for Referring Segmentation",
        "authors": "Chang Liu, Xudong Jiang, Henghui Ding",
        "published": "2023",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmm.2022.3163578"
    },
    {
        "id": 27878,
        "title": "Hard Example Mining-based Training Strategy for Pointly-Supervised Instance Segmentation",
        "authors": "Yanqi Liu, Zongqing Lu",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424879"
    },
    {
        "id": 27879,
        "title": "Distance Estimation Approach for Maritime Traffic Surveillance Using Instance Segmentation",
        "authors": "Miro Petković, Igor Vujović",
        "published": "2023-12-28",
        "citations": 0,
        "abstract": "Maritime traffic monitoring systems are particularly important in Mediterranean ports, as they provide more comprehensive data collection compared to traditional systems such as the Automatic Identification System (AIS), which is not mandatory for all vessels. This paper improves the existing real-time maritime traffic monitoring systems by introducing a distance estimation algorithm for monocular cameras, which aims to provide high quality maritime traffic metadata collection for traffic density analysis. Two distance estimation methods based on a pinhole camera model are presented: the Vessel-Focused Distance Estimation (VFDE) and the novel Vessel Object-Focused Distance Estimation (VOFDE). While VFDE uses the predefined height of a vessel for distance estimation, VOFDE uses standardized dimensions of objects on the vessel, detected with a Convolutional Neural Network (CNN) for instance segmentation to enhance estimation accuracy. Our evaluation covers distances up to 414 m, which is significantly beyond the scope of previous studies. When compared to the distances measured with a precise instrument, VOFDE achieves a Percentage Deviation Index (PDI) of 1.34% to 9.45%. This advance holds significant potential for improving maritime surveillance with monocular cameras and is also applicable in other areas, such as low-cost maritime vehicles equipped with single cameras.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse12010078"
    },
    {
        "id": 27880,
        "title": "Street tree segmentation from mobile laser scanning data using deep learning-based image instance segmentation",
        "authors": "Qiujie Li, Yu Yan",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ufug.2023.128200"
    },
    {
        "id": 27881,
        "title": "RECIST-Induced Reliable Learning: Geometry-Driven Label Propagation for Universal Lesion Segmentation",
        "authors": "Lianyu Zhou, Lequan Yu, Liansheng Wang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3294824"
    },
    {
        "id": 27882,
        "title": "Pipeline for automatic segmentation of multiparametric MRI data in a rat model of ischemic stroke",
        "authors": "Duoyao Liang, Marlène Wiart, Fabien Chauveau, Thomas Grenier",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006149"
    },
    {
        "id": 27883,
        "title": "Attention-based CT scan interpolation for lesion segmentation of colorectal liver metastases",
        "authors": "Mohammad Hamghalam, Richard Do, Amber L. Simpson",
        "published": "2023-4-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2656072"
    },
    {
        "id": 27884,
        "title": "Robust Prototypical Few-Shot Organ Segmentation With Regularized Neural-ODEs",
        "authors": "Prashant Pandey, Mustafa Chasmai, Tanuj Sur, Brejesh Lall",
        "published": "2023-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2023.3258069"
    },
    {
        "id": 27885,
        "title": "MuRCL: Multi-Instance Reinforcement Contrastive Learning for Whole Slide Image Classification",
        "authors": "Zhonghang Zhu, Lequan Yu, Wei Wu, Rongshan Yu, Defu Zhang, Liansheng Wang",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2022.3227066"
    },
    {
        "id": 27886,
        "title": "Complete Instances Mining for Weakly Supervised Instance Segmentation",
        "authors": "Zecheng Li, Zening Zeng, Yuqi Liang, Jin-Gang Yu",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Weakly supervised instance segmentation (WSIS) using only image-level labels is a challenging task due to the difficulty of aligning coarse annotations with the finer task. However, with the advancement of deep neural networks (DNNs), WSIS has garnered significant attention. Following a proposal-based paradigm, we encounter a redundant segmentation problem resulting from a single instance being represented by multiple proposals. For example, we feed a picture of a dog and proposals into the network and expect to output only one proposal containing a dog, but the network outputs multiple proposals. To address this problem, we propose a novel approach for WSIS that focuses on the online refinement of complete instances through the use of MaskIoU heads to predict the integrity scores of proposals and a Complete Instances Mining (CIM) strategy to explicitly model the redundant segmentation problem and generate refined pseudo labels. Our approach allows the network to become aware of multiple instances and complete instances, and we further improve its robustness through the incorporation of an Anti-noise strategy. Empirical evaluations on the PASCAL VOC 2012 and MS COCO datasets demonstrate that our method achieves state-of-the-art performance with a notable margin. Our implementation will be made available at https://github.com/ZechengLi19/CIM.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/127"
    },
    {
        "id": 27887,
        "title": "Domain generalization for robust MS lesion segmentation",
        "authors": "Huahong Zhang, Hao Li, Kathleen Larson, Kilian Hett, Ipek Oguz",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654373"
    },
    {
        "id": 27888,
        "title": "Deep angiogram: trivializing retinal vessel segmentation",
        "authors": "Dewei Hu, Xing Yao, Jiacheng Wang, Yuankai Kenny Tao, Ipek Oguz",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2654214"
    },
    {
        "id": 27889,
        "title": "Mixing Data Augmentation with Preserving Foreground Regions in Medical Image Segmentation",
        "authors": "Xiaoqing Liu, Kenji Ono, Ryoma Bise",
        "published": "2023-4-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230495"
    },
    {
        "id": 27890,
        "title": "Microwave Medical Image Segmentation for Brain Stroke Diagnosis: Imaging-Process-Informed Image Processing",
        "authors": "Chenghui Liu, Zheng Gong, Yifan Chen, Shuaiting Yao",
        "published": "2023-5-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ismict58261.2023.10152073"
    },
    {
        "id": 27891,
        "title": "Deep Learning for Image Segmentation: A Focus on Medical Imaging",
        "authors": "Ali F. Khalifa, Eman Badr",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.035888"
    },
    {
        "id": 27892,
        "title": "The effects of sparsity induction methods on attention-based multiple instance learning applied to Camelyon16",
        "authors": "Thomas E. Tavolara, Metin N. Gurcan, M. Khalid Khan Niazi",
        "published": "2023-4-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2653885"
    },
    {
        "id": 27893,
        "title": "Vertebral segmentation without training using differentiable appearance modeling of a deformable spine template",
        "authors": "Hyunsoo Kim, Jinah Park",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006602"
    },
    {
        "id": 27894,
        "title": "SEA-NET: medical image segmentation network based on spiral squeeze-and-excitation and attention modules",
        "authors": "Liangli Xiong, Chen Yi, Qiliang Xiong, Shaofeng Jiang",
        "published": "2024-1-11",
        "citations": 0,
        "abstract": "Abstract\nBackground\nMedical image segmentation is an important processing step in most of medical image analysis. Thus, high accuracy and robustness are required for them. The current deep neural network based medical segmentation methods have good effect on image with balanced foreground and background, but it will loss the characteristics of small targets on image with imbalanced foreground and background after multiple convolutions.\n\nMethods\nIn order to retain the features of small targets in the deep network, we proposed a new medical image segmentation model based on the U-Net with squeeze-and-excitation and attention modules which form a spiral closed path,callled as Spiral Squeeze-and-Excitation and Attention NET (SEA-NET) in this paper. The segmentation model used squeeze-and-extraction modules to adjust the channel information to enhance the useful information and used attention modules to adjust the spatial information of the feature map to highlight the target area for small target segmentation when up-sampling. The deep semantic information is integrated into the shallow feature map by the attention model. Therefore, the deep semantic information cannot be scattered by continuous up-sampling. We used cross entropy loss + Tversky loss function for fast convergence and well processing the imbalanced data sets. Our proposed SEA-NET was tested on the brain MRI dataset LPBA40 and peripheral blood smear images.\n\nConclusions\nOn brain MRI data, the average value of the Dice coefficient we obtained reached 98.1$$\\%$$\n%\n. On the peripheral blood smear dataset, our proposed model has a good segmentation effect on adhesion cells.\n\nResults\nThe experimental results proved that the proposed SEA-Net performed better than U-Net, U-Net++, etc. in medical image segmentation.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12880-024-01194-8"
    },
    {
        "id": 27895,
        "title": "Multi-path decoder U-Net: A weakly trained real-time segmentation network for object detection and localization in ultrasound scans",
        "authors": "Abdullah F. Al-Battal, Imanuel R. Lerman, Truong Q. Nguyen",
        "published": "2023-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compmedimag.2023.102205"
    },
    {
        "id": 27896,
        "title": "Semantic-Promoted Debiasing and Background Disambiguation for Zero-Shot Instance Segmentation",
        "authors": "Shuting He, Henghui Ding, Wei Jiang",
        "published": "2023-6",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01868"
    },
    {
        "id": 27897,
        "title": "Autonomous Rock Instance Segmentation for Extra-Terrestrial Robotic Missions",
        "authors": "Maximilian Durner, Wout Boerdijk, Yunis Fanger, Ryo Sakagami, David Lennart Risch, Rudolph Triebel, Armin Wedler",
        "published": "2023-3-4",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115717"
    },
    {
        "id": 27898,
        "title": "DynaMask: Dynamic Mask Selection for Instance Segmentation",
        "authors": "Ruihuang Li, Chenhang He, Shuai Li, Yabin Zhang, Lei Zhang",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.01085"
    },
    {
        "id": 27899,
        "title": "Gland Instance Segmentation by Full Resolution Multi-Scale Dilation Residual Networks",
        "authors": "Mengjiao Yao, Xiang Gao",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10448055"
    },
    {
        "id": 27900,
        "title": "Unsupervised Domain Adaptation for Medical Image Segmentation by Disentanglement Learning and Self-Training",
        "authors": "Qingsong Xie, Yuexiang Li, Nanjun He, Munan Ning, Kai Ma, Guoxing Wang, Yong Lian, Yefeng Zheng",
        "published": "2024-1",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2022.3192303"
    },
    {
        "id": 27901,
        "title": "MISSFormer: An Effective Transformer for 2D Medical Image Segmentation",
        "authors": "Xiaohong Huang, Zhifang Deng, Dandan Li, Xueguang Yuan, Ying Fu",
        "published": "2023-5",
        "citations": 37,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2022.3230943"
    },
    {
        "id": 27902,
        "title": "Few-Shot Medical Image Segmentation via Generating Multiple Representative Descriptors",
        "authors": "Ziming Cheng, Shidong Wang, Tong Xin, Tao Zhou, Haofeng Zhang, Ling Shao",
        "published": "2024",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tmi.2024.3358295"
    },
    {
        "id": 27903,
        "title": "Top-Down Beats Bottom-Up in 3D Instance Segmentation",
        "authors": "Maksim Kolodiazhnyi, Anna Vorontsova, Anton Konushin, Danila Rukhovich",
        "published": "2024-1-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00353"
    },
    {
        "id": 27904,
        "title": "Real-time 3D Semantic Instance Segmentation SLAM",
        "authors": "Zihao Pan, Junyi Hou, Lei Yu",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/robio58561.2023.10354959"
    }
]