[
    {
        "id": 28305,
        "title": "Large Generative Models Meet Multimodal Video Intelligence",
        "authors": "Mike Zheng Shou",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616847"
    },
    {
        "id": 28306,
        "title": "Taillight Shape Creative Design based on Generative Adversarial Networks",
        "authors": "Huan Lin, Xiaolei Deng, Dongsong Zhang",
        "published": "2023-3-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2023.1043-1060"
    },
    {
        "id": 28307,
        "title": "Unlocking Multimedia Capabilities of Gigantic Pretrained Language Models",
        "authors": "Boyang Li",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616846"
    },
    {
        "id": 28308,
        "title": "GNNs and Graph Generative models for biomedical applications",
        "authors": "Michalis Vazirgiannis",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3543507.3593049"
    },
    {
        "id": 28309,
        "title": "Generative AI and Creative Learning: Concerns, Opportunities, and Choices",
        "authors": "Mitchel Resnick",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21428/e4baedd9.cf3e35e5"
    },
    {
        "id": 28310,
        "title": "SAT: Self-Attention Control for Diffusion Models Training",
        "authors": "Jing Huang, Tianyi Zhang, Wei Shi",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616838"
    },
    {
        "id": 28311,
        "title": "GenAI Against Humanity: Nefarious Applications of Generative Artificial Intelligence and Large Language Models",
        "authors": "Emilio Ferrara",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4614223"
    },
    {
        "id": 28312,
        "title": "Deep Neural Network-Based Generative Models to improve Surveillance Techniques",
        "authors": "Pranav B Kashyap, S Suchitra",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.139"
    },
    {
        "id": 28313,
        "title": "Evaluation of Medium-large Language Models at Zero-shot Closed Book Generative Question Answering",
        "authors": "René Peinl, Johannes Wirth",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "Large language models (LLMs) have garnered significant attention, but the definition of “large” lacks clarity. This paper focuses on medium-sized language models (MLMs), defined as having at least six billion parameters but less than 100 billion. The study evaluates MLMs regarding zero-shot generative question answering, which requires models to provide elaborate answers without external document retrieval. The paper introduces an own test dataset and presents results from human evaluation. Results show that combining the best answers from different MLMs yielded an overall correct answer rate of 82.7% which is better than the 60.9% of ChatGPT. The best MLM achieved 71.8% and has 33B parameters, which highlights the importance of using appropriate training data for fine-tuning rather than solely relying on the number of parameters. More finegrained feedback should be used to further improve the quality of answers. The open source community is quickly closing the gap to the best commercial models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2024.140106"
    },
    {
        "id": 28314,
        "title": "The current state of artificial intelligence generative language models is more creative than humans on divergent thinking tasks",
        "authors": "Kent F. Hubert, Kim N. Awa, Darya L. Zabelina",
        "published": "2024-2-10",
        "citations": 0,
        "abstract": "AbstractThe emergence of publicly accessible artificial intelligence (AI) large language models such as ChatGPT has given rise to global conversations on the implications of AI capabilities. Emergent research on AI has challenged the assumption that creative potential is a uniquely human trait thus, there seems to be a disconnect between human perception versus what AI is objectively capable of creating. Here, we aimed to assess the creative potential of humans in comparison to AI. In the present study, human participants (N = 151) and GPT-4 provided responses for the Alternative Uses Task, Consequences Task, and Divergent Associations Task. We found that AI was robustly more creative along each divergent thinking measurement in comparison to the human counterparts. Specifically, when controlling for fluency of responses, AI was more original and elaborate. The present findings suggest that the current state of AI language models demonstrate higher creative potential than human respondents.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-53303-w"
    },
    {
        "id": 28315,
        "title": "Multimodal Data Augmentation for Image Captioning using Diffusion Models",
        "authors": "Changrong Xiao, Sean Xin Xu, Kunpeng Zhang",
        "published": "2023-11-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616839"
    },
    {
        "id": 28316,
        "title": "Exploring the Faithfulness of Synthetic Data by Generative Models",
        "authors": "Fiammetta Marulli, Pierluigi Paganini, Fabio Lancellotti",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00334"
    },
    {
        "id": 28317,
        "title": "Generative Models for Learning Document Representations Along with their Uncertainties",
        "authors": "Ankita Nainwal, Kireet Joshi, Sushant Chamoli",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.191"
    },
    {
        "id": 28318,
        "title": "Generative models for anomaly detection and design-space dimensionality reduction in shape optimization",
        "authors": "Danny D’Agostino",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.107566"
    },
    {
        "id": 28319,
        "title": "Applications of generative models with a latent observation subspace in vibrodiagnostics",
        "authors": "Andrzej Puchalski, Iwona Komorska",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29354/diag/176854"
    },
    {
        "id": 28320,
        "title": "Animation Scene Design and Machine Vision Rendering Optimization Combining Generative Models",
        "authors": "Weiwei Zhang",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s15.1-15"
    },
    {
        "id": 28321,
        "title": "Review of: \"From Turing to Transformers: A Comprehensive Review and Tutorial on the Evolution and Applications of Generative Transformer Models\"",
        "authors": "Roheen Qamar",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.32388/6rmwu1"
    },
    {
        "id": 28322,
        "title": "Multimodal Deep Generative Models for Remote Medical Applications",
        "authors": "Catherine Ordun",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "Visible-to-Thermal (VT) face translation is an under-studied problem of image-to-image translation that offers an AI-enabled alternative to traditional thermal sensors. Over three phases, my Doctoral Proposal explores developing multimodal deep generative solutions that can be applied towards telemedicine applications. These include the contribution of a novel Thermal Face Contrastive GAN (TFC-GAN), exploration of hybridized diffusion-GAN models, application on real clinical thermal data at the National Institutes of Health, and exploration of strategies for Federated Learning (FL) in heterogenous data settings.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v37i13.26924"
    },
    {
        "id": 28323,
        "title": "Generative adversarial networks: Core principles, cutting-edge models, broad applications, and contemporary challenges",
        "authors": "Xiangzhong Ye",
        "published": "2024-3-28",
        "citations": 0,
        "abstract": "Generative adversarial networks stand out as one of the most notable innovations in the field of artificial intelligence. Often lauded for their capacity to emulate specific data distributions, their primary function is to discern the underlying characteristics of these distributions and subsequently generate data that mirrors them. In the realm of computer vision, GANs have showcased remarkable prowess by producing high-quality, realistic content. This capability has not only bolstered their reputation but also expanded their applicability across a multitude of tasks. However, the ascendancy of GANs isnt without its set of challenges. Training them can often be a delicate balancing act, as they require careful tuning to ensure stability. Issues like mode collapse, where the generator produces limited varieties of outputs, or training instabilities are not uncommon. Nonetheless, the inherent scalability and versatility of GANs continue to captivate researchers, making them a hotspot for innovation. As we delve deeper into the AI epoch, the potential of GANs remains vast, presenting both unprecedented opportunities and challenges.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/53/20241139"
    },
    {
        "id": 28324,
        "title": "Out-of-distribution Detection via Frequency-regularized Generative Models",
        "authors": "Mu Cai, Yixuan Li",
        "published": "2023-1",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00548"
    },
    {
        "id": 28325,
        "title": "Generative AI: A Review on Models and Applications",
        "authors": "Kuldeep Singh Kaswan, Jagjit Singh Dhatterwal, Kiran Malik, Anupam Baliyan",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsai59793.2023.10421601"
    },
    {
        "id": 28326,
        "title": "Leveraging Generative AI Models for Synthetic Data Generation in Healthcare: Balancing Research and Privacy",
        "authors": "Aryan Jadon, Shashank Kumar",
        "published": "2023-7-25",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartnets58706.2023.10215825"
    },
    {
        "id": 28327,
        "title": "Poster: Generalizing mmWave Sensing with Simulation Synthesis and Generative Models",
        "authors": "Xingyu Chen, Xinyu Zhang",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3638550.3643050"
    },
    {
        "id": 28328,
        "title": "Deep Generative Models for Constructing Synthetic Populations in Public Health Applications",
        "authors": "Nathan Farmer, Arash Mahyari, Ashok Sirinivasan",
        "published": "2023-9-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aipr60534.2023.10440666"
    },
    {
        "id": 28329,
        "title": "Effect of Generative Learning Models Based on Cognitive Conflict on Students’ Creative Thinking Processes Based on Metacognitive",
        "authors": "A Akmam, R Hidayat, F Mufit, R Anshari, N Jalinus",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Abstract\nMetacognition is influenced the creative thinking process in Computational Physics courses. The Computational Physics is needed in the business and industrial. However, Computational Physics courses are less attractive for students. The challenge in learning Computational Physics is how to help students effectively develop creative and computational thinking skills. Based on the above, the purpose of this study is to determine the effectiveness of the PGOC3ARE learning model to create the students’ creative thinking skills in Computational Physics learning and to determine the effect of using the PGOC3ARE learning model on metacognitive-based creative thinking skills, especially in Computational Physics courses. The research method used was an explanatory sequential design research method. The research sample was taken through simple random sampling, where the sample was divided into an experimental class and a control class. The sampling technique for collecting qualitative data was purposive sampling. Data analysis using comparative test statistics. The result of the research is that the PGOC3ARE model is effective in shaping students’ creative thinking skills, especially in the Computational Physics course. Furthermore, the PGOC3ARE learning model has a significant positive effect on the development of students’ creative thinking skills in the Computational Physics course with base on metacognition.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2582/1/012058"
    },
    {
        "id": 28330,
        "title": "GAN-LM: Generative Adversarial Network using Language Models for Downstream Applications",
        "authors": "Dae Yon Hwang, Yaroslav Nechaev, Cyprien de Lichy, Renxian Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.inlg-main.5"
    },
    {
        "id": 28331,
        "title": "Generative Artificial Intelligence—the New Era of Creative Machines",
        "authors": "Sara D’Onofrio",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1365/s40702-024-01069-0"
    },
    {
        "id": 28332,
        "title": "Representation Disentanglement in Generative Models with Contrastive Learning",
        "authors": "Shentong Mo, Zhun Sun, Chao Li",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00158"
    },
    {
        "id": 28333,
        "title": "Active learning inspired method in generative models",
        "authors": "Guipeng Lan, Shuai Xiao, Jiachen Yang, Jiabao Wen, Wen Lu, Xinbo Gao",
        "published": "2024-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123582"
    },
    {
        "id": 28334,
        "title": "Generative models for color normalization in digital pathology and dermatology: Advancing the learning paradigm",
        "authors": "Massimo Salvi, Francesco Branciforti, Filippo Molinari, Kristen M. Meiburger",
        "published": "2024-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.123105"
    },
    {
        "id": 28335,
        "title": "Roadmap for Generative Models Redefining Learning in Egyptian Higher Education",
        "authors": "Laila Mohamed ElFangary",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150216"
    },
    {
        "id": 28336,
        "title": "Embracing Generative AI for Authentic Learning",
        "authors": "Josephine Chinying Lang",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ce.2024.151001"
    },
    {
        "id": 28337,
        "title": "Subsampling of Frequent Words in Text for Pre-training a Vision-Language Model",
        "authors": "Mingliang Liang, Martha Larson",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616843"
    },
    {
        "id": 28338,
        "title": "GEMS: Scene Expansion using Generative Models of Graphs",
        "authors": "Rishi Agarwal, Tirupati Saketh Chandra, Vaidehi Patil, Aniruddha Mahapatra, Kuldeep Kulkarni, Vishwa Vinay",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00024"
    },
    {
        "id": 28339,
        "title": "The Role of Generative AI in Human Creative Processes: Experimental Evidence",
        "authors": "Feng Zhu, Wenbo Zou",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4676053"
    },
    {
        "id": 28340,
        "title": "Creative Dialogue with Generative AI: Exploring the Possible with Ron Beghetto",
        "authors": "Punya Mishra, Danah Henriksen",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11528-024-00949-y"
    },
    {
        "id": 28341,
        "title": "Using Future Thinking as a steering tool for Generative AI creative output: a case study aiming at rethink lighting in the next future",
        "authors": "Ivan Parati, Mariia Zolotova",
        "published": "2024",
        "citations": 0,
        "abstract": "Contemporary business sustainability relies on its flexibility and adaptability to unforeseen changes in societal and environmental challenges. In that sense, Speculative Design and Future Thinking offer a unique methodology for businesses to plan for the unpredictable. While those theories have been tested by decades of artistic and business applications, the recent introduction of generative AI tools widened the complexity and likelihood of answers that can be thoroughly investigated. At the same time, this enhanced capability to peek into our futures raises several concerns:  How can we retain control of generative AI creative output using future thinking as a steering tool? Would that allow designers to proceed beyond strategic choices, addressing specific product development?This paper shares a case study of how future thinking was applied to provide a lighting manufacturer with design visualisations related to the lighting industry's future. HE institution offered this service (hidden for peer review) through an interdepartmental collaboration (Industrial Design and Architecture). Futures Thinking and Speculative Design apply as a methodology for consulting firms on strategic and communication choices (Mc Kinsey & Company, report, 2021). This case study explores the impact of such methodologies on choices related to product, interior, and systems design. Generative AI tools were prompted to visually interpret the forecasted scenarios through narrative discourse and creative works. the questions addressed were: What is the future of the light industry in the context of human emotions, enhanced user experience, well-being, or energy and resources?MethodsA workshop involving undergraduate and postgraduate students of the respective departments was organised in two phases: the first phase was about describing a scenario ten years in the future and conceptualising the design vision; the second phase was addressing the materialisation of light and its execution in a product or service proposal. After selecting the context, students followed methodological steps to envision future products, spaces and interactions following the four identified possible scenarios (Slaughter, 2013). In both phases, students used generative AI tools to visualise scenarios and solutions, Midjourney for the conceptual narrative, and Vizcom was used to generate illustrations of the interior/product lighting ecosystem. The latest tool does not rely solely on prompting but requires the designer to submit a sketch or a draft rendering of the proposed solution.ResultsThe design team of the participating lighting company attended each phase presentation involving products unfolding the relationship with the light in the future. The feedback received from the company appreciates the depth of the research and acknowledges the competitiveness of the identified research directions. The results achieved in the second phase of the workshop will be showcased at the IDI Shanghai yearly exhibition 2023.The format proposed could be easily adapted and implemented in a range of specific design domains, such as transportation and automotive, fashion and accessories, consumer electronics and household appliances, to name a few.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54941/ahfe1004593"
    },
    {
        "id": 28342,
        "title": "Enhancing Multimodal Compositional Reasoning of Visual Language Models with Generative Negative Mining",
        "authors": "Ugur Sahin, Hang Li, Qadeer Khan, Daniel Cremers, Volker Tresp",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00547"
    },
    {
        "id": 28343,
        "title": "Score-Based Generative Models for PET Image Reconstruction",
        "authors": "Imraj RD Singh, Alexander Denker, Riccardo Barbano, Željko Kereta, Bangti Jin, Kris Thielemans, Peter Maass, Simon Arridge",
        "published": "2024-1-23",
        "citations": 1,
        "abstract": "Score-based generative models have demonstrated highly promising results for medical image reconstruction tasks in magnetic resonance imaging or computed tomography. However, their application to Positron Emission Tomography (PET) is still largely unexplored. PET image reconstruction involves a variety of challenges, including Poisson noise with high variance and a wide dynamic range. To address these challenges, we propose several PET-specific adaptations of score-based generative models. The proposed framework is developed for both 2D and 3D PET. In addition, we provide an extension to guided reconstruction using magnetic resonance images. We validate the approach through extensive 2D and 3D <emph>in-silico</emph> experiments with a model trained on patient-realistic data without lesions, and evaluate on data without lesions as well as out-of-distribution data with lesions. This demonstrates the proposed method’s robustness and significant potential for improved PET reconstruction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59275/j.melba.2024-5d51"
    },
    {
        "id": 28344,
        "title": "Enhancing Complex Image Synthesis with Conditional Generative Models and Rule Extraction",
        "authors": "Chafic Abou Akar, Andre Luckow, Ahmad Obeid, Christian Beddawi, Marc Kamradt, Abdallah Makhoul",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00027"
    },
    {
        "id": 28345,
        "title": "GenAI against humanity: nefarious applications of generative artificial intelligence and large language models",
        "authors": "Emilio Ferrara",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "AbstractGenerative Artificial Intelligence (GenAI) and Large Language Models (LLMs) are marvels of technology; celebrated for their prowess in natural language processing and multimodal content generation, they promise a transformative future. But as with all powerful tools, they come with their shadows. Picture living in a world where deepfakes are indistinguishable from reality, where synthetic identities orchestrate malicious campaigns, and where targeted misinformation or scams are crafted with unparalleled precision. Welcome to the darker side of GenAI applications. This article is not just a journey through the meanders of potential misuse of GenAI and LLMs, but also a call to recognize the urgency of the challenges ahead. As we navigate the seas of misinformation campaigns, malicious content generation, and the eerie creation of sophisticated malware, we’ll uncover the societal implications that ripple through the GenAI revolution we are witnessing. From AI-powered botnets on social media platforms to the unnerving potential of AI to generate fabricated identities, or alibis made of synthetic realities, the stakes have never been higher. The lines between the virtual and the real worlds are blurring, and the consequences of potential GenAI’s nefarious applications impact us all. This article serves both as a synthesis of rigorous research presented on the risks of GenAI and misuse of LLMs and as a thought-provoking vision of the different types of harmful GenAI applications we might encounter in the near future, and some ways we can prepare for them.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42001-024-00250-1"
    },
    {
        "id": 28346,
        "title": "Stochastic Composition: Creative Diversity in Generative Art",
        "authors": "Jin-Hee Kim",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.9728/jcc.2023.12.5.2.663"
    },
    {
        "id": 28347,
        "title": "Aspect-level sentiment-controlled knowledge grounded multimodal dialog generation using generative models for reviews",
        "authors": "Deeksha Varshney, Anushkha Singh, Asif Ekbal",
        "published": "2023-9-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16720-z"
    },
    {
        "id": 28348,
        "title": "Generated Distributions Are All You Need for Membership Inference Attacks Against Generative Models",
        "authors": "Minxing Zhang, Ning Yu, Rui Wen, Michael Backes, Yang Zhang",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00477"
    },
    {
        "id": 28349,
        "title": "Future applications of generative large language models: A data-driven case study on ChatGPT",
        "authors": "Filippo Chiarello, Vito Giordano, Irene Spada, Simone Barandoni, Gualtiero Fantoni",
        "published": "2024-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.technovation.2024.103002"
    },
    {
        "id": 28350,
        "title": "Is Prompt Generation Creative under Copyright Law? - Focusing on the Legal Consideration of Creative Use of Generative AI -",
        "authors": "Yunmyung KIM",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29305/tj.2024.2.200.261"
    },
    {
        "id": 28351,
        "title": "Good Models Borrow, Great Models Steal: Intellectual Property Rights and Generative AI",
        "authors": "Simon Chesterman",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4590006"
    },
    {
        "id": 28352,
        "title": "Explaining generative diffusion models via visual analysis for interpretable decision-making process",
        "authors": "Ji-Hoon Park, Yeong-Joon Ju, Seong-Whan Lee",
        "published": "2024-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123231"
    },
    {
        "id": 28353,
        "title": "Deep Generative Regression Models For Soil Moisture Retrieval From GNSS-R Observations",
        "authors": "G. Tsagkatakis, A. Melebari, R. Akbar, J. D. Campbell, E. Hodges, M. Moghaddam",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceaa57318.2023.10297722"
    },
    {
        "id": 28354,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/resmil.v10i1.13"
    },
    {
        "id": 28355,
        "title": "Generative Artificial Intelligence and the Emergence of Creative Displacement Anxiety",
        "authors": "Nicholas Caporusso",
        "published": "2023-10-16",
        "citations": 2,
        "abstract": "Generative Artificial Intelligence (AI), a subset of AI that can generate novel content such as images, text, and music, has the unique transformative potential of augmenting human creativity, offering tools that can enhance creative expression and open unprecedented avenues for innovation. However, alongside its remarkable capabilities, the inevitable pervasive integration of this technology in every aspect of human life, including creative fields, involves the risk of giving rise to unforeseen psychological challenges for our society. This article discusses the potential emergence of a novel psychological phenomenon consisting in the multifaceted response to the perceived overshadowing of human creativity by AI-driven tools. Specifically, the article introduces the term “Creative Displacement Anxiety” (CDA), describe its foundation, and discuss its relationships with established psychological and psychosocial models, theories, constructs, and diagnoses such as technostress, impostor syndrome, cognitive dissonance, and economic anxiety. The article conceptualizes and elucidates the potential root causes, symptoms, and implications of CDA. Additionally, it discusses how some of the possible negative mental health outcomes could potentially be mitigated. Our work emphasizes the need for interventions that raise awareness on generative AI, support individuals in accepting and incorporating AI as a creative tool and companion and helps them navigate this new landscape. Finally, by offering a view of the interplay between AI advancements and the human creative psyche, our research aims at fostering the discussion around embracing the positive contribution of generative AI to our society.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53520/rdpb2023.10795"
    },
    {
        "id": 28356,
        "title": "Applying generative art to cultural and creative product design to construct human-product relationship",
        "authors": "Dihui Chu,  ",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21606/iasdr.2023.180"
    },
    {
        "id": 28357,
        "title": "Experience Grammar: Creative Space Planning with Generative Graph and Shape for Early Design Stage",
        "authors": "Rizal Muslimin",
        "published": "2023-3-26",
        "citations": 1,
        "abstract": "This paper presents a method to synthesise functional relationships and spatial configuration simultaneously using shape and graph computation from shape grammar and space syntax theories. The study revisits seminal works and summarises the compatibilities between shape and graph computation as a set of rules. The rule computation is demonstrated in two cases from hospitality and retail, where current applications, opportunities, and limitations are discussed. The results from the study show that incorporating graph and shape rules allows sequences of functions and spatial arrangements to be developed in parallel. The method could help the designer anticipate the impact on the users’ flow of activities more explicitly during the early design process and could also assist in generating new functional configurations to provide alternative spatial strategies in broader applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13040869"
    },
    {
        "id": 28358,
        "title": "Combining Creative Adversarial Networks with Art Design Models and Machine Vision Feedback Optimization",
        "authors": "Qiang Tian, Qisong Li",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s16.103-116"
    },
    {
        "id": 28359,
        "title": "Research on the creative methods of visual works in the context of generative art",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.25236/far.2023.050902"
    },
    {
        "id": 28360,
        "title": "The Impact of Generative AI on Human Productivity in Creative Writing",
        "authors": "Vinay Bhimavarapu",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "With the innovative field of generative artificial intelligence having advanced at an incredibly rapid rate, its applications are of the utmost priority to study. The purpose of this study is to determine whether or not generative AI can help increase human productivity, specifically in writing. We hypothesized that generative AI will have a positive impact on human productivity. In order to test this, we employed the use of participants to write short fictional stories, one with the help of AI and one without. They were provided with survey questions that helped assess any changes in productivity levels. The productivity of the participants was also analyzed in terms of grammar, spelling, and consistency while compared against time . With the results obtained, we hoped to assess how AI can impact productivity in creative tasks (i.e., writing, art). We also hoped to understand its broader applications for human use and potential benefits and caveats to using generative AI. Based on the results, we concluded that using generative AI did indeed improve writing productivity as it lowered the amount of errors and shortened the time taken. However, how productive the individual was in producing quality work of their own merit also depended on how much work they delegated to the generative AI as well as how they perceived it.    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47611/jsrhs.v12i3.4780"
    },
    {
        "id": 28361,
        "title": "Generative Diffusion Models on Graphs: Methods and Applications",
        "authors": "Chengyi Liu, Wenqi Fan, Yunqing Liu, Jiatong Li, Hang Li, Hui Liu, Jiliang Tang, Qing Li",
        "published": "2023-8",
        "citations": 0,
        "abstract": "Diffusion models, as a novel generative paradigm, have achieved remarkable success in various image generation tasks such as image inpainting, image-to-text translation, and video generation. Graph generation is a crucial computational task on graphs with numerous real-world applications. It aims to learn the distribution of given graphs and then generate new graphs. Given the great success of diffusion models in image generation, increasing efforts have been made to leverage these techniques to advance graph generation in recent years.  In this paper, we first provide a comprehensive overview of generative diffusion models on graphs, In particular, we review representative algorithms for three variants of graph diffusion models, i.e., Score Matching with Langevin Dynamics (SMLD), Denoising Diffusion Probabilistic Model (DDPM), and Score-based Generative Model (SGM). Then, we summarize the major applications of generative diffusion models on graphs with a specific focus on molecule and protein modeling. Finally, we discuss promising directions in generative diffusion models on graph-structured data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/751"
    },
    {
        "id": 28362,
        "title": "A Lightweight Generalizable Evaluation and Enhancement Framework for Generative Models and Generated Samples",
        "authors": "Ganning Zhao, Vasileios Magoulianitis, Suya You, C.-C. Jay Kuo",
        "published": "2024-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacvw60836.2024.00054"
    },
    {
        "id": 28363,
        "title": "A new framework for analyzing color models with generative adversarial networks for improved steganography",
        "authors": "Bisma Sultan, M. ArifWani",
        "published": "2023-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-14348-7"
    },
    {
        "id": 28364,
        "title": "Evaluation of pseudo-healthy image reconstruction for anomaly detection with deep generative models: Application to brain FDG PET",
        "authors": "Ravi Hassanaly, Camille Brianceau, Maëlys Solal, Olivier Colliot, Ninon Burgos",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "Over the past years, pseudo-healthy reconstruction for unsupervised anomaly detection has gained in popularity. This approach has the great advantage of not requiring tedious pixel-wise data annotation and offers possibility to generalize to any kind of anomalies, including that corresponding to rare diseases. By training a deep generative model with only images from healthy subjects, the model will learn to reconstruct pseudo-healthy images. This pseudo-healthy reconstruction is then compared to the input to detect and localize anomalies. The evaluation of such methods often relies on a ground truth lesion mask that is available for test data, which may not exist depending on the application.<br>We propose an evaluation procedure based on the simulation of realistic abnormal images to validate pseudo-healthy reconstruction methods when no ground truth is available. This allows us to extensively test generative models on different kinds of anomalies and measuring their performance using the pair of normal and abnormal images corresponding to the same subject. It can be used as a preliminary automatic step to validate the capacity of a generative model to reconstruct pseudo-healthy images, before a more advanced validation step that would require clinician’s expertise. We apply this framework to the reconstruction of 3D brain FDG PET using a convolutional variational autoencoder with the aim to detect as early as possible the neurodegeneration markers that are specific to dementia such as Alzheimer’s disease.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59275/j.melba.2024-b87a"
    },
    {
        "id": 28365,
        "title": "Generative Adversarial Network and Score-Based Generative Model Comparison",
        "authors": "Ruoxuan Zhu",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icipca59209.2023.10258000"
    },
    {
        "id": 28366,
        "title": "ImEW: A Framework for Editing Image in the Wild",
        "authors": "Tasnim Mohiuddin, Tianyi Zhang, Maowen Nie, Jing Huang, Qianqian Chen, Wei Shi",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616840"
    },
    {
        "id": 28367,
        "title": "Learning incoherent light emission steering from metasurfaces using generative models",
        "authors": "Prasad P. Iyer, Saaketh Desai, Sadhvikas Addamane, Remi Dingreville, Igal Brener",
        "published": "2023-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv56688.2023.00376"
    },
    {
        "id": 28368,
        "title": "AI as Agency Without Intelligence: On ChatGPT, Large Language Models, and Other Generative Models",
        "authors": "Luciano Floridi",
        "published": "2023",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4358789"
    },
    {
        "id": 28369,
        "title": "A Review of Generative Models for 3D Vehicle Wheel Generation and Synthesis",
        "authors": "Timileyin Opeyemi Akande, Oluwaseyi Omotayo Alabi, Julianah B. Oyinloye",
        "published": "2024-3-21",
        "citations": 0,
        "abstract": "Integrating deep learning methodologies is pivotal in shaping the continuous evolution of computer-aided design (CAD) and computer-aided engineering (CAE) systems. This review explores the integration of deep learning in CAD and CAE, particularly focusing on generative models for simulating 3D vehicle wheels. It highlights the challenges of traditional CAD/CAE, such as manual design and simulation limitations, and proposes deep learning, especially generative models, as a solution. The study aims to automate and enhance 3D vehicle wheel design, improve CAE simulations, predict mechanical characteristics, and optimize performance metrics. It employs deep learning architectures like variational autoencoders (VAEs), convolutional neural networks (CNNs), and generative adversarial networks (GANs) to learn from diverse 3D wheel designs and generate optimized solutions. The anticipated outcomes include more efficient design processes, improved simulation accuracy, and adaptable design solutions, facilitating the integration of deep learning models into existing CAD/CAE systems. This integration is expected to transform design and engineering practices by offering insights into the potential of these technologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.62411/jcta.10125"
    },
    {
        "id": 28370,
        "title": "Competition in Generative AI Foundation Models",
        "authors": "Christophe Carugati",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4553787"
    },
    {
        "id": 28371,
        "title": "Fashion-GPT: Integrating LLMs with Fashion Retrieval System",
        "authors": "Qianqian Chen, Tianyi Zhang, Maowen Nie, Zheng Wang, Shihao Xu, Wei Shi, Zhao Cao",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616844"
    },
    {
        "id": 28372,
        "title": "The implications of generative AI for creative composition in higher education and initial teacher education",
        "authors": "Edwin Creely, Joanne Blannin",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "This position paper explores the impact of generative AI on creativity and creative production in higher education, with focus also on initial teacher education. Creative outputs are an essential part of the business of higher education across different disciplinary areas, along with pedagogical and assessment practices matched to these outputs. However, the advent of generative AI has sparked a reconsideration of how we think about creativity, creative output, and the hybridity of relationships between generative AI and humans in creative endeavours. This emergent technology also has significant implications for teacher education and for the develop of new teachers who need confidence with using AI in learning contexts. We suggest that new thinking and critical dialogue are essential in developing educational futures in which generative AI is understood for its affordances, limitations, and dangers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14742/apubs.2023.618"
    },
    {
        "id": 28373,
        "title": "Enhancing colorectal cancer diagnosis through generative models and vision-based tactile sensing: a Sim2Real study",
        "authors": "Siddhartha Kapuria, Naruhiko Ikoma, Sandeep Chinchali, Farshid Alambeigi",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3006550"
    },
    {
        "id": 28374,
        "title": "Harmonizing the voices of AI: Exploring generative music models, voice cloning, and voice transfer for creative expression",
        "authors": " Onuh Matthew Ijiga,  Idoko Peter Idoko,  Lawrence Anebi Enyejo,  Omachile Akoh,  Solomon Ileanaju Ugbane,  Akan Ime Ibokette",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "The intersection of artificial intelligence (AI) and creative expression has sparked a revolution in various artistic domains. This review paper delves into the realms of generative music models, voice cloning, and voice transfer, exploring their significance in fostering novel avenues for creative expression. Beginning with an overview of AI's evolution in creative arts, we scrutinize the progression of AI in music generation and voice synthesis. We delve into the mechanics and impact of generative music models, followed by an examination of voice cloning technologies and their ethical implications. Furthermore, we explore the application of voice transfer in music creation and its extension to other forms of storytelling and podcasting. Ethical and legal considerations surrounding AI-generated voices are also addressed, alongside user perspectives on creativity and the technical challenges and innovations in this field. Through case studies and future directions, we illuminate the potential of AI-driven creative expression, delineating its implications for the future of art and self-expression.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30574/wjaets.2024.11.1.0072"
    },
    {
        "id": 28375,
        "title": "Stellenwert von Natural Language Processing und chatbasierten Generative Language Models",
        "authors": "Markus Haar, Michael Sonntagbauer, Stefan Kluge",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00063-023-01098-5"
    },
    {
        "id": 28376,
        "title": "Examining Generative Image Models Amidst Privacy Regulations",
        "authors": "Hannah Ismael",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4560416"
    },
    {
        "id": 28377,
        "title": "Unified Framework for Diffusion Generative Models in SO(3): Applications in Computer Vision and Astrophysics",
        "authors": "Yesukhei Jagvaral, Francois Lanusse, Rachel Mandelbaum",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Diffusion-based generative models represent the current state-of-the-art for image generation. However, standard diffusion models are based on Euclidean geometry and do not translate directly to manifold-valued data. In this work, we develop extensions of both score-based generative models (SGMs) and Denoising Diffusion Probabilistic Models (DDPMs) to the Lie group of 3D rotations, SO(3). SO(3) is of particular interest in many disciplines such as robotics, biochemistry and astronomy/cosmology science. Contrary to more general Riemannian manifolds, SO(3) admits a tractable solution to heat diffusion, and allows us to implement efficient training of diffusion models. We apply both SO(3) DDPMs and SGMs to synthetic densities on SO(3) and demonstrate state-of-the-art results. Additionally, we demonstrate the practicality of our model on pose estimation tasks and in predicting correlated galaxy orientations for astrophysics/cosmology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i11.29171"
    },
    {
        "id": 28378,
        "title": "Large Generative AI Models vs Smaller Parameter Models with More Data: A Comprehensive Literature Review",
        "authors": "Archer Woodford",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4453658"
    },
    {
        "id": 28379,
        "title": "Emotional Speech Transfer on Demand based on Contextual Information and Generative Models: A Case Study",
        "authors": "Andrea Veronica Porco, Kang Dongshik",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01411139"
    },
    {
        "id": 28380,
        "title": "LGM3A '23: 1st Workshop on Large Generative Models Meet Multimodal Applications",
        "authors": "Zheng Wang, Cheng Long, Shihao Xu, Bingzheng Gan, Wei Shi, Zhao Cao, Tat-Seng Chua",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3610953"
    },
    {
        "id": 28381,
        "title": "A Generative Artificial Intelligence Using Multilingual Large Language Models for ChatGPT Applications",
        "authors": "Nguyen Trung Tuan, Philip Moore, Dat Ha Vu Thanh, Hai Van Pham",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "ChatGPT plays significant roles in the third decade of the 21st Century. Smart cities applications can be integrated with ChatGPT in various fields. This research proposes an approach for developing large language models using generative artificial intelligence models suitable for small- and medium-sized enterprises with limited hardware resources. There are many generative AI systems in operation and in development. However, the technological, human, and financial resources required to develop generative AI systems are impractical for small- and medium-sized enterprises. In this study, we present a proposed approach to reduce training time and computational cost that is designed to automate question–response interactions for specific domains in smart cities. The proposed model utilises the BLOOM approach as its backbone for using generative AI to maximum the effectiveness of small- and medium-sized enterprises. We have conducted a set of experiments on several datasets associated with specific domains to validate the effectiveness of the proposed model. Experiments using datasets for the English and Vietnamese languages have been combined with model training using low-rank adaptation to reduce training time and computational cost. In comparative experimental testing, the proposed model outperformed the ‘Phoenix’ multilingual chatbot model by achieving a 92% performance compared to ‘ChatGPT’ for the English benchmark.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app14073036"
    },
    {
        "id": 28382,
        "title": "The Deep Learning Generative Adversarial Random Neural Network in data marketplaces: The digital creative",
        "authors": "Will Serrano",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.028"
    },
    {
        "id": 28383,
        "title": "Generative AI in creative design processes: a dive into possible cognitive biases",
        "authors": "Roxana Popescu,  ",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21606/iasdr.2023.784"
    },
    {
        "id": 28384,
        "title": "Exploring the potential of large language models and generative artificial intelligence (GPT): Applications in Library and Information Science",
        "authors": "Matus Formanek",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": " The presented study offers a systematic overview of the potential application of large language models (LLMs) and generative artificial intelligence tools, notably the GPT model and the ChatGPT interface, within the realm of library and information science (LIS). The paper supplements and extends the outcomes of a comprehensive information survey on the subject matter with the author’s own experiences and examples showcasing possible applications, demonstrated through illustrative instances. This study does not involve testing available LLMs or selecting the most suitable tool; instead, it targets information professionals, specialists, librarians, and scientists, aiming to inspire them in various ways. Within this paper, we explore both well-known and less recognized use cases of generative AI tools, which may prove relevant not only for the target group of information specialists but also for other users. Our analysis demonstrates that apart from merely summarizing or expanding existing textual content, these AI tools hold the potential for performing non-standard yet sophisticated tasks with electronic information resources. They can facilitate interactive engagement with these resources, aid in the extraction and composition of descriptive metadata, indexing, and even possible classification. Nevertheless, it is essential to acknowledge the numerous limitations of current LLMs, which we acknowledge in this study. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/09610006241241066"
    },
    {
        "id": 28385,
        "title": "A review of generative and non-generative adversarial attack on context-rich images",
        "authors": "Hamil Stanly, Mercy Shalinie S., Riji Paul",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2023.106595"
    },
    {
        "id": 28386,
        "title": "Towards Realistic Generative 3D Face Models",
        "authors": "Aashish Rai, Hiresh Gupta, Ayush Pandey, Francisco Vicente Carrasco, Shingo Jason Takagi, Amaury Aubel, Daeil Kim, Aayush Prakash, Fernando De La Torre",
        "published": "2024-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wacv57701.2024.00370"
    },
    {
        "id": 28387,
        "title": "Deepfakes, Misinformation, and Disinformation in the Era of Frontier AI, Generative AI, and Large AI Models",
        "authors": "Mohamed R. Shoaib, Zefan Wang, Milad Taleby Ahvanooey, Jun Zhao",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icca59364.2023.10401723"
    },
    {
        "id": 28388,
        "title": "Why generative AI can make creative destruction more creative but less destructive",
        "authors": "Pehr-Johan Norbäck, Lars Persson",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "AbstractThe application of machine learning (ML) to operational data is becoming increasingly important with the rapid development of artificial intelligence (AI). We propose a model where incumbents have an initial advantage in ML technology and access to (historical) operational data. We show that the increased application of ML for operational data raises entrepreneurial barriers that make the creative destruction process less destructive (less business stealing) if entrepreneurs have only limited access to the incumbent’s data. However, this situation induces entrepreneurs to take on more risk and to be more creative. Policies making data generally available may therefore be suboptimal. A complementary policy is one that supports entrepreneurs’ access to ML, such as open source initiatives, since doing so would stimulate creative entrepreneurship.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11187-023-00829-4"
    },
    {
        "id": 28389,
        "title": "Deep Generative Models: A Review",
        "authors": "Rayeesa Mehmood,  , Rumaan Bashir, Kaiser J Giri",
        "published": "2023-2-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i7.2296"
    },
    {
        "id": 28390,
        "title": "Fashioning the Future: Unlocking the Creative Potential of Deep Generative Models for Design Space Exploration",
        "authors": "Richard Lee Davis, Thiemo Wambsganss, Wei Jiang, Kevin Gonyop Kim, Tanja Käser, Pierre Dillenbourg",
        "published": "2023-4-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3544549.3585644"
    },
    {
        "id": 28391,
        "title": "Brainstorming Generative Adversarial Network (BGAN): Toward Multiagent Generative Models With Distributed Data Sets",
        "authors": "Aidin Ferdowsi, Walid Saad",
        "published": "2024-3-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jiot.2023.3319630"
    },
    {
        "id": 28392,
        "title": "Revolutionizing generative pre-traineds: Insights and challenges in deploying ChatGPT and generative chatbots for FAQs",
        "authors": "Feriel Khennouche, Youssef Elmir, Yassine Himeur, Nabil Djebari, Abbes Amira",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123224"
    },
    {
        "id": 28393,
        "title": "GENERATIVE ADVERSARIAL NETWORKS APPLICATIONS (2019)",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/jcr.06.07.109"
    },
    {
        "id": 28394,
        "title": "Dali or DALL-E? Popper or …? The Implications of Emerging Generative AI on the Future of Creative Work",
        "authors": "Sandra Barbosu, Pooyan Khashabi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4586863"
    },
    {
        "id": 28395,
        "title": "Goal-conditioned world models: Adaptive computation over multi-granular generative models explains human scene perception",
        "authors": "Mario Belledonne, Chloë Geller, Ilker Yildirim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1663-0"
    },
    {
        "id": 28396,
        "title": "A Proposed Meta-Reality Immersive Development Pipeline: Generative AI Models and Extended Reality (XR) Content for the Metaverse",
        "authors": "Jeremiah Ratican, James Hutson, Andrew Wright",
        "published": "2023",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/jilsa.2023.151002"
    },
    {
        "id": 28397,
        "title": "Review of Generative Models",
        "authors": "Ruixi Wang",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "The advancement of generative AI models has been remarkable since 2022. Several visually appealing generative AI models have been introduced to the public, including those for text and image generation. Despite being generated by large-scale neural networks and deep learning algorithms through extensive training, generative models are capable of achieving average or above-average quality and creativity in many fields, such as painting and literature. This paper will examine some of the AI models currently available, delve into their underlying principles and histories, and provide insight into what the future may hold. With the advancement of technology, we can expect to see even more innovative and creative applications in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/8/20230269"
    },
    {
        "id": 28398,
        "title": "Exploring Mathematical Spaces using Generative AI and Large Language Models",
        "authors": "Mohammad Raeini",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4761694"
    },
    {
        "id": 28399,
        "title": "Diffusion Models in Generative AI",
        "authors": "Cem Sazara",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3613857"
    },
    {
        "id": 28400,
        "title": "Rating the Responses to Legal Questions by Generative AI Models",
        "authors": "Sam Harden",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4723644"
    },
    {
        "id": 28401,
        "title": "Defining Data: Improving Terminology Around Generative AI Models",
        "authors": "Franklin Graves, Elizabeth Rothman",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4758339"
    },
    {
        "id": 28402,
        "title": "Impacts and Implications of Generative AI and Large Language Models: Redefining Banking Sector",
        "authors": "",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jier.v4i2.767"
    },
    {
        "id": 28403,
        "title": "AI as Agency Without Intelligence: on ChatGPT, Large Language Models, and Other Generative Models",
        "authors": "Luciano Floridi",
        "published": "2023-3",
        "citations": 64,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s13347-023-00621-y"
    },
    {
        "id": 28404,
        "title": "Counterfactual image generation by disentangling data attributes with deep generative models",
        "authors": "Jieon Lim, Weonyoung Joo",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29220/csam.2023.30.6.589"
    },
    {
        "id": 28405,
        "title": "Data Synthesis Through Deep Generative Models and its Effectiveness in Improving Defect Inspection Models",
        "authors": "Ninad Kulkarni, Rahul Gupta, Vijayasri Kalyan, Ujwal Bhate",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "Abstract\nRecent advances in Deep Generative Models (DGM) have demonstrated their remarkable ability to synthesize highly realistic images. This work examines the effectiveness of DGM produced synthetic images in the context of training AI models for visual asset inspection, which is plagued by a host of challenges including limited data volumes, extremely imbalanced datasets owing to rarely occurring defects, poor quality and consistency of images, spiraling costs and time for data labeling, to name a few. This paper presents an approach to using DGMs, specifically Generative Adversarial Network (GAN) models, to create synthetic images containing defects and damage. The objective of the approach goes beyond generating good quality images and extends to synthesizing a distribution of images with a variety of defect features without significantly altering the object structure.\nThe paper concludes by discussing multiple metrics to assess the effectiveness of such synthetic data in training downstream asset inspection models and presents the results of multiple experiments on real-world data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/gtindia2023-118325"
    },
    {
        "id": 28406,
        "title": "Large Language Models and Generative AI, Oh My!",
        "authors": "Michael Zyda",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mc.2024.3350290"
    },
    {
        "id": 28407,
        "title": "Prior probability regularized FWI using generative diffusion models",
        "authors": "F. Wang, X. Huang, T. Alkhalifah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.202310756"
    },
    {
        "id": 28408,
        "title": "Enhancing digital rock analysis through generative artificial intelligence: Diffusion models",
        "authors": "Mohammad Esmaeili",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2024.127676"
    },
    {
        "id": 28409,
        "title": "Biases and Fairness in Deep Learning Models: A Survey on Inculcating Fairness in Generative Models",
        "authors": "Greeshma Deshmukh, Anjali Naik",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccubea58933.2023.10391962"
    },
    {
        "id": 28410,
        "title": "Performance-Based Generative Design for Parametric Modeling of Engineering Structures Using Deep Conditional Generative Models",
        "authors": "Martin Juan José Bucher, Michael Anton Kraus, Romana Rust, Siyu Tang",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.autcon.2023.105128"
    },
    {
        "id": 28411,
        "title": "Effects of Visual Explanation on Perceived Creative Autonomy in an AI-Based Generative Music System",
        "authors": "Jason Brent Smith, Jason Freeman",
        "published": "2023-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581754.3584123"
    },
    {
        "id": 28412,
        "title": "Towards Legal Regulations of Generative AI in the Creative Industry",
        "authors": "N. I. Shumakova, J. J. Lloyd, E. V. Titova",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "Objective: this article aims to answer the following questions: 1. Can generative artificial intelligence be a subject of copyright law? 2. What risks the unregulated use of generative artificial intelligence systems can cause? 3. What legal gaps should be filled in to minimize such risks?Methods: comparative legal analysis, sociological method, concrete sociological method, quantitative data analysis, qualitative data analysis, statistical analysis, case study, induction, deduction.Results: the authors identified several risks of the unregulated usage of generative artificial intelligence in the creative industry, among which are: violation of copyright and labor law, violation of consumers rights and the rise of public distrust in government. They suggest that a prompt development of new legal norms can minimize these risks. In conclusion, the article constants that states have already begun to realize that the negative impact of generative artificial intelligence on the creative industry must not be ignored, hence the development of similar legal regulations in states with completely different regimes.Scientific novelty: the article provides a comprehensive study of the impact of generative artificial intelligence on the creative industry from two perspectives: the perspective of law and the perspective of the industry. The empirical basis of it consists of two international surveys and an expert opinion of a representative of the industry. This approach allowed the authors to improve the objectivity of their research and to obtain results that can be used for finding a practical solution for the identified risks. The problem of the ongoing development and popularization of generative artificial intelligence systems goes beyond the question “who is the author?” therefore, it needs to be solved by introduction of other than the already existing mechanisms and regulations - this point of view is supported not only by the results of the surveys but also by the analysis of current lawsuits against developers of generative artificial intelligence systems.Practical significance: the obtained results can be used to fasten the development of universal legal rules, regulations, instruments and standards, the current lack of which poses a threat not only to human rights, but also to several sectors within the creative industry and beyond.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21202/jdtl.2023.38"
    },
    {
        "id": 28413,
        "title": "The tightrope of real genesis: on philosophy’s generative thirdness and the creative self-grounding of thought",
        "authors": "Will Fraser",
        "published": "2023-9-23",
        "citations": 0,
        "abstract": "AbstractMotivated to bypass the twin basins of absolute relativism and dogmatic absolutism, an antinomic polarity into which thought tendentially falls, this paper offers various conceptual frameworks for overcoming antinomies in philosophical thought, and ultimately asserts that this overcoming occurs at a philosophical system’s purported source: its active site of real genesis. The author traces a constellation of thinkers who all invoke this suspended thirdness in their own disciplinary and conceptual registers, from Jean Cavaillès to Gilles Châtelet, C.S. Peirce to Cécile Malaspina, ultimately and speculatively suggesting that this third space, the (abductive) hinge of real genesis, might precede and activate a priori the consequent diremptions into the polarities of the transcendental and the historical, the mathematical and the physical, the global and the local, the continuous and the discrete, the rational and the empirical, and so on. Such a genetic realism, then, places a radical exigency on philosophical thinking: to grasp its real genetic conditions, that is, without a previously given criterion or method. Ultimately, the paper is most interested in suggesting ways to reconfigure the conceptual landscape around this genetic tension or originating hinge, to encourage thought towards the genetic real and away from disciplinary stagnation, towards generative models for systematic thought itself.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1057/s41599-023-02092-0"
    },
    {
        "id": 28414,
        "title": "Development of machine learning-based burst capacity models for pipelines containing dent-gouges with synthetic full-scale burst test data generated using tabular generative adversarial network",
        "authors": "Z. He, W. Zhou",
        "published": "2024-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.engappai.2024.108090"
    },
    {
        "id": 28415,
        "title": "Taxonomy of Adversarial Attacks on Text-to-Image Generative Models",
        "authors": "Bhaktipriya Radharapu, Harish Krishna",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cai54212.2023.10413929"
    },
    {
        "id": 28416,
        "title": "Generative Multi-Physics Models for System Power and Thermal Analysis Using Conditional Generative Adversarial Networks",
        "authors": "Priyank Kashyap, Chris Cheng, Yongjin Choi, Paul Franzon",
        "published": "2023-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/epeps58208.2023.10314864"
    },
    {
        "id": 28417,
        "title": "On-The-Fly History Matching of Simulation Models Using Generative Diffusive Learning (SimGDL)",
        "authors": "Mohammed H. Alnasser, Marko Maucec",
        "published": "2024-2-12",
        "citations": 0,
        "abstract": "Abstract\nHistory matching is an inverse problem in which a geological model needs to be calibrated under uncertainty in order to produce a representative reservoir simulation model. While there are many methods for computer-assisted history matching, most of them require substantial computational power and manifest slow convergence for large-scale simulation models. To tackle these challenges, we propose a new technique for history matching reservoir simulation models using generative diffusive learning (SimGDL) [1].\nOur work consisted of several steps based on conditional denoising diffusion probabilistic models. First, we generated several thousands of geologic realizations covering a wide range of spatial subsurface uncertainties. Secondly, we added various amounts of gaussian noise to these realizations and trained a U-Net to predict the added noise based on the corresponding production response. When history matching, a certain amount of noise is added to one of the geologic realizations and then the trained U-Net, guided by the targeted production response, is used to iteratively remove the noise until it converges to a newly generated, dynamically calibrated geologic realization.\nTo test the potential of this new approach, we created a synthetic simulation model. Several thousands of permeability realizations were prepared and used to train the diffusion U-Net. The simulation model combines a single water injector and an oil producer, where oil rate, water cut, and bottom-hole pressure were designated as production responses. Dynamically calibrated permeability realizations were generated by adding noise to some of the existing realizations and then passing them through our diffusion U-Net, conditioned by the selected target production data. The simulated dynamic responses using the generated geologic realizations showed great improvements in matching the target production data. In addition, the posterior realizations were able to retain main feature signatures from the prior distribution and the areas to be updated. Furthermore, the generated models incorporate the quantification of uncertainty, as captured with multiple geologic realizations that were used in training.\nThis paper presents a new method for data-driven dynamic calibration of reservoir simulation models utilizing Generative Diffusive Learning. It incorporates a robust uncertainty quantification using an ensemble of representative subsurface reservoir models. By adding further complexity to conditioning parameters, this innovative method could be further extended and scaled-up to history match simulation models with diverse structural layouts and production profiles.",
        "keywords": "",
        "link": "http://dx.doi.org/10.2523/iptc-23666-ea"
    },
    {
        "id": 28418,
        "title": "Generative Models for Time Series in Finance",
        "authors": "Miquel Noguer i Alonso, David Pacheco Aznar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4343967"
    },
    {
        "id": 28419,
        "title": "Who am AI?: Mapping Generative AI Impact and Transformative Potential in Creative Ecosystem",
        "authors": "Mattia Thibault, Timo Kivikangas, Riku Roihankorpi, Petri Pohjola, Markus Aho",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3616961.3617804"
    },
    {
        "id": 28420,
        "title": "All Just in Your Head? Unraveling the Side Effects of Generative AI Disclosure in Creative Task",
        "authors": "Kevin Bauer, Ekaterina Jussupow, Rebecca Heigl, Benjamin Vogt, Oliver Hinz",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4782554"
    },
    {
        "id": 28421,
        "title": "Generative Data Augmentation for Few-Shot Domain Adaptation",
        "authors": "Carlos López Fortín, Ikuko Nishikawa",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012338000003654"
    },
    {
        "id": 28422,
        "title": "Wealth of Nations, Wealth of Data: How GDP Shapes Diverse Large Language Models like ChatGPT : Interviewing Assorted Open Source Generative AI Models",
        "authors": "Alex Kaplunovich",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386329"
    },
    {
        "id": 28423,
        "title": "Investigating the Advancements in Generative Models",
        "authors": "Xia Zeng, Changyu He, Yuchuan Jiang",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiac61660.2023.00037"
    },
    {
        "id": 28424,
        "title": "Extraction of Subjective Information from Generative AI Models",
        "authors": "Atsuya Kobasyashi, Saneyasu Yamaguchi",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/candarw60564.2023.00059"
    },
    {
        "id": 28425,
        "title": "Fast Model Selection and Hyperparameter Tuning for Generative Models",
        "authors": "Luming Chen, Sujit K. Ghosh",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "Generative models have gained significant attention in recent years. They are increasingly used to estimate the underlying structure of high-dimensional data and artificially generate various kinds of data similar to those from the real world. The performance of generative models depends critically on a good set of hyperparameters. Yet, finding the right hyperparameter configuration can be an extremely time-consuming task. In this paper, we focus on speeding up the hyperparameter search through adaptive resource allocation, early stopping underperforming candidates quickly and allocating more computational resources to promising ones by comparing their intermediate performance. The hyperparameter search is formulated as a non-stochastic best-arm identification problem where resources like iterations or training time constrained by some predetermined budget are allocated to different hyperparameter configurations. A procedure which uses hypothesis testing coupled with Successive Halving is proposed to make the resource allocation and early stopping decisions and compares the intermediate performance of generative models by their exponentially weighted Maximum Means Discrepancy (MMD). The experimental results show that the proposed method selects hyperparameter configurations that lead to a significant improvement in the model performance compared to Successive Halving for a wide range of budgets across several real-world applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/e26020150"
    },
    {
        "id": 28426,
        "title": "An Overview of the European Union Framework Governing Generative AI Models and Systems",
        "authors": "Florence G'sell",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4762804"
    },
    {
        "id": 28427,
        "title": "Unsupervised speech enhancement with deep dynamical generative speech and noise models",
        "authors": "Xiaoyu Lin, Simon Leglaive, Laurent Girin, Xavier Alameda-Pineda",
        "published": "2023-8-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21437/interspeech.2023-232"
    },
    {
        "id": 28428,
        "title": "Towards Generating Structurally Realistic Models by Generative Adversarial Networks",
        "authors": "Abbas Rahimi, Massimo Tisi, Shekoufeh Kolahdouz Rahimi, Luca Berardinelli",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/models-c59198.2023.00098"
    },
    {
        "id": 28429,
        "title": "Non-Generative Energy Based Models",
        "authors": "Jacob Piland, Christopher Sweet, Priscila Saboia, Charles Vardeman, Adam Czajka",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191352"
    },
    {
        "id": 28430,
        "title": "Keyword Data Analysis Using Generative Models Based on Statistics and Machine Learning Algorithms",
        "authors": "Sunghae Jun",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "For text big data analysis, we preprocessed text data and constructed a document–keyword matrix. The elements of this matrix represent the frequencies of keywords occurring in a document. The matrix has a zero-inflation problem because many elements are zero values. Also, in the process of preprocessing, the data size of the document–keyword matrix is reduced. However, various machine learning algorithms require a large amount of data, so to solve the problems of data shortage and zero inflation, we propose the use of generative models based on statistics and machine learning. In our experimental tests, we compared the performance of the models using simulation and practical data sets. Thus, we verified the validity and contribution of our research for keyword data analysis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13040798"
    },
    {
        "id": 28431,
        "title": "A Complete Recipe for Diffusion Generative Models",
        "authors": "Kushagra Pandey, Stephan Mandt",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00393"
    },
    {
        "id": 28432,
        "title": "Probabilistic Precision and Recall Towards Reliable Evaluation of Generative Models",
        "authors": "Dogyun Park, Suhyun Kim",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01839"
    },
    {
        "id": 28433,
        "title": "Generative Models for Inverse Imaging Problems: From mathematical foundations to physics-driven applications",
        "authors": "Zhizhen Zhao, Jong Chul Ye, Yoram Bresler",
        "published": "2023-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/msp.2022.3215282"
    },
    {
        "id": 28434,
        "title": "Generative models as computational assays for psychiatry",
        "authors": "S. Frässle",
        "published": "2023-3",
        "citations": 0,
        "abstract": "AbstractPsychiatry faces fundamental challenges with regard to mechanistically guided differential diagnosis, as well as prediction of clinical trajectories and treatment response. This has motivated novel approaches that aim to develop “computational assays” for inferring patient-specific disease processes from neuroimaging data, which can then be incorporated into decision making in everyday clinical practice. Such computational assays are often based on generative models, which describe how measured data may be caused by a particular mechanism. Combining generative models with machine learning allows translating the inferences from computational assays into patient-specific predictions, an approach referred to as generative embedding.Here, I illustrate the clinical potential of generative embedding for the exemplary case of a generative model of whole-brain effective (directed) connectivity: regression DCM (rDCM). First, I introduce rDCM to the audience and highlight its relevance for understanding the pathophysiology of psychiatric disorders. I then provide an initial demonstration of the clinical utility of rDCM. Specifically, we assessed the ability of rDCM for predicting future episodes of depression in never-depressed adults, using a large dataset (N=906) of resting-state fMRI data from the UK Biobank. Over a 3-year period, half of the participants showed indications of at least one depressive episode, while the other half did not. Using nested cross-validation for training and a held-out test set (80/20 split), we found that a generative embedding procedure based on rDCM in combination with a support vector machine enables statistically significant predictions of future depressive episodes, both on the training (accuracy: 0.63, area under the curve (AUC): 0.66, p<0.001) and test set (accuracy: 0.62, AUC: 0.64, p<0.001). Interpreting model predictions based on SHAP (Shapley Additive exPlanations) values suggested that the most predictive connections were widely distributed and not confined to specific networks.In summary, generative models of brain connectivity in general, and rDCM in particular, show initial promise to serve as computational assays for psychiatry. Our analyses suggest that (i) fMRI-based generative embedding approaches have some capacity for early detection of individuals at-risk for depression and (ii) achieving accuracies of clinical utility may require combination of fMRI with other data modalities.Disclosure of InterestNone Declared",
        "keywords": "",
        "link": "http://dx.doi.org/10.1192/j.eurpsy.2023.182"
    },
    {
        "id": 28435,
        "title": "Generative Artificial Intelligence, Large Language Models, and JID Innovations",
        "authors": "Russell P. Hall",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.xjidi.2024.100256"
    },
    {
        "id": 28436,
        "title": "Continual learning with invertible generative models",
        "authors": "Jary Pomponi, Simone Scardapane, Aurelio Uncini",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.05.020"
    },
    {
        "id": 28437,
        "title": "Deep generative models for vehicle speed trajectories",
        "authors": "Farnaz Behnia, Dominik Karbowski, Vadim Sokolov",
        "published": "2023-9",
        "citations": 0,
        "abstract": "AbstractGenerating realistic vehicle speed trajectories is a crucial component in evaluating vehicle fuel economy and in predictive control of self‐driving cars. Traditional generative models rely on Markov chain methods and can produce accurate synthetic trajectories but are subject to the curse of dimensionality. They do not allow to include conditional input variables into the generation process. In this paper, we show how extensions to deep generative models allow accurate and scalable generation. Proposed architectures involve recurrent and feed‐forward layers and are trained using adversarial techniques. Our models are shown to perform well on generating vehicle trajectories using a model trained on GPS data from Chicago metropolitan area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/asmb.2816"
    },
    {
        "id": 28438,
        "title": "A Rumsfeldian Framework for Understanding How to Employ Generative AI Models for Financial Analysis",
        "authors": "David Krause",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4455916"
    },
    {
        "id": 28439,
        "title": "Predicting materials properties with generative models: applying generative adversarial networks for heat flux generation",
        "authors": "Qi Kong, Yasushi Shibuta",
        "published": "2024-5-15",
        "citations": 0,
        "abstract": "Abstract\nIn the realm of materials science, the integration of machine learning techniques has ushered in a transformative era. This study delves into the innovative application of generative adversarial networks (GANs) for generating heat flux data, a pivotal step in predicting lattice thermal conductivity within metallic materials. Leveraging GANs, this research explores the generation of meaningful heat flux data, which has a high degree of similarity with that calculated by molecular dynamics simulations. This study demonstrates the potential of artificial intelligence (AI) in understanding the complex physical meaning of data in materials science. By harnessing the power of such AI to generate data that is previously attainable only through experiments or simulations, new opportunities arise for exploring and predicting properties of materials.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1361-648x/ad258b"
    },
    {
        "id": 28440,
        "title": "Enhancing the Readability of Palimpsests Using Generative Image Inpainting",
        "authors": "Mahdi Jampour, Hussein Mohammed, Jost Gippert",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012347100003654"
    },
    {
        "id": 28441,
        "title": "Persistent Homology Based Generative Adversarial Network",
        "authors": "Jinri Bao, Zicong Wang, Junli Wang, Chungang Yan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011648200003417"
    },
    {
        "id": 28442,
        "title": "Generative Texture Super-Resolution via Differential Rendering",
        "authors": "Milena Bagdasarian, Peter Eisert, Anna Hilsmann",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012303300003660"
    },
    {
        "id": 28443,
        "title": "Multiclass Texture Synthesis Using Generative Adversarial Networks",
        "authors": "Maroš Kollár, Lukas Hudec, Wanda Benesova",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011657500003417"
    },
    {
        "id": 28444,
        "title": "A NOVEL SPECIALIZED SEARCH ENGINE FOR AI-MODELS AND THEIR COMPARISON",
        "authors": "Imane Haidar, Ziad Doughan, Ali M. Haidar",
        "published": "2023-5-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54729/2789-8334.1099"
    },
    {
        "id": 28445,
        "title": "Using Deep Generative Models for Glossy Appearance Synthesis and Exploration",
        "authors": "Abhinav Reddy Nimma, Davit Gigilashvili",
        "published": "2023-9-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/euvip58404.2023.10323065"
    },
    {
        "id": 28446,
        "title": "Invited Session III: Neural network models of the visual system: Reverse-engineering neural code in the language of objects and generative models",
        "authors": "Ilker Yildirim",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1167/jov.23.11.19"
    },
    {
        "id": 28447,
        "title": "Generative Approach for Probabilistic Human Mesh Recovery using Diffusion Models",
        "authors": "Hanbyel Cho, Junmo Kim",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00452"
    },
    {
        "id": 28448,
        "title": "Comparative Analysis of Generative AI Models",
        "authors": "Geeta Rani, Jagjit Singh, Abhishek Khanna",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10465941"
    },
    {
        "id": 28449,
        "title": "Outlier Detection for Generative Models with Performance Guarantees",
        "authors": "Jingchao Gao, Jirong Yi, Weiyu Xu",
        "published": "2023-3-22",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ciss56502.2023.10089758"
    },
    {
        "id": 28450,
        "title": "Generative Models vs Discriminative Models: Which Performs Better in Detecting Cyberbullying in Memes?",
        "authors": "Raghav Jain, Krishanu Maity, Prince Jha, Sriparna Saha",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191363"
    },
    {
        "id": 28451,
        "title": "Privacy-preserving Approximate Query Processing with Differentially Private Generative Models",
        "authors": "Jiwon Ock, Taewhi Lee, Seongmin Kim",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386956"
    },
    {
        "id": 28452,
        "title": "Generative AI: Overview, Economic Impact, and Applications in Asset Management",
        "authors": "Martin Luk",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4574814"
    },
    {
        "id": 28453,
        "title": "Rethinking the Use of Classroom Cases: Leveraging Generative and Multimedia Principles for Meaningful Preservice Teacher Learning",
        "authors": "Samuel A. O. Aina, Mary A. O. Aina",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4236/ce.2023.145062"
    },
    {
        "id": 28454,
        "title": "3 Generative AI Applications for IoT You Must Know About",
        "authors": "Maria Kanwal",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4667577"
    },
    {
        "id": 28455,
        "title": "Component-aware generative autoencoder for structure hybrid and shape completion",
        "authors": "Fan Zhang, Qiang Fu, Yang Liu, Xueming Li",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.gmod.2023.101185"
    },
    {
        "id": 28456,
        "title": "Creative Performance of Indonesian Game Developers: An Empirical Study of Mediation Models of Creative Self-Efficacy and Creative Process Engagement",
        "authors": "Okta Prihatma Bayu Putra, Agustinus Bandur, Engkos Achmad Kuncoro, Sasmoko Sasmoko",
        "published": "2023-7-7",
        "citations": 1,
        "abstract": "Prior empirical research focused on creative performance was restricted to companies in the fashion industry and manufacturing industries. However, research on creative performance in the game industry is still lacking. Millennials and gen Z are the largest generational cohort in most companies. Previous studies show that both generations will work better in a non-formal environment. This study investigates the connection between creative performance and leader-member exchange in the context of game developers in Indonesia. Also examined were the relationship’s mediation effects of creative self-efficacy and engagement in the creative process. The study sample included 253 Indonesian game development companies respondents, and the data was analyzed using SMART-PLS. The findings showed that the relationship between a supervisor and a subordinate positively connected to creative performance and that creative self-efficacy and participation in the creative process mediated this positive association. This study recommends that managers and staff members establish informal interactions outside of work. Both sides must understand that creating such partnerships can lead to several advantageous results, including an increase in creativity.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37394/23207.2023.20.133"
    },
    {
        "id": 28457,
        "title": "Finding Needles in Haystack: Formal Generative Models for Efficient Massive Parallel Simulations",
        "authors": "Osama Maqbool, Jürgen Roßmann",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-spring57618.2023.10201233"
    },
    {
        "id": 28458,
        "title": "Generation of Robot Manipulation Plans Using Generative Large Language Models",
        "authors": "Jan-Philipp Töberg, Philipp Cimiano",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/irc59093.2023.00039"
    },
    {
        "id": 28459,
        "title": "The Differentiated Creative search (DCS): Leveraging Differentiated knowledge-acquisition and Creative realism to address complex optimization problems",
        "authors": "Poomin Duankhan, Khamron Sunat, Sirapat Chiewchanwattana, Patchara Nasa-ngium",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123734"
    },
    {
        "id": 28460,
        "title": "Generative vs. Non-Generative Models in Engineering Shape Optimization",
        "authors": "Zahid Masood, Muhammad Usama, Shahroz Khan, Konstantinos Kostas, Panagiotis D. Kaklis",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Generative models offer design diversity but tend to be computationally expensive, while non-generative models are computationally cost-effective but produce less diverse and often invalid designs. However, the limitations of non-generative models can be overcome with the introduction of augmented shape signature vectors (SSVs) to represent both geometric and physical information. This recent advancement has inspired a systematic comparison of the effectiveness and efficiency of generative and non-generative models in constructing design spaces for novel and efficient design exploration and shape optimization, which is demonstrated in this work. These models are showcased in airfoil/hydrofoil design, and a comparison of the resulting design spaces is conducted in this work. A conventional generative adversarial network (GAN) and a state-of-the-art generative model, the performance-augmented diverse generative adversarial network (PaDGAN), are juxtaposed with a linear non-generative model based on the coupling of the Karhunen–Loève Expansion and a physics-informed shape signature vector (SSV-KLE). The comparison demonstrates that, with an appropriate shape encoding and a physics-augmented design space, non-generative models have the potential to cost-effectively generate high-performing valid designs with enhanced coverage of the design space. In this work, both approaches were applied to two large foil profile datasets comprising real-world and artificial designs generated through either a profile-generating parametric model or a deep-learning approach. These datasets were further enriched with integral properties of their members’ shapes, as well as physics-informed parameters. The obtained results illustrate that the design spaces constructed by the non-generative model outperform the generative model in terms of design validity, generating robust latent spaces with no or significantly fewer invalid designs when compared to generative models. The performance and diversity of the generated designs were compared to provide further insights about the quality of the resulting spaces. These findings can aid the engineering design community in making informed decisions when constructing design spaces for shape optimization, as it has been demonstrated that, under certain conditions, computationally inexpensive approaches can closely match or even outperform state-of-the art generative models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jmse12040566"
    },
    {
        "id": 28461,
        "title": "Generating Multimodal Augmentations with LLMs from Song Metadata for Music Information Retrieval",
        "authors": "Federico Rossetto, Jeffrey Dalton, Roderick Murray-Smith",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3607827.3616842"
    },
    {
        "id": 28462,
        "title": "Exploring generative frameworks for product attribute value extraction",
        "authors": "Kalyani Roy, Pawan Goyal, Manish Pandey",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122850"
    },
    {
        "id": 28463,
        "title": "Human innovation and the creative agency of the world in the age of generative AI",
        "authors": "Markus F. Peschl",
        "published": "2024-3",
        "citations": 0,
        "abstract": " With the advent of Large Language Models, such as ChatGPT, and, more generally, generative AI/cognitive technologies, global knowledge production faces a critical systemic challenge. It results from continuously feeding back non- or poorly-creative copies of itself into the global knowledge base; in the worst case, this could not only lead to a stagnation of creative, reliable, and valid knowledge generation, but also have an impact on our material (and subsequently our social) world and how it will be shaped by these rather uninspired automatized knowledge dynamics. More than ever, there appears to be an imperative to bring the creative human agent back into the loop. Arguments from the perspectives of 4E- and Material Engagement Theory approaches to cognition, human-technology relations as well as possibility studies will be used to show that being embodied, sense-making, and enacting the world by proactively and materially interacting with it are key ingredients for any kind of knowledge and meaning production. It will be shown that taking seriously the creative agency of the world, an engaged epistemology, as well as making use of future potentials/possibilities complemented and augmented by cognitive technologies are all essential for re-introducing profound novelty and creativity. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/27538699241238049"
    },
    {
        "id": 28464,
        "title": "Evaluating deep generative models on cognitive tasks: a case study",
        "authors": "Zhisheng Tang, Mayank Kejriwal",
        "published": "2023-6-6",
        "citations": 0,
        "abstract": "AbstractWe present a detailed case study evaluating selective cognitive abilities (decision making and spatial reasoning) of two recently released generative transformer models, ChatGPT and DALL-E 2. Input prompts were constructed following neutral a priori guidelines, rather than adversarial intent. Post hoc qualitative analysis of the outputs shows that DALL-E 2 is able to generate at least one correct image for each spatial reasoning prompt, but most images generated are incorrect, even though the model seems to have a clear understanding of the objects mentioned in the prompt. Similarly, in evaluating ChatGPT on the rationality axioms developed under the classical Von Neumann-Morgenstern utility theorem, we find that, although it demonstrates some level of rational decision-making, many of its decisions violate at least one of the axioms even under reasonable constructions of preferences, bets, and decision-making prompts. ChatGPT’s outputs on such problems generally tended to be unpredictable: even as it made irrational decisions (or employed an incorrect reasoning process) for some simpler decision-making problems, it was able to draw correct conclusions for more complex bet structures. We briefly comment on the nuances and challenges involved in scaling up such a ‘cognitive’ evaluation or conducting it with a closed set of answer keys (‘ground truth’), given that these models are inherently generative and open-ended in responding to prompts.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s44163-023-00067-3"
    },
    {
        "id": 28465,
        "title": "Generative Models for Feature-Based Product Development as a Basis for Hybrid Decision-Making",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.35199/dfx2023.18"
    },
    {
        "id": 28466,
        "title": "Forget me not: memorisation in generative sequence models trained on open source licensed code",
        "authors": "Ivo Emanuilov, Thomas Margoni",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4720990"
    },
    {
        "id": 28467,
        "title": "A Walk in Nature: Exploring the Creative Potentials of a Generative Design Tool for Soft Robotic Surfaces that Foster a Connection with Nature.",
        "authors": "Elena B. Sabinson, Keith Evan Green",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3591196.3593367"
    },
    {
        "id": 28468,
        "title": "Identity Generation with Deep Generative Models",
        "authors": "Nunzio Alexandro Letizia",
        "published": "2023-3-16",
        "citations": 0,
        "abstract": "Deep generative models have drawn the attention of the AI community in the last decade. The scalability of neural architectures helps solving multiple relevant problems, e.g., text-to-image generation, otherwise not addressable. In the context of image data privacy, the increasing amount of produced, shared, and stored images imposes new measures to protect personal identity information. At the same time, such protection mechanisms need to preserve the image quality. In this talk, we discuss how PiktID is using some recent deep learning-based techniques for protecting human identities in pictures. We show several examples, and we present interesting use-cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18690/um.feri.4.2023.3"
    },
    {
        "id": 28469,
        "title": "An Efficient Dataflow for Convolutional Generative Models",
        "authors": "Zhengzheng Ma, Guojie Luo",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icfpt59805.2023.00011"
    },
    {
        "id": 28470,
        "title": "Revolutionizing Translation with AI: Unravelling Neural Machine Translation and Generative Pre-Trained Large Language Models",
        "authors": "Sai Cheong Siu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4499768"
    },
    {
        "id": 28471,
        "title": "Large Language Models and Generative AI in Finance: An Analysis of ChatGPT, Bard, and Bing AI",
        "authors": "David Krause",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4511540"
    },
    {
        "id": 28472,
        "title": "Predicting protein conformational ensembles using deep generative models",
        "authors": "Shrishti Barethiya, Jian Huang, Jianhan Chen",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bpj.2023.11.3320"
    },
    {
        "id": 28473,
        "title": "Portrait Reification with Generative Diffusion Models",
        "authors": "Andrea Asperti, Gabriele Colasuonno, Antonio Guerra",
        "published": "2023-5-25",
        "citations": 2,
        "abstract": "An application of Generative Diffusion Techniques for the reification of human portraits in artistic paintings is presented. By reification we intend the transformation of the painter’s figurative abstraction into a real human face. The application exploits a recent embedding technique for Denoising Diffusion Implicit Models (DDIM), inverting the generative process and mapping the visible image into its latent representation. In this way, we can first embed the portrait into the latent space, and then use the reverse diffusion model, trained to generate real human faces, to produce the most likely real approximation of the portrait. The actual deployment of the application involves several additional techniques, mostly aimed to automatically identify, align, and crop the relevant portion of the face, and to postprocess the generated reification in order to enhance its quality and to allow a smooth reinsertion in the original painting.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13116487"
    },
    {
        "id": 28474,
        "title": "Journal policy on large language generative models",
        "authors": "Daniel I. Sessler, Alparslan Turan",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jclinane.2024.111450"
    },
    {
        "id": 28475,
        "title": "A Mathematical Investigation of Hallucination and Creativity in GPT Models",
        "authors": "Minhyeok Lee",
        "published": "2023-5-16",
        "citations": 11,
        "abstract": "In this paper, we present a comprehensive mathematical analysis of the hallucination phenomenon in generative pretrained transformer (GPT) models. We rigorously define and measure hallucination and creativity using concepts from probability theory and information theory. By introducing a parametric family of GPT models, we characterize the trade-off between hallucination and creativity and identify an optimal balance that maximizes model performance across various tasks. Our work offers a novel mathematical framework for understanding the origins and implications of hallucination in GPT models and paves the way for future research and development in the field of large language models (LLMs).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11102320"
    },
    {
        "id": 28476,
        "title": "Reconstructing heterogenous porous media in 3D using 2D input via deep-learning-based generative models",
        "authors": "Hannah Vogel, Hamed Amiri, Austin Arias, Oliver Plümper",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.7185/gold2023.20172"
    },
    {
        "id": 28477,
        "title": "Will Large-scale Generative Models Corrupt Future Datasets?",
        "authors": "Ryuichiro Hataya, Han Bao, Hiromi Arai",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.01879"
    },
    {
        "id": 28478,
        "title": "Deep Generative Models for Data Synthesis and Augmentation in Machine Learning",
        "authors": " Kiran Mayee Adavala",
        "published": "2024-4-4",
        "citations": 0,
        "abstract": "The increasing trend in deep generative modelling, which offers data scarcity and diversity solutions in machine learning, is one of the most recent developments in the field. The data-oriented approaches drive the need for the quality and variety of data sets that could be prevented due to privacy issues and limited resources. Generative deep models, basically GANs (Generative Adversarial Networks) and VAEs (Variational Automatic Encoders), appear to be the most reliable approach to the synthesis and augmentation of the data. These models employ deep learning to basically learn all by itself from raw data without anyone teaching it, which is the basis of modern artificial intelligence. Accuracy issues between overfitting and poor generalization emphasize the need for smart solutions to the problem of data shortness. Deep generative modelling works based on the data distribution, which the model learns by itself and enables a realistic sample generator. The study reviews the proficiency and complexity of GANs, VAEs, and WGANs, comparing the WGANs' capabilities with the former two. Techniques of data augmentation, e.g., repositioning, rotation, and adding Gaussian noise to the dataset, will greatly increase the diversity of the data. Regardless of the training time, all models showcase competitive inference performance and, as a result, may be satisfactorily used in real-time operations. The insights obtained shed light on ways to improve machine learning and artificial intelligence through brain data synthesis, model training, and computational efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/jes.1435"
    },
    {
        "id": 28479,
        "title": "A Recycling Training Strategy for Medical Image Segmentation with Diffusion Denoising Models",
        "authors": "Yunguan Fu, Yiwen Li, Shaheer U. Saeed, Matthew J. Clarkson, Yipeng Hu",
        "published": "2023-12-7",
        "citations": 1,
        "abstract": "Denoising diffusion models have found applications in image segmentation by generating segmented masks conditioned on images. Existing studies predominantly focus on adjusting model architecture or improving inference, such as test-time sampling strategies. In this work, we focus on improving the training strategy and propose a novel recycling method. During each training step, a segmentation mask is first predicted given an image and a random noise. This predicted mask, which replaces the conventional ground truth mask, is used for denoising task during training. This approach can be interpreted as aligning the training strategy with inference by eliminating the dependence on ground truth masks for generating noisy samples. Our proposed method significantly outperforms standard diffusion training, self-conditioning, and existing recycling strategies across multiple medical imaging data sets: muscle ultrasound, abdominal CT, prostate MR, and brain MR. This holds for two widely adopted sampling strategies: denoising diffusion probabilistic model and denoising diffusion implicit model. Importantly, existing diffusion models often display a declining or unstable performance during inference, whereas our novel recycling consistently enhances or maintains performance. We show for the first time that, under a fair comparison with the same network architectures and computing budget, the proposed recycling-based diffusion models achieved on-par performance with non-diffusion-based supervised training. Furthermore, by ensembling the proposed diffusion model and the non-diffusion counterpart, significant improvements to the non-diffusion models have been observed across all applications, demonstrating the value of this novel training method. This paper summarizes these quantitative results and discusses their values, with a fully reproducible JAX-based implementation, released at <a href='https://github.com/mathpluscode/ImgX-DiffSeg'>https://github.com/mathpluscode/ImgX-DiffSeg</a>",
        "keywords": "",
        "link": "http://dx.doi.org/10.59275/j.melba.2023-fbe4"
    },
    {
        "id": 28480,
        "title": "DiffusionBERT: Improving Generative Masked Language Models with Diffusion Models",
        "authors": "Zhengfu He, Tianxiang Sun, Qiong Tang, Kuanning Wang, Xuanjing Huang, Xipeng Qiu",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.248"
    },
    {
        "id": 28481,
        "title": "Generative AI and Patient Care: A Systematic Review Examining Applications, Limitations, and Future Directions for ChatGPT in Healthcare",
        "authors": "Dominic Etli",
        "published": "2024",
        "citations": 0,
        "abstract": "Background: Generative artificial intelligence (AI) tools like ChatGPT have emerged as potentially valuable technologies to augment human expertise in healthcare. However, uncertainties remain regarding appropriate clinical applications and limitations. This review synthesizes current evidence on using generative AI for clinical decision support, patient data processing, and medical education. Methods: A systematic search of Web of Science, Scopus, and ProQuest databases identified 33 relevant studies published in 2023 examining ChatGPT for healthcare uses. Two reviewers extracted data on study characteristics, AI system details, key results, and authors' conclusions. Evidence was synthesized qualitatively using a comparative analysis approach. Results: Supervised use of ChatGPT-generated simulations appeared beneficial for clinical training, but oversight was critical. Numerous studies found risks in relying on ChatGPT's clinical suggestions given frequent factual errors, outdated recommendations, and inappropriate advice. However, ChatGPT demonstrated potential for enhancing workflows via medical documentation automation. Conclusions: While showing promise for constrained uses like supervised education and documentation, findings caution against open-ended ChatGPT integration in clinical practice currently. Additional large-scale comparative effectiveness research is imperative to establish evidence-based implementation guidance. Responsible translation requires governance, validation against literature, and focus on human-AI collaboration versus replacement. Further inquiry can illuminate best practices for balancing innovation and safety.",
        "keywords": "",
        "link": "http://dx.doi.org/10.23880/jqhe-16000361"
    },
    {
        "id": 28482,
        "title": "A Generative Model for Guided Thermal Image Super-Resolution",
        "authors": "Patricia Suárez, Angel Sappa",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012469400003660"
    },
    {
        "id": 28483,
        "title": "Solving Hungarian natural language processing tasks with multilingual generative models",
        "authors": "Zijian Győző Yang, László János Laki",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.33039/ami.2022.11.001"
    },
    {
        "id": 28484,
        "title": "Inference and Learning for Generative Capsule Models",
        "authors": "Alfredo Nazabal, Nikolaos Tsagkas, Christopher K. I. Williams",
        "published": "2023-3-18",
        "citations": 0,
        "abstract": "AbstractCapsule networks (see Hinton et al., 2018) aim to encode knowledge of and reason about the relationship between an object and its parts. In this letter, we specify a generative model for such data and derive a variational algorithm for inferring the transformation of each model object in a scene and the assignments of observed parts to the objects. We derive a learning algorithm for the object models, based on variational expectation maximization (Jordan et al., 1999). We also study an alternative inference algorithm based on the RANSAC method of Fischler and Bolles (1981). We apply these inference methods to data generated from multiple geometric objects like squares and triangles (“constellations”) and data from a parts-based model of faces. Recent work by Kosiorek et al. (2019) has used amortized inference via stacked capsule autoencoders to tackle this problem; our results show that we significantly outperform them where we can make comparisons (on the constellations data).",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/neco_a_01564"
    },
    {
        "id": 28485,
        "title": "Enhancing Text Classification Models with Generative AI-aided Data Augmentation",
        "authors": "Huanhuan Zhao, Haihua Chen, Hong-Jun Yoon",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aitest58265.2023.00030"
    },
    {
        "id": 28486,
        "title": "Viewset Diffusion: (0-)Image-Conditioned 3D Generative Models from 2D Data",
        "authors": "Stanislaw Szymanowicz, Christian Rupprecht, Andrea Vedaldi",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccv51070.2023.00814"
    },
    {
        "id": 28487,
        "title": "Navigating Generative Artificial Intelligence Promises and Perils for Knowledge and Creative Work",
        "authors": "Hind Benbya,  , Franz Strich, Toomas Tamm,  ,  ",
        "published": "2024",
        "citations": 2,
        "abstract": "Generative artificial intelligence (GenAI) is rapidly becoming a viable tool to enhance productivity and act as a catalyst for innovation across various sectors. Its ability to perform tasks that have traditionally required human judgment and creativity is transforming knowledge and creative work. Yet it also raises concerns and implications that could reshape the very landscape of knowledge and creative work. In this editorial, we undertake an in-depth examination of both the opportunities and challenges presented by GenAI for future IS research.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17705/1jais.00861"
    },
    {
        "id": 28488,
        "title": "Multiclass malaria parasite recognition based on transformer models and a generative adversarial network",
        "authors": "Dianhuan Tan, Xianghui Liang",
        "published": "2023-10-10",
        "citations": 1,
        "abstract": "AbstractMalaria is an extremely infectious disease and a main cause of death worldwide. Microscopic examination of thin slide serves as a common method for the diagnosis of malaria. Meanwhile, the transformer models have gained increasing popularity in many regions, such as computer vision and natural language processing. Transformers also offer lots of advantages in classification task, such as Fine-grained Feature Extraction, Attention Mechanism etc. In this article, we propose to assist the medical professionals by developing an effective framework based on transformer models and a generative adversarial network for multi-class plasmodium classification and malaria diagnosis. The Generative Adversarial Network is employed to generate extended training samples from multiclass cell images, with the aim of enhancing the robustness of the resulting model. We aim to optimize plasmodium classification to achieve an exact balance of high accuracy and low resource consumption. A comprehensive comparison of the transformer models to the state-of-the-art methods proves their efficiency in the classification of malaria parasite through thin blood smear microscopic images. Based on our findings, the Swin Transformer model and MobileVit outperform the baseline architectures in terms of precision, recall, F1-score, specificity, and FPR on test set (the data was divided into train: validation: test splits). It is evident that the Swin Transformer achieves superior detection performance (up to 99.8% accuracy), while MobileViT demonstrates lower memory usage and shorter inference times. High accuracy empowers healthcare professionals to conduct precise diagnoses, while low memory usage and short inference times enable the deployment of predictive models on edge devices with limited computational and memory resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-44297-y"
    },
    {
        "id": 28489,
        "title": "Generative Pre-trained Transformer (GPT) Models for Irony Detection and Classification",
        "authors": "Mustafa Ulvi Aytekin, O. Ayhan Erdem",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iisec59749.2023.10391005"
    },
    {
        "id": 28490,
        "title": "Multiclass Skin Disease Classification using Generative Adversarial Networks and Neural Network Models",
        "authors": "Karan S, Suja Palaniswamy",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276149"
    },
    {
        "id": 28491,
        "title": "Personalized Aging-in-Place Support Through Fine-Tuning of Generative AI Models",
        "authors": "Henry Griffith, Heena Rathore",
        "published": "2023-11-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mobisecserv58080.2023.10329224"
    },
    {
        "id": 28492,
        "title": "Real-time Video Frame De-raining using Disentangled Generative Models",
        "authors": "Aymen Hamrouni, Raby Hamadi, Hakim Ghazzai, Yehia Massoud",
        "published": "2023-3-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sm57895.2023.10112450"
    },
    {
        "id": 28493,
        "title": "Mixup Training for Generative Models to Defend Membership Inference Attacks",
        "authors": "Zhe Ji, Qiansiqi Hu, Liyao Xiang, Chenghu Zhou",
        "published": "2023-5-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/infocom53939.2023.10229036"
    },
    {
        "id": 28494,
        "title": "On the Biometric Capacity of Generative Face Models",
        "authors": "Vishnu Naresh Boddeti, Gautam Sreekumar, Arun Ross",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ijcb57857.2023.10448647"
    },
    {
        "id": 28495,
        "title": "A Review of Generative Models in Generating Synthetic Attack Data for Cybersecurity",
        "authors": "Garima Agrawal, Amardeep Kaur, Sowmya Myneni",
        "published": "2024-1-11",
        "citations": 1,
        "abstract": "The ability of deep learning to process vast data and uncover concealed malicious patterns has spurred the adoption of deep learning methods within the cybersecurity domain. Nonetheless, a notable hurdle confronting cybersecurity researchers today is the acquisition of a sufficiently large dataset to effectively train deep learning models. Privacy and security concerns associated with using real-world organization data have made cybersecurity researchers seek alternative strategies, notably focusing on generating synthetic data. Generative adversarial networks (GANs) have emerged as a prominent solution, lauded for their capacity to generate synthetic data spanning diverse domains. Despite their widespread use, the efficacy of GANs in generating realistic cyberattack data remains a subject requiring thorough investigation. Moreover, the proficiency of deep learning models trained on such synthetic data to accurately discern real-world attacks and anomalies poses an additional challenge that demands exploration. This paper delves into the essential aspects of generative learning, scrutinizing their data generation capabilities, and conducts a comprehensive review to address the above questions. Through this exploration, we aim to shed light on the potential of synthetic data in fortifying deep learning models for robust cybersecurity applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13020322"
    },
    {
        "id": 28496,
        "title": "Adaptive Spectral Normalization for Generative Models",
        "authors": "E. A. Egorov, A. I. Rogachev",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1134/s1064562423701089"
    },
    {
        "id": 28497,
        "title": "Microstructure reconstruction of 2D/3D random materials via diffusion-based deep generative models",
        "authors": "Xianrui Lyu, Xiaodan Ren",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "AbstractMicrostructure reconstruction serves as a crucial foundation for establishing process–structure–property (PSP) relationship in material design. Confronting the limitations of variational autoencoder and generative adversarial network within generative models, this study adopted the denoising diffusion probabilistic model (DDPM) to learn the probability distribution of high-dimensional raw data and successfully reconstructed the microstructures of various composite materials, such as inclusion materials, spinodal decomposition materials, chessboard materials, fractal noise materials, and so on. The quality of generated microstructure was evaluated using quantitative measures like spatial correlation functions and Fourier descriptor. On this basis, this study also achieved the regulation of microstructure randomness and the generation of gradient materials through continuous interpolation in latent space using denoising diffusion implicit model (DDIM). Furthermore, the two-dimensional microstructure reconstruction was extended to three-dimensional framework and integrated permeability as a feature encoding embedding. This enables the conditional generation of three-dimensional microstructures for random porous materials within a defined permeability range. The permeabilities of these generated microstructures were further validated through the application of the lattice Boltzmann method. The above methods provide new ideas and references for material reverse design.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-024-54861-9"
    },
    {
        "id": 28498,
        "title": "Preliminary Study: Use of Large Generative Artificial Intelligence Models in Integrated Project Management",
        "authors": "Vartenie Aramali, Namho Cho, Sharbel Nashar",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485262.011"
    },
    {
        "id": 28499,
        "title": "Probabilistic generative transformer language models for generative design of molecules",
        "authors": "Lai Wei, Nihang Fu, Yuqi Song, Qian Wang, Jianjun Hu",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "AbstractSelf-supervised neural language models have recently found wide applications in the generative design of organic molecules and protein sequences as well as representation learning for downstream structure classification and functional prediction. However, most of the existing deep learning models for molecule design usually require a big dataset and have a black-box architecture, which makes it difficult to interpret their design logic. Here we propose the Generative Molecular Transformer (GMTransformer), a probabilistic neural network model for generative design of molecules. Our model is built on the blank filling language model originally developed for text processing, which has demonstrated unique advantages in learning the “molecules grammars” with high-quality generation, interpretability, and data efficiency. Benchmarked on the MOSES datasets, our models achieve high novelty and Scaf compared to other baselines. The probabilistic generation steps have the potential in tinkering with molecule design due to their capability of recommending how to modify existing molecules with explanation, guided by the learned implicit molecule chemistry. The source code and datasets can be accessed freely at https://github.com/usccolumbia/GMTransformer",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13321-023-00759-z"
    },
    {
        "id": 28500,
        "title": "From Turing to Transformers: A Comprehensive Review and Tutorial on the Evolution and Applications of Generative Transformer Models",
        "authors": "Emma Yann Zhang, Adrian David Cheok, Zhigeng Pan, Jun Cai, Ying Yan",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "In recent years, generative transformers have become increasingly prevalent in the field of artificial intelligence, especially within the scope of natural language processing. This paper provides a comprehensive overview of these models, beginning with the foundational theories introduced by Alan Turing and extending to contemporary generative transformer architectures. The manuscript serves as a review, historical account, and tutorial, aiming to offer a thorough understanding of the models’ importance, underlying principles, and wide-ranging applications. The tutorial section includes a practical guide for constructing a basic generative transformer model. Additionally, the paper addresses the challenges, ethical implications, and future directions in the study of generative models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/sci5040046"
    },
    {
        "id": 28501,
        "title": "Accelerated Motion Correction for MRI Using Score-Based Generative Models",
        "authors": "Brett Levac, Ajil Jalal, Jonathan I. Tamir",
        "published": "2023-4-18",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isbi53787.2023.10230457"
    },
    {
        "id": 28502,
        "title": "Softmax Bias Correction for Quantized Generative Models",
        "authors": "Nilesh Prasad Pandey, Marios Fournarakis, Chirag Patel, Markus Nagel",
        "published": "2023-10-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccvw60793.2023.00157"
    },
    {
        "id": 28503,
        "title": "A generalized optimization-based generative adversarial network",
        "authors": "Bahram Farhadinia, Mohammad Reza Ahangari, Aghileh Heydari, Amitava Datta",
        "published": "2024-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.eswa.2024.123413"
    },
    {
        "id": 28504,
        "title": "MAGAN: A Meta-Analysis for Generative Adversarial Networks’ Latent Space",
        "authors": "Frederic Rizk, Rodrigue Rizk, Dominick Rizk, Chee-Hung Chu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011771900003411"
    }
]