[
    {
        "id": 19671,
        "title": "Omicron ACO. A New Ant Colony Optimization Algorithm",
        "authors": "Benjamın Baran, Osvaldo Gomez",
        "published": "2018-7-28",
        "citations": 4,
        "abstract": "\r\n\r\n\r\nAnt Colony Optimization (ACO) is a metaheuristic inspired by the foraging behavior of ant colonies that has been successful in the resolution of hard combinatorial optimization problems like the Traveling Salesman Problem (TSP). This paper proposes the Omicron ACO (OA), a novel population-based ACO alternative originally designed as an analytical tool. To experimentally prove OA advantages, this work compares the behavior between the OA and the MMAS as a function of time in two well-known TSP problems. A simple study of the behavior of OA as a function of its parameters shows its robustness.\r\n\r\n\r\n",
        "link": "http://dx.doi.org/10.19153/cleiej.8.1.5"
    },
    {
        "id": 19672,
        "title": "Distribution Optimization Using Ant Colony Optimization (ACO) Method Case Research: PT. Coca Cola Official Distributor of Surabaya Area",
        "authors": "",
        "published": "2020-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.11594/nstp.2020.0540"
    },
    {
        "id": 19673,
        "title": "The HEX-ACO-18: Developing an age-invariant HEXACO short scale using Ant Colony Optimization",
        "authors": "Gabriel Olaru, Kristin Jankowsky",
        "published": "No Date",
        "citations": 1,
        "abstract": "In this study, we developed an age-invariant 18-item short form of the HEXACO Personality Inventory for use in developmental personality research. We employed a combination of the item selection procedure ant colony optimization (ACO) and the model estimation approach local structural equation modeling (LSEM). ACO is a metaheuristic algorithm that selects and evaluates items based on the quality of the resulting short scale, thus allowing for the direct optimization of criteria that can only be estimated based on combinations of items, such as model fit and measurement invariance across age. LSEM allows for model estimation and measurement invariance testing across a continuous age variable by weighting participants based on their age, rather than splitting the sample into artificial age groups. Using a HEXACO-100 dataset of N = 6,419 participants ranging from 16 to 90 years of age, we selected a short form optimized for model fit, measurement invariance, facet coverage, and balance of item keying. The resulting HEX ACO 18 short scale showed adequate model fit, scalar measurement invariance across age, and covered three out of four facets from each HEXACO trait domain. Furthermore, the usefulness and versatility of the item and person sampling procedures ACO and LSEM is demonstrated.",
        "link": "http://dx.doi.org/10.31234/osf.io/u8zx7"
    },
    {
        "id": 19674,
        "title": "Reliable Wireless Sensor Network using Ant Colony Optimization (ACO)",
        "authors": "Kruthi B, Santosh Anand",
        "published": "2022-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icesc54411.2022.9885467"
    },
    {
        "id": 19675,
        "title": "ACO for Workforce Planning",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_9"
    },
    {
        "id": 19676,
        "title": "Development And Analysis of Ant Colony Optimization-Based Light Weight Container (ACO-LWC) Algorithm For Efficient Load Balancing",
        "authors": "Aruna K, Pradeep G",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nContainer technology is the latest lightweight virtualization technology which is an alternate solution for virtual machines. Docker is the most popular container technology for creating and managing Linux containers. Containers appear to be the most suitable medium for use in dynamic development, packaging, shipping and many other information technology environments. The portability of the software through the movement of containers is appreciated by businesses and IT professionals. In the docker container, one or more processes may run simultaneously. The main objective of this work is to propose a new algorithm called Ant Colony Optimization-based Light Weight Container (ACO-LWC) load balancing scheduling algorithm for scheduling various process requests. This algorithm is designed such that it shows best performance in terms of load balancing. The proposed algorithm is validated by comparison with two existing load balancing scheduling algorithms namely, least connection algorithm and round robin algorithm. The proposed algorithm is validated using metrics like response time (ms), mean square error (MSE), node load, largest TPS of cluster (fetches/sec), average response time for each request (ms) and run time (s). Quantitative analysis show that the proposed ACO-LWC scheme achieves best performance in terms of all the metrics compared to the existing algorithms. In particular, the response time for least connection, round robin and the proposed ACO-LWC algorithm are 58ms, 60ms and 48ms respectively when 95% requests are finished. Similarly, the error for scheduling 120 requests using least connection, round robin and the proposed ACO-LWC algorithm are 0.15, 0.11 and 0.06 respectively.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-882608/v1"
    },
    {
        "id": 19677,
        "title": "Efficient Security Auditing for the Centric Cloud Computing System and Service (CCSS) For Improving Quality of Service by Applying Ant Colony Optimization (ACO)",
        "authors": "Pushpa P.",
        "published": "2020-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12sp4/20201585"
    },
    {
        "id": 19678,
        "title": "ACO for Image Edge Detection",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_8"
    },
    {
        "id": 19679,
        "title": "ACO for GPS Surveying Problem",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_5"
    },
    {
        "id": 19680,
        "title": "Optimization of Association Rule Using Ant Colony Optimization (ACO) Approach",
        "authors": " Roni La’biran,  Muhammad Kristiawan",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "The Apriori algorithm creates all possible association rules between items in the database using the Association Rule Mining and Apriori Algorithm. Using Ant Colony Optimization, a new algorithm is proposed for improving association rule mining results. Using ant colony behaviour as a starting point, an optimization of ant colonies (ACO) is developed. The Apriori algorithm creates association rules. Determine the weakest rule set and reduce the association rules to find rules of higher quality than apriori based on the Ant Colony algorithm's threshold value. Through optimization and improvement of rules generated for ACO, the proposed research work aims to reduce the scanning of datasets.",
        "link": "http://dx.doi.org/10.31185/wjcms.190"
    },
    {
        "id": 19681,
        "title": "Solving Travelling Salesman Problem(TSP) Using Ant Colony Optimization(ACO)",
        "authors": " Nwamae, Believe B.,  ",
        "published": "2018-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17577/ijertv7is070129"
    },
    {
        "id": 19682,
        "title": "ACO for Wireless Sensor Network Positioning",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_7"
    },
    {
        "id": 19683,
        "title": "Ant Colony Optimization (ACO) Based MANET Routing Protocols: A Comprehensive Review",
        "authors": "Ahmad Khader Habboush",
        "published": "2019-1-27",
        "citations": 3,
        "abstract": "Application of mobile ad hoc networks (MANETs) has gained significant popularity among researchers in the field of data communication networks. However, a MANET operating in a wireless environment imposes a number of challenges for the implementers so far as routing of packets across it is concerned. There is a wide range of research contributions are available in the literature wherein authors propose various solutions to overcome the problems and bottleneck related to routing in MANET. Especially soft computing techniques and Ant Colony Optimization (ACO) in particular has been significantly popular among the researchers to resolve MANET routing issues. This technique plays a vital role in route discovery in particular. In this paper, we have conducted a comprehensive review of this technique applied to routing in MANET with respect to various criteria. Hopefully this paper serves to a perfect document for researchers in this field.",
        "link": "http://dx.doi.org/10.5539/cis.v12n1p82"
    },
    {
        "id": 19684,
        "title": "PENYELESAIAN ASSIGNMENT PROBLEM DENGAN ALGORITMA METAHEURISTIK ANT COLONY OPTIMIZATION   (ACO)",
        "authors": "Herry Kartika Gandhi, Widyawati Widyawati",
        "published": "2019-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36055/jiss.v5i1.6494"
    },
    {
        "id": 19685,
        "title": "ACO for E. coli Cultivation Model",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_6"
    },
    {
        "id": 19686,
        "title": "An Ant Colony Optimization Memorizing Better Solutions (ACO-MBS) for Traveling Salesman Problem",
        "authors": "Dursun Ekmekci",
        "published": "2019-10",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ismsit.2019.8932768"
    },
    {
        "id": 19687,
        "title": "Introductory Chapter: Ant Colony Optimization",
        "authors": "Ali Soofastaei",
        "published": "2022-5-11",
        "citations": 1,
        "abstract": "",
        "link": "http://dx.doi.org/10.5772/intechopen.103801"
    },
    {
        "id": 19688,
        "title": "Emergency Automobile Data Transmission with Ant Colony Optimization (ACO)",
        "authors": "Chetana Hemant Nemade, Uma Pujeri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12720/jait.14.5.1003-1011"
    },
    {
        "id": 19689,
        "title": "Recloser Placement Optimization In The PDP-03 Radial Network Distribution System Using Ant Colony Optimization (ACO)",
        "authors": "Bambang Winardi, Sudjadi Sudjadi, Bambang Winardi",
        "published": "2022-11-22",
        "citations": 0,
        "abstract": "The increasing demand for electricity demanded that the power distribution system has a good reliability. To improve the reliability of electric power systems, PT. PLN Area Semarang use Recloser on the electricity network. Nowadays, the determination of recloser position is very important in reliability of electrical power system. Reliability index used in distribution systems are SAIFI and SAIDI. The value of SAIFI and SAIDI can be calculated from the outage time and the failure rate occurred in one year. Reliability can be concluded better if SAIFI and SAIDI smaller. This research aims to determine the optimal placement of recloser location on the electrical network in feeder PDP 03 Pudak Payung substation. The method used for the recloser location placement is Ant Colony Optimization (ACO) using Matlab Software R2014a. From simulation result, it can be concluded that the reliability value before and after placement recloser changed. SAIFI and SAIDI before recloser placement is 1.0172 times/year and 2.5435 hours/year. Optimal placement location for 1 recloser is at a location 4 with a value of SAIFI and SAIDI is 0.3361 times/year and 1.0456 hours/year. While for 2 reclosers is at a location 2 and 7 with a value of SAIFI and SAIDI is 0.26755 times/year and 0.86069 hours/year.",
        "link": "http://dx.doi.org/10.55642/eatij.v4i03.240"
    },
    {
        "id": 19690,
        "title": "Open Government Data (OGD) portals selection using Ant Colony Optimization (ACO) Algorithm",
        "authors": "",
        "published": "2020-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.30534/ijatcse/2020/344942020"
    },
    {
        "id": 19691,
        "title": "Prospects of Ant Colony Optimization(ACO) in Various Domains",
        "authors": "Preethi S. H. Darius, Joshua Devadason, Darius Gnanaraj Solomon",
        "published": "2022-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/i4c57141.2022.10057938"
    },
    {
        "id": 19692,
        "title": "A novel ant colony optimization (ACO) based energy efficient multipath routing protocol for sensor communications",
        "authors": "Anand Nayyar, Rajeshwar Singh",
        "published": "2019-3-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3233/idt-170172"
    },
    {
        "id": 19693,
        "title": "Ant Colony Optimization (ACO) based Data Hiding in Image Complex Region",
        "authors": "Sahib Khan",
        "published": "2018-2-1",
        "citations": 20,
        "abstract": "This paper presents data an Ant colony optimization (ACO) based data hiding technique. ACO is used to detect complex region of cover image and afterward, least significant bits (LSB) substitution is used to hide secret information in the detected complex regions’ pixels. ACO is an algorithm developed inspired by the inborn manners of ant species. The ant leaves pheromone on the ground for searching food and provisions. The proposed ACO-based data hiding in complex region establishes an array of pheromone, also called pheromone matrix, which represents the complex region in sequence at each pixel position of the cover image. The pheromone matrix is developed according to the movements of ants, determined by local differences of the image element’s intensity. The least significant bits of complex region pixels are substituted with message bits, to hide secret information. The experimental results, provided, show the significance of the performance of the proposed method.",
        "link": "http://dx.doi.org/10.11591/ijece.v8i1.pp379-389"
    },
    {
        "id": 19694,
        "title": "Sistem optimasi pendistribusian bahan makanan dan snack dengan algoritma Ant Colony Optimization (ACO)",
        "authors": "Lutfi Erik Prasetyo, Istiadi Istiadi, Fitri Marisa",
        "published": "2021-10-11",
        "citations": 0,
        "abstract": "Kegiatan distribusi merupakan kegiatan penyaluran barang dan jasa yang dibuat dari produsen ke konsumen agar tersebar luas. Begitulah yang dilakukan oleh perusahaan CV. Landahur , perusahaan ini bertanggung jawab untuk mendistribusikan bahan makanan dan snack dari prinsipal menuju ke customer. Hal tersebut dilakukan supaya memudahkan customer dan produsen baik untuk membeli dan menjual. Dalam prosesnya pendistribusian seorang salesman akan melakukan kunjungan ke customer dengan tujuan untuk menjual bahan makanan dan snack tersebut, Namun dengan banyaknya customer yang perlu dikunjungi maka diperlukan rekomendasi rute terbaik. Dalam penelitian ini menggunakan algoritma Ant Colony Optimization (ACO). ACO digunakan karena mampu menunjukan rute terbaik dengan menetapkan parameter-parameter. Pada penelitian ini telah melakukan 2 ujicoba, ujicoba pertama dengan menggunakan 5 data didapatkan jarak 20,3 km dan ujicoba kedua menggunakan 10 data didapatkan jarak rute terbaik 22,96 km dengan parameter yang jumlah semut 3, 2iterasi, α = 1, β = 0,5, ρ = 0,5194, Pheromone awal = 0,1. Dengan adanya sistem tersebut diharapkan dapat membantu salesman mendapatkan informasi rute terbaik dengan tepat dan akurat",
        "link": "http://dx.doi.org/10.24246/aiti.v18i1.88-96"
    },
    {
        "id": 19695,
        "title": "Ant Colony Optimization-based Light Weight Container (ACO-LWC) Algorithm for Efficient Load Balancing",
        "authors": "K. Aruna, G. Pradeep",
        "published": "2022",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32604/iasc.2022.024317"
    },
    {
        "id": 19696,
        "title": "A prototype DWIPA trip planner: When e-tourism collides with Ant Colony Optimization (ACO) algorithm",
        "authors": "Guson Prasamuarso Kuntarto, Khalish Ramadhansyah, Irwan Prasetya Gunawan",
        "published": "2020-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429444562-11"
    },
    {
        "id": 19697,
        "title": "Optimization based Tuberculosis Image Segmentation by Ant Colony Heuristic Method",
        "authors": "",
        "published": "2022-1",
        "citations": 0,
        "abstract": "Tuberculosis (TB) is a worldwide health crisis and is the second primary infectious disease that causes death next to human immunodeficiency virus. In this work, an attempt has been made to detect the presence of bacilli in sputum smears. The smear images recorded under standard image acquisition protocol are subjected to hybrid Ant Colony Optimization (ACO)-morphological based segmentation procedure. This method is able to retain the shape of bacilli in TB images. The segmented images are validated with ground truth using overlap, distance and probability-based measures. Significant shape-based features such as area, perimeter, compactness, shape factor and tortuosity are extracted from the segmented images. It is observed that this method preserves more edges, detects the presence of bacilli and facilitates direct segmentation with reduced number of redundant searches to generate edges. Thus this hybrid segmentation technique aid in the diagnostic relevance of TB images in identifying the objects present in them.",
        "link": "http://dx.doi.org/10.4018/ijsir.2022010113"
    },
    {
        "id": 19698,
        "title": "FH-ACO: Fuzzy heuristic-based ant colony optimization for joint virtual network function placement and routing",
        "authors": "Mohammad Shokouhifar",
        "published": "2021-8",
        "citations": 44,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.asoc.2021.107401"
    },
    {
        "id": 19699,
        "title": "Improvement of Ant Mill in Ant Colony Topology Optimization",
        "authors": "Hiroshi HASEGAWA, Sou OKIYAMA",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1299/jsmemecj.2023.j122p-05"
    },
    {
        "id": 19700,
        "title": "Efficiency of Finding Best Solutions Through Ant Colony Optimization (ACO) Technique",
        "authors": "K. Sasi Kala Rani, N. Pooranam",
        "published": "2021-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119681984.ch3"
    },
    {
        "id": 19701,
        "title": "Grid Map Merging with Ant Colony Optimization for Multi-Robot Systems",
        "authors": "Heoncheol Lee",
        "published": "2022-5-11",
        "citations": 0,
        "abstract": "Multi-robot systems have recently been in the spotlight in terms of efficiency in performing tasks. However, if there is no map in the working environment, each robot must perform SLAM which simultaneously performs localization and mapping the surrounding environments. To operate the multi-robot systems efficiently, the individual maps should be accurately merged into a collective map. If the initial correspondences among the robots are unknown or uncertain, the map merging task becomes challenging. This chapter presents a new approach to accurately conducting grid map merging with the Ant Colony Optimization (ACO) which is one of the well-known sampling-based optimization algorithms. The presented method was tested with one of the existing grid map merging algorithms and showed that the accuracy of grid map merging was improved by the ACO.",
        "link": "http://dx.doi.org/10.5772/intechopen.98223"
    },
    {
        "id": 19702,
        "title": "Comparative Analysis of Metaheuristic Techniques Ant Colony Optimization (ACO) and Genetic Algorithm (GA)",
        "authors": "Nishu Rana, Pardeep Kumar",
        "published": "2018-7-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v6i7.503507"
    },
    {
        "id": 19703,
        "title": "Determination of the Shortest Path Using the Ant Colony Optimization (ACO) Algorithm Approach",
        "authors": "Hengki Tamando Sihotang",
        "published": "2021-12-13",
        "citations": 0,
        "abstract": "Distribution is one of the essential activities in business because it determines the price of products or goods in the market. So, choosing the shortest path is considered one of the most important things in business, especially distributors. PT Everbright, one of the business actors engaged in the manufacture of batteries and as the main distributor, hopes that the distribution of goods to have the shortest route so that costs can be minimized. The aim of the research was to determine the shortest path in distributing goods in the Medan area to the location of consumers. The research used Ant Colony Optimization (ACO). Determination of the shortest path is based on distance calculations in kilometers, protocol roads, gangs, normal road conditions, and differences between small and major roads. Based on the research results, it is found that the J1 line has the greatest value. So, the path chosen by the ants to pass is J1 which is 11 km away from the departure location (PT Everbright) to the destination (Pasar Glugur Kota). It passes through PT Everbright --> Jln. Gatot Subroto --> Jln. Kapt. Muslim --> Jln. Tgk. Amir Hamzah --> Jln. KH. Syeikh Abdul Wahab Rokan --> Pasar Glugur Kota.",
        "link": "http://dx.doi.org/10.21512/comtech.v12i2.7964"
    },
    {
        "id": 19704,
        "title": "Application of Ant Colony Optimization (ACO) Algorithm to Optimize Trans Banyumas Bus Routes",
        "authors": "Abira Massi Armond, Yogo Dwi Prasetyo, Wahyurini Ediningrum",
        "published": "2022-6-16",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cyberneticscom55287.2022.9865394"
    },
    {
        "id": 19705,
        "title": "A comprehensive study: Ant Colony Optimization (ACO) for facility layout problem",
        "authors": "Raed Abdulkareem Hasan, Mostafa Abdulgafoor Mohammed, Nicolae Tapus, Omar Abdulmaged Hammood",
        "published": "2017-9",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/roedunet.2017.8123738"
    },
    {
        "id": 19706,
        "title": "Smart Workflow Scheduling using the Hybridization of Random Weight Model with Ant Colony Optimization (RWM-ACO)",
        "authors": "Deepak Sharma, Talwinder Kaur",
        "published": "2017-4-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/ijca2017913618"
    },
    {
        "id": 19707,
        "title": "Pencarian Rute Optimal Wisata Alam Kota Tomohon Menggunakan Ant Colony Optimization (ACO)",
        "authors": "Torany Kaunang, Kristoko Hartomo",
        "published": "2022-6-28",
        "citations": 0,
        "abstract": "Kota Tomohon merupakan salah satu destinasi wisata populer di Indonesia yang memiliki banyak tempat wisata yang menarik. Lokasi wisata yang berjauhan menyebabkan banyaknya waktu yang dibutuhkan untuk berwisata di kota Tomohon. Oleh karena itu, diperlukan metode penentuan rute wisata optimal. Penelitian menyajikan penentuan rute wisata di Kota Tomohon dengan menggunakan Ant Colony Optimization (ACO). Berdasarkan percobaan yang dilakukan, 75 % rute yang dihasilkan dengan ACO lebih optimal dari rute standar. Hasil penelitian menunjukkan bahwa ACO dapat menyelesaikan masalah penentuan rute wisata di Kota Tomohon dengan baik dari segi biaya dan waktu rute.",
        "link": "http://dx.doi.org/10.53682/jointer.v3i01.48"
    },
    {
        "id": 19708,
        "title": "MODEL PENERAPAN ALGORITMA ANT COLONY OPTIMIZATION (ACO) UNTUK OPTIMASI SISTEM INFORMASI PENJADWALAN KULIAH",
        "authors": "Rangga Sidik, Mia Fitriawati, Syahrul Mauluddin, Agus Nursikuwagus",
        "published": "2018-9-1",
        "citations": 0,
        "abstract": "Penjadwalan kuliah merupakan proses yang sangat kompleks, karena harus mengatur beberapa komponen seperti dosen, matakuliah, kelas, ruang dan waktu dengan memperhatikan sejumlah batasan dan syarat (constraint) tertentu. Dalam proses pembuatan jadwal kuliah ini setiap perguruan tinggi masing masing berbeda syarat dan batasan. Hal ini lah yang menyebabkan banyak dilakukan penelitian terkait optimasi penjadwalan kuliah. Perlunya optimasi penjadwalan kuliah dirasakan juga oleh program studi manajemen yang merupakan salah satu program studi di Universitas Komputer Indonesia dengan jumlah mahasiswa yang banyak. Dalam proses penjadwalan kuliah masih dilakukan secara konvensional sehingga sering terjadi bentrok jadwal dan prosesnya membutuhkan waktu yang lama. Dalam penggambaran sistem ini menggunakan metode pendekatan berorientasi objek dengan alat bantu pemodelan UML (Unified Modeling Language) dan menggunakan metode pengembangan sistem model prototipe sebagai acuan tahapan penelitian. Penelitian ini merupakan tahap awal dalam membangun sistem informasi penjadwalan kuliah. Hasil penelitian ini berupa model penerapan algoritma Ant Colony Optimization (ACO) untuk optimasi sistem informasi penjadwalan kuliah.",
        "link": "http://dx.doi.org/10.34010/jati.v8i2.1257"
    },
    {
        "id": 19709,
        "title": "Pemecahan Asymmetric Capacitated Vehicle Routing Problem with Time Windows (ACVRPTW) dengan Algoritma Ant Colony Optimization (ACO)",
        "authors": "David Try Liputra",
        "published": "2023-10-25",
        "citations": 0,
        "abstract": "Salah satu aspek utama yang menentukan keberhasilan pengelolaan suatu sistem rantai pasokan atau supply chain management (SCM) adalah perencanaan transportasi. Permasalahan tentang penentuan rute kendaraan atau yang biasa dikenal dengan vehicle routing problem (VRP) merupakan salah satu kajian penting dalam perencanaan transportasi pada tingkat operasional. Penentuan rute kendaraan yang tepat dapat meningkatkan efektivitas dan efisiensi dari sebuah sistem transportasi maupun sistem rantai pasokan yang terkait. Penelitian ini berfokus pada asymmetric capacitated vehicle routing problem with time windows (ACVRPTW), yaitu masalah rute kendaraan yang mempertimbangkan kapasitas kendaraan, jarak bolak-balik antar pelanggan yang tidak simetris, dan batasan waktu pengiriman. Sebuah model matematis dirumuskan dengan berbasis pada tujuan penelitian yang ingin dicapai, yaitu meminimumkan total biaya pengiriman yang terdiri dari biaya perjalanan, biaya lembur pengiriman, biaya kompensasi keterlambatan pengiriman, dan biaya pengiriman kembali. Terdapat dua alternatif algoritma solusi yang dikembangkan, yaitu sequential insertion (SI) dan ant colony optimization (ACO). Sebuah contoh numerik diberikan untuk menunjukkan hasil penelitian pada sebuah industri konveksi pakaian, dimana algoritma ACO terbukti mampu menghasilkan solusi yang lebih baik dibandingkan dengan algoritma SI.",
        "link": "http://dx.doi.org/10.26593/jrsi.v12i2.6477.273-280"
    },
    {
        "id": 19710,
        "title": "Feature selection using Ant Colony Optimization (ACO) and Road Sign Detection and Recognition (RSDR) system",
        "authors": "A. Jayaprakash, C. KeziSelvaVijila",
        "published": "2019-12",
        "citations": 36,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.cogsys.2019.04.002"
    },
    {
        "id": 19711,
        "title": "Autonomous vehicle routing problem solution based on artificial potential field with parallel ant colony optimization (ACO) algorithm",
        "authors": "Fanlei Yan",
        "published": "2018-12",
        "citations": 25,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2018.10.015"
    },
    {
        "id": 19712,
        "title": "An Innovative Maintenance Scheduling Framework for Preventive, Predictive Maintenance Using Ant Colony Optimization",
        "authors": "Abhishek Kaul",
        "published": "2022-5-11",
        "citations": 0,
        "abstract": "The fourth industrial revelation has brought exponential technologies in the area of digitization, internet of things (IOT), artificial intelligence (AI), and optimization which has helped mining companies to increase the availability and utilization of equipment’s. As mining companies implement predictive maintenance technologies, to improve overall equipment availability, there is more value to be unearthed if predictive maintenance is optimized with the production schedules. Ant colony optimization (ACO) is a metaheuristic that is inspired from the behavior of real ants to solve combinatorial optimization problems. This chapter describes an innovative maintenance scheduling framework in the context of optimizing schedules for preventive maintenance and predictive maintenance, with multiple constraints for optimized dynamic schedule to reduce the maintenance time, and production losses.",
        "link": "http://dx.doi.org/10.5772/intechopen.103094"
    },
    {
        "id": 19713,
        "title": "Validation of Hybridized Particle Swarm Optimization (PSO) Algorithm with the Pheromone Mechanism of Ant Colony Optimization (ACO) using Standard Benchmark Function",
        "authors": "Mogaji Stephen, Alese Boniface, Adetunmbi Adebayo",
        "published": "2018-12-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5120/cae2018652799"
    },
    {
        "id": 19714,
        "title": "IMPLEMENTASI METODE ANT COLONY OPTIMIZATION (ACO) UNTUK PEMILIHAN JALUR ARTERNATIF TERPENDEK KASUS KEMACETAN LALULINTAS KOTA SEMARANG TIMUR",
        "authors": "Teguh Setiadi",
        "published": "2020-4-20",
        "citations": 0,
        "abstract": "Abtract The One of the problems that contributed to the worsening traffic conditions, which will be used as research material here is the problem of road narrowing on the road segment that is packed with traffic flow. The road narrowing is a part of the road with the traffic capacity condition subsequently smaller than the up stream. Such road conditions can occur for example when entering the bridge, the occurrence of an accident that causes some of the width of the road is closed, in the event of road improvements or other conditions, causing the change of vehicle travel from the free flow becomes disrupted resulting in decreased speed and increased inter density vehicle. To overcome the problems that exist in the industrial world. Ant Colony Optimization belongs to the Swarm Intelligence group, which is one type of development paradigm used to solve optimization problems where the inspiration used to solve the problem comes from insect swarm behavior or swarms. from this research study are the factors that influence the traffic congestion and the program of action plan that will be done to handle traffic congestion problem in Semarang city road especially in Semarang Timur road Mranggen Semarang. A traffic congestion problem problem with the determination of the shortest pathway using ACO (Ant Colony Optimization). ",
        "link": "http://dx.doi.org/10.51903/jtikp.v9i1.164"
    },
    {
        "id": 19715,
        "title": "Overview of high-efficiency ant colony optimization (ACO)-based adaptive routings for traffic balancing in network-on-chip systems",
        "authors": "En-Jui Chang, An-Yeu Wu",
        "published": "2017-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/asicon.2017.8252416"
    },
    {
        "id": 19716,
        "title": "HR Potensi Pelanggan Tunggakan PDAM  Menggunakan Metode K-Medoids dengan  Optimasi Ant Colony Optimization (ACO)",
        "authors": "Hardi Yusa, Made Sudarma, N Pramaita",
        "published": "2018-12-5",
        "citations": 0,
        "abstract": "PDAM dalam menjalankan kegiatan operasional sangat dipengaruhi oleh piutang atau tunggakan tagihan air pelanggan. Beberapa faktor yang mempengaruhi pola pelanggan dalam menunggak tagihan air yaitu golongan pelanggan dan konsumsi pemakaian air sehingga mempengaruhi tagihan air yang dibayar oleh pelanggan. Penelitian ini akan diterapkan metode clusteringK-Medoidsuntuk mengetahui pelanggan yang menunggak di PDAM dengan melakukan optimasi pada pemilihan titik pusat clustermenggunakan algoritma Ant ColonyOptimization(ACO). Dalam penelitian ini penggabungan metode ACO dan K-Medoidsdisebut ACOMedoids. Hasil dengan metode ACOMedoidsdapat menghasilkan tingkat akurasi yang tinggi dari perbandingan data hasil clusteringdengan data tagihan aktual. Hal ini terlihat pada hasil akurasi yang selalu lebih baik dibandingkan dengan metode K-Medoidsyaitu tertinggi mencapai akurasi 97,65% untuk ACOMedoidssedangkan K-Medoids88,29%. Hasil akurasi menunjukkan algortima ACO dapat menghasilkan titik pusat clusteryang optimal pada proses clusteringmetode K-Medoids.",
        "link": "http://dx.doi.org/10.24843/mite.2018.v17i03.p08"
    },
    {
        "id": 19717,
        "title": "A Hybrid Approach Using Ant Colony Optimization and Binary Particle Swarm Optimization (ACO: BPSO) for Energy Efficient Multi-path Routing in MANET",
        "authors": "Valanto Alappatt, P M Joe Prathap",
        "published": "2020-7",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/accthpa49271.2020.9213196"
    },
    {
        "id": 19718,
        "title": "Ant Colony Optimization",
        "authors": "Stefka Fidanova",
        "published": "2021",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-67380-2_2"
    },
    {
        "id": 19719,
        "title": "Estimation of Exponential Smoothing Parameter on Pesticide Characteristic Forecast using Ant Colony Optimization (ACO)",
        "authors": "Dinita Rahmalia",
        "published": "2018-3-21",
        "citations": 2,
        "abstract": "Pest in agriculture can raise plant disease and fail to harvest. The pest problem in agriculture can be solved by using pesticide. Pesticide usage must be done proportionally. So, the manufacturer should fix standard pesticide active ingredient in pesticide production. Forecast is a prediction of some future evens. In forecast problem, there are any parameters which should be determined. Parameters can be estimated by exact method or heuristic method. Ant Colony Optimization (ACO) is inspired from the cooperative behavior of ant colonies, which can find the shortest path from their nest to a food source. In this research, we use heuristic method like ACO to estimate exponential smoothing parameter on pesticide active ingredient forecast and pesticide sample weight forecast. From the simulation, on the first iteration, all ants choose parameter randomly. At the optimization process, we update pheromone until all ants choose the similar parameter so that process converges and variance approaches to zero. The optimal exponential smoothing parameter can be applied in forecasting with minimum sum of squared error (SSE).",
        "link": "http://dx.doi.org/10.20885/eksakta.vol18.iss1.art6"
    },
    {
        "id": 19720,
        "title": "Pencarian Lokasi Tempat Ibadah Terdekat di Kota Bengkulu Menggunakan Algoritma Ant Colony Optimization (ACO)",
        "authors": "Agung Kharisma Hidayah, Nur’aini Nur’aini, Anisya Sonita, Saparudin Saroni",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "Sebagai sebuah negara dengan penduduk yang memiliki ragam agama, antaranya yakni agama Islam, Kristen, Budha dan Hindu menjadikan Indonesia juga memiliki banyak tempat ibadah yang tersebar di seluruh penjuru daerah. Bengkulu merupakan salah satu daerah yang dikunjungi oleh banyak wisatawan, baik yang berasal dari lokal ataupun mancanegara. Oleh sebab itu fasilitas umum yang ada di Bengkulu sangat diperlukan, salah satu fasilitas yang dibutuhkan adalah tempat ibadah. Informasi mengenai tempat ibadah menjadi penting dan dibutuhkan oleh para wisatawan,  khususnya informasi tentang rute terdekat yang bisa diambil menuju tempat ibadah tersebut. Penelitian ini dilakukan agar dapat membangun sebuah sistem yang bisa memberikan informasi lokasi terdekat tempat ibadah  serta petunjuk arah yang dapat digunakan sebagai panduan menuju lokasi tersebut dengan mengimplementasikan Algoritma Ant Colony Optimization untuk pencarian rute terdekatnya. Aplikasi yang dibuat menggunakan bahasa pemrograman PHP dan database MySQL ini dapat digunakan dengan berbagai macam perangkat karena aplikasi ini berbasis website. Penerapan algoritma Ant Colony Optimization menghasilkan rute yang memiliki jarak terdekat menuju lokasi tempat ibadah.",
        "link": "http://dx.doi.org/10.32664/smatika.v13i02.933"
    },
    {
        "id": 19721,
        "title": "Implementasi Ant Colony Optimization (ACO) pada Sistem Irigasi Lahan Tadah Hujan",
        "authors": "Abdul Haris, Trisma Juwita, Rosida Nur Aziza, Hengki Sikumbang, Riki Ruli A. Siregar",
        "published": "2021-10-25",
        "citations": 0,
        "abstract": "The purpose of this research is to produce an optimal water distribution system for irrigation of rainfed land. The problem with conventional irrigation systems is that the water distribution process cannot be controlled and monitored automatically and in real time. The impact on water distribution becomes ineffective. The implementation of Ant Colony Optimization (ACO) is used in research as a method to determine the location or node based on the pheromone pattern of the soil dryness level at the sprinkler nodes to be distributed by the water flow, taking into account the criteria level on the soil as a trend of probability values ??and determining the nodes according to the needs in the flow water. The results obtained from this study indicate that the data displayed is the level of dryness of each node, the volume of water in the reservoir, and the flow of water flowing. The ACO test shows the sequence of nodes that will be passed after the optimization process of water distribution in a rainfed irrigation system using the ACO method gets an error value calculated by the MAPE method of 43% so that it gets an accuracy value of 57%.",
        "link": "http://dx.doi.org/10.33322/kilat.v10i2.1518"
    },
    {
        "id": 19722,
        "title": "ACO-IM: maximizing influence in social networks using ant colony optimization",
        "authors": "Shashank Sheshar Singh, Kuldeep Singh, Ajay Kumar, Bhaskar Biswas",
        "published": "2020-7",
        "citations": 45,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-019-04533-y"
    },
    {
        "id": 19723,
        "title": "An Overview of Ant Colony Optimization Algorithms for Dynamic Optimization Problems",
        "authors": "Alireza Rezvanian, S. Mehdi Vahidipour, Ali Sadollah",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "Swarm intelligence is a relatively recent approach for solving optimization problems that usually adopts the social behavior of birds and animals. The most popular class of swarm intelligence is ant colony optimization (ACO), which simulates the behavior of ants in seeking and moving food. This chapter aim to briefly overview the important role of ant colony optimization methods in solving optimization problems in time-varying and dynamic environments. To this end, we describe concisely the dynamic optimization problems, challenges, methods, benchmarks, measures, and a brief review of methodologies designed using the ACO and its variants. Finally, a short bibliometric analysis is given for the ACO and its variants for solving dynamic optimization problems.",
        "link": "http://dx.doi.org/10.5772/intechopen.111839"
    },
    {
        "id": 19724,
        "title": "A metaheuristic optimization model for spectral allocation in cognitive networks based on ant colony algorithm (M-ACO)",
        "authors": "B. Padmanaban, S. Sathiyamoorthy",
        "published": "2020-10",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-020-04882-z"
    },
    {
        "id": 19725,
        "title": "PENERAPAN ALGORITMA ANT COLONY OPTIMIZATION (ACO)  PADA JOB SHOP SCHEDULING PROBLEM (JSSP) DI PT. SIEMENS INDONESIA (CILEGON FACTORY)",
        "authors": "Widyawati Widyawati",
        "published": "2018-9-6",
        "citations": 0,
        "abstract": "Fabrication process is often disrupted by non–deterministic job, this create a problem in the Pre-Fabrication department schedule because often the manufacture of raw material for non-deterministic job should given priority. This problem also affected by the existing system which is not yet fully developed to solve the problem of optimize rescheduling master line (seen from total makespan time). Ant Colony Optimization (ACO) variant Ant System (AS) was proposed to solve Job Shop Scheduling Problem (JSSP) with the objective to propose the best schedule that give shortest makespan. The algorithm tested to perform scheduling of 5 projects (consist of 10 parts) as the initial job, and another 2 projects (consist of 4 parts) as the non-deterministic job. For the initial job, makespan was 287 days and after the arrival of non-deterministic job, makespan was 362 days compare with the actual manufacturing time (7 project consist of 14 parts) which is ± 511 days",
        "link": "http://dx.doi.org/10.47080/simika.v1i01.37"
    },
    {
        "id": 19726,
        "title": "Particle Swarm Optimization (PSO) and Ant Colony Optimization (ACO) for optimizing PID parameters on Autonomous Underwater Vehicle (AUV) control system",
        "authors": "T Herlambang, D Rahmalia, T Yulianto",
        "published": "2019-4",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1088/1742-6596/1211/1/012039"
    },
    {
        "id": 19727,
        "title": "Implementation of iterative k-means-+ and ant colony optimization (ACO) in portfolio optimization problem",
        "authors": "M. A. Rezani, G. F. Hertono, B. D. Handari",
        "published": "2020",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0008149"
    },
    {
        "id": 19728,
        "title": "Movies Reviews Sentiment Analysis using Improved Random Forest Algorithm and ACO (Ant Colony Optimization) Approach",
        "authors": "N.K. Deol, V. Thapar, J. Singh",
        "published": "2021-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v9i9.2530"
    },
    {
        "id": 19729,
        "title": "Solving Vehicle Routing Problem using Ant Colony Optimisation (ACO) Algorithm",
        "authors": "Wan Amir FuadWajdi Othman,  , Aeizaal Azman Abd Wahab, Syed SahalNazli Alhady, Haw Ngie Wong",
        "published": "2018-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21276/ijre.2018.5.9.2"
    },
    {
        "id": 19730,
        "title": "An Extensive Work on Stock Price Prediction Using Ant Colony Optimization Algorithm (ACO-SPP)",
        "authors": "Saravanan Ramalingam,  , Pothula Sujatha,  ",
        "published": "2018-12-31",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.22266/ijies2018.1231.09"
    },
    {
        "id": 19731,
        "title": "A New Approach for Position Based Routing Protocols Based on Ant Colony Optimization (ACO) Technique in Vehicular Ad Hoc Network (VANET)",
        "authors": "Atul R. Deshmukh, Pranjali Nirmal, S. S. Dorle",
        "published": "2021-6-25",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/conit51480.2021.9498332"
    },
    {
        "id": 19732,
        "title": "Pheromone deposition/updating strategy in a network: using ant colony optimization (ACO) approach",
        "authors": "Felix U. Ogban, Roy Nentui",
        "published": "2019-12-18",
        "citations": 0,
        "abstract": "The study and understanding of the social behavior of insects has contributed to the definition of some algorithms that are capable of solving several types of optimization problems. The most important and challenging problems that the ants encounters when routing through a network arc, is their ability to searching for the path with a shorter length as well as to minimize the total cost incurred in the process of routing  through the network. In this paper, we introduced some features to the existing Ant Colony Optimization (ACO) algorithm to help tackle this problem. First, we defined two kinds of pheromone and then we also defined three kinds of heuristic information to guide the searching direction of ants for this bi-criteria problem. Each of the ants uses the heuristic types and the pheromone types in each iteration based on the probability, controlled by two parameters. These two parameters are adaptively adjusted in the process of the algorithm. Second, we used the information of the partial solutions to modify the bias of ants so that inferior choices will be ignored. Finally, we tested the performance of the experimental results of the algorithm in an application under different Deadline constraints and the performance of the algorithm prove to be more promising, for it outperformed the performance of most of the algorithm we downloaded on line.Keywords: Ant Colony Optimization algorithm, Pheromone Deposition, Pheromone Updating strategy, Cost Minimization, Network Routing, Optimization problem. ",
        "link": "http://dx.doi.org/10.4314/gjpas.v24i2.11"
    },
    {
        "id": 19733,
        "title": "A Framework for Optimizing Software Regression Test Case based on Modified-Ant Colony Optimization (M-ACO)",
        "authors": "Abrahmi Silvarajoo, Mohammed Hazim Alkawaz",
        "published": "2022",
        "citations": 3,
        "abstract": "Software Regression Testing (SRT) helps with the modified code to ensure that no other new defects have been trained and significantly impact the existing code. SRT is a time and cost taking process. Test Case Prioritization (TCP) helps to reschedule test cases (TC’S) and picks according to the prioritization, which allows the software testers to maximize the number of faults detected within a given time frame. Ant Colony Optimization (ACO) is an optimization algorithm motivated by the searching behavior of insects. This paper proposes a simple framework for the novel Modified-ACO (m-ACO) to prioritize the TC’s. m-ACO is planned as the adjusted type of the ACO method, which reschedules the execution sequence of TC’S by changing the wonder of characteristic insects for choosing their food source. The proposed Framework will help the software testers save their time to execute SRT TC’s. It has been tested for Zasta Billing Web Application and compared the time taken to complete the SRT manually and using the proposed Framework.The proposed Framework helps to reduce the time taken from 90 days to 45 days to achieve the SRT.",
        "link": "http://dx.doi.org/10.1051/itmconf/20224201007"
    },
    {
        "id": 19734,
        "title": "Ant Colony Optimization (ACO) based Routing Protocols for Wireless Sensor Networks (WSN): A Survey",
        "authors": "Anand Nayyar, Rajeshwar Singh",
        "published": "2017",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14569/ijacsa.2017.080220"
    },
    {
        "id": 19735,
        "title": "Hybrid software reliability model with Pareto distribution and ant colony optimization (PD–ACO)",
        "authors": "Sudharson D, Prabha Dr",
        "published": "2020-4-24",
        "citations": 7,
        "abstract": "PurposeSoftware reliability models in the past few years attracted researchers to build an accurate model in the software engineering. Testing is an important factor in the software development cycle.Design/methodology/approachAs testing improves quality and reliability of the application by identifying the bugs in it. Also, it defines the behavior and state of the product based on the defined principles and mechanisms. Conventional reliability models use statistical distributions to attain realistic features.FindingsThe ability to predict the bugs in the application during development phase itself is a proper testing practice which saves the time and increases the efficiency of the application. Efficient management and timely release of the product is based on this reliability testing and ant colony optimization (ACO)-based testing is an important optimization model which is available for testing the application.Originality/valueConventional ant colony optimization used test case generation as its common approach for testing the reliability of the application. ACO uses pheromone activity and it is related in testing of application and provides a simple positive mechanism by identifying the inactivity and precociousness.",
        "link": "http://dx.doi.org/10.1108/ijius-09-2019-0052"
    },
    {
        "id": 19736,
        "title": "The Combination of Ant Colony Optimization (ACO) and Tabu Search (TS) Algorithm to Solve the Traveling Salesman Problem (TSP)",
        "authors": "Rico Wijaya Dewantoro, Poltak Sihombing,  Sutarman",
        "published": "2019-9",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/elticom47379.2019.8943832"
    },
    {
        "id": 19737,
        "title": "Clustering uncertain graphs using ant colony optimization (ACO)",
        "authors": "Syed Fawad Hussain, Ifra Arif Butt, Muhammad Hanif, Sajid Anwar",
        "published": "2022-7",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00521-022-07063-1"
    },
    {
        "id": 19738,
        "title": "Optimization of Fairhurst-Cook Model for 2-D Wing Cracks Using Ant Colony Optimization (ACO), Particle Swarm Intelligence (PSO), and Genetic Algorithm (GA)",
        "authors": "Mohammad Najjarpour, Hossein Jalalifar",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4236/jamp.2018.68134"
    },
    {
        "id": 19739,
        "title": "Application of ant colony optimization (ACO) algorithm in the short rute search for completing travelling problem (TP)",
        "authors": "Mutiawati Mutiawati,  Nelly, Julinawati Suanda, Nur Syuhadah Kamaruddin",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0027901"
    },
    {
        "id": 19740,
        "title": "MS-ACO: a multi-stage ant colony optimization to refute complex software systems specified through graph transformation",
        "authors": "Vahid Rafe, Mahsa Darghayedi, Einollah Pira",
        "published": "2019-6",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-018-3444-y"
    },
    {
        "id": 19741,
        "title": "OPTIMASI PENEMPATAN DAN KAPASITAS KAPASITOR UNTUK MEMINIMALKAN SUSUT DAYA PADA PENYULANG TABANAN DENGAN MENGGUNAKAN METODE ANT COLONY OPTIMIZATION (ACO)",
        "authors": "Fadil Arialdi, Rukmi Sari Hartati, I Made Mataram",
        "published": "2019-12-16",
        "citations": 0,
        "abstract": "Electricity is one of the needs of society that must be met, because electricity is very instrumental in helping everyday life, such as lighting, and for the electronic needs. In distributing power to consumers there is a power loss in the distribution system channel. To reduce power loss, it is necessary to install capacitors. This study aims to reduce power losses in Tabanan feeders using the Ant Colony Optimization (ACO) method with 10 attempts using MATLAB. The total power loss before the capacitor is installed is 0.421 MW (6,4%), after the analysis is obtained the placement of the capacitor located on bus 10 with a capacity of 1000 KVAR, can reduce the power loss to 0.145 MW (2,2%)",
        "link": "http://dx.doi.org/10.24843/spektrum.2019.v06.i04.p1"
    },
    {
        "id": 19742,
        "title": "Ant Colony Optimization",
        "authors": "A Vasuki",
        "published": "2020-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9780429289071-8"
    },
    {
        "id": 19743,
        "title": "Regression Test Case Optimization Using Ant Colony Optimization",
        "authors": "Ashish Seth",
        "published": "2020-3-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5373/jardcs/v12i3/20201172"
    },
    {
        "id": 19744,
        "title": "The HEX-ACO-18: Developing an Age-Invariant HEXACO Short Scale Using Ant Colony Optimization",
        "authors": "Gabriel Olaru, Kristin Jankowsky",
        "published": "2022-7-4",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/00223891.2021.1934480"
    },
    {
        "id": 19745,
        "title": "Ant Colony Optimization ACO Based Autonomous Secure Routing Protocol for Mobile Surveillance Systems",
        "authors": "Kashif Saleem, Iftikhar Ahmad",
        "published": "2022-11-14",
        "citations": 5,
        "abstract": "Sensing plays a vital role in enabling smart cities. The mobile surveillance of different sectors, the retransmission of radio signals, and package delivery are the main applications conducted by unmanned vehicles in smart cities. Multiple unmanned vehicles or miniaturized real-time flying machines with onboard sensors, whether land- or air-based, communicate with each other to form a flying sensor network. Almost all of these machines are battery-operated. Therefore, power preservation is an extremely important factor to be taken into consideration. This paper proposes a power-aware biologically inspired secure autonomous routing protocol (P-BIOSARP) that depends on enhanced ant colony optimization (eACO). eACO autonomously and securely routes the data packet, and the power awareness maintains the power consumption of the flying sensor network. The novel intelligent power-aware routing protocol was implemented in network simulator 2 to perform a number of experiments with different scenarios. The scenarios included varying numbers of total nodes and mobile nodes, different packet rates, mobile source nodes, multiple mobile routing nodes, and, on the side of security, the injection of malicious nodes. The proposed protocol is compared with BIOSARP, E-BIOSARP, and SRTLD in terms of energy consumption, the delivery ratio, and traffic overhead. The analysis shows that the P-BIOSARP remarkably reduces energy consumption compared to other well-known protocols implemented on real testbeds.",
        "link": "http://dx.doi.org/10.3390/drones6110351"
    },
    {
        "id": 19746,
        "title": "A new optimal model for evaluating liquefaction-induced lateral spreading based on the advanced ant colony optimization (ACO)",
        "authors": "Mohammad Alizadeh Mansouri, Rouzbeh Dabiri",
        "published": "2021-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12517-021-08894-3"
    },
    {
        "id": 19747,
        "title": "A New Design of an Ant Colony Optimization (ACO) Algorithm for Optimization of Ad Hoc Network",
        "authors": "Hala Khankhour, Otman Abdoun, Jâafar Abouchabaka",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-3637-0_16"
    },
    {
        "id": 19748,
        "title": "Optimization of Daily Operations in the Marine Industry Using Ant Colony Optimization (ACO)-An Artificial Intelligence (AI) Approach",
        "authors": "Abdullah Sardar, Mohan Anantharaman, Vikram Garaniya, Faisal Khan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12716/1001.17.02.04"
    },
    {
        "id": 19749,
        "title": "Inter-Gateway Handoff Management Using Ant Colony Optimization (ACO) for Wireless Mesh Networks",
        "authors": "Bhushana Babu D N, Krishna Rao E V, Murthy K S N",
        "published": "2020-11-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14445/22315381/ijett-v68i11p208"
    },
    {
        "id": 19750,
        "title": "IEEMARP- a novel energy efficient multipath routing protocol based on ant Colony optimization (ACO) for dynamic sensor networks",
        "authors": "Anand Nayyar, Rajeshwar Singh",
        "published": "2020-12",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-019-7627-z"
    },
    {
        "id": 19751,
        "title": "An Integrated Approach of Ant Colony Optimization (ACO), Machine Learning (ML), and Fuzzy Logic for Revolutionizing Inventory Management in Modern Supply Chains",
        "authors": " S. Swathi, K. Kalaiarasi",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "This article presents a groundbreaking approach aimed at addressing the limitations of conventional inventory management practices in contemporary supply chains. The principal objective is to revolutionize inventory management by harnessing the synergistic potential of Ant Colony Optimization (ACO), Machine Learning (ML), and Fuzzy Logic. This integrated framework seeks to elevate demand forecasting, optimize ordering strategies, and enhance inventory control processes. Methods: The methodology encompasses the amalgamation of three potent techniques: ACO for the optimization of reorder points and quantities, ML for precise demand forecasting through the analysis of historical data and external variables, and Fuzzy Logic for managing imprecise and linguistic factors to facilitate adaptable decision-making. This fusion minimizes overall inventory costs while refining inventory-related choices. Findings: The fusion of ACO, ML, and Fuzzy Logic represents a pragmatic solution for contemporary inventory management. Businesses that embrace this approach can attain adaptability, data-driven precision, and flexibility, resulting in improved demand forecasting, optimized ordering strategies, and more efficient inventory management processes. An illustrative real-world case demonstrates that this integrated approach leads to cost-effective and responsive solutions, with the potential to revolutionize inventory management, translating into cost savings, heightened customer satisfaction, and enhanced operational efficiency. Novelty: The novelty of this integrated approach lies in its distinctive amalgamation of ACO, ML, and Fuzzy Logic within the inventory management context. While these techniques are well-established in their own right, their integration signifies an innovative response to an enduring challenge. This approach enables adaptability to shifting conditions, precise demand forecasting, and flexible decision-making, which were arduous to achieve using traditional methodologies.",
        "link": "http://dx.doi.org/10.52783/tjjpt.v44.i3.2129"
    },
    {
        "id": 19752,
        "title": "Pareto Front Approximation by Ant Colony Optimization",
        "authors": "Jaroslav Janáček, Marek Kvet",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012262900003639"
    },
    {
        "id": 19753,
        "title": "Application of Ant Colony Optimization for Co-Design of Hybrid Electric Vehicles",
        "authors": "Majid Vafaeipour, Dai-Duong Tran, Thomas Geury, Mohamed El Baghdadi, Omar Hegazy",
        "published": "2022-5-11",
        "citations": 1,
        "abstract": "One key subject matter for effective use of Hybrid Electric Vehicles (HEVs) is searching for drivetrains which their component dimensions and control parameters are co-optimally designed for a desired performance. This makes the design challenge as a problem, which needs to be addressed in a holistic way meeting various constraints. Along this line, the strong coupling between components sizes of a drivetrain and parameters of its controllers turns the optimal sizing and control design of HEVs into a Bi-level optimization problem. In this chapter, an important application of continuous Ant Colony Optimization (ACOR) for integrated sizing and control design of HEVs is thoroughly discussed for minimizing the drivetrain cost, minimizing the fuel consumption and addressing the control objectives at the meantime. The outcome of this chapter provides useful information related to incorporation of soft-computing, modeling and simulation concepts into optimization-based design of HEVs from all respects for designers and automotive engineers. It brings opportunities to the readers for understanding the criteria, constraints, and objective functions required for the optimal design of HEVs. Via introducing a two-folded iterative framework, fuel consumption and component sizing minimizations are of the main goals to be simultaneously addressed in this chapter using ACOR.",
        "link": "http://dx.doi.org/10.5772/intechopen.97559"
    },
    {
        "id": 19754,
        "title": "OPTIMIZATION OF ARTIFICIAL NEURAL NETWORKS USING ANT COLONY OPTIMIZATION TO IDENTIFY SIGNATURE IMAGES",
        "authors": "Junia Kurniati",
        "published": "2019-11-1",
        "citations": 0,
        "abstract": "Biometrics can be used in identification or recognition systems because it is a method for recognizing humans based on one or more physical features or unique behaviors, one of which is the Signature. In its application, signatures need to be examined (identification) because signatures are often imitated or falsified for various purposes. The signature that will be identified will be taken first by its characteristics by performing the feature extraction process using the Gabor Wavelet Transform (TGW) method. After extracting, the signature identification process is carried out using the Neural Network. In the process of applying the Neural Network method, optimization will be performed using Ant Colony Optimization. The results showed that the identification of signatures made using the Neural Network alone produced an accuracy of 77%, but after optimization using Ant Colony Optimization increased to 83%.",
        "link": "http://dx.doi.org/10.14710/transmisi.21.4.128-134"
    },
    {
        "id": 19755,
        "title": "Pencarian Rute Optimal Distribusi Melalui Pendekatan Metode Ant Colony Optimization (ACO)",
        "authors": "Lutfi Syahr, Moch Khoswara, Habibi Siraj Aflah H, Suseno Suseno",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "Bakpia Pathok 25 merupakan perusahaan yang memproduksi makan khas jogja yaitu bakpia dan telah berdiri sejak 1948. Sampai saat ini Bakpia Pathok 25 masih menjadi salah satu produsen bakpia yang enak dan terkenal di Yogyakarta sehingga dapat berkembang dan bertahan sampai saat ini. Penelitian ini membahas rute distribusi Bakpia Pathok 25 menggunakan metode Traveling Salesman Problem (TSP) Ant Colony Optimization (ACO). Pendekatan dilakukan untuk mencari rute terbaik agar seorang sopir dapat kembali pulang tepat waktu. Rute awal menunjukkan bahwa sopir melakukan perjalanan dengan rute jarak yang ditempuhnya mencapai 26,19 Km. Setelah menggunakan metode Ant Colony Optimization (ACO) dengan menggunakan MATLAB didapatkan hasil optimal yaitu pada iterasi ke-100 menunjukkan bahwa rute yang digunakan oleh Bakpia Pathok 25 untuk distribusi produk bakpia sudah optimal yaitu dengan rute Toko Pathok Jaya, Toko Ongko Jaya, Toko Pasar Pathok, Toko Bandara Jaya, Toko Kembang Jaya dan kembali menuju Toko Pathok Jaya dengan jarak rute 26.19 Km dan jumlah bahan bakar yang dikeluarkan dengan harga mencapai Rp. 26,190 dalam sekali pendistribusian dan waktu yang didapatkan 54 menit. Penelitian ini diharapkan dapat membantu pihak perusahaan dan mengetahui dalam memilih rute terpendek yaitu rute optimal untuk melakukan distribusi produk bakpia yang diproduksi sehingga dapat meminimalisasi biaya pendistribusian.",
        "link": "http://dx.doi.org/10.55826/tmit.v2i2.105"
    },
    {
        "id": 19756,
        "title": "SRL-ACO: A text augmentation framework based on semantic role labeling and ant colony optimization",
        "authors": "Aytuğ Onan",
        "published": "2023-7",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.jksuci.2023.101611"
    },
    {
        "id": 19757,
        "title": "Use of Ant Colony Optimization (ACO) for Post-Deployment Replanning of UMTS Networks",
        "authors": "Samir K Sadhukhan, Chayanika Bose, Debashis Saha",
        "published": "2018-4",
        "citations": 0,
        "abstract": "Inherent dynamism in user movement demands for post-deployment tuning of UMTS networks to minimize the total cost of ownership (TCO). Conventionally, UMTS operators so far have considered many-to-one mapping of RNCs to MSCs. However, such single-homed networks do not remain cost-effective over the passage of time, typically when subscribers later on begin to show specific mobility patterns such as diurnal movement. This necessitates topological extension of the network in terms of dual-homing of some selected RNCs to two MSCs simultaneously via direct fibre links, resulting in a many-to-two mapping in parts of the network. The aim of such selective dual-homing is to reduce handoff cost maximally at the expense of minimal increase in link cost, thereby reducing the TCO optimally. In this article, the authors have formulated the scenario as an integer linear programming problem, converted it into a state space search and then solved it using Ant Colony Optimization (ACO) technique. Compared to Simulated Annealing (SA) and Tabu Search (TS), ACO exhibits 10% to 15% improvement in solution quality.",
        "link": "http://dx.doi.org/10.4018/ijamc.2018040102"
    },
    {
        "id": 19758,
        "title": "Ant Colony Optimization (ACO) Based Fuzzy C-Means (FCM) Clustering Approach for MRI Images Segmentation",
        "authors": "Mohammed H. Al Aqad,  Luis Miguel Oliveira de Barros Cardoso",
        "published": "2023-12-30",
        "citations": 0,
        "abstract": "Thousands of real-life ants have been used to improve the Ant Colony Optimization (ACO) technique. Significant improvement can be noticed in segmented images using ACO-based rather than random initialization. The segmentation quality has improved as a result of the noise reduction. Clustering based on FCM is used to segment medical images. To avoid local optimal results, cluster centres are initially determined using ACO. This paper shows that our approach (ACO-FCM) provides significant improvements. In ACO-FCM, brain tissues are classified more accurately because there are more correctly classified pixels. As a result of our approach, such tissues can be classified more accurately based on spatial information",
        "link": "http://dx.doi.org/10.31185/wjcms.230"
    },
    {
        "id": 19759,
        "title": "Optimum trajectory of multi-UAV for fertilization of paddy fields using ant colony optimization (ACO) and 2-opt algorithms",
        "authors": "Michael Julyus Christopher Manullang, Karlisa Priandana, Medria Kusuma Dewi Hardhienata",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0110697"
    },
    {
        "id": 19760,
        "title": "The Application of Ant Colony Optimization",
        "authors": "",
        "published": "2022-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.91586"
    },
    {
        "id": 19761,
        "title": "Ant Colony Optimization - Recent Variants, Application and Perspectives [Working Title]",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5772/intechopen.107606"
    },
    {
        "id": 19762,
        "title": "Ant Colony Optimization Approaches for the Tree t-Spanner Problem",
        "authors": "Manisha Israni, Shyam Sundar",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006490002000206"
    },
    {
        "id": 19763,
        "title": "Ant Colony Optimization Ant Colony Optimization untuk menyelesaikan perutean distribusi Snack dengan Vehicle Routing Problem",
        "authors": "Endang Setyati, Ine Juniwati",
        "published": "2022-12-28",
        "citations": 0,
        "abstract": "One of the main challenges faced by the community in their daily activities is the problem of transportation. Transportation of goods and services is an important topic that attracts the attention of the business world today. Closely related to the transportation sector is the Vehicle Routing Problem (VRP).\r\nThe VRP variant used in this study is the Capacitated Vehicle Routing Problem (CVRP) which uses the capacity limit of the vehicle used. CVRP is used to minimize the distribution route of goods at IKM Snack FITRIA located in Sidoarjo. The problem of distribution at IKM Snack FITRIA is how to manage the route of shipping goods from the warehouse to a number of shops/customers scattered in various places in Surabaya, Sidoarjo and Gresik efficiently. This research includes planning the route of each transport vehicle in delivering products to consumers spread over several points originating from one depot. The vehicle in one day sends goods from the warehouse to the customer with one delivery. While the algorithm used is Ant Colony Optimization (ACO). ACO is used because it is able to show the best route for the optimal solution of 98%. And get a minimum total mileage with a low level of variance.",
        "link": "http://dx.doi.org/10.25047/jtit.v9i2.296"
    },
    {
        "id": 19764,
        "title": "DESIGN OF SELF TUNING PID CONTROLLER USING ADAPTIVE PARTICULAR SWARM OPTIMIZATION (APSO) and ANT COLONY OPTIMIZATION (ACO)",
        "authors": "Oğuzhan KAPUKAYA, Mahit GÜNEŞ",
        "published": "2019-12-30",
        "citations": 2,
        "abstract": "Bu çalışmada, Adaptif Parçacık Sürü\nOptimizasyonu (APSO) ve Karıca Kolonisi Algoritması (KKA) kullanarak öz\nayarlamalı oransal integral türevsel (PID) kontrolör tasarımı yapılmıştır ve DA\n(Doğru Akım) Motoru üzerinde test edilmiştir. PID kontrolör elle ayarlandığı\nzaman, parametrelerinin ayarlanması zor ve sıkıntılıdır, ayrıca iyi bir\nperformans sağlanamaz. Bu yüzden, parametre ayar işlemi aşamasında optimizasyon\nyöntemleri kullanmak işi kolaylaştırır ve daha iyi performans sağlar. Bu çalışmada\nPID kontrolörün parametre ayar işlemi, Klasik PID, Adaptif Parçacık Sürü\nOptimizasyonu (APSO) ve Karınca Kolonisi Algoritması (KKA) algoritması ile\nyapılmış ve sonuçlar karşılaştırılmıştır.",
        "link": "http://dx.doi.org/10.17780/ksujes.655044"
    },
    {
        "id": 19765,
        "title": "Research on Improved Ant Colony Optimization Based on Adaptive Chemical Reaction Optimization",
        "authors": "Teng Fei Teng Fei",
        "published": "2021-8",
        "citations": 0,
        "abstract": "\n",
        "link": "http://dx.doi.org/10.53106/199115992021083204013"
    },
    {
        "id": 19766,
        "title": "Novel Hybrid Binary  Ant Colony Optimization-Genetic Algorithm",
        "authors": "israfil Karadöl",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4364274"
    },
    {
        "id": 19767,
        "title": "Algorithm of ant colony optimization (ACO) for 3D variation traveling salesman problem",
        "authors": "A V Riabko, O V Zaika, R P Kukharchuk, T A Vakaliuk, I V Hordiienko",
        "published": "2022-6-1",
        "citations": 0,
        "abstract": "Abstract\nThe article discusses the solution of the spatial traveling salesman problem (TSP 3D variation) using Ant Colony Optimization (ACO). The traveling salesman problem considers n bridges and a matrix of pairwise distances between them. It is necessary to find such an order of visiting cities so that the total distance traveled was minimal, each city was visited exactly once and the salesman returned to the city from which he began his route. In the TSP 3D variation problem, each “city” has 3 coordinates x, y, z. The analysis of the main methods of solving, in particular, the metaheuristic algorithms to which ACO belongs, is performed. At each iteration of these methods, a new solution of the problem is built, which is based not on one, but several solutions of the population. The ACO uses an idea that is based on collecting statistical information about the best solutions. The program code is implemented in MATLAB. During computational experiments, various network topologies were randomly generated, and the number of iterations at which the optimal cycle was achieved was recorded. The execution time of the code for the TSP 3D task is almost the same as the execution time of TSP 2D. The results can be used for spatial tasks of the salesman (TSP 3D-variation), which arise in the process of 3D printing, planning UAV trajectories (UAV) in mountain conditions or multi-story urban development, road planning in multi-story buildings.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2288/1/012001"
    },
    {
        "id": 19768,
        "title": "Event Based Clustering Localized Energy Efficient Ant Colony Optimization (EBC_LEE-ACO) for Performance Enhancement of Wireless Sensor Network",
        "authors": "S. D. Chavan, A. V. Kulkarni",
        "published": "2018-8-18",
        "citations": 8,
        "abstract": "The main challenge of a wireless sensor network (WSN) in disaster situations is to discover efficient routing, to improve quality of service (QoS) and to reduce energy consumption. Location awareness of nodes is also useful or even necessary. Without knowing the position of sensor nodes, collected data is insignificant. Ant colony optimization (ACO) is a unique form of optimization method, which is highly suitable for adaptive routing and guaranteed packet delivery. The primary drawbacks of ACO are data flooding, huge overhead of control messages and long convergence time. These drawbacks are overcome by considering location information of sensor nodes. An event-based clustering localized energy efficient ant colony optimization (EBC_LEE-ACO) algorithm is proposed to enhance the performance of WSN. The main focus of the proposed algorithm is to improve QoS and minimize the network energy consumption by cluster formation and selecting the optimal path based on the biological inspired routing-ACO and location information of nodes. In clustering, data is aggregated and sent to the sink (base station) through cluster head (CH) which reduces overheads. EBC_LEE-ACO is a scalable and energy efficient reactive routing algorithm which improves QoS, lifetime and minimizes energy consummation of WSN as compared to other routing algorithms like AODV, ACO, ACO using RSSI. The proposed algorithm reduces energy consumption by approximately 7%, in addition to improvement in throughput, packet delivery ratio and increase in packet drop which has been observed in comparison with other algorithms, i.e. autonomous localization based eligible energetic Path_with_Ant Colony optimization (ALEEP with ACO) of the network. Use of IEEE 802.11 standard in proposed work increased packet drop.",
        "link": "http://dx.doi.org/10.48084/etasr.2121"
    },
    {
        "id": 19769,
        "title": "Optimal Operation of Micro-Grids to Reduce Energy Production Costs and Environmental Pollution Using Ant Colony Optimization Algorithm (ACO)",
        "authors": "Giulio Lorenzini, Mehrdad Ahmadi Kamarposhti, Ahmed Amin Ahmed Solyman",
        "published": "2021-2-28",
        "citations": 1,
        "abstract": "With increasing demand for electric energy and requesting higher quality by subscribers, the electric power industry has moved towards using new technologies. Many modern societies seek to use the systems of new energy management in order to reduce environmental pollutants and operational costs in electrical energy systems. Therefore, exploiting various resources of renewable energies, micro-grids can be considered as a significant tool to attain these objectives. According to the subject, Ant Colony Optimization algorithm (ACO) is used in this paper to optimize one micro-grid sample in order to reduce the cost of generating power and to reduce environmental pollution to increase reliability. The recommended algorithm has been done in two scenarios and each in two sections. In the first scenario, energy management will be conducted for all distributed generation resources and in the second scenario it is assumed that wind and solar products, produce their maximum power and energy management are conducted for the reminder elements and the results are compared with other optimization algorithms.",
        "link": "http://dx.doi.org/10.18280/jesa.540102"
    },
    {
        "id": 19770,
        "title": "Time and Position Aware Resource Search (TPARS) Algorithm for the Mobile Peer-to-Peer Network using Ant Colony Optimization (ACO)",
        "authors": "Mayank Pandey, Dharmendra Kumar, Ajay Kumar Dubey",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijcnds.2022.10047421"
    }
]