[
    {
        "id": 22671,
        "title": "Multi-Range Gated Graph Neural Network for Telecommunication Fraud Detection",
        "authors": "Shuyun Ji, Jinglin Li, Quan Yuan, Jiawei Lu",
        "published": "2020-7",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9207589"
    },
    {
        "id": 22672,
        "title": "Semi-supervised GANs for Fraud Detection",
        "authors": "Charitos Charitou, Artur d'Avila Garcez, Simo Dragicevic",
        "published": "2020-7",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9206844"
    },
    {
        "id": 22673,
        "title": "A Model Based on Siamese Neural Network for Online Transaction Fraud Detection",
        "authors": "Xinxin Zhou, Zhaohui Zhang, Lizhi Wang, Pengwei Wang",
        "published": "2019-7",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8852295"
    },
    {
        "id": 22674,
        "title": "Multiple Inputs Neural Networks for Fraud Detection",
        "authors": "Mansour Zoubeirou A Mayaki, Michel Riveill",
        "published": "2022-10",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mlcr57210.2022.00011"
    },
    {
        "id": 22675,
        "title": "Beyond the individual: An improved telecom fraud detection approach based on latent synergy graph learning",
        "authors": "Junhang Wu, Ruimin Hu, Dengshi Li, Lingfei Ren, Zijun Huang, Yilong Zang",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.10.019"
    },
    {
        "id": 22676,
        "title": "Fraud Detection using Recurrent Neural Networks for Digital Wallet Security",
        "authors": "Can Iscan, Fatma Patlar Akbulut",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmk59864.2023.10286651"
    },
    {
        "id": 22677,
        "title": "Medicare fraud detection using neural networks",
        "authors": "Justin M. Johnson, Taghi M. Khoshgoftaar",
        "published": "2019-12",
        "citations": 59,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1186/s40537-019-0225-0"
    },
    {
        "id": 22678,
        "title": "Electricity fraud detection using committee semi-supervised learning",
        "authors": "Joaquim L. Viegas, Nuno M. Cepeda, Susana M. Vieira",
        "published": "2018-7",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489389"
    },
    {
        "id": 22679,
        "title": "The Application of Neural Networks to Fraud Detection",
        "authors": "Pengjun Guan",
        "published": "2022-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3558819.3565092"
    },
    {
        "id": 22680,
        "title": "CCFD-GAN: Credit Card Fraud Detection Based on Generative Adversarial Networks Enhanced by Penalty Mechanism",
        "authors": "Wenbo Zhang, Shuo Zhang, Jinyi Chen, Hejiao Huang",
        "published": "2023-6-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191810"
    },
    {
        "id": 22681,
        "title": "FraudAmmo: Large Scale Synthetic Transactional Dataset for Payment Fraud Detection",
        "authors": "Karthikeswaren Ramachandran, Kanishka Kayathwal, Hardik Wadhwa, Gaurav Dhama",
        "published": "2023-6-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn54540.2023.10191990"
    },
    {
        "id": 22682,
        "title": "Detection of Credit Card Fraud with Artificial Neural Networks",
        "authors": "Ferhat YEŞİLYURT, Hasan TEMURTAŞ, Çiğdem BAKIR",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": " Along with the Internet, digital technologies are frequently used in every moment of our lives. Many transactions that we carry out in monetary terms such as shopping in our daily life are now done digitally. With the developing digitalization in the world, people's lives become easier and people can access different products in a short time. In particular, people can spend and shop quickly and easily without carrying cash in their pockets with a credit card. However, with the increase in the use of credit cards, there are also some security vulnerabilities. Fraudsters can gain unfair advantage by obtaining certain credit card information such as passwords. They can shop with someone else's credit card without permission. These transactions cause substantial financial damage to individuals and institutions. With the increase in the use of credit cards with the developing technology, such credit card fraud is also increasing rapidly. Taking precautions against credit card fraud is a very important issue in order to ensure the safety of people. For this reason, in order to ensure the security of both banks and financial institutions that provide credit card services, it is necessary to prevent credit card fraud and to detect fraud that may occur in credit cards within the scope of combating fraud. In our study, Artificial Neural Networks were used to detect credit card fraud transactions. A prediction model has been developed to detect fraud in credit card transactions with ANN. Using the Credit Card data set obtained from the Kaggle database, modeling was done with the Feed Forward Artificial Neural Network method. The aim of this study is to automatically detect abnormal behaviors made with credit cards. 98.44% success was achieved with feedforward artificial neural network.",
        "link": "http://dx.doi.org/10.58190/icat.2023.15"
    },
    {
        "id": 22683,
        "title": "UPI Fraud Detection Using Convolutional Neural Networks(CNN)",
        "authors": "MELAM NAGARAJU, Yarramreddy Chandrasena Reddy Dept. of IT, Polavarapu Nagendra Babu, Venkata Sai Pavan Ravipati, Velpula Chaitanya",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn response to the escalating threat of online banking fraud, exacerbated by the COVID-19 pandemic, this paper introduces a novel approach utilizing Convolutional Neural Networks (CNNs) for fraud detection. The study focuses on developing machine learning models tailored for recognizing fraudulent transactions and addresses challenges such as imbalanced datasets, feature transformation, and engineering. The proposed CNN-based model exhibits superior accuracy, particularly in handling imbalanced datasets, offering a promising solution compared to traditional algorithms. The research emphasizes the adaptability of CNNs to unconventional data types, such as banking transactions, and showcases their ability to capture intricate fraud patterns. Evaluation metrics include precision, recall, F1-Score, ROC Curve, and AUC, providing a comprehensive assessment of the model's effectiveness.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-4088962/v1"
    },
    {
        "id": 22684,
        "title": "Medicare fraud detection using graph neural networks",
        "authors": "Yeeun Yoo, Donghwa Shin, Daehee Han, Sunghyon Kyeong, Jinho Shin",
        "published": "2022-7-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icecet55527.2022.9872963"
    },
    {
        "id": 22685,
        "title": "Explainable Ai-Driven Financial Transaction Fraud Detection Using Machine Learning and Deep Neural Networks",
        "authors": "Chaithanya  Vamshi Sai, Debashish Das, Nouh Elmitwally, Ogerta Elezaj, Md Baharul Islam",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4439980"
    },
    {
        "id": 22686,
        "title": "NFA: A neural factorization autoencoder based online telephony fraud detection",
        "authors": "Abdul Wahid, Mounira Msahli, Albert Bifet, Gerard Memmi",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.dcan.2023.03.002"
    },
    {
        "id": 22687,
        "title": "Credit Card Fraud Detection Using Autoencoder-Based Deep Neural Networks",
        "authors": "Jiatong Shen",
        "published": "2021-3-26",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icbaie52039.2021.9389940"
    },
    {
        "id": 22688,
        "title": "Credit-card Fraud Detection System using Neural Networks",
        "authors": "Salwa Al Balawi, Njood Aljohani",
        "published": "2023",
        "citations": 0,
        "abstract": "Recently, with the development of online transactions, the credit-card transactions begun to be the most prevalent online payment methods. Credit-card fraud refers to the use fake Credit-Cards to purchase goods without paying. With the fast research and development in the area of information technology and data mining methods including the neural networks and decision trees, to advanced machine learning and deep learning methods, researchers have proposed a wide range of antifraud systems. Mainly, the Machine Learning (ML) and Deep Learning (DL) methods are employed to perform the fraud detection task. This paper aims to explore the existing credit-card fraud detection methods, and categorize them into two main categories. In addition, we investigated the deployment of neural network models with credit-card fraud detection problem, since we employed the Artificial Neural Network (ANN) and Convolutional Neural Network (CNN). ANN and CNN models are implemented and assessed using a credit-card dataset. The main contribution of this paper focuses on increasing the fraud-detection classification accuracy through developing an efficient deep neural network model.",
        "link": "http://dx.doi.org/10.34028/iajit/20/2/10"
    },
    {
        "id": 22689,
        "title": "FraudNE: a Joint Embedding Approach for Fraud Detection",
        "authors": "Mengyu Zheng, Chuan Zhou, Jia Wu, Shirui Pan, Jinqiao Shi, Li Guo",
        "published": "2018-7",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2018.8489585"
    },
    {
        "id": 22690,
        "title": "Impact of different transaction features on credit card fraud detection by neural networks",
        "authors": "Ertong Wei",
        "published": "2023-6-14",
        "citations": 0,
        "abstract": "A perfect credit card fraud detection model is necessary because of the economic loss caused by credit card fraud. Since many models have already gained great performance, this research focuses on the influences of different credit card transaction features on the accuracy of the fraud detection model constructed by a neural network, which is favorable for economists to study credit card fraud better. The data used in this research from Kaggle contains a million credit card transaction records with seven features for each. To analyze the importance of different details, different parameters are used in the input layer of the neural network model to compare the performance. Furthermore, the result is that the feature ratio to the median purchase price is the most significant one. The second important feature is the distance from home, and then online order is followed. Compared with the accuracy when inputting all the seven features(99.81%), the model performs well with only the above three features in the input layer(95.43%).",
        "link": "http://dx.doi.org/10.54254/2755-2721/4/2023333"
    },
    {
        "id": 22691,
        "title": "GRAFRAUD: Fraud Detection using Graph Databases and Neural Networks",
        "authors": "Alperen Sayar, Şuayip Arslan, Ajeet Singh Raina, Seyit Ertuğrul, Tuna Çakar",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iisec59749.2023.10391038"
    },
    {
        "id": 22692,
        "title": "GMM-based Undersampling and Its Application for Credit Card Fraud Detection",
        "authors": "Fengjun Zhang, Guanjun Liu, Zhenchuan Li, Chungang Yan, Changjun Jiang",
        "published": "2019-7",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8852415"
    },
    {
        "id": 22693,
        "title": "Generative adversarial network based telecom fraud detection at the receiving bank",
        "authors": "Yu-Jun Zheng, Xiao-Han Zhou, Wei-Guo Sheng, Yu Xue, Sheng-Yong Chen",
        "published": "2018-6",
        "citations": 68,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2018.02.015"
    },
    {
        "id": 22694,
        "title": "Fraud detection in credit card transaction using neural networks",
        "authors": "Imane Sadgali, Nawal Sael, Faouzia Benabbou",
        "published": "2019-10-2",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3368756.3369082"
    },
    {
        "id": 22695,
        "title": "Credit Card Fraud Detection: A Realistic Modeling and a Novel Learning Strategy",
        "authors": "",
        "published": "2018-8",
        "citations": 173,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tnnls.2017.2736643"
    },
    {
        "id": 22696,
        "title": "Fraud Detection Using Neural Networks: A Case Study of Income Tax",
        "authors": "Belle Fille Murorunkwere, Origene Tuyishimire, Dominique Haughton, Joseph Nzabanita",
        "published": "2022-5-31",
        "citations": 6,
        "abstract": "Detecting tax fraud is a top objective for practically all tax agencies in order to maximize revenues and maintain a high level of compliance. Data mining, machine learning, and other approaches such as traditional random auditing have been used in many studies to deal with tax fraud. The goal of this study is to use Artificial Neural Networks to identify factors of tax fraud in income tax data. The results show that Artificial Neural Networks perform well in identifying tax fraud with an accuracy of 92%, a precision of 85%, a recall score of 99%, and an AUC-ROC of 95%. All businesses, either cross-border or domestic, the period of the business, small businesses, and corporate businesses, are among the factors identified by the model to be more relevant to income tax fraud detection. This study is consistent with the previous closely related work in terms of features related to tax fraud where it covered all tax types together using different machine learning models. To the best of our knowledge, this study is the first to use Artificial Neural Networks to detect income tax fraud in Rwanda by comparing different parameters such as layers, batch size, and epochs and choosing the optimal ones that give better accuracy than others. For this study, a simple model with no hidden layers, softsign activation function performs better. The evidence from this study will help auditors in understanding the factors that contribute to income tax fraud which will reduce the audit time and cost, as well as recover money foregone in income tax fraud.",
        "link": "http://dx.doi.org/10.3390/fi14060168"
    },
    {
        "id": 22697,
        "title": "Fraud Detection Based on Graph Neural Networks with Self-attention",
        "authors": "Min Li, Mengjie Sun, Qianlong Liu, Yumeng Zhang",
        "published": "2021-10",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ainit54228.2021.00075"
    },
    {
        "id": 22698,
        "title": "Dynamic Relation-Attentive Graph Neural Networks for Fraud Detection",
        "authors": "Heehyeon Kim, Jinhyeok Choi, Joyce Jiyoung Whang",
        "published": "2023-12-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdmw60847.2023.00143"
    },
    {
        "id": 22699,
        "title": "An Inferable Representation Learning for Fraud Review Detection with Cold-start Problem",
        "authors": "Qian Li, Qiang Wu, Chengzhang Zhu, Jian Zhang, Wentao Zhao",
        "published": "2019-7",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8852437"
    },
    {
        "id": 22700,
        "title": "Medicare Fraud Detection Using Graph Analysis: A Comparative Study of Machine Learning and Graph Neural Networks",
        "authors": "Yeeun Yoo, Jinho Shin, Sunghyon Kyeong",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3305962"
    },
    {
        "id": 22701,
        "title": "Adversarial Reprogramming of Pretrained Neural Networks for Fraud Detection",
        "authors": "Lingwei Chen, Yujie Fan, Yanfang Ye",
        "published": "2021-10-26",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3459637.3482053"
    },
    {
        "id": 22702,
        "title": "Combing machine learning and elemental profiling for geographical authentication of Chinese Geographical Indication (GI) rice",
        "authors": "Fei Xu, Fanzhou Kong, Hong Peng, Shuofei Dong, Weiyu Gao, Guangtao Zhang",
        "published": "2021-7-8",
        "citations": 10,
        "abstract": "AbstractIdentification of geographical origin is of great importance for protecting the authenticity of valuable agri-food products with designated origins. In this study, a robust and accurate analytical method that could authenticate the geographical origin of Geographical Indication (GI) products was developed. The method was based on elemental profiling using inductively coupled plasma mass spectrometry (ICP-MS) in combination with machine learning techniques for model building and feature selection. The method successfully predicted and classified six varieties of Chinese GI rice. The elemental profiles of 131 rice samples were determined, and two machine learning algorithms were implemented, support vector machines (SVM) and random forest (RF), together with the feature selection algorithm Relief. Prediction accuracy of 100% was achieved by both Relief-SVM and Relief-RF models, using only four elements (Al, B, Rb, and Na). The methodology and knowledge from this study could be used to develop reliable methods for tracing geographical origins and controlling fraudulent labeling of diverse high-value agri-food products.",
        "link": "http://dx.doi.org/10.1038/s41538-021-00100-8"
    },
    {
        "id": 22703,
        "title": "Detection of Credit Card Fraud Transactions Using Machine Learning Algorithms and Neural Networks: A Comparative Study",
        "authors": "Deepti Dighe, Sneha Patil, Shrikant Kokate",
        "published": "2018-8",
        "citations": 25,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccubea.2018.8697799"
    },
    {
        "id": 22704,
        "title": "Fraud detection for job placement using hierarchical clusters-based deep neural networks",
        "authors": "Jeongrae Kim, Han-Joon Kim, Hyoungrae Kim",
        "published": "2019-8",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10489-019-01419-2"
    },
    {
        "id": 22705,
        "title": "Multilayer perceptron artificial neural networks-based model for credit card fraud detection",
        "authors": "Bassam Kasasbeh, Balqees Aldabaybah, Hadeel Ahmad",
        "published": "2022-4-1",
        "citations": 3,
        "abstract": "Nowadays, <span>credit card fraud has emerged as a major problem. People are becoming increasingly using credit cards to pay for their transactions, it has become more popular and essential in our lives. Fraudsters are developing new strategies and techniques over time, and it is not easy for humans to manually check out all transactions. The cost of fraudulent transactions is significant and without prevention mechanisms it is rising. Finding the best methodology to detect fraudulent transactions is a crucial asset to the industry to reduce the fraud financial loss. Artificial neural networks (ANN) technique is considered as one of the effective techniques that has proved its efficiency in detecting credit card fraud transactions with high precision and minimum cost. In this paper, we propose a multilayer perceptron (MLP) ANN-based model solution to improve the accuracy of the detection process. The performance of the methodology is measured based on the precision, sensitivity, specificity, accuracy, F-measure, area under curve (AUC) and root mean square error (RMSE). Moreover, we illustrate the performance results of these measures with a descriptive analysis. Experimental results have shown that the proposed ANN-based model is efficient and does improve the accuracy of the detection of fraudulent transactions.</span>",
        "link": "http://dx.doi.org/10.11591/ijeecs.v26.i1.pp362-373"
    },
    {
        "id": 22706,
        "title": "Using Harmony Search Algorithm in Neural Networks to Improve Fraud Detection in Banking System",
        "authors": "Sajjad Daliri",
        "published": "2020-2-8",
        "citations": 19,
        "abstract": "Financial fraud is among the main problems undermining the confidence of customers in addition to incurring economic losses to banks and financial institutions. In recent years, along with the proliferation of fraud, financial institutions began looking for ways to find a suitable solution in the fight against fraud. Given the advanced and varied changes in methods of fraud, extensive research has been conducted to detect fraud. In this paper, the Artificial Neural Network technique and Harmony Search Algorithm are used to detect fraud. In the proposed method, hidden patterns between normal and fraudulent customers’ information are searched. Given that fraudulent behavior could be detected and stopped before they take place, the results of the proposed system show that it has an acceptable capability in fraud detection.",
        "link": "http://dx.doi.org/10.1155/2020/6503459"
    },
    {
        "id": 22707,
        "title": "Detection of Fraud Transactions Using Recurrent Neural Network during COVID-19",
        "authors": "Samir Bandyopadhyay, SHAWNI DUTTA",
        "published": "No Date",
        "citations": 3,
        "abstract": "Online transactions are becoming more popular in present situation where the globe is facing an unknown disease COVID-19. Now authorities of Countries requested peoples to use cashless transaction as far as possible. Practically it is not always possible to use it in all transactions. Since number of such cashless transactions have been increasing during lockdown period due to COVID-19, fraudulent transactions are also increasing in a rapid way. Fraud can be analysed by viewing a series of customer transactions data that was done in his/her previous transactions. Normally banks or other transaction authorities warned their customers about the transaction If any deviation is noticed by them from available patterns. These authorities think that it is possibly of fraudulent transaction. For detection of fraud during COVID-19, banks and credit card companies are applying various methods such as data mining , decision tree, rule based mining, neural network, fuzzy clustering approach and machine learning methods. These approaches is try to find out normal usage pattern of customers based on their past activities. The objective of this paper is to find out such fraud transactions during such unmanageable situation.Digital payment schemes are often threatened by fraudulent activities. Detecting fraud transaction in during money transfer may save customers from financial loss. Mobile based money transactions are focused in this paper for fraud detection. A Deep Learning (DL) framework is suggested in this paper that monitors and detects fraudulent activities. Implementing and applying recurrent neural network on PaySim generated synthetic financial dataset, deceptive transactions are identified. The proposed method is capable to detect deceptive transactions with an accuracy of 99.87%, F1-Score of 0.99 and MSE of 0.01.",
        "link": "http://dx.doi.org/10.20944/preprints202006.0368.v1"
    },
    {
        "id": 22708,
        "title": "Deep Convolution Neural Network Model for Credit-Card Fraud Detection and Alert",
        "authors": "Joy Iong-Zong Chen, Kong-Long Lai",
        "published": "2021-6-22",
        "citations": 50,
        "abstract": "With the exponential increase in the usage of the internet, numerous organisations, including the financial industry, have operationalized online services. The massive financial losses occur as a result of the global growth in financial fraud. Henceforth, devising advanced financial fraud detection systems can actively detect the risks such as illegal transactions and irregular attacks. Over the recent years, these issues are tackled to a larger extent by means of data mining and machine learning techniques. However, in terms of unknown attack pattern identification, big data analytics and speed computation, several improvements must be performed in these techniques. The Deep Convolution Neural Network (DCNN) scheme based financial fraud detection scheme using deep learning algorithm is proposed in this paper. When large volume of data is involved, the detection accuracy can be enhanced by using this technique. The existing machine learning models, auto-encoder model and other deep learning models are compared with the proposed model to evaluate the performance by using a real-time credit card fraud dataset. Over a time duration of 45 seconds, a detection accuracy of 99% has been obtained by using the proposed model as observed in the experimental results.",
        "link": "http://dx.doi.org/10.36548/jaicn.2021.2.003"
    },
    {
        "id": 22709,
        "title": "Tax Fraud Detection through Neural Networks: An Application Using a Sample of Personal Income Taxpayers",
        "authors": "César Pérez López, María Delgado Rodríguez, Sonia de Lucas Santos",
        "published": "2019-3-30",
        "citations": 22,
        "abstract": "The goal of the present research is to contribute to the detection of tax fraud concerning personal income tax returns (IRPF, in Spanish) filed in Spain, through the use of Machine Learning advanced predictive tools, by applying Multilayer Perceptron neural network (MLP) models. The possibilities springing from these techniques have been applied to a broad range of personal income return data supplied by the Institute of Fiscal Studies (IEF). The use of the neural networks enabled taxpayer segmentation as well as calculation of the probability concerning an individual taxpayer’s propensity to attempt to evade taxes. The results showed that the selected model has an efficiency rate of 84.3%, implying an improvement in relation to other models utilized in tax fraud detection. The proposal can be generalized to quantify an individual’s propensity to commit fraud with regards to other kinds of taxes. These models will support tax offices to help them arrive at the best decisions regarding action plans to combat tax fraud.",
        "link": "http://dx.doi.org/10.3390/fi11040086"
    },
    {
        "id": 22710,
        "title": "Bank Fraud Detection with Graph Neural Networks",
        "authors": "A. I. Sergadeeva, D. S. Lavrova, D. P. Zegzhda",
        "published": "2022-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s0146411622080223"
    },
    {
        "id": 22711,
        "title": "Automatic Fraud Detection in e-Commerce Transactions using Deep Reinforcement Learning and Artificial Neural Networks",
        "authors": "Yuanyuan Tang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01407113"
    },
    {
        "id": 22712,
        "title": "Credit Card Fraud Detection with Auto Encoders and Artificial Neural Networks",
        "authors": "Nagabhusanam M V, S. Siva Priyanka, Aruru Sai Kumar, Sunku Prahasita, Guntha Sahithi",
        "published": "2023-7-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10308011"
    },
    {
        "id": 22713,
        "title": "The Devil is in the Conflict: Disentangled Information Graph Neural Networks for Fraud Detection",
        "authors": "Zhixun Li, Dingshuo Chen, Qiang Liu, Shu Wu",
        "published": "2022-11",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdm54844.2022.00131"
    },
    {
        "id": 22714,
        "title": "Credit Card Fraud Detection using Classification, Unsupervised, Neural Networks Models",
        "authors": " L. Bhavya,  V. Sasidhar Reddy,  U. Anjali Mohan,  S. Karishma,  ",
        "published": "2020-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17577/ijertv9is040749"
    },
    {
        "id": 22715,
        "title": "Financial fraud detection using graph neural networks: A systematic review",
        "authors": "Soroor Motie, Bijan Raahemi",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.eswa.2023.122156"
    },
    {
        "id": 22716,
        "title": "Recurrent Dynamical Projection for Time Series-Based Fraud Detection",
        "authors": "Eric A. Antonelo, Radu State",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-68612-7_57"
    },
    {
        "id": 22717,
        "title": "FORENSIC CREDIT CARD FRAUD DETECTION USING DEEP NEURAL NETWORK",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.35741/issn.0258-2724.58.1.33"
    },
    {
        "id": 22718,
        "title": "Detection of Fraud Transactions Using Recurrent Neural Network during COVID-19",
        "authors": "Samir Kuma Bandyopadhyay,  ",
        "published": "2020-10-7",
        "citations": 8,
        "abstract": "Online transactions are becoming more popular in present situation where the globe is facing an unknown disease COVID-19. Now authorities of several countries have requested people to use cashless transaction as far as possible. Practically, it is not always possible to use it in all transactions. Since number of such cashless transactions has been increasing during lockdown period due to COVID-19, fraudulent transactions are also increasing in a rapid way. Fraud can be analysed by viewing a series of customer transactions data that was done in his/ her previous transactions. Normally banks or other transaction authorities warn their customers about the transaction, if they notice any deviation from available patterns; the authorities consider it as a possibly fraudulent transaction. For detection of fraud during COVID-19, banks and credit card companies are applying various methods such as data mining, decision tree, rule based mining, neural network, fuzzy clustering approach and machine learning methods. The approach tries to find out normal usage pattern of customers based on their former activities. The objective of this paper is to propose a method to detect such fraud transactions during such unmanageable situation of the pandemic. Digital payment schemes are often threatened by fraudulent activities. Detecting fraud transactions during money transfer may save customers from financial loss. Mobile-based money transactions are focused in this paper for fraud detection. A Deep Learning (DL) framework is suggested in the paper that monitors and detects fraudulent activities. Implementing and applying Recurrent Neural Network on PaySim generated synthetic financial dataset, deceptive transactions are identified. The proposed method is capable to detect deceptive transactions with an accuracy of 99.87%, F1-Score of 0.99 and MSE of 0.01.",
        "link": "http://dx.doi.org/10.24321/2394.6539.202012"
    },
    {
        "id": 22719,
        "title": "Using PCA to Improve the Detection of Medical Insurance Fraud in SOFM Neural Networks",
        "authors": "Hongfei Cao, Runtong Zhang",
        "published": "2019-1-12",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3312662.3312713"
    },
    {
        "id": 22720,
        "title": "Credit Card Fraud Detection Using Neural Networks at Merchant Side",
        "authors": "Muzaffar A. Rahim Shabad, M Kavitha",
        "published": "2018-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1166/jctn.2018.7628"
    },
    {
        "id": 22721,
        "title": "FraudMemory: Explainable Memory-Enhanced Sequential Neural Networks for Financial Fraud Detection",
        "authors": "Kunlin Yang, Wei Xu",
        "published": "2019",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.24251/hicss.2019.126"
    },
    {
        "id": 22722,
        "title": "Optimisation and Resampling methods for Handling Imbalanced Datasets in Credit Card Fraud Detection using Artificial Neural Networks",
        "authors": "Oussama Ndama, El Mokhtar En-Naimi",
        "published": "2023-5-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3607720.3607745"
    },
    {
        "id": 22723,
        "title": "Heterogeneous graph neural networks for fraud detection and explanation in supply chain finance",
        "authors": "Bin Wu, Kuo-Ming Chao, Yinsheng Li",
        "published": "2024-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.is.2023.102335"
    },
    {
        "id": 22724,
        "title": "A Primer on Anomaly and Fraud Detection in Blockchain Networks",
        "authors": "Emily Turner, Stephen Chan, Jeffrey Chu, Yuanyuan Zhang",
        "published": "2023-1-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21428/cb6ab371.34d34edf"
    },
    {
        "id": 22725,
        "title": "A Model Based on Convolutional Neural Network for Online Transaction Fraud Detection",
        "authors": "Zhaohui Zhang, Xinxin Zhou, Xiaobo Zhang, Lizhi Wang, Pengwei Wang",
        "published": "2018-8-6",
        "citations": 58,
        "abstract": "Using wireless mobile terminals has become the mainstream of Internet transactions, which can verify the identity of users by passwords, fingerprints, sounds, and images. However, once these identity data are stolen, traditional information security methods will not avoid online transaction fraud. The existing convolutional neural network model for fraud detection needs to generate many derivative features. This paper proposes a fraud detection model based on the convolutional neural network in the field of online transactions, which constructs an input feature sequencing layer that implements the reorganization of raw transaction features to form different convolutional patterns. Its significance is that different feature combinations entering the convolution kernel will produce different derivative features. The advantage of this model lies in taking low dimensional and nonderivative online transaction data as the input. The whole network consists of a feature sequencing layer, four convolutional layers and pooling layers, and a fully connected layer. Verifying with online transaction data from a commercial bank, the experimental results show that the model achieves excellent fraud detection performance without derivative features. And its precision can be stabilized at around 91% and recall can be stabilized at around 94%, which increased by 26% and 2%, respectively, comparing with the existing CNN for fraud detection.",
        "link": "http://dx.doi.org/10.1155/2018/5680264"
    },
    {
        "id": 22726,
        "title": "Telecommunications Fraud Detection, Using Social Networks for",
        "authors": "Chris Volinsky",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4939-7131-2_280"
    },
    {
        "id": 22727,
        "title": "A Hybrid Approach Adopted for Credit Card Fraud Detection Based on Deep Neural Networks and Attention Mechanism",
        "authors": " Vikash Chander Maheshwari,  Nurul Aida Osman,  Norshakirah Aziz",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Over the past few years, credit card fraud has become a serious problem as more individuals rely on credit cards for purchases. The significant increase in fraudulent activities can be attributed to advancements in technology and the prevalence of online transactions, leading to significant financial losses. To address this issue, an effective fraud detection system needs to be developed and put into practice. Machine learning techniques are commonly used to automatically detect credit card fraud, but they do not consider deceptive behaviour or behavioural issues that could lead to false alarms. The objective of this research is to determine how to identify instances of credit card fraud. This paper aimed to create a model using deep learning and SMOTE oversampling technique to anticipate credit card fraud. A Recurrent Neural Network with Long Short-Term Memory (RNN-LSTM) and an attention mechanism is suggested for detecting fraud. This model is known to be effective for processing sequential data with complex relationships between vectors. The performance of RNN-LSTM is compared to XGBoost, Random Forest, Naive Bayes, SVM, and ANN classifiers, and the experiments indicate that our proposed model achieves high accuracy of 99.4% and produces strong results. The suggested model has the potential to decrease financial losses worldwide by identifying instances of credit card scams or frauds.",
        "link": "http://dx.doi.org/10.37934/araset.32.1.315331"
    },
    {
        "id": 22728,
        "title": "Credit Card Fraud Detection Model Based on LSTM Recurrent Neural Networks",
        "authors": "Ibtissam Benchaji,  , Samira Douzi, Bouabid El Ouahidi",
        "published": "2021",
        "citations": 33,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.12720/jait.12.2.113-118"
    },
    {
        "id": 22729,
        "title": "Credit Card Fraud Detection Using Artificial Neural Networks and Random Forest Algorithms",
        "authors": "Sasmita Kumari Pradhan, N V Krishna Rao, N M Deepika, Putta Harish, MA Pawan Kumar, Prem Sai Kumar",
        "published": "2021-12-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceca52323.2021.9676142"
    },
    {
        "id": 22730,
        "title": "Spectrum-based Deep Neural Networks for Fraud Detection",
        "authors": "Shuhan Yuan, Xintao Wu, Jun Li, Aidong Lu",
        "published": "2017-11-6",
        "citations": 23,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3132847.3133139"
    },
    {
        "id": 22731,
        "title": "Firearm Detection using Convolutional Neural Networks",
        "authors": "Rodrigo Kanehisa, Areolino Neto",
        "published": "2019",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007397707070714"
    },
    {
        "id": 22732,
        "title": "Credit card fraud recognition based on width and depth neural networks",
        "authors": "Shan Jiang, Yuming Feng, Xiaofeng Liao, B. O. Onasanya",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nCredit card fraud identification is an important issue in risk prevention and control for banks and financial institutions. In order to establish credit card fraud identification model, This paper studies the feature extraction of fraud identification and the correlation analysis of influencing factors, the basic principles of deep neural network models were studied, and the basic principles of wide neural network models were studied, at the same time. On this basis, this paper proposes a credit card fraud identification model combining width neural network and depth neural network. The model was trained using a random gradient descent method. On the test set, the method proposed in this paper achieved an F1 score of 95.6%, and the method has good fraud identification performance. After comparison, the method proposed in this article is superior to traditional machine learning models such as KNN, decision tree, and Bayesian network.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3378590/v1"
    },
    {
        "id": 22733,
        "title": "Revisiting Edge Detection in Convolutional Neural Networks",
        "authors": "Minh Le, Subhradeep Kayal",
        "published": "2021-7-18",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9534039"
    },
    {
        "id": 22734,
        "title": "Multilayer perceptron neural network technique for fraud detection",
        "authors": "Aji Mubalaike Mubarek, Esref Adali",
        "published": "2017-10",
        "citations": 22,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ubmk.2017.8093417"
    },
    {
        "id": 22735,
        "title": "Various Methods for Fraud Transaction Detection in Credit Cards",
        "authors": "Hardik Manek, Nikhil Kataria, Sujai Jain, Chitra Bhole",
        "published": "2019-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5383/juspn.12.01.004"
    },
    {
        "id": 22736,
        "title": "Finding Credit Card Fraud from the Imbalanced Data Via Deep Neural Networks",
        "authors": "Huajie Huang, Bo Liu, Xiaoyu Xue, Jiuxin Cao, Xinyi Chen",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4463271"
    },
    {
        "id": 22737,
        "title": "Towards Consumer Loan Fraud Detection: Graph Neural Networks with Role-Constrained Conditional Random Field",
        "authors": "Bingbing Xu, Huawei Shen, Bingjie Sun, Rong An, Qi Cao, Xueqi Cheng",
        "published": "2021-5-18",
        "citations": 25,
        "abstract": "Consumer loans, i.e., loans to finance consumers to buy certain types of expenditures, is increasingly popular in e-commerce platform. Different from traditional loans with mortgage, online consumer loans only take personal credit as collateral for loans. Consequently, loan fraud detection is particularly critical for lenders to avoid economic loss. Previous methods mainly leverage applicant's attributes and historical behavior for loan fraud detection. Although these methods gain success at detecting potential charge-offs, yet they perform worse when multiple persons with various roles (e.g., sellers, intermediaries) collude to apply fraudulent loan. To combat this challenge, we consider the problem of loan fraud detection via exploiting roles of users and multi-type social relationships among users. We propose a novel Graph neural network with a Role-constrained Conditional random field, namely GRC, to learn the representation of applicants and detect loan fraud based on the learned representation. The proposed model characterizes the multiple types of relationships via self-attention mechanism and employs conditional random field to constrain users with the same role to have similar representation. We validate the proposed model through experiments in large-scale auto-loan scenario. Extensive experiments demonstrate that our model achieves state-of-the-art results in loan fraud detection on Alipay, one online credit payment service serving more than 450 million users in China.",
        "link": "http://dx.doi.org/10.1609/aaai.v35i5.16582"
    },
    {
        "id": 22738,
        "title": "Enhancing Financial Fraud Detection with Hierarchical Graph Attention Networks: A Study on Integrating Local and Extensive Structural Information",
        "authors": "Feifen Shi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4518075"
    },
    {
        "id": 22739,
        "title": "Towards a Fraud Detection Framework in VoIP Networks",
        "authors": "",
        "published": "2018-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1201/9781315218939-34"
    },
    {
        "id": 22740,
        "title": "Financial fraud detection using quantum graph neural networks",
        "authors": "Nouhaila Innan, Abhishek Sawaika, Ashim Dhor, Siddhant Dutta, Sairupa Thota, Husayn Gokal, Nandan Patel, Muhammad Al-Zafar Khan, Ioannis Theodonis, Mohamed Bennai",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s42484-024-00143-6"
    },
    {
        "id": 22741,
        "title": "Telecommunications Fraud Detection, Using Social Networks for",
        "authors": "Chris Volinsky",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4614-7163-9_280-1"
    },
    {
        "id": 22742,
        "title": "Graph Neural Network for Ethereum Fraud Detection",
        "authors": "Runnan Tan, Qingfeng Tan, Peng Zhang, Zhao Li",
        "published": "2021-12",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ickg52313.2021.00020"
    },
    {
        "id": 22743,
        "title": "Ransomware Detection with Deep Neural Networks",
        "authors": "Matan Davidian, Natalia Vanetik, Michael Kiperberg",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011008000003120"
    },
    {
        "id": 22744,
        "title": "ARCNN framework for multimodal infodemic detection",
        "authors": "Chahat Raj, Priyanka Meel",
        "published": "2022-2",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2021.11.006"
    },
    {
        "id": 22745,
        "title": "Deep Neural Networks for Android Malware Detection",
        "authors": "Abhilash Hota, Paul Irolla",
        "published": "2019",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007617606570663"
    },
    {
        "id": 22746,
        "title": "Recent Progress on Anomaly Detection in Social Networks using Graph Neural Networks",
        "authors": "victor Daniel",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>survey paper on graph neural networks based anomaly detection in social networks</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21152719"
    },
    {
        "id": 22747,
        "title": "Using neural network for credit card fraud detection",
        "authors": "Sevdalina Georgieva, Maya Markova, Velizar Pavlov",
        "published": "2019",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5127478"
    },
    {
        "id": 22748,
        "title": "Recent Progress on Anomaly Detection in Social Networks using Graph Neural Networks",
        "authors": "victor Daniel",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>survey paper on graph neural networks based anomaly detection in social networks</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21152719.v1"
    },
    {
        "id": 22749,
        "title": "Application Development for Mask Detection and Social Distancing Violation Detection using Convolutional Neural Networks",
        "authors": "Gokul Kumar, Sujala Shetty",
        "published": "2021",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010483107600767"
    },
    {
        "id": 22750,
        "title": "Fundamentals of Convolutional Neural Networks",
        "authors": "Umberto Michelucci",
        "published": "2019",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-4976-5_3"
    },
    {
        "id": 22751,
        "title": "Convolutional Neural Networks for Signal Detection",
        "authors": "Robert Forrest",
        "published": "2021-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1813655"
    },
    {
        "id": 22752,
        "title": "Detecting Fraud",
        "authors": "",
        "published": "2017-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315263656-5"
    },
    {
        "id": 22753,
        "title": "Community Detection for Mobile Money Fraud Detection",
        "authors": "Safa El Ayeb, Baptiste Hemery, Fabrice Jeanne, Estelle Cherrier",
        "published": "2020-12-14",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/snams52053.2020.9336578"
    },
    {
        "id": 22754,
        "title": "Comparison of Face Recognition and Detection Models: Using Different Convolution Neural Networks",
        "authors": " Kai Kang",
        "published": "2019-4",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s1060992x19020036"
    },
    {
        "id": 22755,
        "title": "Metaheuristics optimization-based ensemble of deep neural networks for Mpox disease detection",
        "authors": "Sohaib Asif, Ming Zhao, Fengxiao Tang, Yusen Zhu, Baokang Zhao",
        "published": "2023-10",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neunet.2023.08.035"
    },
    {
        "id": 22756,
        "title": "Multi-Class Mobile Money Service Financial Fraud Detection by Integrating Supervised Learning with Adversarial Autoencoders",
        "authors": "Julio Cezar Soares Silva, David Macedo, Cleber Zanchettin, Adriano L.I. Oliveira, Adiel Teixeira de Almeida Filho",
        "published": "2021-7-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn52387.2021.9533313"
    },
    {
        "id": 22757,
        "title": "Treating Fraud Risk",
        "authors": "",
        "published": "2017-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315263656-4"
    },
    {
        "id": 22758,
        "title": "Assessing Fraud Risk",
        "authors": "",
        "published": "2017-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315263656-3"
    },
    {
        "id": 22759,
        "title": "Managing Fraud Risk",
        "authors": "",
        "published": "2017-5-15",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315263656-1"
    },
    {
        "id": 22760,
        "title": "Graph Neural Networks in Anomaly Detection",
        "authors": "Shen Wang, Philip S. Yu",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-16-6054-2_26"
    },
    {
        "id": 22761,
        "title": "Measuring Fraud Resistance",
        "authors": "",
        "published": "2017-5-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9781315263656-7"
    },
    {
        "id": 22762,
        "title": "Optimizing Insurance Fraud Claim Detection through Machine Learning: A Comprehensive Approach for Improved Fraud Detection",
        "authors": "Aayush .",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nInsurance fraud is a growing concern, prompting proactive measures through advanced machine learning techniques. This research focuses on constructing a predictive model for distinguishing genuine and fraudulent auto insurance claims. The dataset, comprising 1,000 instances and 40 attributes, covers customer demographics, policy details, incidents, and financial data. Early fraud detection is crucial for financial loss mitigation and maintaining insurance system integrity. The study employs data preprocessing to handle missing values and features XGBoost importance, variance thresholding, and correlation analysis for enhanced model interpretability. The machine learning model integrates nine algorithms, with a hard-voting ensemble of Logistic Regression and XGBoost demonstrating competitive accuracy, reaching 83.0%. Results highlight Linear Discriminant Analysis as the leading classifier, achieving 84% accuracy. The ensemble approach achieves 83.0% accuracy with a notable precision of 91%, showcasing the strength of combining diverse models. The study emphasizes the significance of preprocessing, feature selection, and ensemble learning for fraud detection optimization. The refined model achieves a minimal Brier loss of 0.00054, indicating minimal discrepancies in predicted probabilities and actual outcomes in binary classification. Exploration of principal component analysis (PCA) with multiple linear regression reveals a trade-off between model simplicity and performance. Retaining 32 components preserves 95% of variance, achieving a balance at 0.7967, while keeping 35 components reaches the highest value of 0.9991, showcasing dimensionality reduction's potential to capture nearly all the data variance.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-4109015/v1"
    },
    {
        "id": 22763,
        "title": "Co-F I N D: LSTM Based Adaptive Recurrent Neural Network for CoVID-19 Fraud Index Detection",
        "authors": "Anika Anjum, Mumenunnessa Keya, Abu Kaisar Mohammad Masum, Sharun Akter Khushbu, Sheak Rashed Haider Noori",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-12413-6_37"
    },
    {
        "id": 22764,
        "title": "Graph Neural Network for Credit Card Fraud Detection",
        "authors": "GuanJun Liu, Jing Tang, Yue Tian, Jiacun Wang",
        "published": "2021-12-18",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccsi53130.2021.9736204"
    },
    {
        "id": 22765,
        "title": "Telecom Fraud Detection with Machine Learning on Imbalanced Dataset",
        "authors": "Ivan Krasic, Stipe Celar",
        "published": "2022-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/softcom55329.2022.9911518"
    },
    {
        "id": 22766,
        "title": "An efficient bitcoin fraud detection in social media networks",
        "authors": "Anju Viswam, Gopu Darsan",
        "published": "2017-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccpct.2017.8074262"
    },
    {
        "id": 22767,
        "title": "Deep Recurrent Neural Networks for seizure detection and early seizure detection systems",
        "authors": "S. Talathi",
        "published": "2017-6-5",
        "citations": 30,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1366924"
    },
    {
        "id": 22768,
        "title": "ANONUS: Anonymous Bonus Point System with Fraud Detection",
        "authors": "Samuel Brack, Stefan Dietzel, Bjorn Scheuermann",
        "published": "2017-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/lcn.2017.50"
    },
    {
        "id": 22769,
        "title": "Neural Networks for Deepfake Detection",
        "authors": "muhammad Salman",
        "published": "No Date",
        "citations": 0,
        "abstract": "The proliferation of deepfake technology has sparked concerns regarding media manipulation and misinformation. To counter this, researchers employ neural networks, such as Convolutional Neural Networks (CNNs) for image analysis, Recurrent Neural Networks (RNNs) for temporal patterns, and 3D CNNs for video-based identification. Effective training methods, like data augmentation and transfer learning, aid these networks in discerning real from manipulated content. Rigorous validation through metrics like accuracy and recall ensures their dependability, while adversarial training enhances their resilience against attacks. In a rapidly evolving landscape, continuous development and a comprehensive strategy involving policy measures and public awareness are imperative. Neural networks assume a central role in the fight against deepfakes, safeguarding digital media integrity and minimizing potential harm.",
        "link": "http://dx.doi.org/10.31219/osf.io/9gakf"
    },
    {
        "id": 22770,
        "title": "Neural network based approach for Ethereum fraud detection",
        "authors": "Manju Dahiya, Naman Mishra, Riya Singh,  Pavitra",
        "published": "2023-5-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciem59379.2023.10166745"
    }
]