[
    {
        "id": 6705,
        "title": "Benchmarking Neural Network Architectures for Strong Gravitational Lens Classification",
        "authors": "Eileen Nolan",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1995270"
    },
    {
        "id": 6706,
        "title": "NEURAL NETWORK ARCHITECTURES",
        "authors": "",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "Neural networks are currently one of the most modern creative and interesting areas of knowledge. The use of neural networks allows solving many problems when the use of other approaches is almost impossible due to their complexity. Todaty, there are a large number of neural network architectures available, including simple ones like perceptron and neural networks with trillions of parameters. Such a variety of neural network architectures is determined by the tasks they face. In addition, the scope of neural networks is also growing due to the emergence of the possibility of their application in connection with increasing data volumes and computing power. The article provides an overview of the main of neural networks architectures, which serve as the basis for development of the modern neural networks, that can be used in many aspects of everyday life.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18469/ikt.2022.20.2.15"
    },
    {
        "id": 6707,
        "title": "Using Neural Network Architectures for Intraday Trading in the Gold Market",
        "authors": "Srinivas Devarajula, Vitaliy Milke, Cristina Luca",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011794400003393"
    },
    {
        "id": 6708,
        "title": "On the Adjacency Matrix of Spatio-Temporal Neural Network Architectures for Predicting Traffic",
        "authors": "Sebastian Bomher, Bogdan Ichim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011971300003479"
    },
    {
        "id": 6709,
        "title": "Advancements in English listening education: Chat GPT and convolutional neural network integration",
        "authors": "Runmei Xing",
        "published": "2023-11-20",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.33902/jpr.202323980"
    },
    {
        "id": 6710,
        "title": "Efficient and Accurate Hyperspectral Image Demosaicing with Neural Network Architectures",
        "authors": "Eric Wisotzky, Lara Wallburg, Anna Hilsmann, Peter Eisert, Thomas Wittenberg, Stephan Göb",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012392300003660"
    },
    {
        "id": 6711,
        "title": "Neural Network Architectures for Integrated Circuits",
        "authors": "Khyati Nagrani, Tapas Kumar Maiti",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isdcs58735.2023.10153560"
    },
    {
        "id": 6712,
        "title": "Garment Defect Detection Using Convolutional Neural Network",
        "authors": "Egodawattaarachchige Asini Bovindya, Samadhi Rathnayake, Anuradha Karunasena, Sahan Pothupitiya",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icac60630.2023.10417665"
    },
    {
        "id": 6713,
        "title": "Artificial Neural Network for Human Object Interaction System Over Aerial Images",
        "authors": "Mahwish Pervaiz, Ahmad Jalal",
        "published": "2023-2-20",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacs55311.2023.10089722"
    },
    {
        "id": 6714,
        "title": "ALCDC SYSTEM WITH CONVOLUTIONAL NEURAL NETWORK TECHNOLOGY: ADVANCEMENTS IN LUNG CANCER DETECTION",
        "authors": "",
        "published": "2023-6-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets40953"
    },
    {
        "id": 6715,
        "title": "Theoretical Understanding of Convolutional Neural Network: Concepts, Architectures, Applications, Future Directions",
        "authors": "Mohammad Mustafa Taye",
        "published": "2023-3-6",
        "citations": 59,
        "abstract": "Convolutional neural networks (CNNs) are one of the main types of neural networks used for image recognition and classification. CNNs have several uses, some of which are object recognition, image processing, computer vision, and face recognition. Input for convolutional neural networks is provided through images. Convolutional neural networks are used to automatically learn a hierarchy of features that can then be utilized for classification, as opposed to manually creating features. In achieving this, a hierarchy of feature maps is constructed by iteratively convolving the input image with learned filters. Because of the hierarchical method, higher layers can learn more intricate features that are also distortion and translation invariant. The main goals of this study are to help academics understand where there are research gaps and to talk in-depth about CNN’s building blocks, their roles, and other vital issues.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/computation11030052"
    },
    {
        "id": 6716,
        "title": "Optimal sensor network routing with secure network monitoring using deep learning architectures",
        "authors": "Shamimul Qamar",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08753-0"
    },
    {
        "id": 6717,
        "title": "Exploration of Lightweight Neural Network Architectures for Sentiment Analysis",
        "authors": "Hongfei Rong",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicml60161.2023.10424736"
    },
    {
        "id": 6718,
        "title": "Lung Segmentation from Chest Radiographs Using Multiscale Deep Neural Network",
        "authors": "Saurabh Kashyap, Priti Sharma, Pramod Kumar Soni",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10389878"
    },
    {
        "id": 6719,
        "title": "Fabric Fault And Extra Thread Detection Using Convolutional Neural Network",
        "authors": "Sowmiya A, Karunamoorthy B",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeca56562.2023.10199318"
    },
    {
        "id": 6720,
        "title": "Convolutional Neural Network Based Predictive Framework for Intensive Care Unit Readmission",
        "authors": "Nadia Rasheed, Muhammad Usman Akram, Jahan Zeb",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacs60934.2024.10473298"
    },
    {
        "id": 6721,
        "title": "Artificial Neural Network Technique for DDOS Attack Prediction in Cyber-IOT System",
        "authors": "Md Asad, Rakesh Kumar Tiwari",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390204"
    },
    {
        "id": 6722,
        "title": "Plant Disease Detection Using Deep Neural Network",
        "authors": "G Shobana, K Vignesh, S Sree Dharshan",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeca56562.2023.10199940"
    },
    {
        "id": 6723,
        "title": "Asynchronous evolution of deep neural network architectures",
        "authors": "Jason Liang, Hormoz Shahrzad, Risto Miikkulainen",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.111209"
    },
    {
        "id": 6724,
        "title": "Enhancing Medical Image Segmentation with Recurrent Neural Network Architectures",
        "authors": "Palak Masson, Deepak Sharma, Kanchan Yadav, Tarun Sethi",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt61202.2024.10489522"
    },
    {
        "id": 6725,
        "title": "Convolutional Neural Network Architectures Analysis for Image Captioning",
        "authors": "Jun Seung Woo, Shin Dong Ho",
        "published": "2023-6-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46254/na8.20230159"
    },
    {
        "id": 6726,
        "title": "Weeds Classification using Convolutional Neural Network Architectures",
        "authors": "S Suriya, Hema A",
        "published": "2023-6",
        "citations": 0,
        "abstract": "Agriculture is an important sector for both human survival and economic growth. It has to be managed efficiently. This can be done by the use of technology in order to minimize human effort. It can be managed efficiently by following crop management tasks. One such crop management task is the identification and removal of weeds. Weeds are considered to be plants which are not required to be grown with the agricultural crops, because the weeds also utilize the water and nutrients like the agricultural crop and cause impact on the growth of agricultural crops. In order to identify weeds, deep learning technology can be used. The proposed system helps to classify weeds using Convolutional Neural Networks.  This system employs models like, ResNet50, MobileNetV2 and InceptionV3, which are used for better classification. The system is evaluated based on these models, and all the three models have resulted in better accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36548/jscp.2023.2.003"
    },
    {
        "id": 6727,
        "title": "Convolutional Neural Network Based Alzheimer's Disease Detection Using OIASIS Dataset",
        "authors": "Babasaheb S. Satpute, Wasudeo P. Rahane, Rajesh Bharati",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10389921"
    },
    {
        "id": 6728,
        "title": "Improving Facial Emotion Recognition Through Transfer Learning with Deep Convolutional Neural Network (DCNN) Models",
        "authors": "Usha Rawat, C.S. Rai",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390186"
    },
    {
        "id": 6729,
        "title": "Enabling Efficient On-Edge Spiking Neural Network Acceleration with Highly Flexible FPGA Architectures",
        "authors": "Samuel López-Asunción, Pablo Ituero",
        "published": "2024-3-14",
        "citations": 0,
        "abstract": "Spiking neural networks (SNNs) promise to perform tasks currently performed by classical artificial neural networks (ANNs) faster, in smaller footprints, and using less energy. Neuromorphic processors are set out to revolutionize computing at a large scale, but the move to edge-computing applications calls for finely-tuned custom implementations to keep pushing towards more efficient systems. To that end, we examined the architectural design space for executing spiking neuron models on FPGA platforms, focusing on achieving ultra-low area and power consumption. This work presents an efficient clock-driven spiking neuron architecture used for the implementation of both fully-connected cores and 2D convolutional cores, which rely on deep pipelines for synaptic processing and distributed memory for weight and neuron states. With them, we developed an accelerator for an SNN version of the LeNet-5 network trained on the MNIST dataset. At around 5.5 slices/neuron and only 348 mW, it is able to use 33% less area and four times less power per neuron as current state-of-the-art implementations while keeping low simulation step times.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/electronics13061074"
    },
    {
        "id": 6730,
        "title": "Designing a Convolutional Neural Network for Image Recognition: A Comparative Study of Different Architectures and Training Techniques",
        "authors": "Tapomoy Adhikari",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4366645"
    },
    {
        "id": 6731,
        "title": "Comprehensive Evaluation of Deep Neural Network Architectures for Parawood Pith Estimation",
        "authors": "Wattanapong Kurdthongmee",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "Accurate pith estimation is crucial for maintaining the quality of wood products. This study delves into deep learning techniques for precise Parawood pith estimation, employing popular convolutional neural networks (ResNet50, MobileNet, and Xception) with adapted regression heads. Through variations in regression functions, optimizers, and training epochs, the most effective models were pinpointed. Xception, coupled with Huber Loss regression, Nadam optimizer, and 200 epochs, showcased superior performance, achieving a 4.48 mm mean error (with a standard deviation of 3.69 mm) in Parawood. Notably, benchmarking on the Douglas Fir dataset yielded similar results (2.81 mm mean error, standard deviation: 1.57 mm). These findings underscore deep learning's potential for Parawood and Douglas Fir pith estimation, offering substantial benefits to wood industry quality control and production efficiency. By harnessing advanced machine learning techniques, this study advances wood industry processes, promoting the adoption of state-of-the-art technology in forestry and wood science. Doi: 10.28991/HIJ-2023-04-03-06 Full Text: PDF",
        "keywords": "",
        "link": "http://dx.doi.org/10.28991/hij-2023-04-03-06"
    },
    {
        "id": 6732,
        "title": "Neural Network Architectures Evaluation on the Prediction Accuracy of the Ionospheric Total Electron Content",
        "authors": "Artem Kharakhashyan, Olga Maltseva",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/rsemw58451.2023.10202127"
    },
    {
        "id": 6733,
        "title": "Acne Skin Disease Detection Using Convolutional Neural Network Model",
        "authors": "Kartik Bansal, Madan Lal Saini,  Rahul, Kushagra Bhardwaj, Lakshya Prajapati",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10389831"
    },
    {
        "id": 6734,
        "title": "Advancements in Medical Imaging for Sugar Diagnosis Using Modified Hopfield Neural Network",
        "authors": "Anuj Kumar Dwivedi, Ayush Mohan, Shivani Singh, Ayushi Goel, Eklavya Singh",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdt57929.2023.10150618"
    },
    {
        "id": 6735,
        "title": "Comparative approach to different convolutional neural network (CNN) architectures applied to human behavior detection",
        "authors": "Juliana Verga Shirabayashi, Ana Silvia Moretto Braga, Jair da Silva",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08430-2"
    },
    {
        "id": 6736,
        "title": "A study of neural artistic style transfer models and architectures for Indian art styles",
        "authors": "J Mercy Faustina, V Akash, Anmol Gupta, V Divya, Takasi Manoj, N Sadagopan, B Sivaselvan",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0954898x.2023.2252073"
    },
    {
        "id": 6737,
        "title": "Quaternion Neural Network Architectures in Various Application Domains",
        "authors": "Bharat Tripathi, Nidhi Srivastava, Amod Kumar Tiwar, Abhishek Sharma",
        "published": "2023-6-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicat57735.2023.10263685"
    },
    {
        "id": 6738,
        "title": "Automated Sleep Stage Classification in Home Environments: An Evaluation of Seven Deep Neural Network Architectures",
        "authors": "Jaime Yeckle, Vidya Manian",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "Sleep is an essential human physiological need that has garnered increasing scientific attention due to the burgeoning prevalence of sleep-related disorders and their impact on public health. Among contemporary challenges, the demand for authentic sleep monitoring outside the confines of specialized laboratories, ideally within the home environment, has arisen. Addressing this, we explore the development of pragmatic approaches that facilitate implementation within domestic settings. Such approaches necessitate the deployment of streamlined, computationally efficient automated classifiers. In pursuit of a sleep stage classifier tailored for home use, this study rigorously assessed seven conventional neural network architectures prominent in deep learning (LeNet, ResNet, VGG, MLP, LSTM-CNN, LSTM, BLSTM). Leveraging sleep recordings from a cohort of 20 subjects, we elucidate that LeNet, VGG, and ResNet exhibit superior performance compared to recent advancements reported in the literature. Furthermore, a comprehensive architectural analysis was conducted, illuminating the strengths and limitations of each in the context of home-based sleep monitoring. Our findings distinctly identify LeNet as the most-amenable architecture for this purpose, with LSTM and BLSTM demonstrating relatively lesser compatibility. Ultimately, this research substantiates the feasibility of automating sleep stage classification employing lightweight neural networks, thereby accommodating scenarios with constrained computational resources. This advancement aims at revolutionizing the field of sleep monitoring, making it more accessible and reliable for individuals in their homes.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23218942"
    },
    {
        "id": 6739,
        "title": "Cataract Disease Identification Using Transformer and Convolution Neural Network: A Novel Framework",
        "authors": "Deepak Kumar, Brijesh Bakariya, Chaman Verma, Zoltan Illes",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390523"
    },
    {
        "id": 6740,
        "title": "Detecting Fire in Color Images using Convolutional Neural Network Architectures",
        "authors": "Doddapaneni Tanmayi, Ediga Udaya, Peeta Basa Pati",
        "published": "2023-4-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126490"
    },
    {
        "id": 6741,
        "title": "Neural Network Architectures for Assessing the Accuracy of Image Registration",
        "authors": "Vitaliy Dushepa, Igor Baryshev",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ukrmico61577.2023.10380390"
    },
    {
        "id": 6742,
        "title": "Digit Recognition by the Implementation of Supervised Learning Using a Convolutional Neural Network",
        "authors": "Mrinal Paliwal, Sunil Kumar Chawla, Punit Soni",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10389920"
    },
    {
        "id": 6743,
        "title": "Convolutional Neural Network Based Intelligent Methods for Early Detection of Groundnut Leaf Spot",
        "authors": "Aezeden Mohamed, Donovan Goru, Japheth David, Zachariah Liet",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390090"
    },
    {
        "id": 6744,
        "title": "Cataract Disease Classification using Convolutional Neural Network Architectures",
        "authors": "S. Gayathri, S. Saran, P. Siva Kumar, Inder Pal Singh",
        "published": "2023-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icears56392.2023.10085502"
    },
    {
        "id": 6745,
        "title": "COMPARISON OF NEURAL NETWORK ARCHITECTURES TO PREDICTING ELECTRICITY CONSUMPTION BY ENTERPRISE",
        "authors": "Denis V. Bortnik, Aleksandr I. Orlov",
        "published": "2023-12-26",
        "citations": 0,
        "abstract": "Forecasting of electricity consumption is a key tool for enterprises, energy supply and power grid organizations. Accurate forecasting enables to plan the distribution of limited resources of the power grid facilities, as well as to manage the demand for electricity. In the context of modern demand management technologies, improving the accuracy of forecasting of electricity consumption becomes especially important.\r\n\r\nThe purpose of the study is to improve the accuracy of predicting power consumption by the power supply object using neural networks.\r\n\r\nMaterials and methods. The work used a data set containing a profile of the enterprise’s capacity for a three-month period, as well as additional data, such as time of day, day of the week, weekends and holidays, month. The data set is divided into training and control parts. Preliminary data processing, neural network architecture design, training and testing were carried out. The criteria for the quality of training are the mean absolute error, the mean square error and the coefficient of determination.\r\n\r\nResearch results. In the work, a comparative analysis of three neural network architectures was performed: a one-dimensional convolutional network, a recurrent neural network with long-term and short-term memory, and WaveNet, on the basis of which their indicators of the quality of power consumption forecasting were evaluated. It was shown that all considered architectures of neural networks are suitable for the use in the issue of predicting power consumption. Long-term and short-term memory networks have shown good results in power prediction due to their ability to handle long-term time dependencies. The WaveNet architecture outperformed both long-term and short-term memory model-based recurrent neural networks and one-dimensional convolutional networks by selected criteria.\r\n\r\nConclusions. The study led to the conclusion that the use of neural networks, especially architectures with long-term and short-term memory and WaveNet, is an effective approach for predicting power consumption. The quality of forecasting significantly depends on the choice of hyperparameters and preliminary processing of the initial data. Prospect for further research in this area is studying the influence of various factors on the accuracy of forecasting and optimization of the learning process of neural networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47026/1810-1909-2023-4-57-65"
    },
    {
        "id": 6746,
        "title": "Comparison of the Convolutional Neural Network Architectures for Traffic Object Classification",
        "authors": "Apriandy Angdresey, Lanny Sitanayah, Efraim Pantas",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ic3ina60834.2023.10285791"
    },
    {
        "id": 6747,
        "title": "Deep Convolutional Neural Network-based Framework for Apple Leaves Disease Detection",
        "authors": "Saba Firdous, Shahzad Akbar, Syed Ale Hassan, Aima Khalid, Sahar Gull",
        "published": "2023-2-20",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacs55311.2023.10089774"
    },
    {
        "id": 6748,
        "title": "Authentication of Voter Using Convolutional Neural Network and Blockchain",
        "authors": "Kapil Upadhyay, Aman Bansal, Adarsh Gupta, Vipashi Kansal, Upma Jain, Shruti Bhatla",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390084"
    },
    {
        "id": 6749,
        "title": "Advancements in spiking neural network communication and synchronization techniques for event-driven neuromorphic systems",
        "authors": "Mahyar Shahsavari, David Thomas, Marcel van Gerven, Andrew Brown, Wayne Luk",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.array.2023.100323"
    },
    {
        "id": 6750,
        "title": "A Digital Twin Network for Computational Neuroscience Simulators: Exploring Network Architectures for Acceleration of Biological Neural Network Simulations",
        "authors": "Vida Sobhani, Kevin Kauth, Tim Stadtmann, Tobias Gemmeke",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/wowmom57956.2023.00084"
    },
    {
        "id": 6751,
        "title": "Robust Ex-situ Training of Memristor Crossbar-based Neural Network with Limited Precision Weights",
        "authors": "Raqibul Hasan",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3611315.3633245"
    },
    {
        "id": 6752,
        "title": "Exploring Convolutional Neural Network Architectures for EEG Feature Extraction",
        "authors": "Ildar Rakhmatulin, Minh-Son Dao, Amir Nassibi, Danilo Mandic",
        "published": "2024-1-29",
        "citations": 1,
        "abstract": "The main purpose of this paper is to provide information on how to create a convolutional neural network (CNN) for extracting features from EEG signals. Our task was to understand the primary aspects of creating and fine-tuning CNNs for various application scenarios. We considered the characteristics of EEG signals, coupled with an exploration of various signal processing and data preparation techniques. These techniques include noise reduction, filtering, encoding, decoding, and dimension reduction, among others. In addition, we conduct an in-depth analysis of well-known CNN architectures, categorizing them into four distinct groups: standard implementation, recurrent convolutional, decoder architecture, and combined architecture. This paper further offers a comprehensive evaluation of these architectures, covering accuracy metrics, hyperparameters, and an appendix that contains a table outlining the parameters of commonly used CNN architectures for feature extraction from EEG signals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24030877"
    },
    {
        "id": 6753,
        "title": "The AI Race: Why Current Neural Network-based Architectures are a Poor Basis for Artificial General Intelligence",
        "authors": "Jérémie Sublime",
        "published": "2024-1-10",
        "citations": 0,
        "abstract": "Artificial General Intelligence is the idea that someday an hypothetical agent will arise from artificial intelligence (AI) progresses, and will surpass by far the brightest and most gifted human minds. This idea has been around since the early development of AI. Since then, scenarios on how such AI may behave towards humans have been the subject of many fictional and research works. This paper analyzes the current state of artificial intelligence progresses, and how the current AI race with the ever faster release of impressive new AI methods (that can deceive humans, outperform them at tasks we thought impossible to tackle by AI a mere decade ago, and that disrupt the job market) have raised concerns that Artificial General Intelligence (AGI) might be coming faster that we thought. In particular, we focus on 3 specific families of modern AIs to develop the idea that deep neural networks, which are the current backbone of nearly all artificial intelligence methods, are poor candidates for any AGI to arise due to their many limitations, and therefore that any threat coming from the recent AI race does not lie in AGI but in the limitations, uses, and lack of regulations of our current models and algorithms.\nThis article appears in the AI & Society track.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1613/jair.1.15315"
    },
    {
        "id": 6754,
        "title": "PANNA 2.0: Efficient neural network interatomic potentials and new architectures",
        "authors": "Franco Pellegrini, Ruggero Lot, Yusuf Shaidu, Emine Küçükbenli",
        "published": "2023-8-28",
        "citations": 2,
        "abstract": "We present the latest release of PANNA 2.0 (Properties from Artificial Neural Network Architectures), a code for the generation of neural network interatomic potentials based on local atomic descriptors and multilayer perceptrons. Built on a new back end, this new release of PANNA features improved tools for customizing and monitoring network training, better graphics processing unit support including a fast descriptor calculator, new plugins for external codes, and a new architecture for the inclusion of long-range electrostatic interactions through a variational charge equilibration scheme. We present an overview of the main features of the new code, and several benchmarks comparing the accuracy of PANNA models to the state of the art, on commonly used benchmarks as well as richer datasets.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0158075"
    },
    {
        "id": 6755,
        "title": "Segmentation and Classification of Leaf Disease Using Radial Basis Function neural Network",
        "authors": "Vignesh T, Srie Vidhya Janani E",
        "published": "2023-2-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56472/25832646/jeta-v3i1p102"
    },
    {
        "id": 6756,
        "title": "Performance Analysis for Convolutional Neural Network Architectures using Brain Tumor Datasets: A Proposed System",
        "authors": "Md. Jalal Uddin Chowdhury, Shafkat Kibria",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iwaiip58158.2023.10462886"
    },
    {
        "id": 6757,
        "title": "A Comparative Study of Deep Convolutional Neural Network Architectures to Identify Full Bee Body in Images",
        "authors": "Oleksandr Zhukov, Horbenko Vitalii Ivanovych",
        "published": "2023-6-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idt59031.2023.10194440"
    },
    {
        "id": 6758,
        "title": "Distinct Architectures of Feed Forward Neural Network for Implementing A Human Swing Leg System",
        "authors": "",
        "published": "2023-9-28",
        "citations": 0,
        "abstract": "The artificial intelligence techniques such as neural networks and fuzzy systems play an important role to disconnect flexion & expansion of the swing leg, the earth response force of the other foot has been redesigned. Underthat paper, we think the fuzzy controller plan issue for yield following flawed genuine investigation of nonlinear systems. For examination, an essential fuzzy control plot has been bristly developed dependent on a current methodology delegate under the ﬁeld.In this paper, the Feedforward Neural Network has been implemented with integer, fixed point and floating point data representations. Additionally, The Fuzzy Logic Controllers in both analog and digital forms has been implemented in hardware. Both designs use less hardware resources and operate with reasonable speed compared to other existing designs. The digital implementation of Fuzzy Logic Controller has been tested for a simulated first order liquid level process and the performance results have been compared with those of the Matlab version of Fuzzy Logic Controller. Here, Fuzzy Logic Controller is used as the controller and is trained adaptively for the changes in process parameters using recursive k-means clustering algorithm for updating the centers of the hidden layer and Recursive Least Square algorithm for updating the weights of the output layer, the result of the settling time about 20ms and takes 20 iterations, and the squared error reaches zero at approximately 20 µs.\n\nIndex Terms— Fuzzy Controller, leg interaction force, Prosthetic legs, Human walking, GyroAccelerate,Fuzzy Logic System.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33103/uot.ijccce.23.3.5"
    },
    {
        "id": 6759,
        "title": "Music Genre Classification Capabilities of Enhanced Neural Network Architectures",
        "authors": "Joshua Engelkes",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61366/2576-2176.1135"
    },
    {
        "id": 6760,
        "title": "Benchmarking Artificial Neural Network Architectures for High-Performance Spiking Neural Networks",
        "authors": "Riadul Islam, Patrick Majurski, Jun Kwon, Anurag Sharma, Sri Ranga Sai Krishna Tummala",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "Organizations managing high-performance computing systems face a multitude of challenges, including overarching concerns such as overall energy consumption, microprocessor clock frequency limitations, and the escalating costs associated with chip production. Evidently, processor speeds have plateaued over the last decade, persisting within the range of 2 GHz to 5 GHz. Scholars assert that brain-inspired computing holds substantial promise for mitigating these challenges. The spiking neural network (SNN) particularly stands out for its commendable power efficiency when juxtaposed with conventional design paradigms. Nevertheless, our scrutiny has brought to light several pivotal challenges impeding the seamless implementation of large-scale neural networks (NNs) on silicon. These challenges encompass the absence of automated tools, the need for multifaceted domain expertise, and the inadequacy of existing algorithms to efficiently partition and place extensive SNN computations onto hardware infrastructure. In this paper, we posit the development of an automated tool flow capable of transmuting any NN into an SNN. This undertaking involves the creation of a novel graph-partitioning algorithm designed to strategically place SNNs on a network-on-chip (NoC), thereby paving the way for future energy-efficient and high-performance computing paradigms. The presented methodology showcases its effectiveness by successfully transforming ANN architectures into SNNs with a marginal average error penalty of merely 2.65%. The proposed graph-partitioning algorithm enables a 14.22% decrease in inter-synaptic communication and an 87.58% reduction in intra-synaptic communication, on average, underscoring the effectiveness of the proposed algorithm in optimizing NN communication pathways. Compared to a baseline graph-partitioning algorithm, the proposed approach exhibits an average decrease of 79.74% in latency and a 14.67% reduction in energy consumption. Using existing NoC tools, the energy-latency product of SNN architectures is, on average, 82.71% lower than that of the baseline architectures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s24041329"
    },
    {
        "id": 6761,
        "title": "PERFORMANCE REFINEMENT OF CONVOLUTIONAL NEURAL NETWORK ARCHITECTURES FOR SOLVING BIG DATA PROBLEMS",
        "authors": " Saud Aljaloud",
        "published": "2023-2-20",
        "citations": 1,
        "abstract": "Two of the most well-liked neural network frameworks, Theano and TensorFlow, will be compared in this study for how well they perform on a given problem. The MNIST database will be used for this specific problem, which is the recognition of handwritten digits from one to nine. It is a good idea to use more examples than contrasted ones to compare these frameworks because this database is the subject of active research at the moment and has produced excellent results. However, in order to be trained and deliver accurate results, neural networks need a sizeable amount of sample data, as will be covered in more detail later. Because of this, big data experts frequently encounter problems of this nature. As the project description implies, we won't just present a standard comparison because of this; instead, we'll work to present a comparison of these networks' performance in a Big Data environment using distributed computing. The FMNIST or Fashion MNIST database and CIFAR10 will also be tested (using the same neural network design), extending the scope of the comparison beyond MNIST. The same code will be used with the same structure thanks to the use of a higher-level library called Keras, which makes use of the aforementioned support (in our case, Theano or TensorFlow). There has been a surge in open-source parallel GPU implementation research and development as a result of the high computational cost of training CNNs on large data sets. However, there aren't many studies that have been done to assess the performance traits of those implementations. In this study, we compare these implementations carefully across a wide range of parameter configurations, look into potential performance bottlenecks, and pinpoint a number of areas that could use more fine-tuning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25130/tjps.v28i1.1270"
    },
    {
        "id": 6762,
        "title": "A comparative analysis of deep neural network architectures for sentence classification using genetic algorithm",
        "authors": "Brendan Rogers, Nasimul Noman, Stephan Chalup, Pablo Moscato",
        "published": "2023-9-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12065-023-00874-8"
    },
    {
        "id": 6763,
        "title": "Convolutional Neural Network Architectures for Modulation Scheme Classification in RF Signals within Cognitive Radio Systems",
        "authors": "Mwp Maduranga, H.K.I.S. Lakmal, Valmik Tilwari",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icsc60394.2023.10441073"
    },
    {
        "id": 6764,
        "title": "Aspect-Based Opinion Mining of Customer Reviews in the Hospitality Industry: Leveraging Recursive Neural Tensor Network Algorithm",
        "authors": "Anam Afaq, Gurinder Singh, Loveleen Gaur, Shikha Kapoor",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390384"
    },
    {
        "id": 6765,
        "title": "An Enhanced Convolutional Neural Network Based on L1 Regularization for Segmentation of Coronary Arteries in X-Ray Angiograms",
        "authors": "Fazli Wahid, Yingliang Ma, Ramla Sheikh, Muhammad Aamir",
        "published": "2024-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacs60934.2024.10473261"
    },
    {
        "id": 6766,
        "title": "Unveiling the Power of Deep Learning: Insights into Advanced Neural n Network Architectures",
        "authors": "Jeff Shuford",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "Deep learning has emerged as a powerful paradigm within artificial intelligence, revolutionizing various fields with its ability to automatically discover intricate patterns and representations from vast amounts of data. In this article, we delve into the latest advancements in deep learning, focusing on the exploration of advanced neural network architectures. Through a comprehensive review and analysis, we uncover the underlying principles and methodologies driving the success of these architectures, elucidating their capabilities and limitations. From convolutional neural networks (CNNs) for image recognition to recurrent neural networks (RNNs) for sequential data processing, we highlight key innovations and breakthroughs that have propelled the field forward. Furthermore, we discuss recent trends such as attention mechanisms, transformer models, and graph neural networks, showcasing their potential applications and impact across diverse domains. By unraveling the power of deep learning and its advanced neural network architectures, this article aims to provide valuable insights into the state-of-the-art techniques driving AI research and development.",
        "keywords": "",
        "link": "http://dx.doi.org/10.60087/jaigs.v3i1.60"
    },
    {
        "id": 6767,
        "title": "Performance analysis of convolutional neural network architectures over wireless capsule endoscopy dataset",
        "authors": "Parminder Kaur, Rakesh Kumar",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Wireless capsule endoscopy is one of the diagnostic methods used to record the video of the gastrointestinal tract. The endoscopy capsule stays in the digestive system for at least eight hours. It is difficult for gastroenterologists to examine such a lengthy video and identify the ailment. Convolutional neural networks (CNN) are a powerful solution to several computer vision problems. CNN can speed up the reviewing time of the recorded video by classifying video frames into various categories. The primary emphasis of this research paper is to examine and evaluate the performance of three different CNN architectures-VGG, inception, and MobileNet-in classifying the disease. Experimental results demonstrate that MobileNetV2’s accuracy is 91%, whereas InceptionV3 and VGG16 have an accuracy of 94% which is better than the accuracy of MobileNetV3. However, MobileNeV2 performed relatively better than the other CNN models in terms of computational time and cost. The model’s F-score, precision, and recall values are computed and compared also.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v13i1.5858"
    },
    {
        "id": 6768,
        "title": "Advantages of Hybrid Neural Network Architectures to Enhance Prediction of Tensile Properties in Laser Powder Bed Fusion",
        "authors": "Florian Funcke, Tobias Forster, Peter Mayr",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "The properties of AlSi10Mg produced by Laser Powder Bed Fusion (PBF-LB) are defined by a multitude of different machine and laser parameters. This multi-parameter space presents the challenge of optimizing the material properties for a given application by the sheer amount of possible parameter combinations. Characterizing this multi-parameter space empirically is limited by time and resources and thus yields an incomplete picture of the process capabilities and local optima, respectively. To improve on this situation, machine learning to map the process parameters on the tensile properties of AlSi10Mg was used. The Hybrid Neural Network (HNN) used in this study consisted of a Convolutional Neural Network (CNN) to process the micrographs and a Dense Neural Network (DNN) to process the LPBF process parameters as well as the output of the CNN. The micrographs given to the CNN part of the network were printed with the same parameters given to the DNN part to include the information of the bulk microstructure as it strongly influences the tensile properties of the material. With the HNN, we observed good accuracy of the predicted tensile properties, given the small amount of training data. Furthermore, we explore which features of the micrographs were extracted by the CNN.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4028/p-0tcamf"
    },
    {
        "id": 6769,
        "title": "Performance Improvement of Convolutional Neural Network Architectures for Skin Disease Detection",
        "authors": "Hasan Maher Ahmed, Manar Younis Kashmola",
        "published": "2023-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12785/ijcds/130152"
    },
    {
        "id": 6770,
        "title": "Neural network architectures for optical channel nonlinear compensation in digital subcarrier multiplexing systems",
        "authors": "Ali Bakhshali, Hossein Najafi, Behnam Behinaein Hamgini, Zhuhong Zhang",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "In this work, we propose to use various artificial neural network (ANN) structures for modeling and compensation of intra- and inter-subcarrier fiber nonlinear interference in digital subcarrier multiplexing (DSCM) optical transmission systems. We perform nonlinear channel equalization by employing different ANN cores including convolutional neural networks (CNN) and long short-term memory (LSTM) layers. First, we develop a fiber nonlinearity compensation for DSCM systems based on a fully-connected network across all subcarriers. In subsequent steps, and borrowing from the perturbation analysis of fiber nonlinearity, we gradually upgrade proposed designs towards modular structures with better performance-complexity advantages. Our study shows that putting proper macro structures in design of ANN nonlinear equalizers in DSCM systems can be crucial in development of practical solutions for future generations of coherent optical transceivers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1364/oe.493240"
    },
    {
        "id": 6771,
        "title": "Enhancing Gesture Recognition for Musical Conducting: A Study on Diverse Data Classification and Stacked Neural Network Architectures",
        "authors": "Gideon Woo, Faith Tan, Herbert H. Tsang",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10371840"
    },
    {
        "id": 6772,
        "title": "Research of Different Neural Network Architectures for Audio and Video Denoising",
        "authors": "Anton Kanev, Maksim Nazarov, Daniel Uskov, Vladislav Terentyev",
        "published": "2023-3-16",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/reepe57272.2023.10086862"
    },
    {
        "id": 6773,
        "title": "EXPLORING DEEP SPECTRAL AND TEMPORAL FEATURE REPRESENTATIONS WITH ATTENTION-BASED NEURAL NETWORK ARCHITECTURES FOR ACCENTED MALAYALAM SPEECH- A LOW-RESOURCED LANGUAGE",
        "authors": "Rizwana Kallooravi Thandil, Mohamed Basheer K.P",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/ecb/2023.12.si5a.0388"
    },
    {
        "id": 6774,
        "title": "Fast Inner-Product Algorithms and Architectures for Deep Neural Network Accelerators",
        "authors": "Trevor E. Pogue, Nicola Nicolici",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tc.2023.3334140"
    },
    {
        "id": 6775,
        "title": "ANALYSIS OF NEURAL NETWORK ARCHITECTURES FOR RECOGNITION OF HANDWRITTEN NUMBERS",
        "authors": "A. M. Matviichuk,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "The accuracy of contemporary systems designed for the recognition of handwritten numbers exhibits significant variability, contingent upon the technologies selected during the development of a specific method. Neural networks have supplanted algorithms reliant on statistical data and datasets for this task, primarily due to their better performance. Several recent publications addressing the challenges of handwritten digit recognition employing diverse types of neural networks have been examined. This paper delves into the analysis of the architecture of two prominent types: dense neural networks and convolutional neural networks along with their respective training methods applicable to the recognition of handwritten digits from images. The study's findings reveal that Dense Neural Networks (DNN), while applicable to the task at hand, demonstrate diminished performance as the size of the input image increases. Conversely, Convolutional Neural Networks (CNN) prove more adept at image analysis, owing to their convolution and pooling operations, thus establishing their priority in this context. Four distinct types of learning applicable to neural networks were explored, namely Supervised Learning, Unsupervised Learning, Semi-supervised Learning, and Reinforcement Learning. The investigation concludes that Supervised Learning using backpropagation emerges as the most fitting method for training neural networks to address the identified problem. The paper further explores the stages and principles underpinning the operation of the backpropagation method. Building upon the derived results, there is a plan to develop an application leveraging the identified architecture. This application aims to empower users with the capability to efficiently extract digital information from images, irrespective of their resolution. The envisioned outcome is an application that attains high accuracy and processing speed in image recognition and extraction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.31673/2412-4338.2023.041827"
    },
    {
        "id": 6776,
        "title": "Applying Advanced Neural Network Architectures to Improve Extracting Effectiveness of Textual Information",
        "authors": "Vishal Sharma,  Savita, R. Kavitha, G. Arun Francis, P. Chandrakala, Dattatray G. Takale",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425425"
    },
    {
        "id": 6777,
        "title": "Enhancing Convolutional Neural Network Architectures with Long Short-Term Memory for Improved Image Classification",
        "authors": "An Hung Nguyen, Minh Tuan Pham",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/atigb59969.2023.10364368"
    },
    {
        "id": 6778,
        "title": "Novel Physics-Informed Artificial Neural Network Architectures for System and Input Identification of Structural Dynamics PDEs",
        "authors": "Sarvin Moradi, Burak Duran, Saeed Eftekhar Azam, Massood Mofid",
        "published": "2023-2-28",
        "citations": 7,
        "abstract": "Herein, two novel Physics Informed Neural Network (PINN) architectures are proposed for output-only system identification and input estimation of dynamic systems. Using merely sparse output-only measurements, the proposed PINNs architectures furnish a novel approach to input, state, and parameter estimation of linear and nonlinear systems with multiple degrees of freedom. These architectures are comprised of parallel and sequential PINNs that act upon a set of ordinary differential equations (ODEs) obtained from spatial discretization of the partial differential equation (PDE). The performance of this framework for dynamic system identification and input estimation was ascertained by extensive numerical experiments on linear and nonlinear systems. The advantage of the proposed approach, when compared with system identification, lies in its computational efficiency. When compared with traditional Artificial Neural Networks (ANNs), this approach requires substantially smaller training data and does not suffer from generalizability issues. In this regard, the states, inputs, and parameters of dynamic state-space equations of motion were estimated using simulated experiments with “noisy” data. The proposed framework for PINN showed excellent great generalizability for various types of applications. Furthermore, it was found that the proposed architectures significantly outperformed ANNs in generalizability and estimation accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/buildings13030650"
    },
    {
        "id": 6779,
        "title": "Deep Neural Network Architectures for Momentary Forecasting in Dry Bulk Markets: Robustness to the Impact of COVID-19",
        "authors": "Lee Sang-Hyeok",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3244680"
    },
    {
        "id": 6780,
        "title": "Organic-inorganic hybrid materials and architectures in optoelectronic devices: Recent advancements",
        "authors": "M. Arya, S. Heera, P. Meenu, K.G. Deepa",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.chphma.2024.03.004"
    },
    {
        "id": 6781,
        "title": "Social network based link correlation using graph neural network with deep learning architectures for feature vectors prediction and classification",
        "authors": "Nagaraju Sonti, Rukmini Mulpuri Santhi Sri, Venkatappa Reddy Pamulapati",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "SummaryIn recent years, social network analysis has received a lot of interest. A critical area of research in this field is link prediction. Link prediction is researched for other forms of social networks. Still, because social link networks (SLNs) change over time and depend on the discussed topics, this network has unique difficulties. Recent studies have focused on three main issues: extending link prediction to a dynamic environment, forecasting formation, and destroying network linkages that change over time. Although it is a challenging issue, deep learning (DL) techniques have been demonstrated to increase prediction accuracy significantly. This research proposes a novel approach to link correlation for social networks based on DL architectures in feature vector prediction and classification. Here the input data has been processed for smoothening and normalization with noise removal. Then, the feature vector was predicted using a dynamically structured convolutional radial basis neural network for this data. The expected feature vector has been classified using a stochastic gradient‐based graph neural network. The experimental analysis is carried out for various social network data in terms of accuracy of 98%, precision of 85%, recall of 86%, F‐1 score of 75%, AUC of 72%, and RMSE of 76%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cpe.8090"
    },
    {
        "id": 6782,
        "title": "Evolving Deep Neural Network Architectures by Sine Cosine Algorithm for Healthcare 4.0",
        "authors": "Sanja Golubovic, Luka Jovanovic, Branislav Radomirovic, Angelina Njegus, Miodrag Zivkovic, Nebojsa Bacanin",
        "published": "2023-4-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inc457730.2023.10263180"
    },
    {
        "id": 6783,
        "title": "Convolution Neural Network Architectures for COVID-19 Detection using Images from Chest X-Rays: A Review",
        "authors": "Vidita Patel, Santosh Kumar Singh",
        "published": "2023-5-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icacite57410.2023.10183261"
    },
    {
        "id": 6784,
        "title": "Advancements in Android Malware Detection: A Comprehensive Review of Graph Neural Network Approaches",
        "authors": "Pallavi Papankar, Nitin Mandaogade",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61161/ijarcsms.v12i3.2"
    },
    {
        "id": 6785,
        "title": "Hybrid bayesian convolutional neural network object detection architectures for tracking small markers in automotive crashtest videos",
        "authors": "Felix Neubürger, Daniel Gierse, Thomas Kopinski",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "Automotive crash tests are an important aspect of everyday safety, where accurate measurements and evaluations play a crucial role. In order to automate this process, we implement a bayesian hybrid computer vision model to detect two different kinds of target markers. These are commonly used in crash tests, by e.g. automotive manufacturers, to aid the localisation of the car’s positional data by attaching these markers at different positions to the vehicle. A tracking algorithm is subsequently used to add contextual time information to the marker objects. The extracted information can then be used in downstream tasks to calculate important metrics for the crash test evaluation, e.g. the speed, momentum, acceleration and trajectory at particular parts of the car during different stages of the crash test. The model consists of a pre-trained Faster-RCNN for the region proposals with the addition of a bayesian convolutional neural network to estimate a statistical uncertainty on the model’s classifications. This uncertainty estimation can be used as a tool to improve safety in uncertain edge cases in videos where lighting conditions and light reflections are not optimal. Our pipeline achieves an average recall and precision of 0.89 and 0.99, respectively, when applied to test data. This outperforms the recall of state of the art models like the Faster-RCNN Resnet-152 by more than 28\\% while delivering slightly better precision, increasing robustness in most of the tested use-cases.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7557/18.6802"
    },
    {
        "id": 6786,
        "title": "Comparison of Neural Network Architectures for the Detection of Clutter in Automotive Radar Data",
        "authors": "Johannes Kopp, Dominik Kellner, Aldi Piroli, Vinzenz Dallabetta, Klaus Dietmayer",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/iccas59377.2023.10316746"
    },
    {
        "id": 6787,
        "title": "Retracted: Evaluating Deep Neural Network Architectures with Transfer Learning for Pneumonitis Diagnosis",
        "authors": "",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9858237"
    },
    {
        "id": 6788,
        "title": "REPRODUCIBILITY OF BRAIN AGE SALIENCIES ACROSS DEEP NEURAL NETWORK ARCHITECTURES",
        "authors": "Nicholas Kim, Phoebe Imms, Nikhil Chaudhari, Nahian Chowdhury, Anar Amgalan, Paul Bogdan, Andrei Irimia",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "Abstract\nThe brain’s biological age (BA) reflects structural changes related to neuroanatomic senescence. BA is estimated from magnetic resonance images (MRIs) using convolutional neural networks (CNNs), which provide interpretability through saliency maps. By conveying the importance of brain regions to BA estimation, these maps reveal sex differences in brain-aging. We compared two CNN architectures to assess the reproducibility of such differences. Both regression CNNs had T1-weighted MRIs as inputs; outputs were estimated BAs. One CNN was trained on males and females separately, whereas the other was trained on both sexes. The dataset used consisted of T1-weighted MRIs from 5,851 cognitively normal individuals (3,142 females) aged 22 to 95 years, sampled from the Alzheimer’s Disease Neuroimaging Initiative (N = 510), Human Connectome Project Aging (N = 508) and Young Adult (N = 1,112), and UK Biobank (N = 3,721). For both models, compared to the average saliency for a null distribution, males’ BA estimation relied significantly (p &lt; 0.05) more on the right lateral temporal lobe and superior frontal gyrus. Females’ BA estimation depended significantly (p &lt;; 0.05) more on the right posterior and bilateral occipital regions, and medial parietal lobe. Simulated alterations in brain morphometry indicated saliencies correctly revealed regions with aging-related dynamics, which confirm prior findings on sex differences in brain-aging. Variations in CNN models’ saliencies did not affect overall anatomic patterns, suggesting that CNNs can capture brain-aging patterns robustly despite architecture differences. Novel statistical models for formal comparison of CNN saliencies should be developed to accommodate their nonlinear nature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1093/geroni/igad104.3572"
    },
    {
        "id": 6789,
        "title": "Investigating the Power of Advanced Neural Network Architectures for Higher Quality Information Extraction",
        "authors": "Ramya G, Kirti H. Wanjale, Vaibhav Srivastav, Muthukumar B, Awakash Mishra, C. Mukuntharaj",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425128"
    },
    {
        "id": 6790,
        "title": "Prediction of Diabetes Disease of Type-I and Type-II Using Back-Propagation Neural Network",
        "authors": "Pawan Kumar Singh, Anju Gera, Deepkiran Munjal, Ekta Verma, Ravi Kumar Tewari, Pranav Shrivastava",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390447"
    },
    {
        "id": 6791,
        "title": "Hybrid Deep Neural Network for Alpaca Animal Recognition: Achieving High Accuracy in Detection and Classification",
        "authors": "Naresh Kumar Trivedi, Himani Maheshwari, Raj Gaurang Tiwari, Vinay Gautam, Ambuj Kumar Agarwal",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10390113"
    },
    {
        "id": 6792,
        "title": "Advancements in Accelerating Deep Neural Network Inference on AIoT Devices: A Survey",
        "authors": "Long Cheng, Yan Gu, Qingzhi Liu, Lei Yang, Cheng Liu, Ying Wang",
        "published": "2024",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tsusc.2024.3353176"
    },
    {
        "id": 6793,
        "title": "Feed-forward and recurrent inhibition for compressing and classifying high dynamic range biosignals in spiking neural network architectures",
        "authors": "Rachel Sava, Elisa Donati, Giacomo Indiveri",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/biocas58349.2023.10388963"
    },
    {
        "id": 6794,
        "title": "Traffic Flow Prediction in Urban Networks: Integrating Sequential Neural Network Architectures",
        "authors": "Eva Lieskovska, Maros Jakubec, Pavol Kudela",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150170"
    },
    {
        "id": 6795,
        "title": "AttackNet: Enhancing biometric security via tailored convolutional neural network architectures for liveness detection",
        "authors": "Oleksandr Kuznetsov, Dmytro Zakharov, Emanuele Frontoni, Andrea Maranesi",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2024.103828"
    },
    {
        "id": 6796,
        "title": "Optimizing Advanced Neural Network Architectures to Enhance the Accuracy of Extracting Online Information",
        "authors": "C. Mukuntharaj, T Vijayaraj, Pradnya S. Mehta, Kuldeep Singh Kulhar, Trapty Agrawal, R Kavitha",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425246"
    },
    {
        "id": 6797,
        "title": "Automatic Design of Convolutional Neural Network Architectures Under Resource Constraints",
        "authors": "Siyi Li, Yanan Sun, Gary G. Yen, Mengjie Zhang",
        "published": "2023-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tnnls.2021.3123105"
    },
    {
        "id": 6798,
        "title": "Robustness Assessment of Neural Network Architectures to Geometric Transformations: A Comparative Study with Data Augmentation",
        "authors": "Heriniaina Andry Raboanary, Roland Raboanary, Nirina H. M. Tahiridimbisoa",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceccme57830.2023.10253075"
    },
    {
        "id": 6799,
        "title": "The Impact of Advanced Neural Network Architectures for Extracting Elusive Information",
        "authors": "Renu Kachhoria, Love Mittal, Prakash Divakaran, Vinay Singh, N. Thangarasu, S. Rajarajeswari",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442870"
    },
    {
        "id": 6800,
        "title": "Automatic Knee Osteoarthritis Severity Grading using Deep Neural  Networks: Comparative Analysis of Network Architectures and  Optimization Functions",
        "authors": "Ahmet Ezgi, Aytuğ Onan",
        "published": "2023-7-20",
        "citations": 1,
        "abstract": "Knee osteoarthritis (OA) is a prevalent degenerative joint disease that requires accurate assessment of its severity for effective treatment planning. In this study, we propose an automatic knee OA severity-grading system based on deep neural networks. Specifically, we explore various network architectures, including VGG-16, VGG-19, ResNet-101, EfficientNet-B7, and EfficientNet-B6, along with different optimization functions such as SGD, ADAM, Nadam, AdamW, and AdaDelta. Furthermore, we investigate two loss functions, namely, the novel ordinal loss and the cross-entropy loss. The proposed system is evaluated on a carefully curated dataset, and comprehensive experimental settings are employed to ensure reliable results. Our findings indicate that the combination of the EfficientNet-B7 network with the Nadam optimizer yields the best performance, achieving an accuracy of 70.1% in knee OA severity grading. These results demonstrate the potential of deep neural networks in automating the grading process, offering a valuable tool for clinicians and researchers in the field of knee osteoarthritis management.",
        "keywords": "",
        "link": "http://dx.doi.org/10.59287/icaens.992"
    },
    {
        "id": 6801,
        "title": "Edge preserving image denoising with deep networks and ensemble convolutional neural network architectures",
        "authors": "Rao Thamanam Srinivasa, K. Manjunathachari, Prasad K. Satya",
        "published": "2023",
        "citations": 0,
        "abstract": "In the field of visual perception, the edges of images tend to be rich in effective visual stimuli, which contribute to the neural network's understanding of various scenes. Image smoothing is an image processing method used to highlight the wide area, low-frequency components, and main part of the image or to suppress image noise and high-frequency interference components, which can make the image's brightness smooth and gradual, reduce the abrupt gradient, and improve the image quality. Reducing noise is treated as one of the important problems in image processing. At the same time, preserving the edges of objects is of critical importance to protect the visual appearance of the objects. Deep networks have marked a trend in computer vision applications and this paper presents a customized Gaussian noise minimizing network with edge preserving filers. Here, ensemble architecture of convolutional neural network is used in minimizing the Gaussian noise and image denoising. The ensemble architecture is combined with VGG-19 and Xception design of CNN. The ensemble Convolutional Neural Networks (CNNs) are classified for Gaussian noisy images, real noisy images, blind denoising, and hybrid noisy images, representing the combination of noisy, blurred, and lowresolution images. Following the classification, motivations and principles of various deep learning methods are analyzed. Subsequently, a comparison of state-of-the-art methods on public denoising datasets is conducted, considering both quantitative and qualitative analyses. The experimental analysis is carried out in terms of PSNR, accuracy, precision, recall and F-measure.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26634/jip.10.4.20305"
    },
    {
        "id": 6802,
        "title": "Proposing Novel Recurrent Neural Network Architectures for Infant Cry Detection in Domestic Context",
        "authors": "Raiyan Jahangir, Nasif Shahriar Mohim, Nafiz Imtiaz Khan, Md Akhtaruzzaman, Muhammad Nazrul Islam",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/r10-htc57504.2023.10461731"
    },
    {
        "id": 6803,
        "title": "Model compression of deep neural network architectures for visual pattern recognition: Current status and future directions",
        "authors": "Seema Bhalgaonkar, Mousami Munot, Alwin anuse",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.compeleceng.2024.109180"
    },
    {
        "id": 6804,
        "title": "A Comparative Study of Convolutional Neural Network Architectures for Enhanced Tomato Leaf Disease Classification Using Refined Statistical Features",
        "authors": "Cheemaladinne Vengaiah, Srinivasa Reddy Konda",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18280/ts.410116"
    },
    {
        "id": 6805,
        "title": "Bandwidth-Efficient Distributed Neural Network Architectures With Application to Neuro-Sensor Networks",
        "authors": "Thomas Strypsteen, Alexander Bertrand",
        "published": "2023-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jbhi.2022.3225019"
    },
    {
        "id": 6806,
        "title": "Artificial neural network model of the mechanical behaviour of shape memory alloy Schwartz primitive lattice architectures",
        "authors": "N.V. Viet, W. Zaki",
        "published": "2023-8",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mechmat.2023.104680"
    },
    {
        "id": 6807,
        "title": "An Automatic Brain Tumors Detection and Classification Using Deep Convolutional Neural Network with VGG-19",
        "authors": "Venmathi A.R, S. David, Ennam Govinda, K. Ganapriya, R. Dhanapal, A. Manikandan",
        "published": "2023-6-16",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeca56562.2023.10200949"
    },
    {
        "id": 6808,
        "title": "Advancements in CNN Architectures for Computer Vision: A Comprehensive Review",
        "authors": "Anumol C S",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aicera/icis59538.2023.10420413"
    },
    {
        "id": 6809,
        "title": "Impact of the Number of Features on the Performance of a Deep Neural Network Classifier for Type-2 Diabetes Prediction",
        "authors": "Teleza Kanthonga, Chiedza Hwata, Arthur Nathaniel Mwang’onda",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aaiac60008.2023.10465564"
    },
    {
        "id": 6810,
        "title": "Advancements in Prosthetic Hand Control: An IoT-Convolutional Neural Network Fusion for Gesture Recognition",
        "authors": "S. Dhanalakshmi, R. Hemalatha, Arul Mary Rexy V, T. Kanthimathi, P. Sudha Juliet, Thamizhamuthu R",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smartgencon60755.2023.10442214"
    },
    {
        "id": 6811,
        "title": "A Self-adaptive neuroevolution approach to constructing Deep Neural Network architectures across different types",
        "authors": "Zhenhao Shuai, Hongbo Liu, Zhaolin Wan, Wei-Jie Yu, Jun Zhang",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110127"
    },
    {
        "id": 6812,
        "title": "Investigating The Effectiveness of Various Convolutional Neural Network Model Architectures for Skin Cancer Melanoma Classification",
        "authors": "Rizky Hafizh Jatmiko, Yoga Pristyanto",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "Melanoma is one of the most dangerous types of skin cancer. Since 2018, the number of skin cancer cases in the US has increased and exceeded 100,000. Melanoma is the third most common cancer in Indonesia, following womb cancer and breast cancer. Standard detection of melanoma skin cancer biopsy is costly and time-consuming. The purpose of this research is to build and compare melanoma skin cancer detection using various Convolutional Neural Network method. This research used four CNN model architectures methods, VGG-16, LeNet, Xception, and MobileNet. The dataset for this research is image data that consists of 9605 data divided into benign and malignant classes. The data will be augmented to increase its quantity. After that, the data will be trained using four CNN architecture models and evaluated using the confusion matrix. The result of this study is that Xception model has the best accuracy and the lowest loss, with 93% accuracy and 19% loss, with precision 93%, recall 93,5%, and f1-score 93%. Whereas the other model, VGG-16 gives 90 % accuracy, 27% loss, LeNet 89,7% accuracy, 28% loss, and mobileNet 90,8% accuracy and 22,5% loss.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30812/matrik.v23i1.3185"
    },
    {
        "id": 6813,
        "title": "Deep neural network architectures for audio emotion recognition performed on song and speech modalities",
        "authors": "Souha Ayadi, Zied Lachiri",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s10772-023-10079-0"
    },
    {
        "id": 6814,
        "title": "Performance Study of Convolutional Neural Network Architectures for 3D Incompressible Flow Simulations",
        "authors": "Ekhi Ajuria Illarramendi, Michael Bauerheim, Neil Ashton, Corentin Lapeyre, Bénédicte Cuenot",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3592979.3593416"
    },
    {
        "id": 6815,
        "title": "Neural Network Architectures for Recognizing Military Objects on Satellite Images",
        "authors": "Oleksandr Kovaliv, Yuriy Kondratenko, Anatoliy Shevchenko, Ievgen Sidenko, Galyna Kondratenko",
        "published": "2023-9-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/idaacs58523.2023.10348905"
    },
    {
        "id": 6816,
        "title": "A Bibliometric Review: Brain Tumor Magnetic Resonance Imagings Using Different Convolutional Neural Network Architectures",
        "authors": "Arati Rath, Dipak Kumar Mohanty, Bhabani Shankar Prasad Mishra, Dilip Kumar Bagal",
        "published": "2023-2",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.wneu.2022.11.091"
    },
    {
        "id": 6817,
        "title": "Advancements in Deep Learning Architectures: A Comprehensive Review of Current Trends",
        "authors": "Md. Rashed Khan",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "This comprehensive review delves into the dynamic landscape of deep learning architectures, exploring recent advancements that have propelled the field to new heights. Deep learning, a cornerstone of artificial intelligence, continues to evolve rapidly, and this article aims to provide an in-depth examination of current trends shaping the domain. The review encompasses key developments in Convolutional Neural Networks (CNNs) for image processing, highlighting intricate architectures like ResNets and DenseNets. In the realm of Natural Language Processing (NLP), the study explores the transformative impact of advanced Recurrent Neural Networks (RNNs), such as LSTMs and GRUs, along with the revolutionary influence of attention mechanisms and Transformers. Transfer learning, demonstrated through pre-trained models like GPT and BERT, is discussed for its ability to set new benchmarks in natural language understanding and generation. The article also addresses advancements in self-supervised and unsupervised learning, showcasing techniques like contrastive learning and Generative Adversarial Networks (GANs) that allow models to learn intricate patterns from unlabeled data. Furthermore, the review emphasizes the growing importance of explainability and ethical considerations in deep learning architectures, highlighting ongoing efforts to ensure transparency and mitigate bias. As the field continues to mature, the synthesis of recent breakthroughs underscores the transformative impact of deep learning on artificial intelligence and sets the stage for further innovations that will shape its future trajectory.",
        "keywords": "",
        "link": "http://dx.doi.org/10.60087/jaigs.v1i1.29"
    },
    {
        "id": 6818,
        "title": "ADVANCEMENTS IN VIDEO CAPTIONING: A COMPREHENSIVE REVIEW OF DEEP LEARNING TECHNIQUES, ARCHITECTURES, AND PRE-PROCESSING STRATEGIES",
        "authors": "",
        "published": "2024-2-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49310"
    },
    {
        "id": 6819,
        "title": "Real-Time Thermal Spray Process Monitoring Using Convolution Neural Network Deep Learning Architectures",
        "authors": "K. Malamousi, K. Delibasis, S. Kamnis",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11666-024-01713-7"
    },
    {
        "id": 6820,
        "title": "Neural Network Modeling Bias for Hafnia-based FeFETs",
        "authors": "Osama Yousuf, Imtiaz Hossen, Andreu Glasmann, Sina Najmaei, Gina C. Adam",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3611315.3633253"
    },
    {
        "id": 6821,
        "title": "An in-depth analysis of Convolutional Neural Network architectures with transfer learning for skin disease diagnosis",
        "authors": "Rifat Sadik, Anup Majumder, Al Amin Biswas, Bulbul Ahammad, Md. Mahfujur Rahman",
        "published": "2023-11",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.health.2023.100143"
    },
    {
        "id": 6822,
        "title": "Advancements in Cataract Detection: The Systematic Development of LeNet-Convolutional Neural Network Models",
        "authors": "Thittaporn Ganokratanaa, Mahasak Ketcham, Patiyuth Pramkeaw",
        "published": "2023-9-26",
        "citations": 1,
        "abstract": "Regular screening and timely treatment play a crucial role in addressing the progression and visual impairment caused by cataracts, the leading cause of blindness in Thailand and many other countries. Despite the potential for prevention and successful treatment, patients often delay seeking medical attention due to the gradual and relatively asymptomatic nature of cataracts. To address this challenge, this research focuses on the identification of cataract abnormalities using image processing techniques and machine learning for preliminary assessment. The LeNet-convolutional neural network (LeNet-CNN) model is employed to train a dataset of digital camera images, and its performance is compared to the support vector machine (SVM) model in categorizing cataract abnormalities. The evaluation demonstrates that the LeNet-CNN model achieves impressive results in the testing phase. It attains an accuracy rate of 96%, exhibiting a sensitivity of 95% for detecting positive cases and a specificity of 96% for accurately identifying negative cases. These outcomes surpass the performance of previous studies in this field. This highlights the accuracy and effectiveness of the proposed approach, particularly the superior performance of LeNet-CNN. By utilizing image processing technology and convolutional neural networks, this research provides an effective tool for initial cataract screening. Patients can independently assess their eye health by capturing self-images, facilitating early intervention and medical consultations. The proposed method holds promise in enhancing the preliminary assessment of cataracts, enabling early detection and timely access to appropriate care.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/jimaging9100197"
    },
    {
        "id": 6823,
        "title": "Comparative Evaluation of Several Convolutional Neural Network Architectures in Diabetic Retinopathy Classification",
        "authors": "Simeon Yuda Prasetyo,  Nurhasanah, Muhammad Fadlan Hidayat, Zahra Nabila Izdihar",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmeralda60125.2023.10458188"
    },
    {
        "id": 6824,
        "title": "Recent Advancements in Modern Antenna Design for Wearable Devices",
        "authors": "Md. Shafikul Islam Shawan, Md. Abdullah Kawser, Fatema Tuz Zohra, Sorup Kumer Das, Md. Hazrat Ali",
        "published": "2023-8-7",
        "citations": 0,
        "abstract": "The rapid growth of wearable technologies within wireless body area networks (WBANs) has increased the demand for advanced wearable antennas. The human body's presence creates significant challenges for these antennas since it behaves differently as a wave propagation medium. It is necessary to prioritize specific requirements for antenna design, such as size, frequency, efficiency, wideband and multiband operation, because of body interaction and signal attenuation. The development of novel methodologies, the use of state-of-the-art fabrication methods, and the advancement of antenna designs have been the main areas of attention for researchers in this field in recent years. This research investigates contemporary advancements in wearable antennas, particularly emphasizing utilizing recent materials, fabrication processes, and new techniques. It also highlights the unique applicability of these antennas in advanced WBAN systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55529/jaimlnn.35.14.27"
    },
    {
        "id": 6825,
        "title": "A Novel Approach Towards Detecting Malaria Parasite in Thin Blood Smears Using a Sequential Convolutional Neural Network (CNN) Model",
        "authors": "Mahima Gupta, Yash Dungarwal, Yerramsetty Sai Naga Sabarish, Kakelli Anil Kumar",
        "published": "2023-11-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aaiac60008.2023.10465396"
    },
    {
        "id": 6826,
        "title": "A Comparative Analysis of Convolutional Neural Network Architectures for Coffee Leaf Rust Detection",
        "authors": "Andrea Kristine Lelis, Emanuel Gethresito I. Ferriols, Kim Marcial A.Vallesteros, Jen Aldwayne B. Delmo",
        "published": "2023-6-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2cacis57635.2023.10193074"
    },
    {
        "id": 6827,
        "title": "cudaBRKGA-CNN: An Approach for Optimizing Convolutional Neural Network Architectures",
        "authors": "Andersson A. Da Silva, Ricardo M. A. Silva, Amanda S. Xavier, Thiago D. Bispo, Geraldo R. Mateus, Mauricio G. C. Resende",
        "published": "2023-7-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cec53210.2023.10254101"
    },
    {
        "id": 6828,
        "title": "Comparison of different neural network architectures for detecting anomalies of storage indicators",
        "authors": "Vadim С. Moshkin, Dmitry Kurilo, Ilya Andreev, Yulia Gavrilova",
        "published": "2024-2-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3025021"
    },
    {
        "id": 6829,
        "title": "Advancements in End-to-End Speech Recognition: A Comparative Study of Deep Learning Architectures and Attention Mechanisms",
        "authors": "",
        "published": "2024-1-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets48033"
    },
    {
        "id": 6830,
        "title": "Convolutional Neural Network Architectures for Gender, Emotional Detection from Speech and Speaker Diarization",
        "authors": "Thaer Mufeed Taha, Zaineb Ben Messaoud, Mondher Frikha",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "This paper introduces three system architectures for speaker identification that aim to overcome the limitations of diarization and voice-based biometric systems. Diarization systems utilize unsupervised algorithms to segment audio data based on the time boundaries of utterances, but they do not distinguish individual speakers. On the other hand, voice-based biometric systems can only identify individuals in recordings with a single speaker. Identifying speakers in recordings of natural conversations can be challenging, especially when emotional shifts can alter voice characteristics, making gender identification difficult. To address this issue, the proposed architectures include techniques for gender, emotion, and diarization at either the segment or group level. The evaluation of these architectures utilized two speech databases, namely VoxCeleb and RAVDESS (Ryerson audio-visual database of emotional speech and song) datasets. The findings reveal that the proposed approach outperforms the strategy level in terms of recognition results, despite the real-time processing advantage of the latter. The challenge of identifying multiple speakers engaging in a conversation while considering emotional changes that impact speech is effectively addressed by the proposed architectures. The data indicates that the gender and emotion classification of diarization achieves an accuracy of over 98 percent. These results suggest that the proposed speech-based approach can achieve highly accurate speaker identification. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.3991/ijim.v18i03.43013"
    },
    {
        "id": 6831,
        "title": "Exploration of convolutional neural network architectures for large region map automation",
        "authors": "Rostyslav-Mykola Tsenov, Christopher J. Henry, Joni L. Storie, Christopher D. Storie, Brent Murray, Mikhail Sokolov",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/1.jrs.17.018505"
    },
    {
        "id": 6832,
        "title": "A Comparative Study of Certain Convolutional Neural Network Architectures for X-ray Image Analysis in Bone Fracture Detection and Identification",
        "authors": "Mashrur Kabir, Tasnia Jasim Tahiti, Tasnim Ahsan Prome",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdsa59508.2024.10468017"
    },
    {
        "id": 6833,
        "title": "Comparison of deep-neural-network architectures for the prediction of head-related transfer functions using a parametric pinna model",
        "authors": "F. Pausch, F. Perfler, N. Holighaus, P. Majdak",
        "published": "2024-1-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61782/fa.2023.0795"
    },
    {
        "id": 6834,
        "title": "Pre-Trained Deep Convolutional Neural Network Architectures for Breast Cancer Diagnosis in Mammography: Current State-Of-The-Art",
        "authors": "Marwa Ben Ammar, Faten Labbene Ayechi, Riadh Ksantini, Halima Mahjoubi",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/inista59065.2023.10310612"
    },
    {
        "id": 6835,
        "title": "Exploration of Key Point Localization Neural Network Architectures for Y-Maze Behavior Test Automation",
        "authors": "Gwanghee Lee, Sangjun Moon, Dasom Choi, Gayeon Kim, Kyoungson Jhang",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5626/jcse.2023.17.3.100"
    },
    {
        "id": 6836,
        "title": "Andronicus of Rhodes at SemEval-2023 Task 4: Transformer-Based Human Value Detection Using Four Different Neural Network Architectures",
        "authors": "Georgios Papadopoulos, Marko Kokol, Maria Dagioglou, Georgios Petasis",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.75"
    },
    {
        "id": 6837,
        "title": "Bird Image Classification using Convolutional Neural Network Transfer Learning Architectures",
        "authors": "Asmita Manna, Nilam Upasani, Shubham Jadhav, Ruturaj Mane, Rutuja Chaudhari, Vishal Chatre",
        "published": "2023",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.0140397"
    },
    {
        "id": 6838,
        "title": "A Comparative Analysis of Deep Learning Convolutional Neural Network Architectures for Fault Diagnosis of Broken Rotor Bars in Induction Motors",
        "authors": "Kevin Barrera-Llanga, Jordi Burriel-Valencia, Ángel Sapena-Bañó, Javier Martínez-Román",
        "published": "2023-9-30",
        "citations": 6,
        "abstract": "Induction machines (IMs) play a critical role in various industrial processes but are susceptible to degenerative failures, such as broken rotor bars. Effective diagnostic techniques are essential in addressing these issues. In this study, we propose the utilization of convolutional neural networks (CNNs) for detection of broken rotor bars. To accomplish this, we generated a dataset comprising current samples versus angular position using finite element method magnetics (FEMM) software for a squirrel-cage rotor with 28 bars, including scenarios with 0 to 6 broken bars at every possible relative position. The dataset consists of a total of 16,050 samples per motor. We evaluated the performance of six different CNN architectures, namely Inception V4, NasNETMobile, ResNET152, SeNET154, VGG16, and VGG19. Our automatic classification system demonstrated an impressive 99% accuracy in detecting broken rotor bars, with VGG19 performing exceptionally well. Specifically, VGG19 exhibited high accuracy, precision, recall, and F1-Score, with values approaching 0.994 and 0.998. Notably, VGG19 exhibited crucial activations in its feature maps, particularly after domain-specific training, highlighting its effectiveness in fault detection. Comparing CNN architectures assists in selecting the most suitable one for this application based on processing time, effectiveness, and training losses. This research suggests that deep learning can detect broken bars in induction machines with accuracy comparable to that of traditional methods by analyzing current signals using CNNs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23198196"
    },
    {
        "id": 6839,
        "title": "Comparison of Deep Convolutional Neural Network Architectures for Fruit Categorization",
        "authors": "Johan Muliadi Kerta, Abdul Haris Rangkuti, Jeremy Tantio",
        "published": "2024",
        "citations": 0,
        "abstract": "In general, there are so many types of fruit images that it is difficult for humans to differentiate them based on their visual characteristics alone. This research focuses on identifying and recognizing images of fruit from 23 different classes or types. Fruit varieties consist of 13 apple classes, 1 orange class, and 9 tomato classes, totaling 15,987 images. Fruit image data were collected from various sources, including the internet, magazines, and direct capture with a digital camera. The process of identifying and recognizing fruit images involves the classification of fruit images using a deep learning algorithm. Several CNN models, which are derivatives of deep learning, are used to achieve high accuracy and robustness in recognizing various types of apples and tomatoes. To evaluate the performance of each model, the apple data were trained on a large and diverse set of apple images using several CNN models such as ResNet50V2, InceptionV3, InceptionResNetV2, VGG16, VGG19, MobileNetV2, and EfficientNet. Performance is assessed using metrics such as accuracy, precision, recall, and F1 score. To achieve optimal performance in the image recognition process, it consists of preprocessing strategies, data augmentation, feature extraction, and classification supported by optimization, all of which have a significant impact on increasing accuracy performance. Experimental results show that certain CNN model architectures outperform other model architectures in terms of time efficiency and accuracy in recognizing fruit types/classes. However, to get more optimal results regarding the performance of the CNN model architecture for fruit categorization, two optimizers will be used, namely Adam and Adagrad, and will be compared. Based on Adam's optimizer experiments, the EfficientNet model produces the highest average accuracy of up to 99%, followed using the VGG 16 and ResNet V2 50 models, which achieve 98% and 97% accuracy. Meanwhile, the use of the Adagrad optimizer with the VGG 16 model produces the highest average accuracy of up to 95%, followed using the VGG 19 and EfficientNet models, which achieve accuracy of up to 93% and 91%. Overall, this experiment produced very good accuracy because it produced an average of above 90%. However, there is still room for improvement in recognizing fruits of different shapes, textures, and colors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32985/ijeces.15.3.4"
    },
    {
        "id": 6840,
        "title": "YFlows: Systematic Dataflow Exploration and Code Generation for Efficient Neural Network Inference using SIMD Architectures on CPUs",
        "authors": "Cyrus Zhou, Zack Hassman, Dhirpal Shah, Vaughn Richard, Yanjing Li",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640537.3641566"
    },
    {
        "id": 6841,
        "title": "Resource-Efficient Neural Network Architectures for Classifying Nerve Cuff Recordings on Implantable Devices",
        "authors": "Yi-Chin E. Hwang, Roman Genov, José Zariffa",
        "published": "2024-2",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tbme.2023.3312361"
    },
    {
        "id": 6842,
        "title": "CatStep: Automated Cataract Surgical Phase Classification and Boundary Segmentation Leveraging Inflated 3D-Convolutional Neural Network Architectures and BigCat",
        "authors": "Ossama Mahmoud, Han Zhang, Nicholas Matton, Shahzad I. Mian, Bradford Tannen, Nambi Nallasamy",
        "published": "2024-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.xops.2023.100405"
    },
    {
        "id": 6843,
        "title": "Energy Efficiency of Training Neural Network Architectures: An Empirical Study",
        "authors": "Yinlena Xu, Silverio Martínez-Fernández, Matias Martinez, Xavier Franch",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24251/hicss.2023.098"
    },
    {
        "id": 6844,
        "title": "Advancements in On-Device Deep Neural Networks",
        "authors": "Kavya Saravanan, Abbas Z. Kouzani",
        "published": "2023-8-21",
        "citations": 1,
        "abstract": "In recent years, rapid advancements in both hardware and software technologies have resulted in the ability to execute artificial intelligence (AI) algorithms on low-resource devices. The combination of high-speed, low-power electronic hardware and efficient AI algorithms is driving the emergence of on-device AI. Deep neural networks (DNNs) are highly effective AI algorithms used for identifying patterns in complex data. DNNs, however, contain many parameters and operations that make them computationally intensive to execute. Accordingly, DNNs are usually executed on high-resource backend processors. This causes an increase in data processing latency and energy expenditure. Therefore, modern strategies are being developed to facilitate the implementation of DNNs on devices with limited resources. This paper presents a detailed review of the current methods and structures that have been developed to deploy DNNs on devices with limited resources. Firstly, an overview of DNNs is presented. Next, the methods used to implement DNNs on resource-constrained devices are explained. Following this, the existing works reported in the literature on the execution of DNNs on low-resource devices are reviewed. The reviewed works are classified into three categories: software, hardware, and hardware/software co-design. Then, a discussion on the reviewed approaches is given, followed by a list of challenges and future prospects of on-device AI, together with its emerging applications.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/info14080470"
    },
    {
        "id": 6845,
        "title": "Contrail Analysis through Advanced Neural Network Architectures: Image Segmentation and Classification",
        "authors": "Ashraful Alam Nirob, Shahriar Ahmed, Tahmidul Karim Takee, Adnan Rahman Eshan, Shadik Ul Haque, Ehsanur Rahman Rhythm, Annajiat Alim Rasel",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccit60459.2023.10441226"
    },
    {
        "id": 6846,
        "title": "A novel parallel merge neural network with streams of spiking neural network and artificial neural network",
        "authors": "Jie Yang, Junhong Zhao",
        "published": "2023-9",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2023.119034"
    },
    {
        "id": 6847,
        "title": "COMPARISON OF THE PERFORMANCE OF DIFFERENT NEURAL NETWORK ARCHITECTURES AND PRE-TRAINED NEURAL NETWORKS FOR THE CLASSIFICATION OF FOREST FLORA AND FAUNA",
        "authors": "Witold Prusak, Aleksander Skrzypiec, Tymoteusz Turlej",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": " The aim of this project is to compare the effectiveness of different neural network architectures and pre-trained models for the classification of forest flora and fauna. Experiments were conducted on a dataset containing images of selected plants and animals found in the forest. The project covers the basics of convolutional neural networks, and compares the architectures of the networks used in the study. The results of the experiments compare the effectiveness of different convolutional neural network architectures and pre-trained models, such as EfficientNet or ResNet50. The study includes the training times of selected neural networks, classification times of individual images, and their effectiveness. Additionally, the impact of pre-training networks on the ImageNet dataset on the quality of neural network classification was compared. The purpose of this project was to determine the neural network with the most optimal parameters for use in our robot, �Rumcajs�, which is to be used for monitoring and mapping forest flora and fauna by classifying the segmented images with Segment Anything Model from our advanced camera systems. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5593/sgem2023/2.1/s07.05"
    },
    {
        "id": 6848,
        "title": "Optimal Quadratic Binding for Relational Reasoning in Vector Symbolic Neural Architectures",
        "authors": "Naoki Hiratani, Haim Sompolinsky",
        "published": "2023-1-20",
        "citations": 3,
        "abstract": "Abstract\nBinding operation is fundamental to many cognitive processes, such as cognitive map formation, relational reasoning, and language comprehension. In these processes, two different modalities, such as location and objects, events and their contextual cues, and words and their roles, need to be bound together, but little is known about the underlying neural mechanisms. Previous work has introduced a binding model based on quadratic functions of bound pairs, followed by vector summation of multiple pairs. Based on this framework, we address the following questions: Which classes of quadratic matrices are optimal for decoding relational structures? And what is the resultant accuracy? We introduce a new class of binding matrices based on a matrix representation of octonion algebra, an eight-dimensional extension of complex numbers. We show that these matrices enable a more accurate unbinding than previously known methods when a small number of pairs are present. Moreover, numerical optimization of a binding operator converges to this octonion binding. We also show that when there are a large number of bound pairs, however, a random quadratic binding performs, as well as the octonion and previously proposed binding methods. This study thus provides new insight into potential neural mechanisms of binding operations in the brain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/neco_a_01558"
    },
    {
        "id": 6849,
        "title": "Comparative Analysis of Convolutional Neural Network Architectures for Automated Knee Segmentation in Medical Imaging: A Performance Evaluation",
        "authors": "Anna Ghidotti, Andrea Vitali, Daniele Regazzoni, Miri Weiss Cohen, Caterina Rizzi",
        "published": "2024-5-1",
        "citations": 0,
        "abstract": "Abstract\nSegmentation of anatomical components is a major step in creating accurate and realistic 3D models of the human body, which are used in many clinical applications, including orthopedics. Recently, many deep learning approaches have been proposed to solve the problem of manual segmentation, which is time-consuming and operator-dependent. In the present study, SegResNet has been adapted from other domains, such as brain tumors, for knee joints, in particular, to segment the femoral bone from magnetic resonance images. This algorithm has been compared to the well-known U-Net in terms of evaluation metrics, such as the Dice similarity coefficient and Hausdorff distance. In the training phase, various combinations of hyperparameters, such as epochs and learning rates, have been tested to determine which combination produced the most accurate results. Based on their comparable results, both U-Net and SegResNet performed well in accurately segmenting the femur. Dice similarity coefficients of 0.94 and Hausdorff distances less than or equal to 1 mm indicate that both models are effective at capturing anatomical boundaries in the femur. According to the results of this study, SegResNet is a viable option for automating the creation of 3D femur models. In the future, the performance and applicability of SegResNet in real-world settings will be further validated and tested using a variety of datasets and clinical scenarios.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/1.4064450"
    },
    {
        "id": 6850,
        "title": "A fair experimental comparison of neural network architectures for latent representations of multi-omics for drug response prediction",
        "authors": "Tony Hauptmann, Stefan Kramer",
        "published": "2023-2-14",
        "citations": 0,
        "abstract": "AbstractBackgroundRecent years have seen a surge of novel neural network architectures for the integration of multi-omics data for prediction. Most of the architectures include either encoders alone or encoders and decoders, i.e., autoencoders of various sorts, to transform multi-omics data into latent representations. One important parameter is the depth of integration: the point at which the latent representations are computed or merged, which can be either early, intermediate, or late. The literature on integration methods is growing steadily, however, close to nothing is known about the relative performance of these methods under fair experimental conditions and under consideration of different use cases.ResultsWe developed a comparison framework that trains and optimizes multi-omics integration methods under equal conditions. We incorporated early integration, PCA and four recently published deep learning methods: MOLI, Super.FELT, OmiEmbed, and MOMA. Further, we devised a novel method, Omics Stacking, that combines the advantages of intermediate and late integration. Experiments were conducted on a public drug response data set with multiple omics data (somatic point mutations, somatic copy number profiles and gene expression profiles) that was obtained from cell lines, patient-derived xenografts, and patient samples. Our experiments confirmed that early integration has the lowest predictive performance. Overall, architectures that integrate triplet loss achieved the best results. Statistical differences can, overall, rarely be observed, however, in terms of the average ranks of methods, Super.FELT is consistently performing best in a cross-validation setting and Omics Stacking best in an external test set setting.ConclusionsWe recommend researchers to follow fair comparison protocols, as suggested in the paper. When faced with a new data set, Super.FELT is a good option in the cross-validation setting as well as Omics Stacking in the external test set setting. Statistical significances are hardly observable, despite trends in the algorithms’ rankings. Future work on refined methods for transfer learning tailored for this domain may improve the situation for external test sets. The source code of all experiments is available underhttps://github.com/kramerlab/Multi-Omics_analysis",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s12859-023-05166-7"
    },
    {
        "id": 6851,
        "title": "A comparative study on different neural network architectures to model inelasticity",
        "authors": "Max Rosenkranz, Karl A. Kalina, Jörg Brummund, Markus Kästner",
        "published": "2023-11-15",
        "citations": 7,
        "abstract": "AbstractThe mathematical formulation of constitutive models to describe the path‐dependent, that is, inelastic, behavior of materials is a challenging task and has been a focus in mechanics research for several decades. There have been increased efforts to facilitate or automate this task through data‐driven techniques, impelled in particular by the recent revival of neural networks (NNs) in computational mechanics. However, it seems questionable to simply not consider fundamental findings of constitutive modeling originating from the last decades research within NN‐based approaches. Herein, we propose a comparative study on different feedforward and recurrent neural network architectures to model 1D small strain inelasticity. Within this study, we divide the models into three basic classes: black box NNs, NNs enforcing physics in a weak form, and NNs enforcing physics in a strong form. Thereby, the first class of networks can learn constitutive relations from data while the underlying physics are completely ignored, whereas the latter two are constructed such that they can account for fundamental physics, where special attention is paid to the second law of thermodynamics in this work. Conventional linear and nonlinear viscoelastic as well as elastoplastic models are used for training data generation and, later on, as reference. After training with random walk time sequences containing information on stress, strain, and—for some models—internal variables, the NN‐based models are compared to the reference solution, whereby interpolation and extrapolation are considered. Besides the quality of the stress prediction, the related free energy and dissipation rate are analyzed to evaluate the models. Overall, the presented study enables a clear recording of the advantages and disadvantages of different NN architectures to model inelasticity and gives guidance on how to train and apply these models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/nme.7319"
    },
    {
        "id": 6852,
        "title": "Lip-Reading Advancements: A 3D Convolutional Neural Network/Long Short-Term Memory Fusion for Precise Word Recognition",
        "authors": "Themis Exarchos, Georgios N. Dimitrakopoulos, Aristidis G. Vrahatis, Georgios Chrysovitsiotis, Zoi Zachou, Efthymios Kyrodimos",
        "published": "2024-2-4",
        "citations": 0,
        "abstract": "Lip reading, the art of deciphering spoken words from the visual cues of lip movements, has garnered significant interest for its potential applications in diverse fields, including assistive technologies, human–computer interaction, and security systems. With the rapid advancements in technology and the increasing emphasis on non-verbal communication methods, the significance of lip reading has expanded beyond its traditional boundaries. These technological advancements have led to the generation of large-scale and complex datasets, necessitating the use of cutting-edge deep learning tools that are adept at handling such intricacies. In this study, we propose an innovative approach combining 3D Convolutional Neural Networks (CNNs) and Long Short-Term Memory (LSTM) networks to tackle the challenging task of word recognition from lip movements. Our research leverages a meticulously curated dataset, named MobLip, encompassing various speech patterns, speakers, and environmental conditions. The synergy between the spatial information extracted by 3D CNNs and the temporal dynamics captured by LSTMs yields impressive results, achieving an accuracy rate of up to 87.5%, showcasing robustness to lighting variations and speaker diversity. Comparative experiments demonstrate our model’s superiority over existing lip-reading approaches, underlining its potential for real-world deployment. Furthermore, we discuss ethical considerations and propose avenues for future research, such as multimodal integration with audio data and expanded language support. In conclusion, our 3D CNN-LSTM architecture presents a promising solution to the complex problem of word recognition from lip movements, contributing to the advancement of communication technology and opening doors to innovative applications in an increasingly visual world.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/biomedinformatics4010023"
    },
    {
        "id": 6853,
        "title": "Development of Convolutional Neural Network-Based AI-Dermatoscope for Non-Invasive Skin Assessments",
        "authors": "Nipun Shantha Kahatapitiya, Akila Wijethunge, Sajith Edirisinghe, Bhagya Nathali Silva, Mansik Jeon, Jeehyun Kim, Udaya Wijenayake, Ruchire Eranga Wijesinghe",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icac60630.2023.10417424"
    },
    {
        "id": 6854,
        "title": "Improving malicious email detection through novel designated deep-learning architectures utilizing entire email",
        "authors": "Trivikram Muralidharan, Nir Nissim",
        "published": "2023-1",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neunet.2022.09.002"
    },
    {
        "id": 6855,
        "title": "Comparative Analysis of Different Deep Convolutional Neural Network Architectures for Classification of Brain Tumor on Magnetic Resonance Images",
        "authors": "Jainy Sachdeva, Deepanshu Sharma, Chirag Kamal Ahuja",
        "published": "2024-1-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11831-023-10041-y"
    },
    {
        "id": 6856,
        "title": "Classification of Plant Pest Grasshopper Species by Convolutional Neural Network Architectures and Transfer Learning",
        "authors": "Nurullah ŞAHİN, Nuh ALPASLAN, Mustafa İLÇİN, Davut HANBAY",
        "published": "2023-3-28",
        "citations": 0,
        "abstract": "Çekirgeler, mahsullere zarar vererek her yıl milyonlarca ton gıdanın yok olmasına neden olmaktadır. Etkili ve doğru çekirge tanımlama sistemlerinin geliştirilmesi, çekirge türlerinin kontrol altına alınması ve gıda kaybının önlenmesinde kritik öneme sahiptir. Bu çalışmada, ülkemizin ve dünyanın çeşitli yerlerinde görülen 11 farklı bitki zararlısı çekirge türü çeşitli evrişimsel sinir ağı modelleri kullanılarak sınıflandırılmıştır. Çalışmada kullanılan veri seti ülkemizin Doğu ve Güneydoğu Anadolu bölgesinde gözlemlenerek elde edilmiştir. Bu çalışmanın en büyük yeniliği, ülkemizde bulunan 11 farklı bitki zararlısı çekirge türüne ait GHCD11 adında yeni bir veri setinin oluşturulmuş olmasıdır. Bunun yanında, çalışmada 11 farklı bitki zararlısı çekirge türünün otomatik olarak sınıflandırılması için Keras kütüphanesinde bulunan ve görüntü sınıflandırmasında yaygın olarak kullanılan VGG16, VGG19, ResNet50, DenseNet121, EfficientNet, MobileNet kullanılmıştır. Öğrenme aktarımı ile GHCD11 veri seti üzerinde yapılan deneysel çalışmalar sonucunda, %95 ile %99 aralığında kayda değer sınıflandırma doğrulukları elde edilmiştir. Çalışma yeni bir veri seti sunmasının yanı sıra, bitki zararlısı çekirge türlerinin evrişimsel sinir ağı mimarileri ile otomatik tanı ve tespitinin yüksek başarım ile yapılabileceğini göstermesi açısından önem arz etmektedir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.35234/fumbd.1228883"
    },
    {
        "id": 6857,
        "title": "Improved deep artificial neural network-powered prediction of extreme mechanical performances of fractal architectures with high hierarchical rank",
        "authors": "N.V. Viet, S. Ilyas, W. Zaki",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijsolstr.2023.112591"
    },
    {
        "id": 6858,
        "title": "Modified symbiotic organisms search optimization for automatic construction of convolutional neural network architectures",
        "authors": "Fatsuma Jauro, Abdulsalam Ya'u Gital, Usman Ali Abdullahi, Aminu Onimisi Abdulsalami, Mohammed Abdullahi, Adamu Abubakar Ibrahim, Haruna Chiroma",
        "published": "2024-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.iswa.2024.200349"
    },
    {
        "id": 6859,
        "title": "Evaluating Architectures and Hyperparameters of Self-supervised Network Projections",
        "authors": "Tim Cech, Daniel Atzberger, Willy Scheibel, Rico Richter, Jürgen Döllner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011699700003417"
    },
    {
        "id": 6860,
        "title": "Advancements in waveguide architectures using high-performance silica-on-silicon platform - INVITED",
        "authors": "Serge Bidnyk, Ksenia Yadav, Ashok Balakrishnan",
        "published": "2023",
        "citations": 0,
        "abstract": "Novel applications in optical coherence tomography (OCT) and LiDAR systems have become possible due to performance characteristics of a state-of-the-art silica-on-silicon planar lightwave circuit (PLC) platform. We have achieved ultra-low propagation losses of <0.009 dB/cm with unmatched phase control in a polarization-insensitive way, enabling a range of real-time advanced vision and imaging applications utilizing k-clocks and analog frequency sampling architectures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/epjconf/202328701006"
    },
    {
        "id": 6861,
        "title": "A Comparative Analysis of Artificial Neural Network (ANN) Architectures for Box Compression Strength Estimation",
        "authors": "By Juan Gu,  , Benjamin Frank, Euihark Lee",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20909/kopast.2023.29.3.163"
    },
    {
        "id": 6862,
        "title": "Modeling of 3D Blood Flows with Physics-Informed Neural Networks: Comparison of Network Architectures",
        "authors": "Philipp Moser, Wolfgang Fenz, Stefan Thumfart, Isabell Ganitzer, Michael Giretzlehner",
        "published": "2023-1-27",
        "citations": 8,
        "abstract": "Machine learning-based modeling of physical systems has attracted significant interest in recent years. Based solely on the underlying physical equations and initial and boundary conditions, these new approaches allow to approximate, for example, the complex flow of blood in the case of fluid dynamics. Physics-informed neural networks offer certain advantages compared to conventional computational fluid dynamics methods as they avoid the need for discretized meshes and allow to readily solve inverse problems and integrate additional data into the algorithms. Today, the majority of published reports on learning-based flow modeling relies on fully-connected neural networks. However, many different network architectures are introduced into deep learning each year, each with specific benefits for certain applications. In this paper, we present the first comprehensive comparison of various state-of-the-art networks and evaluate their performance in terms of computational cost and accuracy relative to numerical references. We found that while fully-connected networks offer an attractive balance between training time and accuracy, more elaborate architectures (e.g., Deep Galerkin Method) generated superior results. Moreover, we observed high accuracy in simple cylindrical geometries, but slightly poorer estimates in complex aneurysms. This paper provides quantitative guidance for practitioners interested in complex flow modeling using physics-based deep learning.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/fluids8020046"
    },
    {
        "id": 6863,
        "title": "Innovative Advancements in Network Topologies: A Comprehensive Investigation of Mesh Network, Tree Topology, and Hypercube Network",
        "authors": " Jesse Emmanuel A. Encarnacion,  Jerry I. Teleron",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "In the dynamic digital era, characterized by diverse and evolving communication demands, the necessity for adept network architectures has reached a paramount juncture. This paper responds to this imperative by exploring the novel architectures poised to redefine the contours of modern networking. The study employed a comprehensive methodology through theoretical analysis, simulation studies, and real-world applications. It rigorously assesses the topology structure, scalability, latency and throughout, fault tolerance, and application of the three innovative network topologies namely: Mesh Network, Tree Topology, and Hypercube Network. The results showed that Mesh Network is more suitable for dynamic IoT environment due to high resilience and fault tolerance. It emerged as a robust choice for managing the complex communication patterns inherent in IoT deployments. However, Mesh Network must strengthen its security measures by incorporating encryption protocols and intrusion detection systems. The Tree topologies showcase scalability but may be challenged in fault-tolerant scenarios. This requires tree topologies to focus on enhancing the scalability of hierarchical structures, perhaps through adaptive configurations. Hypercube networks, inspired by parallel processing, demonstrate efficiency in edge computing environments. The efficiency of hypercube networks in edge computing environments suggests the need for continued optimization. The research also elucidates potential benefits and delve into the opportunities and challenges associated with each topology. It does not only underscore their strengths and limitations but also provides actionable recommendations for their effective implementation across various scenarios. The findings of this study can contribute to the collective knowledge base and serve as a catalyst for future developments guiding researchers, practitioners, and decision-makers in their pursuit of resilient and adaptive network designs in an ever-changing digital landscape",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-13869"
    },
    {
        "id": 6864,
        "title": "A Security Evaluation Framework for Software-Defined Network Architectures in Data Center Environments",
        "authors": "Igor Ivkić, Dominik Thiede, Nicholas Race, Matthew Broadbent, Antonios Gouglidis",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011988300003488"
    },
    {
        "id": 6865,
        "title": "EEG Signal in Emotion Detection Feature Extraction and Classification using Fuzzy Based Feature Search Algorithm and Deep Q Neural Network in Deep Learning Architectures",
        "authors": "Shailaja Kotte, Kumar Dabbakuti J R K",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14445/23488549/ijece-v10i5p108"
    },
    {
        "id": 6866,
        "title": "Bow-tie architectures in biological and artificial neural networks: Implications for network evolution and assay design",
        "authors": "Seth Hilliard, Karen Mosoyan, Sergio Branciamore, Grigoriy Gogoshin, Alvin Zhang, Diana L. Simons, Russell C. Rockne, Peter P. Lee, Andrei S. Rodin",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.isci.2023.106041"
    },
    {
        "id": 6867,
        "title": "FTTX NETWORK DESIGN ARCHITECTURES",
        "authors": "",
        "published": "2023-10-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets45023"
    },
    {
        "id": 6868,
        "title": "Advancements in the study of neural mechanisms underlying mammalian grouping behaviour",
        "authors": "Aubrey M. Kelly",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "Despite the prevalence of large group-living in the animal kingdom, we know surprisingly little about how the brain facilitates grouping behavior, particularly in mammals. In this brief communication, I provide an update on advancements in the study of the neural mechanisms underlying mammalian grouping behavior. I discuss the benefits of using non-traditional organisms in the laboratory and provide examples of how using non-standard, large housing and testing apparatuses produces more ethologically-relevant behavioral datasets. Further, with advancements in computer vision-based automated tracking and increasing availability of wireless neural recording and manipulation tools, scientists can now generate unprecedented neurobehavioral datasets from multiple interacting animals. Together, recent advancements in behavioral and neural approaches hold great promise for expanding our understanding of how the brain modulates complex, mammalian grouping behaviors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3389/fetho.2023.1273613"
    },
    {
        "id": 6869,
        "title": "Neurodrive - Advancements in Convolutional Neural Networks for Autonomous Driving: A Comprehensive Review",
        "authors": "",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49858"
    },
    {
        "id": 6870,
        "title": "Deep neural network architectures for cardiac image segmentation",
        "authors": "Jasmine El-Taraboulsi, Claudia P. Cabrera, Caroline Roney, Nay Aung",
        "published": "2023-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ailsci.2023.100083"
    },
    {
        "id": 6871,
        "title": "Exploring the Landscape: Analysis of Model Results on Various Convolutional Neural Network Architectures for iRESPOND System",
        "authors": "Freddie Prianes, Kaela Marie Fortuno, Rosel Onesa, Brenda Benosa, Thelma Palaoag, Nancy Flores",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2024.0150352"
    },
    {
        "id": 6872,
        "title": "Lungs X-Ray Image Segmentation and Classification of Lung Disease using Convolutional Neural Network Architectures",
        "authors": "Bambang Suprihatin, Yuli Andriani, Fauziah Nuraini Kurdi, Anita Desiani, Ibra Giovani Dwi Putra, Muhammad Akmal Shidqi",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "Lung disease is one of the biggest causes of death in the world. The SARS-CoV-2 virus causes diseases like COVID-19, and the bacteria Streptococcus sp., which causes pneumonia, are two sample causes of lung disease. X-ray images are used to detect the lung disease. This study aimed to combine the stages of segmentation and classification of lung disease. This study in segmentation aims to separate the features contained in the lung images. The classification aimed to provide holistic information on lung disease. This research method used the Deep Residual U-Net (DrU-Net) segmentation architecture and the Deep Residual Neural Network (DResNet) classification architecture. DrU-Net is a modified U-Net architecture with dropout added in its convolutional layers. DResNet is a modified Residual Network (ResNet) architecture with dropout added in its convolutional block layers. The result of this study was segmentation using the DrU-Net architecture obtained 99% for accuracy, 98% for precision, 98% for recalls, 98% for F1-Score, and 96.1% for IoU. The classification results of the segmented images using the DResNet architecture obtained 91% for accuracy, 86% for precision, 85% for recalls, and 84% for F1-Score. The performance results of DrU-Net architecture were excellent and robust in image segmentation. Unfortunately, the average performance of DResNet in classification was still below 90%. These results indicate that Dres-Net performs well in classifying lung disorders in 3 labels, namely Covid, Normal, and Pneumonia, but still needs improvement.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30812/matrik.v23i1.3133"
    },
    {
        "id": 6873,
        "title": "Special issue on towards advancements in machine learning for exploiting large-scale and heterogeneous repositories",
        "authors": "Sajid Anwar, Álvaro Rocha",
        "published": "2023-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-022-08182-5"
    },
    {
        "id": 6874,
        "title": "Anterior cruciate ligament tear detection based on convolutional neural network and generative adversarial neural network",
        "authors": "Kavita Joshi, K. Suganthi",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-09350-x"
    },
    {
        "id": 6875,
        "title": "ARCHITECTURES OF NEURAL NETWORKS BASED ON THE PHYSICAL CHARACTERISTICS OF THE OBJECT",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "Neural networks based on the physical characteristics of an object have been actively used in recent time in order to solve combined problems that require multi-step calculations. Therefore this technology shall be thoroughly studied and properly used. Neural networks solve many problems in different fields of science. Today there are several different ways of application, one of the possible applications is the solution of the equation of partial variables, in special cases the approximation of piecewise functional systems can be used. This article presents an overview of neural network architecture based on physical characteristics of the object. The application of physical informative neural networks (PINNs) for approximation of piecewise functional systems is considered. It is shown that PINNs allow to use information about the physical equations of the system in training, automatically determine boundaries between ranges of input variables, and use various activation functions and hidden layers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18469/ikt.2022.20.4.08"
    },
    {
        "id": 6876,
        "title": "Application of recent reliable transport layer advancements to DoD SATCOM network challenges",
        "authors": "Joy Wang, Theodore Richards, Aradhana Narula-Tam",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115799"
    },
    {
        "id": 6877,
        "title": "Advancements in Early Lung Cancer Detection Using Convolutional Neural Networks",
        "authors": "Sheenam Middha, Abhay Kumar",
        "published": "2023-12-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiihi57871.2023.10489806"
    },
    {
        "id": 6878,
        "title": "Deep Learning in Stock Market Forecasting: Comparative Analysis of Neural Network Architectures Across NSE and NYSE",
        "authors": " Bishnu Padh Ghosh,  Mohammad Shafiquzzaman Bhuiyan,  Debashish Das,  Tuan Ngoc Nguyen,  Mahmud Jewel,  Md Tuhin Mia,  Duc M Cao",
        "published": "2024-1-13",
        "citations": 0,
        "abstract": "This research explores the application of four deep learning architectures—Multilayer Perceptron (MLP), Recurrent Neural Networks (RNN), Long Short-Term Memory (LSTM), and Convolutional Neural Networks (CNN)—in predicting stock prices using historical data. Focusing on day-wise closing prices from the National Stock Exchange (NSE) of India and the New York Stock Exchange (NYSE), the study trains the neural network on NSE data and tests it on both NSE and NYSE stocks. Surprisingly, the CNN model outperforms the others, successfully predicting NYSE stock prices despite being trained on NSE data. Comparative analysis against the ARIMA model underscores the superior performance of neural networks, emphasizing their potential in forecasting stock market trends. This research sheds light on the shared underlying dynamics between distinct markets and demonstrates the efficacy of deep learning architectures in stock price prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32996/jcsts.2024.6.1.8"
    },
    {
        "id": 6879,
        "title": "Exploring Neural Network Structure through Sparse Recurrent Neural Networks: A Recasting and Distillation of Neural Network Hyperparameters",
        "authors": "Quincy Hershey, Randy Paffenroth, Harsh Pathak",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmla58977.2023.00026"
    },
    {
        "id": 6880,
        "title": "GAN Neural Networks Architectures for Testing Process Control Industrial Network Against Cyber-Attacks",
        "authors": "Krzysztof Zarzycki, Patryk Chaber, Krzysztof Cabaj, Maciej Ławryńczuk, Piotr Marusak, Robert Nebeluk, Sebastian Plamowski, Andrzej Wojtulewicz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3277250"
    },
    {
        "id": 6881,
        "title": "The effect of convolutional neural network architectures on phase segmentation of composite material X-ray micrographs",
        "authors": "Pedro Galvez-Hernandez, James Kratz",
        "published": "2023-8",
        "citations": 2,
        "abstract": " Porosity severely reduces the mechanical performance of composite laminates and methods for automatic segmentation of void phases are growing. This study investigates porosity in composite materials that take the form of interlaminar voids and dry tow areas. Deep Learning was used for the segmentation of X-ray micrographs via the implementation of eight state-of-the-art Convolutional Neural Network (CNN) architectures trained with data sets containing twenty-five, fifty, and one-hundred images. The combination of hyperparameters providing the highest accuracy for each architecture and training set size was achieved through the optimisation of six relevant hyperparameters, including the cut-off probability applied to output probability maps. Additionally, the properties of the CNN architectures ( e.g., layer typology, connections, density…) were found to play a determining role, not only in the segmentation results but also in the associated computing effort. U-Net and FCDenseNet outperformed the FCN-8s, FCN-16, SegNet, LinkNet, ResNet18 and Xception CNN architectures. However, the CNNs generally outperformed the standard thresholding approaches, especially in sub-volumes containing low porosity (1.07%) where the influence on strength is very sensitive in high-performance composites. In low porosity samples, U-Net and FCDenseNet consistently segmented voids to 85% + accuracy, whereas thresholding was only half as accurate, at around 40%. The results provide a strong motivation to replace thresholding as a segmentation method for composite X-ray micrographs. In terms of efficiency, the reduced complexity of the U-Net network allowed for an average reduction of the training time (−36%) and prediction time (−17%) when compared to FCDenseNet. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/00219983231168790"
    },
    {
        "id": 6882,
        "title": "Comparative study of convolutional neural network architectures for gastrointestinal lesions classification",
        "authors": "Erik O. Cuevas-Rodriguez, Carlos E. Galvan-Tejada, Valeria Maeda-Gutiérrez, Gamaliel Moreno-Chávez, Jorge I. Galván-Tejada, Hamurabi Gamboa-Rosales, Huizilopoztli Luna-García, Arturo Moreno-Baez, José María Celaya-Padilla",
        "published": "2023-3-16",
        "citations": 2,
        "abstract": "The gastrointestinal (GI) tract can be affected by different diseases or lesions such as esophagitis, ulcers, hemorrhoids, and polyps, among others. Some of them can be precursors of cancer such as polyps. Endoscopy is the standard procedure for the detection of these lesions. The main drawback of this procedure is that the diagnosis depends on the expertise of the doctor. This means that some important findings may be missed. In recent years, this problem has been addressed by deep learning (DL) techniques. Endoscopic studies use digital images. The most widely used DL technique for image processing is the convolutional neural network (CNN) due to its high accuracy for modeling complex phenomena. There are different CNNs that are characterized by their architecture. In this article, four architectures are compared: AlexNet, DenseNet-201, Inception-v3, and ResNet-101. To determine which architecture best classifies GI tract lesions, a set of metrics; accuracy, precision, sensitivity, specificity, F1-score, and area under the curve (AUC) were used. These architectures were trained and tested on the HyperKvasir dataset. From this dataset, a total of 6,792 images corresponding to 10 findings were used. A transfer learning approach and a data augmentation technique were applied. The best performing architecture was DenseNet-201, whose results were: 97.11% of accuracy, 96.3% sensitivity, 99.67% specificity, and 95% AUC.",
        "keywords": "",
        "link": "http://dx.doi.org/10.7717/peerj.14806"
    },
    {
        "id": 6883,
        "title": "Towards 6G: Beam Prediction using Convolutional Neural Network and Artificial Neural Network",
        "authors": "D.M.C. Dissanayake, Punnarumol Temdee",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incit60207.2023.10412992"
    },
    {
        "id": 6884,
        "title": "Detection and Mitigation of Vulnerabilities in Space Network Software Bus Architectures",
        "authors": "Adrian Schalk, Dane Brown",
        "published": "2023-3-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aero55745.2023.10115986"
    },
    {
        "id": 6885,
        "title": "Advancements in personalized stem cell models for aging-related neurodegenerative disorders",
        "authors": "Mingxi Weng, Ralf Jauch",
        "published": "2024-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/nrr.nrr-d-23-01793"
    },
    {
        "id": 6886,
        "title": "Dual-process theories, cognitive architectures, and hybrid neural-symbolic models",
        "authors": "Ron Sun",
        "published": "2024-3-18",
        "citations": 0,
        "abstract": "This position paper discusses relationships among hybrid neural-symbolic models, dual-process theories, and cognitive architectures. It provides some historical backgrounds and argues that dual-process (implicit versus explicit) theories have significant implications for developing neural-symbolic (neurosymbolic) models. Furthermore, computational cognitive architectures can help to disentangle issues concerning dual-process theories and thus help the development of neural-symbolic models (in this way as well as in other ways).",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/nai-240720"
    },
    {
        "id": 6887,
        "title": "Connectivity Schemas in NeuroEvolution: What Neural Architectures does GEPNN evolve?",
        "authors": "Mwaura Jonathan, Heminway Ryan",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ssci52147.2023.10371957"
    },
    {
        "id": 6888,
        "title": "Mutual Information-Based Neural Network Distillation for Improving Photonic Neural Network Training",
        "authors": "Alexandros Chariton, Nikolaos Passalis, Nikos Pleros, Anastasios Tefas",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11063-023-11170-y"
    },
    {
        "id": 6889,
        "title": "Solving time delay fractional optimal control problems via a Gudermannian neural network and convergence results",
        "authors": "Farzaneh Kheyrinataj, Alireza Nazemi, Marziyeh Mortezaee",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0954898x.2023.2173817"
    },
    {
        "id": 6890,
        "title": "Deep Neural Network Architectures for an Embedded MPC Implementation: Application to an Automated Insulin Delivery System",
        "authors": "A. Castillo, M.F. Villa-Tamayo, E. Pryor, J. Garcia-Tirado, P. Colmegna, M. Breton",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ifacol.2023.10.443"
    },
    {
        "id": 6891,
        "title": "DSC-Ghost-Conv: A compact convolution module for building efficient neural network architectures",
        "authors": "Tao Wang, Shiqing Zhang",
        "published": "2023-7-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-16120-3"
    },
    {
        "id": 6892,
        "title": "Neural Network With Binary Cross Entropy for Antenna Selection in Massive MIMO Systems: Convolutional Neural Network Versus Fully Connected Network",
        "authors": "Jaekwon Kim, Hyo-Sang Lim",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3322679"
    },
    {
        "id": 6893,
        "title": "Advancements in Plant Pests Detection: Leveraging Convolutional Neural Networks for Smart Agriculture",
        "authors": "Gopalakrishnan Nagaraj, Dakshinamurthy Sungeetha, Mohit Tiwari, Vandana Ahuja, Ajit Kumar Varma, Pankaj Agarwal",
        "published": "2024-1-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059201"
    },
    {
        "id": 6894,
        "title": "The effect of amplitude modification in S-shaped activation functions on neural network regression",
        "authors": "Faizal Makhrus",
        "published": "2023",
        "citations": 0,
        "abstract": "Time series forecasting using multilayer feed-forward neural networks (FNN) is potential to give high accuracy. Several factors influence the accuracy. One of them is the choice of activation functions (AFs). There are several AFs commonly used in FNN with their specific characteristics, such as bounded type AFs. They include sigmoid, softsign, arctan, and tanh. This paper investigates the effect of the amplitude in the bounded AFs on the FNNs accuracy. The theoretical investigations use simplified FNN models: linear equation and linear combination. The results show that the higher amplitudes give higher accuracy than typical amplitudes in softsign, arctan, and tanh AFs. However, in sigmoid AF, the amplitude changes do not influence the accuracy. These theoretical results are supported by experiments using the FNN model for time series prediction of 10 foreign exchanges from different continents compared to the US dollar. Based on the experiments, the optimum amplitude of the AFs should be high, that is greater or equal to 100 times of the maximum input values to the FNN, and the accuracy gains up to 310 times.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14311/nnw.2023.33.015"
    },
    {
        "id": 6895,
        "title": "Spintronic Memristor-Based Binarized Ensemble Convolutional Neural Network Architectures",
        "authors": "Ghislain Takam Tchendjou, Kamal Danouchi, Guillaume Prenat, Lorena Anghel",
        "published": "2023-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/tcad.2022.3213612"
    },
    {
        "id": 6896,
        "title": "Forest Fire Detection Based on Light-Weight Deep Neural Networks",
        "authors": "Shenbagam Palanisamy, Deepikaa Easwaran",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaeca56562.2023.10201047"
    },
    {
        "id": 6897,
        "title": "Two-dimensional convolutional neural network outperforms other machine learning architectures for water depth surrogate modeling",
        "authors": "Xiaohui Yan, Abdolmajid Mohammadian, Ruigui Ao, Jianwei Liu, Na Yang",
        "published": "2023-1",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jhydrol.2022.128812"
    },
    {
        "id": 6898,
        "title": "Advancements in Wireless Network Security and Next-Generation Technologies",
        "authors": "Nirwan Ansari",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mwc.2024.10495917"
    },
    {
        "id": 6899,
        "title": "Poisonous Mushroom Detection Using Graph Neural Networks",
        "authors": "D.P.C.H Pathirana, R.M.T.U. Rajapaksha, H.M. Samadhi Chathuranga Rathnayake, Kosala Sirisena, Udara Samarathunga",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icac60630.2023.10417353"
    },
    {
        "id": 6900,
        "title": "DRGNN - Dilated recurrent graph neural network framework incorporating spatial and temporal features signifying social relationships in IoT network based traffic prediction",
        "authors": "Jegatheesan Divya, Arumugam Chandrasekar",
        "published": "2023",
        "citations": 0,
        "abstract": "The intelligent transportation system seeks to reduce traffic and improve the driving experience. They give us a lot of data that we can use to improve services for both the public and transportation officials by feeding it into machine learning systems. Most importantly, Traffic environment refers to everything that might have an impact on how much traffic is moving down the road, including traffic signals, accidents, protests, and even road repairs that might result in a backup. A motorist or rider can make an informed choice if they have previous knowledge that is very close to approximate all the above and many more real-world circumstances that can affect traffic. Additionally, it aids in the development of driverless vehicles. Traffic data have been growing dramatically in recent decades, and we are moving toward big data concepts for transportation. The current approaches for predicting traffic flow use some traffic prediction models, however they are still inadequate to handle practical situations. We thus aimed to focus on the traffic flow forecast problem using the traffic data and prediction models. The proposed model called DRGNN, a dilated recurrent graph neural network framework aims to effectively analyze and predict the traffic pattern by considering the spatial (space) and temporal (time) aspects of the real-time traffic data considering social relationships between internet of vehicles which indeed produced accurate and valuable insights that could help in deploying the model in any suitable real-time traffic monitoring and prediction system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14311/nnw.2023.33.026"
    },
    {
        "id": 6901,
        "title": "An integrated fuzzy neural supervision and attention-based graph neural network for improving network clustering",
        "authors": "Tham Vo",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00521-023-08974-3"
    },
    {
        "id": 6902,
        "title": "NEURAL NETWORK SYSTEM FOR ANALYSIS OF UNBALANCED HETEROGENEOUS DERMATOLOGICAL DATA ON THE BASIS OF A MULTIMODAL NEURAL NETWORK",
        "authors": "",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "To date, skin cancer is the most frequently diagnosed form of oncopathology. Visual diagnosis of this cancer type in the early stages is difficult due to similar visual manifestations in benign and malignant types of pigmented formations, and its accuracy depends on the experience of dermatologist. Artificial intelligence technologies are able to equal and surpass accuracy of visual diagnostic methods, but there is a risk of false positive prognosis, when malignant pigmented formation may be recognized as benign. One of the possible ways to improve recognition accuracy and reduce false positive conclusions is simultaneous use of different preprocessing methods, heterogeneous data analysis, and use of modified learning loss functions to eliminate negative impact of unbalanced dermatological data. The study presents an intelligent system for unbalanced heterogeneous dermatological data analyzing based on a multimodal neural network trained using modified cross-entropy loss function. The accuracy of classification of pigmented skin lesions in 10 diagnostically significant categories in the proposed system based on the AlexNet convolutional neural network architecture reached 83.87%. Due to the emerging synergy when using various methods to improve performance quality of intelligent systems, the number of false positive forecasts of the intelligent system was reduced, and the accuracy was increased by 1.31-4.91 percentage points, depending on the convolutional neural network architecture. Implementation of the developed system as a tool for auxiliary diagnostics can reduce the consumption of financial and labor resources involved in the medical industry, as well as increase the chance of early detection of pigmentary oncopathologies.",
        "keywords": "",
        "link": "http://dx.doi.org/10.18469/ikt.2022.20.4.11"
    },
    {
        "id": 6903,
        "title": "Advancements in Image Compression Techniques",
        "authors": "Pratheeksha S, Raksha M, Raghavendra K, Bhoomika H S, Vipula Singh",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276110"
    },
    {
        "id": 6904,
        "title": "APPLICATIONS, ATTACKS, AND ADVANCEMENTS IN CRYPTOGRAPHY AND NETWORK SECURITY HASH FUNCTIONS: A REVIEW",
        "authors": "",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets39371"
    }
]