[
    {
        "id": 6301,
        "title": "Time to Retire F1-Binary Score for Action Unit Detection",
        "authors": "Saurabh Hinduja, Tara Nourivandi, Jeffrey  F. Cohn, Shaun Canavan",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4399502"
    },
    {
        "id": 6302,
        "title": "90% F1 Score in Relation Triple Extraction: Is it Real?",
        "authors": "Pratik Saini, Samiran Pal, Tapas Nayak, Indrajit Bhattacharya",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.1"
    },
    {
        "id": 6303,
        "title": "UAV Imaging: Correlation Between Contrast and F1-Score for Vision-Based Crack Detection",
        "authors": "Tran Hiep Dinh, Cong Hieu Le, Quang Ha",
        "published": "2024-1-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/sii58957.2024.10417452"
    },
    {
        "id": 6304,
        "title": "Probabilistic Extension of Precision, Recall, and F1 Score for More Thorough Evaluation of Classification Models",
        "authors": "Reda Yacouby, Dustin Axman",
        "published": "2020",
        "citations": 109,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.eval4nlp-1.9"
    },
    {
        "id": 6305,
        "title": "The advantages of the Matthews correlation coefficient (MCC) over F1 score and accuracy in binary classification evaluation",
        "authors": "Davide Chicco, Giuseppe Jurman",
        "published": "2020-12",
        "citations": 2495,
        "abstract": "Abstract\nBackground\nTo evaluate binary classifications and their confusion matrices, scientific researchers can employ several statistical rates, accordingly to the goal of the experiment they are investigating. Despite being a crucial issue in machine learning, no widespread consensus has been reached on a unified elective chosen measure yet. Accuracy and F1 score computed on confusion matrices have been (and still are) among the most popular adopted metrics in binary classification tasks. However, these statistical measures can dangerously show overoptimistic inflated results, especially on imbalanced datasets.\n\nResults\nThe Matthews correlation coefficient (MCC), instead, is a more reliable statistical rate which produces a high score only if the prediction obtained good results in all of the four confusion matrix categories (true positives, false negatives, true negatives, and false positives), proportionally both to the size of positive elements and the size of negative elements in the dataset.\n\nConclusions\nIn this article, we show how MCC produces a more informative and truthful score in evaluating binary classifications than accuracy and F1 score, by first explaining the mathematical properties, and then the asset of MCC in six synthetic use cases and in a real genomics scenario. We believe that the Matthews correlation coefficient should be preferred to accuracy and F1 score in evaluating binary classification tasks by all scientific communities.\n",
        "link": "http://dx.doi.org/10.1186/s12864-019-6413-7"
    },
    {
        "id": 6306,
        "title": "F1 Score Based Weighted Asynchronous Federated Learning",
        "authors": "Sneha Sree Yarlagadda, Sai Harshith Tule, Karthik Myada",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Abstract: The domain of federated learning has observed remarkable developments in recent years, enabling collaborative model training while preserving data privacy. This paper discusses several recent advancements in the field of federated learning, particularly in asynchronous and weighted federated learning. A novel approach within the federated learning paradigm titled \"F1 Score Based Weighted Asynchronous Federated Learning\" is introduced. The approach addresses issues of biased aggregation and device heterogeneity by assigning weights to devices based on their F1 scores, prioritizing those with superior performance in classification. Leveraging the asynchronous nature of federated learning, this approach enhances both resource efficiency and convergence speed. By incorporating F1 scores into the weighting mechanism, a balanced emphasis on precision and recall is achieved. It can optimize resource utilization, expediting the learning process by focusing on updates from devices with more accurate and valuable information. This approach can enhance collaborative model improvement while preserving data privacy in federated learning.",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.58487"
    },
    {
        "id": 6307,
        "title": "High-F1-score Recognition of Input Gestures while Holding Smartphone by Reducing False Detection Due to Walking Noise",
        "authors": "Ryo Katsuma, Tomoaki Amiya",
        "published": "2022-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18494/sam3938"
    },
    {
        "id": 6308,
        "title": "F1-EV score: Measuring The Likelihood of Estimating a Good Decision Threshold for Semi-Supervised Anomaly Detection",
        "authors": "Kevin Wilkinghoff, Keisuke Imoto",
        "published": "2024-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp48485.2024.10446011"
    },
    {
        "id": 6309,
        "title": "Rapid detection of adulterated lamb meat using near infrared and electronic nose: A F1-score-MRE data fusion approach",
        "authors": "Wenshen Jia, Yingdong Qin, Changtong Zhao",
        "published": "2024-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.foodchem.2023.138123"
    },
    {
        "id": 6310,
        "title": "Evaluating compressive sensing algorithms in through-the-wall radar via F1-score",
        "authors": "Ali A. AlBeladi, Ali H. Muqaibel",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijsise.2018.10014297"
    },
    {
        "id": 6311,
        "title": "Evaluating compressive sensing algorithms in through-the-wall radar via F1-score",
        "authors": "Ali A. AlBeladi, Ali H. Muqaibel",
        "published": "2018",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1504/ijsise.2018.093268"
    },
    {
        "id": 6312,
        "title": "Automatic Stock Market Prediction using Novel Long Short Term Memory Algorithm compared with Logistic Regression for improved F1 score",
        "authors": "P. Venkata Sairam, Logu. K",
        "published": "2022-2-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciptm54933.2022.9754116"
    },
    {
        "id": 6313,
        "title": "Piscis: a novel loss estimator of the F1 score enables accurate spot detection in fluorescence microscopy images via deep learning",
        "authors": "Zijian Niu, Aoife O’Farrell, Jingxin Li, Sam Reffsin, Naveen Jain, Ian Dardani, Yogesh Goyal, Arjun Raj",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractSingle-molecule RNA fluorescencein situhybridization (RNA FISH)-based spatial transcriptomics methods have enabled the accurate quantification of gene expression at single-cell resolution by visualizing transcripts as diffraction-limited spots. While these methods generally scale to large samples, image analysis remains challenging, often requiring manual parameter tuning. We present Piscis, a fully automatic deep learning algorithm for spot detection trained using a novel loss function, the SmoothF1 loss, that approximates the F1 score to directly penalize false positives and false negatives but remains differentiable and hence usable for training by deep learning approaches. Piscis was trained and tested on a diverse dataset composed of 358 manually annotated experimental RNA FISH images representing multiple cell types and 240 additional synthetic images. Piscis outperforms other state-of-the-art spot detection methods, enabling accurate, high-throughput analysis of RNA FISH-derived imaging data without the need for manual parameter tuning.",
        "link": "http://dx.doi.org/10.1101/2024.01.31.578123"
    },
    {
        "id": 6314,
        "title": "A Shape Comparison Reinforcement Method Based on Feature Extractors and F1-Score",
        "authors": "Danilo Avola, Luigi Cinque, Gian Luca Foresti, Francesco Lamacchia, Marco Raoul Marini, Luca Perini, Kristjana Qorraj, Gabriele Telesca",
        "published": "2019-10",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smc.2019.8914601"
    },
    {
        "id": 6315,
        "title": "Comparative Analysis of Recurrent Neural Network over Convolutional Neural Network in Predicting R2l Attack in IoT Devices with Improved Accuracy and F1 Score",
        "authors": "I. Jaya Bharath Reddy, S. Mahaboob Basha",
        "published": "2023-9-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic3i59117.2023.10397830"
    },
    {
        "id": 6316,
        "title": "Predicting breast cancer using machine learning classifiers and enhancing the output by combining the predictions to generate optimal F1-score",
        "authors": "DishaHarshadbhai Parekh, Vishal Dahiya",
        "published": "2021",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4103/bbrj.bbrj_131_21"
    },
    {
        "id": 6317,
        "title": "A Comprehensive Investigation of Machine Learning Algorithms with SMOTE Integration to Maximize F1 Score",
        "authors": "Surbhi Sharma, Alka Singhal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2100-3_16"
    },
    {
        "id": 6318,
        "title": "On kNN Class Weights for Optimising G-Mean and F1-Score",
        "authors": "Grzegorz Góra, Andrzej Skowron",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-50959-9_29"
    },
    {
        "id": 6319,
        "title": "A MODEL FOR SWELLING AND SQUEEZING GROUND IN TUNNELLING",
        "authors": "Yuzo OKUI, Kazuo NISHIMURA",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.40"
    },
    {
        "id": 6320,
        "title": "EXPERIMENTAL RESEARCH ON DEFORMATION OF SEGMENTAL LINING OF SHIELD TUNNEL",
        "authors": "Kiwamu TSUNO, Kaho KINOSHITA, Yoshiteru KAWAKAMI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_112"
    },
    {
        "id": 6321,
        "title": "Abstract F1-1: Tumor stroma in DCIS progression",
        "authors": "Robert West",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Abstract\nThe interaction between cancer cells and the surrounding stroma plays a significant role in tumor growth and progression. The rapidly growing field of study involving the tumor microenvironment is discovering stromal-specific genes and cells that participate in this process. In invasive breast cancer, transcriptional analysis of stroma derived samples has identified stromal gene expression features that are correlated with clinical outcome with features characteristic of angiogenesis, hypoxia, and inflammation. The role of the microenvironment in DCIS is less well studied and has significant variation across and within DCIS. The basement membrane and myoepithelial cell layers provide a barrier for the interaction between neoplastic cells and the tumor microenvironment. DCIS tumor cells may be variably exposed to the immune environment. An immune infiltration is common in some DCIS, including high grade DCIS with necrosis. How this influences the transition from DCIS to IBC is complex.\nCitation Format: Robert West. Tumor stroma in DCIS progression [abstract]. In: Proceedings of the 2022 San Antonio Breast Cancer Symposium; 2022 Dec 6-10; San Antonio, TX. Philadelphia (PA): AACR; Cancer Res 2023;83(5 Suppl):Abstract nr F1-1.",
        "link": "http://dx.doi.org/10.1158/1538-7445.sabcs22-f1-1"
    },
    {
        "id": 6322,
        "title": "Abstract F1-2: Clonal evolution of DCIS to invasion",
        "authors": "Jelle Wesseling",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Abstract\nClonal evolution of DCIS to invasion\nDuctal carcinoma in situ (DCIS) is the most common form of preinvasive breast cancer and, despite treatment, a small fraction (5-10%) of DCIS patients develop subsequent invasive breast cancer (IBC). If not treated, at least 3 out of 4 women with DCIS will not develop IBC1-3. This implies many women with non-progressive, low-risk DCIS are likely to carry the burden of overtreatment. To solve this DCIS dilemma, two fundamental questions need to be answered. The first question is, how the subsequent IBC is related to the initial DCIS lesion. The second question is how to distinguish high- from low-risk DCIS at the time of diagnosis. This is essential to take well-informed DCIS management decisions, i.e., surgery, followed by radiotherapy in case of breast conserving treatment with or without subsequent endocrine treatment, or test whether active surveillance for low-risk DCIS is safe.\nHow is the subsequent IBC related to the initial DCIS?\nThe high genomic concordance in DNA aberrations between DCIS and IBC suggest that most driver mutations and CNA events are acquired at the earliest stages of DCIS initiation. It has therefore been assumed that most solid tumours arise from a single cell and that the probability of two independent tumours arising from the same tissue is low4-6. However, lineage tracing and genomic studies strongly suggest both direct and independent clonal lineages during the initiation of DCIS and evolution to IBC. In these processes, mammary stem cells have been implicated in DCIS initiation.\nRole of mammary stem cells in DCIS initiation\nLineage tracing mouse model experiments have shown the fate of individual cells and lineages that acquire mutations before a tumour is established7-9. This is also relevant for DCIS initiation10,11, as different pools of MaSCs drive the growth and development of the ductal network and are considered the cell of origin for breast cancers9,10. The ductal trees remain quiescent until puberty, during which extension, branching and termination of terminal end buds (TEBs) leads to its expansion throughout the fat pad7,12,13. Any oncogenic mutation that occurs in a fetal MaSC will spread throughout the ductal network to a large part of the ductal tree, leading to sick lobes9. By contrast, oncogenic mutations acquired by a single MaSC during puberty spread to a smaller number of offspring located in small clusters in a part of the ductal network8,14.\nDirect lineage models for DCIS progression\nDirect lineage models postulate that DCIS has a single cell of origin that acquires mutations and progresses to IBC15-18. This is also supported by the high genomic concordance of CNAs and mutations in synchronous DCIS–IBC regions6,15,17,19-21 and the results of a recent large longitudinal study that profiled pure DCIS and recurrent IBC using multiple sequencing techniques, which estimated direct clonal lineages in approximately ~80% of patients18.\nTwo distinct direct lineage models have been proposed: the evolutionary bottleneck model and the multiclonal invasion model. In the evolutionary bottleneckmodel, a single clone (or a limited number of clones) with an invasive genotype is selected and breaks through the basement membrane to migrate into surrounding tissues15,16,22, while other clones are unable to escape the ducts21-28. The multiclonal invasion model posits that most or all subclones can escape the basement membrane, establishing invasive disease6,16,17,20. The multiclonal model has not been studied widely in pure DCIS and recurrent IBC samples.\nIndependent lineage model for DCIS progression\nDCIS lesions and IBCs can arise from different initiating cells in the same breast independently5,20,29-32. An analysis of sequential DCIS–IBC pairs in a unique, large-scale, in-depth study of 95 matched pure DCIS and recurrent IBC showed that ~20% of the IBC recurrences were indeed clonally unrelated to the primary DCIS18, as is also supported by some mathematical model studies33.\nThe potential role of a field effect\nIBC can develop in the same breast as an initial DCIS even after treatment, which could be explained by the presence of a field effect34-37. Alternatively, the sick lobe hypothesis proposes that a single lobe harbours first-hit mutations, acquired in utero or during early mammary development37-42. This could also explain the restriction of IBC to the ipsilateral side of the breast39,43,44. Germline mutations may also explain the emergence of independent lineages in DCIS and IBC patients, lowering the threshold for cancer development32,43-46.\nConvergent evolution model of DCIS progression\nA third model for the emergence of IBC from DCIS is convergent evolution, in which the same mutations and CNA are selected and expanded during tumour growth such that environmental factors fuel competition between distinct clones and push them towards a similar genotype. Ultimately, two independent clonal lineages from different ancestral cells then happen to share multiple genomic aberrations or driver mutations across regions47-49. Although independent lineages are considered uncommon (~20%) in ipsilateral recurrences, they occur at much higher frequencies in contralateral recurrences (&gt;80%), in which single-nucleotide polymorphism and comparative genomic hybridization microarrays show few (or no) genomic alterations shared in tumours from the contralateral breast cancer18,50,51.\nHow to distinguish high- from low-risk DCIS at the time of diagnosis?\nThe genomic and transcriptomic profile present at the time of DCIS diagnosis may contain crucial information on the risk of progression of DCIS to IBC. Thus far, it has been unclear whether prognostic gene expression markers can be used to separate indolent DCIS from potentially progressive DCIS. To this end, microarrays and RNA-seq have been applied for the comparison of bulk RNA from microdissected DCIS and IBC tissue. In synchronous DCIS–IBC, a limited number of transcriptional differences have been found and the few events discovered often varied extensively across different tumours52-56. Although these differences were strong, the added value of these studies is uncertain as they are often confounded by small sample size, lack of matched receptor status data, and low sample purity. Despite these limitations, these studies have implicated the epithelial-mesenchymal transition (EMT) and extracellular matrix (ECM) remodelling pathways as potentially relevant for the progression of DCIS to IBC55-62.\nWe studied two large DCIS cohorts: the Sloane cohort, a prospective breast screening cohort from the UK (median follow-up of 12.5 years), and a Dutch population-based cohort (NKI, median follow-up of 13 years). FFPE tissue specimens from patients with pure primary DCIS after breast-conserving surgery (BCS) +/- RT that did develop a subsequent ipsilateral event (DCIS or invasive) were considered as cases, whereas patients that did not develop any form of recurrence up to the last follow-up or death were considered as controls. We performed copy number analysis (CNA) and RNAseq analysis on 229 cases (149 IBC recurrences and 80 DCIS recurrences) and 344 controls.\nWe classified DCIS into the PAM50 subtypes using RNAseq data which revealed an enrichment of luminal A phenotype in DCIS that did not recur (P = 0.01, Fisher Exact test). No single copy number aberration was more common in cases compared to controls. RNAseq data did not reveal any genes significantly over/under expressed in cases versus controls after false discovery rate (FDR) correction. However, by limiting the analysis to samples that had not had RT and excluding pure DCIS recurrences we developed a penalized Cox model from RNAseq data. The model was trained on weighted samples (to correct for the biased sampling of the case control dataset) from the NKI series with double loop cross validation. Using this predicted hazard ratio, the samples were split into high, medium and low risk quantiles, with a recurrence risk of 20%, 9% and 2.5%, respectively at 5 years (p&lt;0.001, Wald test). The NKI-trained predictor was independently validated in the Sloane No RT cohort (p = 0.02, Wald test). GSEA analysis revealed proliferation hallmarks enriched in the recurrence predictor (FDR = 0.058). The NKI-RNAseq predictor was more predictive of invasive recurrence than PAM50, clinical features (Grade, Her2 and ER) and the 12-gene Oncotype DCIS score (p &lt; 0.001, permutation test using the Wald statistic) in both the NKI and Sloane series.\nIn the methylation analysis, 50 controls were compared with 35 cases. We could identify Variably Methylation Regions (VMRs) and Differentially Methylated Regions (DMRs) between cases and controls. Interestingly, VMRs were enriched in cell adhesion pathways\nConclusion\nThe recently acquired knowledge described above on how often the subsequent IBC is directly related to the initial DCIS and on molecular markers predicting the risk of DCIS progression is essential for accurate DCIS risk assessment. This is essential to aid accurate clinical decision making to personalize DCIS management in the near future.\nReferences\n1. Falk, R. S., Hofvind, S., Skaane, P. & Haldorsen, T. Second events following ductal carcinoma in situ of the breast: a register-based cohort study. Breast Cancer Res Treat 129, 929-938, doi:10.1007/s10549-011-1531-1 (2011).\n2. Ryser, M. D. et al. Cancer Outcomes in DCIS Patients Without Locoregional Treatment. Jnci J National Cancer Inst 111, 952-960, doi:10.1093/jnci/djy220 (2019).\n3. Maxwell, A. J. et al. Unresected screen detected Ductal Carcinoma in Situ: outcomes of 311 women in the Forget-me–not 2 study. Breast 61, 145-155, doi:10.1016/j.breast.2022.01.001 (2022).\n4. Hanahan, D. & Weinberg, R. A. Hallmarks of cancer: the next generation. Cell 144, 646-674, doi:10.1016/j.cell.2011.02.013 (2011).\n5. Kim, H., Kim, C. Y., Park, K. H. & Kim, A. Clonality analysis of multifocal ipsilateral breast carcinomas using X-chromosome inactivation patterns. Hum Pathol 78, 106-114, doi:10.1016/j.humpath.2018.04.016 (2018).\n6. Bergholtz, H. et al. Comparable cancer-relevant mutation profiles in synchronous ductal carcinoma in situ and invasive breast cancer. Cancer Rep (Hoboken) 3, e1248, doi:10.1002/cnr2.1248 (2020).\n7. Giraddi, R. R. et al. Stem and progenitor cell division kinetics during postnatal mouse mammary gland development. Nat Commun 6, 8487, doi:10.1038/ncomms9487 (2015).\n8. Scheele, C. L. et al. Identity and dynamics of mammary stem cells during branching morphogenesis. Nature 542, 313-317, doi:10.1038/nature21046 (2017).\n9. Ying, Z. & Beronja, S. Embryonic Barcoding of Equipotent Mammary Progenitors Functionally Identifies Breast Cancer Drivers. Cell Stem Cell 26, 403-419.e404, doi:10.1016/j.stem.2020.01.009 (2020).\n10. Zhou, J. et al. Stem Cells and Cellular Origins of Breast Cancer: Updates in the Rationale, Controversies, and Therapeutic Implications. Front Oncol 9, 820, doi:10.3389/fonc.2019.00820 (2019).\n11. Watson, C. J. & Khaled, W. T. Mammary development in the embryo and adult: new insights into the journey of morphogenesis and commitment. Development 147, doi:10.1242/dev.169862 (2020).\n12. Williams, J. M. & Daniel, C. W. Mammary ductal elongation: differentiation of myoepithelium and basal lamina during branching morphogenesis. Dev Biol 97, 274-290, doi:10.1016/0012-1606(83)90086-6 (1983).\n13. Silberstein, G. B. & Daniel, C. W. Glycosaminoglycans in the basal lamina and extracellular matrix of serially aged mouse mammary ducts. Mech Ageing Dev 24, 151-162, doi:10.1016/0047-6374(84)90067-8 (1984).\n14. Davis, F. M. et al. Single-cell lineage tracing in the mammary gland reveals stochastic clonal dispersion of stem/progenitor cell progeny. Nat Commun 7, 13053, doi:10.1038/ncomms13053 (2016).\n15. Hernandez, L. et al. Genomic and mutational profiling of ductal carcinomas in situ and matched adjacent invasive breast cancers reveals intra-tumour genetic heterogeneity and clonal selection. J Pathol 227, 42-52, doi:10.1002/path.3990 (2012).\n16. Casasent, A. K., Edgerton, M. & Navin, N. E. Genome evolution in ductal carcinoma in situ: invasion of the clones. J Pathol 241, 208-218, doi:10.1002/path.4840 (2017).\n17. Casasent, A. K. et al. Multiclonal Invasion in Breast Tumors Identified by Topographic Single Cell Sequencing. Cell 172, 205-217 e212, doi:10.1016/j.cell.2017.12.007 (2018).\n18. Lips, E. H. et al. Genomic analysis defines clonal relationships of ductal carcinoma in situ and recurrent invasive breast cancer. Nat Genet 54, 850–860, doi:10.1038/s41588-022-01082-3 (2022).\n19. Miron, A. et al. PIK3CA mutations in in situ and invasive breast carcinomas. Cancer Res 70, 5674-5678, doi:10.1158/0008-5472.CAN-08-2660 (2010).\n20. Yates, L. R. et al. Subclonal diversification of primary breast cancer revealed by multiregion sequencing. Nat Med 21, 751-759, doi:10.1038/nm.3886 (2015).\n21. Pareja, F. et al. Whole-Exome Sequencing Analysis of the Progression from Non-Low-Grade Ductal Carcinoma In Situ to Invasive Ductal Carcinoma. Clin Cancer Res 26, 3682-3693, doi:10.1158/1078-0432.CCR-19-2563 (2020).\n22. Trinh, A. et al. Genomic Alterations during the In Situ to Invasive Ductal Breast Carcinoma Transition Shaped by the Immune System. Mol Cancer Res 19, 623-635, doi:10.1158/1541-7786.MCR-20-0949 (2021).\n23. Poste, G. & Fidler, I. J. The pathogenesis of cancer metastasis. Nature 283, 139-146, doi:10.1038/283139a0 (1980).\n24. Greaves, M. & Maley, C. C. Clonal evolution in cancer. Nature 481, 306-313, doi:10.1038/nature10762 (2012).\n25. Kroigard, A. B. et al. Clonal expansion and linear genome evolution through breast cancer progression from pre-invasive stages to asynchronous metastasis. Oncotarget 6, 5634-5649, doi:10.18632/oncotarget.3111 (2015).\n26. Martelotto, L. G. et al. Whole-genome single-cell copy number profiling from formalin-fixed paraffin-embedded samples. Nat Med 23, 376-385, doi:10.1038/nm.4279 (2017).\n27. Walens, A. et al. Adaptation and selection shape clonal evolution of tumors during residual disease and recurrence. Nat Commun 11, 5017, doi:10.1038/s41467-020-18730-z (2020).\n28. Welter, L. et al. Treatment response and tumor evolution: lessons from an extended series of multianalyte liquid biopsies in a metastatic breast cancer patient. Cold Spring Harb Mol Case Stud 6, doi:10.1101/mcs.a005819 (2020).\n29. Maggrah, A. et al. Paired ductal carcinoma in situ and invasive breast cancer lesions in the D-loop of the mitochondrial genome indicate a cancerization field effect. Biomed Res Int 2013, 379438, doi:10.1155/2013/379438 (2013).\n30. Desmedt, C. et al. Uncovering the genomic heterogeneity of multifocal breast cancer. J Pathol 236, 457-466, doi:10.1002/path.4540 (2015).\n31. Visser, L. L. et al. Discordant Marker Expression Between Invasive Breast Carcinoma and Corresponding Synchronous and Preceding DCIS. Am J Surg Pathol 43, 1574-1582, doi:10.1097/PAS.0000000000001306 (2019).\n32. McCrorie, A. D. et al. Multifocal breast cancers are more prevalent in BRCA2 versus BRCA1 mutation carriers. J Pathol Clin Res 6, 146-153, doi:10.1002/cjp2.155 (2020).\n33. Sontag, L. & Axelrod, D. E. Evaluation of pathways for progression of heterogeneous breast tumors. J Theor Biol 232, 179-189, doi:10.1016/j.jtbi.2004.08.002 (2005).\n34. Mai, K. T. Morphological evidence for field effect as a mechanism for tumour spread in mammary Paget’s disease. Histopathology 35, 567-576, doi:10.1046/j.1365-2559.1999.00788.x (1999).\n35. Foschini, M. P. et al. Genetic clonal mapping of in situ and invasive ductal carcinoma indicates the field cancerization phenomenon in the breast. Hum Pathol 44, 1310-1319, doi:10.1016/j.humpath.2012.09.022 (2013).\n36. Asioli, S., Morandi, L., Cavatorta, C., Cucchi, M. C. & Foschini, M. P. The impact of field cancerization on the extent of duct carcinoma in situ (DCIS) in breast tissue after conservative excision. Eur J Surg Oncol 42, 1806-1813, doi:10.1016/j.ejso.2016.07.005 (2016).\n37. Tan, M. P. Integration of ’sick lobe hypothesis’ with concept of field cancerisation for a personalised surgical margin for breast conserving surgery. J Surg Oncol 116, 954-955, doi:10.1002/jso.24728 (2017).\n38. Going, J. J. & Mohun, T. J. Human breast duct anatomy, the ’sick lobe’ hypothesis and intraductal approaches to breast cancer. Breast Cancer Res Treat 97, 285-291, doi:10.1007/s10549-005-9122-7 (2006).\n39. Tot, T. The theory of the sick breast lobe and the possible consequences. Int J Surg Pathol 15, 369-375, doi:10.1177/1066896907302225 (2007).\n40. Dooley, W., Bong, J. & Parker, J. Redefining lumpectomy using a modification of the \"sick lobe\" hypothesis and ductal anatomy. Int J Breast Cancer 2011, 726384, doi:10.4061/2011/726384 (2011).\n41. Tan, M. P. & Tot, T. The sick lobe hypothesis, field cancerisation and the new era of precision breast surgery. Gland Surg 7, 611-618, doi:10.21037/gs.2018.09.08 (2018).\n42. Petrova, S. C. et al. Regulation of breast cancer oncogenesis by the cell of origin’s differentiation state. Oncotarget 11, 3832-3848, doi:10.18632/oncotarget.27783 (2020).\n43. Knudson, A. G., Jr. Heredity and human cancer. Am J Pathol 77, 77-84 (1974).\n44. Park, S., Supek, F. & Lehner, B. Systematic discovery of germline cancer predisposition genes through the identification of somatic second hits. Nat Commun 9, 2601, doi:10.1038/s41467-018-04900-7 (2018).\n45. Konishi, H. et al. Mutation of a single allele of the cancer susceptibility gene BRCA1 leads to genomic instability in human breast epithelial cells. Proc Natl Acad Sci U S A 108, 17773-17778, doi:10.1073/pnas.1110969108 (2011).\n46. Mazzola, E., Cheng, S. C. & Parmigiani, G. The penetrance of ductal carcinoma in situ among BRCA1 and BRCA2 mutation carriers. Breast Cancer Res Treat 137, 315-318, doi:10.1007/s10549-012-2345-5 (2013).\n47. Tegze, B. et al. Parallel evolution under chemotherapy pressure in 29 breast cancer cell lines results in dissimilar mechanisms of resistance. PLoS One 7, e30804, doi:10.1371/journal.pone.0030804 (2012).\n48. Gao, Y. et al. Single-cell sequencing deciphers a convergent evolution of copy number alterations from primary to circulating tumor cells. Genome Res 27, 1312-1322, doi:10.1101/gr.216788.116 (2017).\n49. Wang, F. et al. MEDALT: single-cell copy number lineage tracing enabling gene discovery. Genome Biol 22, 70, doi:10.1186/s13059-021-02291-5 (2021).\n50. Brommesson, S. et al. Tiling array-CGH for the assessment of genomic similarities among synchronous unilateral and bilateral invasive breast cancer tumor pairs. BMC Clin Pathol 8, 6, doi:10.1186/1472-6890-8-6 (2008).\n51. Regitnig, P., Ploner, F., Maderbacher, M. & Lax, S. F. Bilateral carcinomas of the breast with local recurrence: analysis of genetic relationship of the tumors. Mod Pathol 17, 597-602, doi:10.1038/modpathol.3800089 (2004).\n52. Ma, X. J. et al. Gene expression profiles of human breast cancer progression. Proc Natl Acad Sci U S A 100, 5974-5979, doi:10.1073/pnas.0931261100 (2003).\n53. Porter, D. et al. Molecular markers in ductal carcinoma in situ of the breast. Mol Cancer Res 1, 362-375 (2003).\n54. Castro, N. P. et al. Evidence that molecular changes in cells occur before morphological alterations during the progression of breast ductal carcinoma. Breast Cancer Research 10, doi:ARTN R87 10.1186/bcr2157 (2008).\n55. Dettogni, R. S. et al. Potential biomarkers of ductal carcinoma in situ progression. BMC Cancer 20, 119, doi:10.1186/s12885-020-6608-y (2020).\n56. Song, G. et al. Identification of aberrant gene expression during breast ductal carcinoma in situ progression to invasive ductal carcinoma. J Int Med Res 48, 300060518815364, doi:10.1177/0300060518815364 (2020).\n57. Abba, M. C. et al. Transcriptomic changes in human breast cancer progression as determined by serial analysis of gene expression. Breast Cancer Res 6, R499-513, doi:10.1186/bcr899 (2004).\n58. Schuetz, C. S. et al. Progression-specific genes identified by expression profiling of matched ductal carcinomas in situ and invasive breast tumors, combining laser capture microdissection and oligonucleotide microarray analysis. Cancer Res 66, 5278-5286, doi:10.1158/0008-5472.CAN-05-4610 (2006).\n59. Lee, S. et al. Differentially expressed genes regulating the progression of ductal carcinoma in situ to invasive breast cancer. Cancer Res 72, 4574-4586, doi:10.1158/0008-5472.CAN-12-0636 (2012).\n60. Coradini, D., Boracchi, P., Ambrogi, F., Biganzoli, E. & Oriana, S. Cell polarity, epithelial-mesenchymal transition, and cell-fate decision gene expression in ductal carcinoma in situ. Int J Surg Oncol 2012, 984346, doi:10.1155/2012/984346 (2012).\n61. Knudsen, E. S. et al. Progression of ductal carcinoma in situ to invasive breast cancer is associated with gene expression programs of EMT and myoepithelia. Breast Cancer Res Treat 133, 1009-1024, doi:10.1007/s10549-011-1894-3 (2012).\n62. Krstic, M. et al. TBX3 promotes progression of pre-invasive breast cancer cells by inducing EMT and directly up-regulating SLUG. Journal of Pathology 248, 191-203, doi:10.1002/path.5245 (2019).\nCitation Format: Jelle Wesseling. Clonal evolution of DCIS to invasion [abstract]. In: Proceedings of the 2022 San Antonio Breast Cancer Symposium; 2022 Dec 6-10; San Antonio, TX. Philadelphia (PA): AACR; Cancer Res 2023;83(5 Suppl):Abstract nr F1-2.",
        "link": "http://dx.doi.org/10.1158/1538-7445.sabcs22-f1-2"
    },
    {
        "id": 6323,
        "title": "AN ATTEMPT AT MODEL-BASED TUNNEL ROCK CLASSIFICATION USING SEISMIC VELOCITY AND RESISTIVITY DATA",
        "authors": "Toru TAKAHASHI",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.52"
    },
    {
        "id": 6324,
        "title": "NUMERICAL EXPERIMENTS FOR TUNNEL TOMOGRAPHY USING FULL WAVE INVERSION",
        "authors": "Toru KUWAHARA, Koichi OKUZAWA, Nobuto YAMADA, Rei SATO",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_1"
    },
    {
        "id": 6325,
        "title": "STUDY ON THE EFFECT OF APPLYING THE LIMIT STATE DESIGN METHOD TO SHIELD TUNNELS",
        "authors": "Kenichi ANAN, Masahiro YOSHIMOTO",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_67"
    },
    {
        "id": 6326,
        "title": "VISCO-ELASTO-PLASTIC MODEL FOR SWELLING AND SQUEEZING GROUND FOR DEFORMED TUNNEL",
        "authors": "Yuzo OKUI, Kazuo NISHIMURA, Nobuharu ISAGO",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_1"
    },
    {
        "id": 6327,
        "title": "A STUDY ON ASEISMIC DESIGN METHOD OF THE BRACED EXCAVATION",
        "authors": "Akira SUZUKI, Kenichi KOJIMA, Michinori HONDA, Seiji NISHIYAMA",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_41"
    },
    {
        "id": 6328,
        "title": "PUNCHING TEST TO EARLY-AGE BASE CONCRETE AND ITS DISCRETE ELEMENT SIMULATION",
        "authors": "Naotaka KIKKAWA, Nobutaka HIRAOKA, Kazuya ITOH",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.56"
    },
    {
        "id": 6329,
        "title": "STUDY ON LOAD RESISTANCE CAPACITY OF REINFORCEMENT FOR SHIELD TUNNEL",
        "authors": "Katsuharu SATO, Daiki KAGA, Masahiro YOSHIMOTO, Kenichi ANAN",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_49"
    },
    {
        "id": 6330,
        "title": "A STUDY ON THERMAL ANALYSIS FOR INITIAL CRACK PREDICTION OF LINING CONCRETE",
        "authors": "Akihiko NAKAMURA, Mitsuo KUNICHIKA, Hideaki NAKAMURA",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.i_18"
    },
    {
        "id": 6331,
        "title": "CRACK WIDTH MEASUREMENT USING MULTISCALE LOG KERNEL",
        "authors": "Kenji KAGITANI, Koji OSHIKIRI, Taro KIKUCHI, Shou MAKINO, Yoshito SEINO, Satoshi TOMOTO",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.i_30"
    },
    {
        "id": 6332,
        "title": "STUDY ON LOAD RESISTANCE CAPACITY OF REPAIRED SHIELD TUNNEL",
        "authors": "Katsuharu SATO, Daiki KAGA, Masahiro YOSHIMOTO, Kenichi ANAN, Motoi IWANAMI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_59"
    },
    {
        "id": 6333,
        "title": "PREDICTING SEISMIC VELOCITY DISTRIBUTION AHEAD OF TUNNEL FACE USING DRILL VIBRATION OF HYDRAULIC DRILLING MACHINE",
        "authors": "Koji TSUKAMOTO, Masato SHINJI",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_46"
    },
    {
        "id": 6334,
        "title": "IMPORTANCE OF INITIAL DISPLACEMENT MONITORING AND ITS APPLICATION TO HIGH OVERBURDEN TUNNELING",
        "authors": "Takeshi SATO, Fumiharu NAKAHARA, Tomoyuki AOKI, Kiyoshi KISHIDA",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_17"
    },
    {
        "id": 6335,
        "title": "ADVANCED PREDICTION OF TUNNEL INFLOW USING VIRTUAL DRAIN MODEL",
        "authors": "Kenichi HOSONO, Tsuyoshi FUKUDA, Akira FUJINO, Takeshi EJIMA, Akihiko WAKAI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_1"
    },
    {
        "id": 6336,
        "title": "[RETRACTED] F1 Keto ACV Gummies Reviews 100% Clinically Certified Ingredients?F1 Keto ACV Gummies Weight Loss F1 Keto ACV Gummies v1",
        "authors": "fhvdvf not provided",
        "published": "No Date",
        "citations": 0,
        "abstract": "[RETRACTED]Thusly, that is the explanation goes without food aren't supporting individuals to decrease more weight. ",
        "link": "http://dx.doi.org/10.17504/protocols.io.bp2l616xzvqe/v1"
    },
    {
        "id": 6337,
        "title": "PROPOSAL OF STRUCTURAL ANALYSIS METHOD FOR CIRCULAR DEEP SHAFT WITH OPENING FOR SHIELD TUNNEL",
        "authors": "Tetsuji YAMAGUCHI, Takahiro ITANO, Motoi IWANAMI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_21"
    },
    {
        "id": 6338,
        "title": "STUDY ON IMPLEMENTATION OF LARGE-SCALE RADIAL GROUND FREEZING",
        "authors": "Yuichi TANAKA, Nobuyuki TAKAMATSU, Takehiro OOSE, Yoshihiro HIBINO, Takayuki SHIMIZU",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_30"
    },
    {
        "id": 6339,
        "title": "DETECTION OF INTERNAL DEFECTS IN SHOTCRETE SPECIMENS BY NONCONTACT ACOUSTIC DETECTION METHOD",
        "authors": "Tsuneyoshi SUGIMOTO, Kazuko SUGIMOTO, Hitoshi TAKAGI, Chitose KURODA",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.2_i_26"
    },
    {
        "id": 6340,
        "title": "STUDY ON APPLICATION OF SIMPLE DUST SENSOR TO TUNNEL CONSTRUCTION SITE",
        "authors": "Koshiro KAKEYA, Hisashi HAYASHI, Teruhito OTSUKA, Kenji NAKAMURA, Masato SHINJI",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_12"
    },
    {
        "id": 6341,
        "title": "DETECTION OF BUGHOLES OF TUNNEL LINING CONCRETE BY USING THE IMAGE WITH COLOR FILTERS",
        "authors": "Kenta OKAMOTO, Huatao HUANG, Sadatoshi OHMORI, Isamu YOSHITAKE",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.2_i_19"
    },
    {
        "id": 6342,
        "title": "EVALUATION OF EXCAVATION DAMAGED ZONE BY OPTICAL MEASUREMENT IN HORONOBE UNDERGROUND RESEARCH LABORATORY",
        "authors": "Koji HATA, Sumio NYUNOYA, Kazuhei AOYAGI, Nobukatsu MIYARA",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.2_i_29"
    },
    {
        "id": 6343,
        "title": "EVALUATION METHOD OF CRACK PROPAGATION OF TUNNEL LINING VALIDATION",
        "authors": "Shinobu KAISE, Tetsuo ITO, Hiroshi YAGI, Maresuke MIZUNO, Kouki MAEDA, Masato SHINJI",
        "published": "2017",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_10"
    },
    {
        "id": 6344,
        "title": "Multi Scale aided Deep Learning model for High F1-score classification of fundus images based Diabetic Retinopathy and Glaucoma",
        "authors": "G R S Naga Kumar, Raja Sekhar Sankuri, Sri Phani Krishna Karri",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ic2e357697.2023.10262434"
    },
    {
        "id": 6345,
        "title": "FINITE ELEMENT ANALYSIS METHOD FOR SHIELD TUNNEL CONSIDERING INFLUENCE OF CORROSION OF SEGMENT JOINT",
        "authors": "Kaho KINOSHITA, Takashi USHIDA, Kiwamu TSUNO, Akira HOSODA",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_88"
    },
    {
        "id": 6346,
        "title": "DEVELOPMENT OF OPTIMAL MANAGEMENT SYSTEM FOR SHOTCRETE THICKNESS OF TUNNEL FACE USING LOGISTIC REGRESSION",
        "authors": "Yasuyuki MIYAJIMA, Hayato TOBE, Kei YAMASHITA, Harushige KUSUMI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_102"
    },
    {
        "id": 6347,
        "title": "TRAPDOOR CENTRIFUGE TEST ON PROPAGATION OF SAND GROUND DISPLACEMENT AND ITS EFFECT OF GROUND RESISTANCE",
        "authors": "Hiroki ASAKURA, Jiro TAKEMURA, Kazuhide YASHIRO",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.2_i_16"
    },
    {
        "id": 6348,
        "title": "DETERIORATION PREDICTION METHOD BASED ON BRINE FLOW IN GROUND FOR UNDERGROUND STRUCTURE NEAR TIDAL RIVER",
        "authors": "Takashi USHIDA, Takashi NAKAYAMA, Kenjiro TERADA",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_132"
    },
    {
        "id": 6349,
        "title": "Cover Art",
        "authors": "",
        "published": "2023-9-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/mictod/qaad067"
    },
    {
        "id": 6350,
        "title": "VERIFICATION ON QUANTITATIVE HEALTH MONITORING METHOD OF TUNNEL CONCRETE LINING",
        "authors": "Shinobu KAISE, Tetsuo ITO, Hiroshi YAGI, Maresuke MIZUNO, Kouki MAEDA, Masato SHINJI",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.1"
    },
    {
        "id": 6351,
        "title": "STUDY FOR EFFICIENCY OF SEISMIC DESIGN IN SEWAGE PIPE RENEWAL METHOD",
        "authors": "Kunio SAKOU, Atsushi HONNAMI, Jun WADA, Kazunori HINO, Katsumi SUGIMOTO",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_49"
    },
    {
        "id": 6352,
        "title": "Cover Art",
        "authors": "",
        "published": "2023-11-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/mictod/qaad082"
    },
    {
        "id": 6353,
        "title": "Cover Art",
        "authors": "",
        "published": "2023-7-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/mictod/qaad047"
    },
    {
        "id": 6354,
        "title": "EFFICIENCY OF FREEZE EXPANSION PRESSURE REDUCTION METHODS BY ABSORBING FREEZE EXPANSION DISPLACEMENT AND ITS REASONABLE SELECTION METHOD",
        "authors": "Hiroshi OGURA, Shunji KANIE, Hisao IZUTA",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_85"
    },
    {
        "id": 6355,
        "title": "INHIBITION EFFECT OF A NEW SHAPE INVERT THAT PREVENTS FLOOR HEAVING AFTER COMPLETION",
        "authors": "Hiroaki KOBAYASHI, Hikaru UENO, Atsumi ISOGAI, Keisuke SHIMAMOTO, Kiyoshi KISHIDA",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.116"
    },
    {
        "id": 6356,
        "title": "EFFECT OF CONSTRUCTION FACTORS ON SURFACE DETERIORATION OF THE CROWN OF LINING CONCRETE",
        "authors": "Takahiro SAITO, Midori MEGURO, Chihhsuan CHANG, Kunikazu AZUMA, Mitsuyasu IWANAMI",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_99"
    },
    {
        "id": 6357,
        "title": "PROPOSAL OF PREDICTION METHOD OF TUNNEL EXCAVATION BEHAVIOR IN GRAVEL GROUND BY NUMERICAL ANALYSIS",
        "authors": "Hisashi HAYASHI, Daisuke SAKAI, Yasuyuki OKAZAKI, Shingo MORIMOTO, Masato SHINJI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_21"
    },
    {
        "id": 6358,
        "title": "PROPOSAL OF EVALUATION METHOD FOR LOAD-BEARING CAPACITY OF PERMANENT LINING IN MOUNTAIN TUNNELS",
        "authors": "Koki KIKUCHI, Atsushi KUSAKA, Nobuharu ISAGO, Toru SASAKI, Yoshitomo TATSUMI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.2_i_1"
    },
    {
        "id": 6359,
        "title": "RAMP SHIELD TUNNELING EFFECTS ON AN EXISTING PARALLEL TUNNEL WITH 3D SEPARATION VARIATIONS",
        "authors": "Keiichiro ENDO, Hirokazu AKAGI, Alireza AFSHANI, Hiroshi DOBASHI, Grant HASAN",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_60"
    },
    {
        "id": 6360,
        "title": "MODEL TEST AND TEST CONSTRUCTION REGARDING SPRAYED POLYUREA FOR SPALLING PREVENSION METHOD IN TUNNELS",
        "authors": "Keisuke SHIMAMOTO, Kazuhide YASHIRO, Yoshiteru KAWAKAMI, Masami KOSHIISHI, Kazunao IDE",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_21"
    },
    {
        "id": 6361,
        "title": "DEVELOPMENT OF VISUALIZATION SYSTEM FOR SOIL FLOW IN THE CHAMBER OF EPB SHIELD",
        "authors": "Atsushi KAGAWA, Shizuka KANNO, Yasushi ABE, Motohiro HIDAKA, Yukinobu KIMURA",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_61"
    },
    {
        "id": 6362,
        "title": "STUDY ON THE LOAD-BEARING CAPACITY OF PRECAST TUNNEL LINING BY MOUNTAIN TUNNELING METHOD",
        "authors": "Hideto MASHIMO, Yuuki INO, Kenji YOSHITAKE, Ryunosuke KASHIMA, Takehiro NATSUME",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.2_i_1"
    },
    {
        "id": 6363,
        "title": "Abstract F1-3: Defining recurrence risk for DCIS: How do we tailor therapy",
        "authors": "Kimberly Van Zee",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "Abstract\nIn tailoring treatment for DCIS, the goal is to avoid overtreatment while minimizing risk of recurrence. This necessitates estimation of recurrence risk and assessment of efficacy of each intervention in reducing risk. There are several clinicopathologic and treatment factors that have been proven in prospective trials to affect risk. These have been combined into a multivariable nomogram that estimates 10-year risk of recurrence (DCIS Nomogram). It is available online and free-of-charge, and has been validated in at least 5 independent populations with assessments of calibration and discrimination to assess its utility.\nThere have also been attempts to develop genomic predictors of risk. The Oncotype DCIS score originally was based on a purely genomic analysis, but was “refined” to include clinicopathologic factors. DCISionRT was initially created with the inclusion of clinicopathologic factors. Neither has been prospectively validated and neither has published any assessments of calibration and discrimination. It is unclear what proportion of either risk estimate is due to the inclusion of clinicopathologic factors vs the actual genomic analysis. Both cost thousands of dollars.\nFurthermore, neither the refined Oncotype DCIS score nor the DCISionRT score incorporates the use of endocrine therapy. Tamoxifen and aromatase inhibitors have been proven to reduce the risk of recurrence by about 30-50%, and their use should be expected to decrease risk of recurrence. Yet, neither score accounts for this fact, and therefore the risk predictions are too high for those that take endocrine therapy, and too low for those that do not.\nIn a sample of 59 women age ≥50 years old, with DCIS ≤2.5cm in size and clear margins, 10-year recurrence risk estimates from the DCIS Nomogram and refined Oncotype DCIS score (RDS) were compared. Overall, RDS risk estimates were in agreement (within 1-2% of the nomogram risk estimate range, calculated with and without the use of endocrine therapy) in 92% of cases. Among the 5 patients for which the Nomogram and RDS estimates disagreed, all had close margins (≤2mm). Close margins are associated with a statistically significant doubling of risk of recurrence. Nevertheless, the Oncotype DCIS score 10-year recurrence estimate was only 5-8% for these patients with close margins, while the Nomogram estimates were 11-14% (assuming use of endocrine therapy) or 21-27% (without endocrine therapy). From all published data, it seems clear that the refined Oncotype DCIS score markedly underestimates risk for those with close margins. And for those with clear margins, there was excellent (100%) agreement between the Nomogram and the refined Oncotype DCIS score.\nGiven the need for cost-based value in health care, and given the cost-free availability of a validated predictive online DCIS nomogram, rigorous evaluation of predictive accuracy and proof of significant added clinical benefit should be performed and made available before any new expensive commercially available test is adopted for clinical use.\nCitation Format: Kimberly Van Zee. Defining recurrence risk for DCIS: How do we tailor therapy [abstract]. In: Proceedings of the 2022 San Antonio Breast Cancer Symposium; 2022 Dec 6-10; San Antonio, TX. Philadelphia (PA): AACR; Cancer Res 2023;83(5 Suppl):Abstract nr F1-3.",
        "link": "http://dx.doi.org/10.1158/1538-7445.sabcs22-f1-3"
    },
    {
        "id": 6364,
        "title": "EVALUATION OF THE EFFECT OF RC SEGMENT CURVATURE ON REINFORCEMENT METHOD USING CONTINUOUS FIBER SHEETS",
        "authors": "Katsuharu SATO, Kenichi ANAN, Masahiro YOSHIMOTO, Motoi IWANAMI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_74"
    },
    {
        "id": 6365,
        "title": "WIND TUNNEL EXPERIMENTS ON DUST COLLECTION EFFICIENCY OF A MOUNTAIN TUNNEL UNDER CONSTRUCTION",
        "authors": "Kenji SAKAI, Daiki KOBAYASHI, Jumpei TANI, Shingo MORIMOTO, Masato SHINJI",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.15"
    },
    {
        "id": 6366,
        "title": "STUDY ON SUPPORT EFFECT OF EARLY CLOSURE METHOD OF MOUNTAIN TUNNEL BASED ON DATA OF CONSTRUCTION WORKS",
        "authors": "Kiyoto NAKANO, Atsushi MORITA, Kazuo NISHIMURA",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.7"
    },
    {
        "id": 6367,
        "title": "STUDY ON RATIONAL STRUCTURE FOR TUNNEL INVERT AS COUNTERMEASURES AGAINST HEAVING PHENOMENON",
        "authors": "Kiyoto NAKANO, Junichi ASAKA, Kazuo MIYAZAWA, Hiroyuki WATANABE, Tsuyoshi DOMON, Kazuo NISHIMURA",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.40"
    },
    {
        "id": 6368,
        "title": "INFRARED THERMOMETRY APPLICATION TO THE DETECTION OF VOID IN THE SUBWAY TUNNEL LINING SURFACE",
        "authors": "Koichi KAWAKAMI, Shinji KONISHI, Hideaki SHINOHARA, Masafumi KUBO, Hideaki KUROSU, Hirokazu AKAGI",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.25"
    },
    {
        "id": 6369,
        "title": "SIMULATION OF CHRONOLOGICAL CHANGE IN DUST CONCENTRATION DURING TUNNEL CONSTRUCTION BY UNSTEADY CFD ANALYSIS",
        "authors": "Koshiro KAKEYA, Hisashi HAYASHI, Mitsutoshi TAKAYA, Maromu YAMADA, Teruhito OTSUKA, Naotaka KIKKAWA, Masato SHINJI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_13"
    },
    {
        "id": 6370,
        "title": "STUDY ON THE EFFECT AND SIMPLE DESIGN METHOD OF REINFORCEMENT WORKS FOR DEFORMED MOUNTAIN TUNNELS IN SERVICE",
        "authors": "Kazuhide YASHIRO, Keisuke SHIMAMOTO, Yu OHARA, Masaki MIZUTANI",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_1"
    },
    {
        "id": 6371,
        "title": "TWO-DIMENSIONAL FRAME DESIGN METHOD IN CONSIDERATION OF OPENING WIDTH AT SIDE WALL OF EXISTING CUT-AND-COVER TUNNEL",
        "authors": "Hiroyuki MINAKAMI, Yasushi ARAI, Takashi NAKAYAMA, Kiwamu TSUNO",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_85"
    },
    {
        "id": 6372,
        "title": "PROPOSAL OF ANALYSIS METHOD FOR EVALUATING RISK OF FALLING ROCKS DUE TO UNEVENNESS OF TUNNEL FACE",
        "authors": "Yasuyuki OKAZAKI, Hisashi HAYASHI, Yudai TSUDA, Daichi TAMURA, Koichi AOKI, Masato SHINJI",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_92"
    },
    {
        "id": 6373,
        "title": "CRACK-INDUCING CHARACTERISTICS AND CRACK CONTROL EFFECT IN LINING CONCRETE DUE TO CRACK-INDUCING JOINT FORMATION",
        "authors": "Takahiro SAITO, Hajime HAMADA, Midori MEGURO, Nobuhiro CHIJIWA, Mitsuyasu IWANAMI",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_40"
    },
    {
        "id": 6374,
        "title": "ESTIMATION OF FLOOR HEAVE MECHANISM OF ROCK TUNNELS FOCUSED ON THE CHANGE IN WATER CONTENT",
        "authors": "Keisuke SHIMAMOTO, Takeshi KAWAGOE, Kazuhide YASHIRO, Hiroaki KOBAYASHI, Atsumi ISOGAI",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_34"
    },
    {
        "id": 6375,
        "title": "Гетерозисные F1 гибриды кабачка",
        "authors": "A.V. Medvedev, S.V. Kuzmin, A.V. Tikhonova, A.F. Bukharov",
        "published": "2019-5-7",
        "citations": 0,
        "abstract": "Проведено изучение линий и гибридных комбинаций кабачка селекции Крымской ОСС – филиала ВИР. Выявлены линии с высокой общей комбинационной способностью по общей урожайности – Ар3 и Бл12 и по ранней урожайности – К5 и Бл12. В результате сортоиспытания новых гетерозисных\nF1 гибридов кабачка выделены образцы с высокой урожайностью, выше 50 т/га (F1 Ар3 × Д1, F1 Бл12 × Д1, F1 Бл12 × Ар3), устойчивостью к мучнистой росе и ВОМ-1 (F1 Ар3 × Д1) и другими хозяйственно ценными свойствами.The study of the lines and hybrid combinations of the vegetable marrow breeding branch of the Krymsk EBS – ARRIP Branch is conducted. Lines with a high overall combining ability were revealed for the total yield – the line Аr3 and Bl12 and for the early yield – К5 and Bl12 are ascertained. As a result of varietal testing new F1 hybrids of the vegetable marrow, samples with high yields, above 50 t/ha (F1 Ar3 × D1, F1 Bl12 × D1, F1 Bl12 × Ap3), powdery mildew resistance and CMV-1 (F1 Ar3 × D1), other economically valuable properties were allocated.",
        "link": "http://dx.doi.org/10.25630/pav.2019.49.75.009"
    },
    {
        "id": 6376,
        "title": "POSSIBILITY ON SUBSTITUTION CLOSE VISUAL INSPECTION FOR IMAGING TECHNOLOGY TO TUNNEL LINING HEALTH MONITORING",
        "authors": "Shinobu KAISE, Tetsuo ITO, Yoshikatsu MAEDA, Hiroshi YAGI, Kouki MAEDA, Masato SHINJI",
        "published": "2020",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_62"
    },
    {
        "id": 6377,
        "title": "Z-Score",
        "authors": "Courtney McKim",
        "published": "2022-5-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4324/9780367198459-reprw155-1"
    },
    {
        "id": 6378,
        "title": "DEVELOPMENT AND VERIFICATION OF A SEISMIC SURVEY METHOD AHEAD OF THE TUNNEL FACE USING DRILLING VIBRATION DATA OF ULTRA-LONG CONTROLLED BORING",
        "authors": "Masahito YAMAGAMI, Yoshiaki YAMANAKA, Toru TAKAHASHI",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.26"
    },
    {
        "id": 6379,
        "title": "CONSIDERATION ON MAIN TUNNEL BEHAVIOR AND DESIGN INDEX OF DRIFT WHEN APPLYING THE CENTER DRIFT ADVANCED METHOD",
        "authors": "Sadatoshi OHMORI, Tadashi OKABE, Ayako GOMI, Nobuharu ISAGO",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_1"
    },
    {
        "id": 6380,
        "title": "INDEX FOR EVALUATING SOUNDNESS AGAINST LINING CONCRETE SPALLING",
        "authors": "Naotoshi YASUDA, Yoshinori SHIMADA, Shigeo EMOTO, Michihiro KANEDA, Koji TANAKA, Manabu TAKEOKA, Nobutaka ISHIDA, Norikazu MISAKI, Yoshiaki OKA, Eiichi OKETANI",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_32"
    },
    {
        "id": 6381,
        "title": "STUDY ON IMPROVEMENTS OF EVALUTATION AND CALCLATION OF TUNNEL-LINING CRACK INDEX (TCI) FOR ASSESS THE HEALTH MONITORING OF TUNNEL LINING",
        "authors": "Ayaka KITAMURA, Shingo MORIMOTO, Masato SHINJI",
        "published": "2019",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.1"
    },
    {
        "id": 6382,
        "title": "APPLICABLE RANGE OF INCLINATION MONITORING METHOD FOR PREDICTION OF GEOTECHNICAL CONDITION AHEAD OF TUNNEL FACE AND ITS QUANTITATIVE EVALUATION",
        "authors": "Kazuo SAKAI, Takuya TANI, Tomoyuki AOKI, Kiyoshi KISHIDA",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.1_76"
    },
    {
        "id": 6383,
        "title": "STUDY ON MEASURES TO RESTRAIN THERMAL CRACKS AND IMPROVE SURFACE QUALITY OF TUNNEL ENTRANCE CONCRETE LINING",
        "authors": "Seishi SHIRAIWA, Hirohiko KURIHARA, Ryota MISAWA, Toru TSUCHIYA, Masami KAWANAKA",
        "published": "2017",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_32"
    },
    {
        "id": 6384,
        "title": "EVALUATION OF VERTICAL EFFECTIVE EARTH PRESSURE FOR SHIELD SEGMENT DESIGN IN MEDIUM STIFF CLAY",
        "authors": "Yoshihiro ITO, Saeko SHINOGUCHI, Shigeaki OKA, Alireza AFSHANI, Shunsuke KANEKO, Jin SAITO, Hirokazu AKAGI",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.77.2_i_44"
    },
    {
        "id": 6385,
        "title": "IDENTIFYING ANISOTROPIC IN SITU STRESS CONDITION AND ITS IMPACT ON DISPLACEMENT PROFILES FOR TUNNELING WITH HIGH OVERBURDEN",
        "authors": "Takeshi SATO, Fumiharu NAKAHARA, Tomoyuki AOKI, Weiren LIN, Kiyoshi KISHIDA",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_55"
    },
    {
        "id": 6386,
        "title": "LONG TERM PREDICTION OF VERTICAL EARTH PRESSURE LOADING ON A SHIELD TUNNEL IN SOFT CLAY GROUND",
        "authors": "Shigeaki OKA, Yoshihiro ITO, Ayaka YOKOTA, Jin SAITO, Shunsuke KANEKO, Hirokazu Akagi",
        "published": "2017",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.73.i_75"
    },
    {
        "id": 6387,
        "title": "STUDY ON MOUNTAIN TUNNELS WATER-REDUCING MEASURES AND TUNNEL BEHAVIORS BY POST GROUTING",
        "authors": "Tsuyoshi NAKADE, Masabumi SUZUKI, Hitoshi TEZUKA, Nobuyoshi KOTAJIMA, Masahiro KATAYAMA, George KISANUKI, Makoto NISHIGAKI",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.75"
    },
    {
        "id": 6388,
        "title": "CONSIDERATION ABOUT CRACK OF TUNNEL LINING CONCRETE DUE TO MATERIALS AND CONSTRUCTION METHODS",
        "authors": "Maresuke MIZUNO, Yoshikatsu MAEDA, Shinobu KAISE, Satoshi TSUCHIYA, Shigeru MATSUOKA, Tetsuya ISHIDA, Kazuo NISHIMURA",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.88"
    },
    {
        "id": 6389,
        "title": "目次",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2512/jspm.18.f1"
    },
    {
        "id": 6390,
        "title": "Гибрид F1 Герцогиня – реальный пример импортозамещения",
        "authors": "G.A. Kostenko",
        "published": "2019-2-7",
        "citations": 0,
        "abstract": "Отечественный гибрид капусты белокочанной\nF1 Герцогиня, успешно выращивают как в лучших хозяйствах Московской области, так и в простых фермерских хозяйствах в других регионах РФ. Его урожайность достигает 100 т/га, кочаны обладают высокой товарностью и стандартностью. Гибрид имеет повышенную адаптивность, положительно реагирует на внесение минеральных удобрений и характеризуется отличной лежкостью при зимне-весеннем хранении. При этом он обладает устойчивостью к комплексу болезней в период вегетации и при хранении. Сегодня это один из лучших конкурентоспособных отечественных гибридов.Domestic hybrid of cabbage Gertsoginya is successfully grown in the best enterprises of the Moscow region, and in simple farms in other regions of the Russian Federation. Its yield reaches 100 t/ha, heads have high marketability and standard. The hybrid has increased adaptability, responds positively to the application of mineral fertilizers and is characterized by excellent keeping quality during winter and spring storage. At the same time, it is resistant to a complex of diseases during the growing season and during storage. Today it is one of the best competitive domestic hybrids.",
        "link": "http://dx.doi.org/10.25630/pav.2019.13.2.009"
    },
    {
        "id": 6391,
        "title": "NON-CONTACT SOUNDNESS EVALUATION FOR CONCRETE STRUCTURES BY LASER SENSING SYSTEM",
        "authors": "Naotoshi YASUDA, Norikazu MISAKI, Yoshinori SHIMADA, Shigeo EMOTO, Michihiro KANEDA, Manabu TAKEOKA, Koji TANAKA, Nobutaka ISHIDA, Yoshihisa TAKAYAMA, Toshitaka SOGA",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.58"
    },
    {
        "id": 6392,
        "title": "Issue cover January 2024",
        "authors": "",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1093/mictod/qaad103"
    },
    {
        "id": 6393,
        "title": "DETECTION OF THE END POINT OF THE CHANNEL IN IMPROVEMENT BODY AFTER CHEMICAL GROUTING USING ELECTRICAL RESISTIVITY MONITORING BY THE TIME-LAPSE ANALYSIS METHOD",
        "authors": "Tomoaki SHIMIZU, Hiroyuki AZUMA, Yoshiya ODA",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.2_i_34"
    },
    {
        "id": 6394,
        "title": "PROPOSAL AND VERIFICATION OF SEGMENT DESIGN METHOD CONSIDERING CONSTRUCTION LOAD AT SHIELD CURVE PART UNDER LARGE DEPTH AND HIGH WATER PRESSURE OF THE SHIELD TUNNELING",
        "authors": "Masayuki MATUURA, Jun SUGIYAMA, Yasushi NISHINO",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.74.i_40"
    },
    {
        "id": 6395,
        "title": "目次",
        "authors": "",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2512/jspm.17.f1"
    },
    {
        "id": 6396,
        "title": "PREDICTING FINANCIAL DISTRESS USING ALTMAN SCORE, GROVER SCORE, SPRINGATE SCORE, ZMIJEWSKI SCORE (CASE STUDY ON CONSUMER GOODS COMPANY)",
        "authors": ". Hantono",
        "published": "2019-5-7",
        "citations": 1,
        "abstract": "This study aims to detect the financial distress on consumer goods companies listing on the Indonesia Stock Exchange 2013-2017 by using altman score, grover score, springate score, zmijewski score.The object of this study is all consumer goods companies listing on the Indonesia Stock Exchange which publishes audited financial statements for fiscal year 2013 - 2017, which amounted to 24 (twenty four) companies. The sampling technique is by using purposive sampling method where the sample is determined based on certain criteria determined by the researcher and has limitations in terms of generalization. The sample of research is 42 (fourty two companies) Data collection method using documentation method Data analysis technique used is descriptive qualitative analysis using altman score, grover score, springate score, zmijewski score..Keywords:   altman score, grover score, springate score, zmijewski score, financial distressJEL Classification: G10, G33",
        "link": "http://dx.doi.org/10.32400/ja.24056.8.01.2019.1-16"
    },
    {
        "id": 6397,
        "title": "VERIFICATION OF STRESS RELEASE RATE OF 2D NUMERICAL ANALYSIS AGAINST FULL FACE METHOD USING IMMEDIATELY RING CLOSURE",
        "authors": "Kazuhiko MAEGAWA, Hiroshi YAGI, Tetsuo ITO, Shogo KUNIMURA, Yuzo OKUI, Hiroshi KUWASHIMA, Yujing JIANG",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.78.1_26"
    },
    {
        "id": 6398,
        "title": "ESTIMATION OF ADDITIONAL LOAD ON A SHIELD TUNNEL DUE TO GROUND SWELLING BY THE RECOVER OF GROUNDWATER LEVEL",
        "authors": "Shigeaki OKA, Wei LI, Yoshihiro ITO, Shunsuke KANEKO, Jin SAITO, Hirokazu AKAGI",
        "published": "2019",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.75.2_i_20"
    },
    {
        "id": 6399,
        "title": "THE STUDY ON ANALYSIS OF CRACK PROGRESSION OF TUNNEL LINING BASED ON CONTRIBUTIONS OF CRACK WIDTHS AND ITS LENGTHS BY USING TCI",
        "authors": "Haruna AIO, Takashi NAKAMURA, Satoshi KURASHIGE, Hisashi HAYASHI, Masato SHINJI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_79"
    },
    {
        "id": 6400,
        "title": "LONG TERM ADDITIONAL LOAD ON A SHIELD TUNNEL IN SOFT CLAY DUE TO CLAY CONSOLIDATION WITH WATER LEAKAGE",
        "authors": "Shigeaki OKA, Yoshihiro ITO, Wei LI, Alireza AFSHANI, Shunsuke KANEKO, Jin SAITO, Hirokazu AKAGI",
        "published": "2020",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2208/jscejte.76.1_49"
    }
]