[
    {
        "id": 34305,
        "title": "Optimasi Parameter Artificial Neural Network (ANN) Menggunakan Particle Swarm Optimization (PSO) Untuk Pengkategorian Nasabah Bank",
        "authors": "Lennox Larwuy",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Artificial Neural Network (ANN), also known as Jaringan Saraf Tiruan, is one of the methods commonly used for pattern recognition, classification, forecasting, and regression, depending on the problem or data used. While the results obtained are generally good, there are often issues with determining the initial parameters as the initial weights, which can lead to non-convergence of results. This is why a method is needed to optimize the ANN parameters to achieve better outcomes. Particle Swarm Optimization (PSO) was chosen as the method to optimize the ANN parameters (PSO-ANN). The best parameter values for PSO were predefined, with w (inertia weight) set to 0.8 and c1 and c2 (acceleration coefficients) set to 1.5. Subsequently, PSO-ANN was trained using a bank customer dataset to determine the categories of customers with credit problems or not. The results were compared with using ANN without parameter optimization. The obtained results showed an Accuracy rate of 82.6%, Precision of 91.1%, and Recall of 37.1%. This represents an improvement compared to the results of ANN without parameter optimization, which had an Accuracy rate of 80.1%, Precision of 89.5%, and Recall of 32.4%.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33772/jmks.v3i3.60"
    },
    {
        "id": 34306,
        "title": "Prediksi Indeks Prestasi Komulatif Mahasiswa berdasarkan Nem dengan Menggunakan Algoritma Neural Network Berbasis Particle Swarm Optimization",
        "authors": " Muhamad Ziaul Haq,  Nursalim",
        "published": "2023-2-13",
        "citations": 0,
        "abstract": "Proses Penerimaan Mahasiswa Baru (PMB) pada berbagai perguruan tinggi di Indonesia baik itu perguruan tinggi negeri ataupun swasta melakukan seleksi terhadap calon mahasiswanya dengan melihat pada Nilai Ebtanas Murni (NEM). Guna menganalisis hubungan antara nilai NEM calon mahasiswa dengan prestasi akademik yang dicapai di STMIK Adhi Guna (dalam hal ini digunakan indeks prestasi kumulatif (IPK) dengan analisis korelasi dan regresi linier ganda. Variabel penelitian yang digunakan adalah hasil IPK kelulusan mahasiswa sebagai variabel dependen (terikat), dan nilai mata pelajaran Bahasa Indonesia, Bahasa Inggris, dan Matematika sebagai variabel independent (bebas). Penelitian ini menggunakan 2 algoritma yang berbeda yaitu Neural Network (NN) dan Particle Swarm Optimization (PSO) untuk membandingkan hasil dan mencari tingkat akurasi terbaik diantara kedua algoritma tersebut. Dari penelitian yang telah dilakukan dapat disimpulkan bahwa Neural Network berbasis Particle Swarm Optimization adalah algoritma yang paling baik dibandingkan dengan Neural Network untuk mengukur tingkat korelasi antara NEM dan Indeks Prestasi Kumulatif (IPK) mahasiswa. Neural Network pada penelitian ini menghasilkan akurasi terkecil 0,214 dengan Time = 4 s. Neural Network berbasis PSO menghasilkan akurasi terkecil 0,132.",
        "keywords": "",
        "link": "http://dx.doi.org/10.56338/jks.v6i2.3303"
    },
    {
        "id": 34307,
        "title": "Fault Diagnosis of Power Electronic Circuits Based on Improved Particle Swarm Optimization Algorithm Neural Network",
        "authors": "",
        "published": "2023-8-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5152/electrica.2022.21180"
    },
    {
        "id": 34308,
        "title": "Optimization of Petrochemical Port Safety Monitoring Network Layout Based on Particle Swarm Optimization Algorithm",
        "authors": "Di Cui, Guoqing Sun, Yun Li",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245434"
    },
    {
        "id": 34309,
        "title": "Retracted: Training a Feedforward Neural Network Using Hybrid Gravitational Search Algorithm with Dynamic Multiswarm Particle Swarm Optimization",
        "authors": "BioMed Research International",
        "published": "2024-3-20",
        "citations": 0,
        "abstract": "",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2024/9783980"
    },
    {
        "id": 34310,
        "title": "Calculation of Neural Network Weights and Biases Using Particle Swarm Optimization",
        "authors": "Jerin Paul Selvan, Girish Pandurang Potdar",
        "published": "2024-1-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023059190"
    },
    {
        "id": 34311,
        "title": "Optimization of Steam Power System Operation Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Bei Li",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245642"
    },
    {
        "id": 34312,
        "title": "Multi-Objective Optimization Scheduling of Microgrids Based on Particle Swarm Optimization Algorithm",
        "authors": "Gang Luo, Yu Mei",
        "published": "2023-9-1",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276161"
    },
    {
        "id": 34313,
        "title": "Optimization Algorithm Design of Computer Network Connection Enhancement Based on Particle Swarm Optimization",
        "authors": "Guan Zhicong",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci57876.2023.10176792"
    },
    {
        "id": 34314,
        "title": "An Examination of Dynamic Group Particle Swarm Optimization - A New Variant of Particle Swarm Optimization",
        "authors": "Ishan Guthikonda, Jayant Venkatesan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4553109"
    },
    {
        "id": 34315,
        "title": "Optimization Design of English Translation Error Recognition Algorithm Based on Particle Swarm Optimization Neural Network",
        "authors": "Fei Gao",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00010"
    },
    {
        "id": 34316,
        "title": "A new training algorithm for long short-term memory artificial neural network based on particle swarm optimization",
        "authors": "Turan Cansu, Emine Kolemen, Özlem Karahasan, Eren Bas, Erol Egrioglu",
        "published": "2023-11",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41066-023-00389-8"
    },
    {
        "id": 34317,
        "title": "Optimizing Network Slicing Through Neural Network and Particle Swarm Optimization",
        "authors": "M Kowsalya, Thiruvenkadam Srinivasan, Kangjoo Kim, In-Ho Ra",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i-pact58649.2023.10434782"
    },
    {
        "id": 34318,
        "title": "Improved Particle Swarm Optimization for Optimizing The Deep Convolutional Neural Network",
        "authors": "A.W.C.K. Atugoda, Subha Fernando",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icitr61062.2023.10382832"
    },
    {
        "id": 34319,
        "title": "Optimization Research of Particle Swarm Optimization Algorithm in BP Neural Network Model",
        "authors": "Yongheng Cai, Jiadong Guo, Junhao Zhong",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiiip61647.2023.00043"
    },
    {
        "id": 34320,
        "title": "Speech Recognition Network Design of Standard Mandarin Intelligent Test System Based on Particle Swarm Optimization Algorithm",
        "authors": "Xiuzhi Fan, Yongtao Xian",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10244868"
    },
    {
        "id": 34321,
        "title": "Research on BP Neural Network Based on Particle Swarm Optimization Algorithm",
        "authors": "Yugang Liu",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aicit59054.2023.10277952"
    },
    {
        "id": 34322,
        "title": "Security-Oriented Network Intent Placement using Particle Swarm Optimization",
        "authors": "Gabriel Landeau, Marios Avgeris, Aris Leivadeas, Ioannis Lambadaris",
        "published": "2023-10-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnet59123.2023.10339783"
    },
    {
        "id": 34323,
        "title": "Improved Particle Swarm Optimization in Quantity Monitoring Model of Microbial Information",
        "authors": "Yuanchang Jin, Yufeng Li",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nmitcon58196.2023.10276303"
    },
    {
        "id": 34324,
        "title": "Coverage Optimization of Eureka Digital Sound Broadcasting Single Frequency Network Using Simulated Annealing and Particle Swarm Optimization",
        "authors": "Joseph Sospeter Salawa, Elijah Mwangi, Nerey Mvungi",
        "published": "2023-6",
        "citations": 0,
        "abstract": "Due to scarcity of bandwidth available for sound broadcasting, Digital sound broadcasting Technology is emerging to be the Technology of resort in sound broadcasting industry towards replacing the analogue sound broadcasting currently dominated by FM Radio. There are many digital sound broadcasting systems being proposed with different performance and bandwidth efficiency. Static delays are artificial delays intentionally introduced at each Transmitter in order to minimize interference in a Single Frequency Network (SFN). In this paper, we have looked at the Terrestrial digital audio broadcasting (T-DAB) system specifically to optimize its final SFN coverage by finding an optimal set of static delays for transmitters. For the sake of simulation, hexagonal model of transmitters operating under Single Frequency Network (SFN) was used. The aim of this study is to maximize SFN coverage by using optimal set of artificial static delays, Particle Swarm Optimization (PSO) have strong ability in finding the global optimistic result while Stimulated Annealing (SA) algorithm has a strong ability to find the local Optimistic result and therefore based on their unique strength, these methods were selected so that our study can have a good comparison in terms of coverage by using both global and local optimistic results. We report the increase of coverage by 1.12% and 2.38% using Simulated Annealing and Particle Swarm Optimization technique respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jcm.18.6.377-384"
    },
    {
        "id": 34325,
        "title": "Convolution neural network hyperparameter optimization  using modified particle swarm optimization",
        "authors": "Muhammad Munsarif, Muhammad Sam'an, Andrian Fahrezi",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Based on the literature review, a convolutional neural network (CNN) is one of the deep learning techniques most often used for classification problems, especially image classification. Various approaches have been proposed to improve accuracy performance. In CNN architecture, parameter determination is very influential on accuracy performance. Particle swarm optimization (PSO) is a type of metaheuristic algorithm widely used for hyperparameter optimization. PSO convergence is faster than genetic algorithm (GA) and attracts many researchers for further studies such as genetic algorithms and ant colony. In PSO, determining the value of the weight parameter is very influential on accuracy. Therefore, this paper proposes CNN hyperparameter optimization using modified PSO with linearly decreasing randomized weight. The experiments use the modified National Institute of Standards and Technology (MNIST) dataset. The accuracy of the proposed method is superior, and the execution time is slower to random search. In epoch 1, epoch 3, and epoch 5, the proposed method is superior to baseline CNN, linearly decreasing weight PSO (LDWPSO), and RL-based optimization algorithm (ROA). Meanwhile, the accuracy performance of the proposed method is superior to previous studies, namely LeNet-1, LeNet-2, LeNet-3, PCANet-2, RANDNet-2, CAE1, CAE-2, and bee colony. Otherwise, lost to PSO-CNN, distributed PSO (DPSO), recurrent CNN, and CNN-PSO. However, the four methods have a complex architecture and wasteful execution time.",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/eei.v13i2.6112"
    },
    {
        "id": 34326,
        "title": "Application Analysis of Particle Swarm Optimization Convolutional Neural Network in Industrial Design",
        "authors": "Hui Zhang, Minglei Zheng",
        "published": "2023-7-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s1.31-45"
    },
    {
        "id": 34327,
        "title": "Evaluation of High-precision Bridge Monitoring System Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Shiwen Wang",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10244996"
    },
    {
        "id": 34328,
        "title": "Sliding Window-based Particle Swarm optimization Algorithm for a Sewer Network",
        "authors": "Iulian Vasiliev, Laurentiu Luca, Marian Barbu, Ramon Vilanova, Sergiu Caraman",
        "published": "2023-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ecc57647.2023.10178171"
    },
    {
        "id": 34329,
        "title": "Modified Particle Swarm Optimization for Clustering",
        "authors": "Muchamad Kurniawan, Rani Muhima, Maftahatul Hakimah, Siti Agustini, Rahmi Putri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012111800003680"
    },
    {
        "id": 34330,
        "title": "Improved particle swarm optimization with reverse learning and neighbor adjustment for space surveillance network task scheduling",
        "authors": "Xi Long, Weiwei Cai, Leping Yang, Huan Huang",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.swevo.2024.101482"
    },
    {
        "id": 34331,
        "title": "Synergistic Optimization of 5G Networks: Integrating Genetic Algorithms and Particle Swarm Optimization for Enhanced Energy Efficiency and Network Performance",
        "authors": "Debarun Ghosh, Bharathi S. H",
        "published": "2023-11-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/nkcon59507.2023.10396185"
    },
    {
        "id": 34332,
        "title": "Research on particle swarm optimization and neural network ensemble learning algorithm for weather forecast",
        "authors": "Hui Feng",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.2671207"
    },
    {
        "id": 34333,
        "title": "Multivariate nonlinear economic forecasting model based on immune particle swarm optimization neural network",
        "authors": "Rongchang Liu, Guangli Yang",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedcs60513.2023.00037"
    },
    {
        "id": 34334,
        "title": "Elite archives-driven particle swarm optimization for large scale numerical optimization and its engineering applications",
        "authors": "Yiying Zhang",
        "published": "2023-2",
        "citations": 24,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.swevo.2022.101212"
    },
    {
        "id": 34335,
        "title": "Evaluation of Economic Development Data Management System Based on Particle Swarm Optimization Algorithm",
        "authors": "Zhengwei Xu, Da Kuang",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245900"
    },
    {
        "id": 34336,
        "title": "Active Distribution Network Reactive Power Optimization Based on an Improved Genetic Particle Swarm Optimization Algorithm",
        "authors": "Shuai Gou",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "Abstract\nAs the distributed generation is gradually connected to the distribution network, it will lead to an increase in node voltage deviation and network loss. The active distribution network reactive power optimization approach based on an improved genetic particle swarm optimization algorithm is proposed in this paper to increase voltage quality and system efficiency. First, a reactive power optimization model for active distribution networks that has the least possible active power loss and voltage variation is developed. Then, the genetic idea is applied to the particle swarm optimization algorithm to improve it and address the issues of the long iteration time of the genetic algorithm and the tendency of the particle swarm optimization algorithm to settle into local optimal solutions. Finally, the enhanced genetic particle swarm optimization algorithm described in this paper is validated using the enhanced IEEE-33 node system. The findings indicate that this strategy can significantly shorten computation times while also increasing calculation precision.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2655/1/012035"
    },
    {
        "id": 34337,
        "title": "Hybrid Particle Swarm Optimization-based Modeling of Wireless Sensor Network Coverage Optimization",
        "authors": "Guangyue Kou, Guoheng Wei",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14569/ijacsa.2023.01405102"
    },
    {
        "id": 34338,
        "title": "Factored Particle Swarm Optimization for Policy Co-training in Reinforcement Learning",
        "authors": "Kordel K. France, John W. Sheppard",
        "published": "2023-7-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3583131.3590376"
    },
    {
        "id": 34339,
        "title": "A New Hybrid Model for Classifying Cardiac Arrhythmias Using Convolutional Neural Networks and Particle Swarm Optimization",
        "authors": "Saniya Khurana",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245822"
    },
    {
        "id": 34340,
        "title": "Research on indoor wireless network coverage layout based on hybrid particle swarm optimization algorithm",
        "authors": "Shuo Xing",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icetci57876.2023.10176947"
    },
    {
        "id": 34341,
        "title": "A Global Routing Optimization Method for Integrated Circuit Clock Network Based on Improved Particle Swarm Optimization",
        "authors": "Yumin He, Mingyong Xin, Yu Wang, Changbao Xu",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnepe60694.2023.10429415"
    },
    {
        "id": 34342,
        "title": "Research on Reactive Power Optimization of Distribution Network Based on Quantum Particle Swarm Optimization Algorithm",
        "authors": "Xiaomeng Wu, Qinkai Zhang, Weidong Tian, Anlei Sun, Chenchen Li",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291600"
    },
    {
        "id": 34343,
        "title": "Hybrid Salp Swarm and Particle Swarm Optimization based Secure Aware Energy-Efficient Routing in Wireless Sensor Network",
        "authors": "M Vanitha, Nagendar Yamsani, Ibraheem Hatem Mohammed, Sowmya Madhavan, Kassem Al-Attabi",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciics59993.2023.10421116"
    },
    {
        "id": 34344,
        "title": "A Co-Optimization Algorithm Utilizing Particle Swarm Optimization for Linguistic Time Series",
        "authors": "Nguyen Duy Hieu, Mai Van Linh, Pham Dinh Phong",
        "published": "2023-3-25",
        "citations": 2,
        "abstract": "The linguistic time-series forecasting model (LTS-FM), which has been recently proposed, uses linguistic words of linguistic variable domains generated by hedge algebras (HAs) to describe historical numeric time-series data. Then, the LTS-FM was established by utilizing real numeric semantics of words induced by the fuzziness parameter values (FPVs) of HAs. In the existing LTS-FMs, just the FPVs of HAs are optimized, while the used word set is still chosen by human experts. This paper proposes a co-optimization method of selecting the optimal used word set that best describes numeric time-series data in parallel with choosing the best FPVs of HAs to improve the accuracy of LTS-FMs by utilizing particle swarm optimization (PSO). In this co-optimization method, the outer loop optimizes the FPVs of HAs, while the inner loop optimizes the used word set. The experimental results on three datasets, i.e., the “enrollments of the University of Alabama” (EUA), the “killed in car road accidents in Belgium” (CAB), and the “spot gold in Turkey” (SGT), showed that our proposed forecasting model outperformed the existing forecasting models in terms of forecast accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11071597"
    },
    {
        "id": 34345,
        "title": "Implementation of tongue based leukemia detection using novel discrete particle swarm optimization and compare with particle swarm optimization algorithm using MATLAB",
        "authors": "R. Sai Monisha, N. Nalini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0150930"
    },
    {
        "id": 34346,
        "title": "Distribution Network Reconfiguration with Improved Multi-Objective Particle Swarm Optimization Algorithm",
        "authors": "Yuehao Yan, Huihui Zhang, Tongkui Ding, Zhongliang Xin, Xiaohui Liu",
        "published": "2023-9-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/powercon58120.2023.10331435"
    },
    {
        "id": 34347,
        "title": "Retracted: Improved Particle Swarm Optimization Algorithm in Power System Network Reconfiguration",
        "authors": "",
        "published": "2023-7-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9870636"
    },
    {
        "id": 34348,
        "title": "Information Network Security Situation Prediction Method Based on Particle Swarm Optimization",
        "authors": "Jian Wang, Zhibo Fu, Ya’Nan Wu",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiars59518.2023.00034"
    },
    {
        "id": 34349,
        "title": "Simulation Research on Reliability Evaluation Model of Electric Power Communication Network Based on Particle Swarm Optimization",
        "authors": "Rong Tian",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00175"
    },
    {
        "id": 34350,
        "title": "Particle Swarm Optimization, Particle Swarm Optimization-Variable Coefficient, and Cuckoo Search Algorithm- Based MPPT: A Comparative Analysis",
        "authors": "Md Adil Azad, Mo Abu Hanifa, Areebah Fatima, Mohd Shahbaz Faisal",
        "published": "2023-12-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeic59336.2023.10450227"
    },
    {
        "id": 34351,
        "title": "Voltage stability and power loss minimization with STATCOM using particle swarm optimization and hybrid firefly particle swarm optimization algorithms",
        "authors": "Subramanyam Reddy R. Siva",
        "published": "2023",
        "citations": 0,
        "abstract": "This paper presents a hybrid algorithm using a hybrid firefly and particle swarm optimization (HFPSO) algorithm to determine the optimal placement of STATCOM devices. A multi-objective function is used to increase voltage stability, voltage profile and minimize overall power losses of the transmission system. At first, PSO algorithm is used to find the optimal STATCOM location and further more to reduce the power losses and voltage profile enhancement to overcome the sub-optimal operation of existing algorithms, the HFPSO algorithm is used to determine the optimal placement of STATCOM FACTS device and verification of the proposed algorithm was achieved on standard IEEE 14-bus and 30-bus transmission systems in the MATLAB environment. Comprehensive simulation results of two different cases show that the proposed HFPSO demonstrates significant improvements over other existing algorithms to enhance voltage stability and reducing active and reactive power losses in an electrical power transmission systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26634/jps.11.3.20045"
    },
    {
        "id": 34352,
        "title": "Distribution Network Reconfiguration Using Chaotic Particle Swarm Chicken Swarm Fusion Optimization Algorithm",
        "authors": "Yanmin Wu, Jiaqi Liu, Lu Wang, Yanjun An, Xiaofeng Zhang",
        "published": "2023-10-21",
        "citations": 3,
        "abstract": "Aiming at the problems of traditional optimization algorithms for reconfiguring distribution networks, which easily fall into a local optimum, have difficulty finding a global optimum, and suffer from low computational efficiency, the proposed algorithm named Chaotic Particle Swarm Chicken Swarm Fusion Optimization (CPSCSFO) is used to optimize the reconfiguration of the distribution network with distributed generation (DG). This article works to solve the problems mentioned above from the following three aspects: Firstly, chaotic formula is used to improve the initialization of the particles and optimize the optimal position. This increases individual randomness while avoiding local optimality for inert particles. Secondly, chicken swarm optimization (CSO) and particle swarm optimization (PSO) are combined. The multi-population nature of the CSO algorithm is used to increase the global search capability, and, at the same time, the information exchange between groups is completed to extend the particle search range, which ensures the independence and excellence of each particle group. Thirdly, the node hierarchy method is introduced to calculate the power flow. The branching loop matrix and the node hierarchy strategy are used to detect the network topology. In this way, improper solutions can be reduced, and the efficiency of the algorithm can be improved. This paper has demonstrated better performance by CPSCSFO based on simulation results. The network loss has been reduced and the voltage level of each node in the optimal reconfiguration with distributed power supply has been improved; the network loss in the optimal reconfiguration with DG is 69.59% lower than that reconfiguration before. The voltage level of each node is increased, the minimum node voltage is increased by 3.44% and a better convergence speed is presented. As a result, the quality of network operation and the distribution network is greatly improved and provides guidance for building a safer, more economical and reliable distribution network.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16207185"
    },
    {
        "id": 34353,
        "title": "Optimization of BP Neural Network for Wind Power Output Prediction Based on Particle Swarm Optimization Algorithm",
        "authors": "Kai Liu, Hongsheng Su",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "Abstract\nBecause wind power has strong uncertainty and uncontrollability, there are great difficulties in the process of grid connection and power dispatching. The existing prediction models have some shortcomings, such as insufficient precision and poor convergence. In this paper, an improved short-term prediction model is proposed. The correlation coefficient is determined by the grey correlation method, and then the optimal coefficient is calculated by optimizing the backpropagation network using a particle swarm optimization algorithm. Comparing the prediction results of the new model with those of a single BP network and the POS optimization BP network, it can be concluded that the new model is more precise than the other models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2562/1/012010"
    },
    {
        "id": 34354,
        "title": "Energy Proficient Reduced Coverage Set with Particle Swarm Optimization for Distributed Sensor Network",
        "authors": "T. V. Chithra, A. Milton",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/csse.2023.026561"
    },
    {
        "id": 34355,
        "title": "Voltage control of DC microgrid based on fuzzy neural network and improved particle swarm optimization algorithm",
        "authors": "Jianfeng Sun",
        "published": "2023-1-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsie55183.2023.10175287"
    },
    {
        "id": 34356,
        "title": "Classification of heart blockage using particle swarm optimization based probabilistic neural network",
        "authors": "S. Sathishkumar, R. Devi Priya",
        "published": "2023-10-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0219477524500123"
    },
    {
        "id": 34357,
        "title": "Simulation of Econometric Dynamic Simulation And Prediction Model Based on Particle Swarm Optimization Neural Network Algorithm",
        "authors": "Xueqing Wang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aiars59518.2023.00054"
    },
    {
        "id": 34358,
        "title": "Enhancing stock market forecasting using sequential training network empowered by tunicate swarm optimization",
        "authors": "Kalva Sudhakar, Satuluri Naganjaneyulu",
        "published": "2023-12-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11042-023-17686-8"
    },
    {
        "id": 34359,
        "title": "Optimization of BP Neural Network PID Waste Incineration Control System Based on Improved Particle Swarm Optimization",
        "authors": "Dianbin Luo, Chenghui Yang, De Zhou",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccasit58768.2023.10351581"
    },
    {
        "id": 34360,
        "title": "Design Method of Electric Bicycle Traffic Signs Using Particle Swarm Optimization with Convolutional Neural Network",
        "authors": "Xingfei Xia, Yuxiao Ma, Wei Wei",
        "published": "2023-11-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s12.145-158"
    },
    {
        "id": 34361,
        "title": "Boosting particle swarm optimization by backtracking search algorithm for optimization problems",
        "authors": "Sukanta Nama, Apu Kumar Saha, Sanjoy Chakraborty, Amir H. Gandomi, Laith Abualigah",
        "published": "2023-6",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.swevo.2023.101304"
    },
    {
        "id": 34362,
        "title": "Security optimization method of high-power charging pile inter-group communication network under trusted taboo particle swarm optimization",
        "authors": "Yigang Wang, Jianfeng Zhao",
        "published": "2023-5",
        "citations": 1,
        "abstract": "In order to ensure the normal operation of the communication network in the event of a small number of charging pile failures, it is necessary to establish a stable communication network between the charging pile groups. In this case, it is necessary to improve the stability and viability of the communication network between the pile groups. Based on this, this paper proposes a security optimization method for high-power inter pile communication networks under trusted tabu particle swarm optimization. Using 6LoWPAN technology to optimize the wireless communication network architecture of charging piles to reduce the probability of communication network paralysis; design a neighborhood end-to-end communication strategy, and conduct research on lightweight key management of charging piles by building a three-tier architecture for the communication environment of charging piles. The trusted taboo particle swarm optimization algorithm optimizes the security of the communication network between high-power charging piles to ensure the security of the communication network. The experimental results show that after the optimization of the proposed method, the stability and invulnerability of the communication network between the charging pile groups have been effectively improved, and the method has a high convergence speed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/ro/2023038"
    },
    {
        "id": 34363,
        "title": "Particle Swarm Optimization Trained Feedforward Neural Network for Under-Voltage Load Shedding",
        "authors": "Sharman Sundarajoo, Dur Soomro",
        "published": "2023-6-27",
        "citations": 1,
        "abstract": "This paper suggests an under-voltage load shedding (UVLS) approach to avoid voltage collapse in stressed distribution systems. Prior to a blackout, a failing system reaches an emergency state, and UVLS is executed as the final option to prevent voltage collapse. Hence, this article introduces an optimal UVLS method using a feedforward artificial neural network (ANN) model trained with the particle swarm optimization (PSO) algorithm to obtain the optimal load shedding amount for a distribution system. PSO is used to obtain the best topology and optimum initial weights of the ANN model to enhance the precision of the ANN model. Thus, the dispute between the optimum fitting regression of the allocation of ANN nodes and computational time was disclosed, while the MSE of the ANN model was minimized. Moreover, the proposed method uses the stability index (SI) to identify the weak buses in the system following an emergency state. Different overload scenarios are examined on the IEEE 33-bus distribution network to validate the efficacy of the suggested UVLS scheme. A comparative study is performed to further assess the performance of the proposed technique. The comparison indicates that the recommended method is effective in terms of voltage stability and remaining load.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37936/ecti-eec.2023212.249825"
    },
    {
        "id": 34364,
        "title": "An IoT-based English translation and teaching using particle swarm optimization and neural network algorithm",
        "authors": "Lili Zhang",
        "published": "2023-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-09032-9"
    },
    {
        "id": 34365,
        "title": "Current study on PID control method with optimized BP neural network based on particle swarm optimization",
        "authors": "Han Wang",
        "published": "2024-3-7",
        "citations": 0,
        "abstract": "At present, robots show great application value in various industries, and the progress of the industry constantly puts forward higher requirements for the performance of robots, and robot control is an important part of robot application. It is difficult for the traditional PID controller to implement online tuning when it is faced with actual objects. Consequently, the neural network algorithm has been included into robot control methods in recent years; the PID controller based on BP neural network is the subject of this research. This study presents the current state of research, the basic concept behind BP neural networks, how they are used in controller design, and how to optimize the PID parameters of BP neural networks using a particle swarm optimization method. To increase system stability, the neural network is coupled with a PID controller. The adaptive learning capability of the neural network is utilized to modify PID control parameters online in real time. Targeting the trouble that it slips into a local minimum easily during the BP-PID self-learning process and the refined PSO algorithm is used to improve it. It makes sure that the BP-PID system converges to the global optimal solution. The proposed method can effectively improve the system control accuracy and control stability.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2753-8818/31/20241088"
    },
    {
        "id": 34366,
        "title": "Multi-Level and Multi-Swarm Particle Swarm Optimization Algorithm",
        "authors": "Junwei Long, Xiangbo Yi",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/acdp59959.2023.00028"
    },
    {
        "id": 34367,
        "title": "Capacity Optimization Configuration of Aircraft Energy Storage Units Based on Particle Swarm Optimization and Neural Network Algorithm",
        "authors": "Zhiliang Wang, Xiaodong Fan, Meng Wang, Hongxu Liu, Wanqiang Cui, Guihua Liu",
        "published": "2023-11-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peas58692.2023.10394715"
    },
    {
        "id": 34368,
        "title": "Retracted: Design and Simulation of Logistics Network Model Based on Particle Swarm Optimization Algorithm",
        "authors": "",
        "published": "2023-7-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9810623"
    },
    {
        "id": 34369,
        "title": "Particle Swarm Optimization LSTM Neural Network for Navigation Satellite Clock Bias Forecasting",
        "authors": "Guannan Xiang, Zhi Zhou, Guanjun Wang, Jinghang Wu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/prai59366.2023.10332030"
    },
    {
        "id": 34370,
        "title": "Enhancing TEEN Protocol using the Particle Swarm Optimization and BAT Algorithms in Underwater Wireless Sensor Network",
        "authors": "Ruqaiya D. Jalal, Salah A. Aliesawi",
        "published": "2023-1-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dese58274.2023.10100062"
    },
    {
        "id": 34371,
        "title": "An efficient frame preemption algorithm for time-sensitive networks using enhanced graph convolutional network with particle swarm optimization",
        "authors": "R. Kannamma, Umadevi K.S.",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.measen.2023.100964"
    },
    {
        "id": 34372,
        "title": "Research on Improved BP Neural Network Prediction Based on Niche Particle Swarm Optimization Algorithm",
        "authors": "Shengjie Jin, Chunguang Zhang",
        "published": "2023-3-8",
        "citations": 1,
        "abstract": "As for data prediction, a prediction model is proposed based on BP neural network. This method is based on the traditional BP neural network algorithm to improve the problems of slow convergence speed and easy to fall into local optimum. The idea of niche is introduced into the particle swarm optimization algorithm to improve the global search ability and convergence speed, find the global optimum value, and then use LMBP neural network to continue to optimize the parameters to improve the prediction effect.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/jceim.v10i1.5764"
    },
    {
        "id": 34373,
        "title": "Comparison of differential evolution, particle swarm optimization, quantum-behaved particle swarm optimization, and quantum evolutionary algorithm for preparation of quantum states",
        "authors": "Xin Cheng, Xiu-Juan Lu, Ya-Nan Liu, Sen Kuang",
        "published": "2023-1-1",
        "citations": 2,
        "abstract": "Four intelligent optimization algorithms are compared by searching for control pulses to achieve the preparation of target quantum states for closed and open quantum systems, which include differential evolution (DE), particle swarm optimization (PSO), quantum-behaved particle swarm optimization (QPSO), and quantum evolutionary algorithm (QEA). We compare their control performance and point out their differences. By sampling and learning for uncertain quantum systems, the robustness of control pulses found by these four algorithms is also demonstrated and compared. The resulting research shows that the QPSO nearly outperforms the other three algorithms for all the performance criteria considered. This conclusion provides an important reference for solving complex quantum control problems by optimization algorithms and makes the QPSO be a powerful optimization tool.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1674-1056/ac65ee"
    },
    {
        "id": 34374,
        "title": "Particle Swarm Optimization for Target Encirclement by a UAV Formation",
        "authors": "Tagir Muslimov",
        "published": "2023-6-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023033015"
    },
    {
        "id": 34375,
        "title": "Distribution Network Reconstruction Based on Discrete Particle Swarm Algorithm Based on Quantum Coding",
        "authors": "Ning Luo, Ludong Chen, Jinsen Liu, Pengcheng Zhang, Fei Zheng",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470728"
    },
    {
        "id": 34376,
        "title": "Deep Convolutional Generative Adversarial Network-Based Plant Disease Detection And Classification Using Particle Swarm Optimization Algorithms",
        "authors": "V. Krishna Pratap, N. Suresh Kumar",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10392841"
    },
    {
        "id": 34377,
        "title": "Discrimination method of biomass slagging tendency based on particle swarm optimization deep neural network (DNN)",
        "authors": "Yingxin Bi, Chunxiang Chen, Xiaodong Huang, Haokun Wang, Guangsheng Wei",
        "published": "2023-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.energy.2022.125368"
    },
    {
        "id": 34378,
        "title": "Compound Prediction Model of Information Network Security Situation Based on Support Vector Machine and Particle Swarm Optimization Algorithm",
        "authors": "Minfeng Chen",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaisc58445.2023.10200752"
    },
    {
        "id": 34379,
        "title": "Particle swarm optimization algorithm based RBF neural network prediction model for the load of green data center",
        "authors": "F. Mei, J. Jiang, X. Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.2994"
    },
    {
        "id": 34380,
        "title": "Distribution Network Reconfiguration Based On Improved Particle Swarm Optimization Algorithm",
        "authors": "Xiaomeng Wu, Chenchen Li, Jiahe Jiang, Anlei Sun, Qinkai Zhang",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/itoec57671.2023.10291638"
    },
    {
        "id": 34381,
        "title": "Bayesian Network Demand-Forecasting Model Based on Modified Particle Swarm Optimization",
        "authors": "Shebiao Hu, Kun Li",
        "published": "2023-9-7",
        "citations": 1,
        "abstract": "With the increasing variety of products, the increasing substitutability of products, and the trend of customized products, the volatility of market demand is increasing, which poses a challenge to make accurate demand forecasting. The Bayesian method is particularly promising and appealing when the data fluctuate greatly. This paper proposes a product-demand forecasting model based on multilayer Bayesian network, which introduces hidden layer variables and volatility factors to meet the time series connection and volatility of the demand data. However, most studies use sampling methods to estimate the parameters. We use Bayesian maximum a posteriori estimation to estimate the model parameters and introduce an improved particle swarm optimization algorithm (MPSO) to optimize the objective function. In order to increase the diversity of the particle population and accelerate the convergence, an adaptive particle velocity, position updating strategy, and nonlinear changing inertia weight are introduced in the algorithm. Finally, RMSE (Root Mean Square Error) and MAPE (Mean Absolute Percentage Error) are used as the evaluation criterion to conduct experiments on six different datasets, and the experimental results are compared with the results of the ARIMA (autoregressive integrated moving average model) method and PSO algorithm. The experimental results show that the method has a good prediction effect. It provides a new idea for demand forecasting in the supply chain.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app131810088"
    },
    {
        "id": 34382,
        "title": "An Efficient Intrusion Detection System in Cloud Network Based on Deep Learning and Improved Marine Predators-Particle Swarm Optimization",
        "authors": "",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2023.1231.06"
    },
    {
        "id": 34383,
        "title": "Motor Imagery Recognition Based on an Optimized Probabilistic Neural Network with the Particle Swarm Optimization",
        "authors": "Yufei Yang, Mingai Li",
        "published": "2023-5-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ccdc58219.2023.10326560"
    },
    {
        "id": 34384,
        "title": "BN-GEPSO: Learning Bayesian Network Structure Using Generalized Particle Swarm Optimization",
        "authors": "Muhammad Saad Salman, Ibrahim M. Almanjahie, AmanUllah Yasin, Ammara Nawaz Cheema",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32604/cmc.2023.034960"
    },
    {
        "id": 34385,
        "title": "Convolutional neural network optimization for discovering plant leaf diseases with particle swarm optimizer",
        "authors": "Vishakha A. Metre, S.D. Sawarkar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijcse.2023.10059723"
    },
    {
        "id": 34386,
        "title": "A Variable Step LMS Algorithm Based on Particle Swarm Optimization",
        "authors": "Yanling Li, Jianwei Zhan, Hui Zhang, Dong Wang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3640912.3640987"
    },
    {
        "id": 34387,
        "title": "Stability Prediction of Highway Slope on Highly Plastic Clay Using Particle Swarm Optimization (PSO)-Based Neural Network",
        "authors": "Nobahar Masoud, Fei Han, Abolfazl Eslami, Sadik Khan, Farshad Amini",
        "published": "2024-2-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485347.027"
    },
    {
        "id": 34388,
        "title": "Fuzzy logic and particle swarm optimization-based clustering protocol in wireless sensor network",
        "authors": "Piyush Rawat, Pranjal Kumar, Siddhartha Chauhan",
        "published": "2023-5",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s00500-023-07833-6"
    },
    {
        "id": 34389,
        "title": "Identification of Distribution Network Parameters Based on Particle Swarm Optimization Method",
        "authors": "Jingjing Wang, Dawei Xie, Wei Peng, Chao Ding, Huan Wang",
        "published": "2023-7-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ispds58840.2023.10235740"
    },
    {
        "id": 34390,
        "title": "Location Optimization of Fresh Agricultural Products Distribution Center Based on Particle Swarm Optimization Neural Network",
        "authors": "Minu Inba Shanthini Watson Benjamin, R Bhuvana, Venkata Reddy Adama, E. Kiruthika, S. Manohar, Pradeep Kumar",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smarttechcon57526.2023.10391105"
    },
    {
        "id": 34391,
        "title": "A Novel Approach for Optimization of Convolution Neural Network with Particle Swarm Optimization and Genetic Algorithm for Face Recognition",
        "authors": "Kalaiarasi P, P. Esther Rani",
        "published": "2023-5-5",
        "citations": 1,
        "abstract": "Convolutional neural networks are contemporary deep learning models that are employed for many various applications. In general, the filter size, number of filters, number of convolutional layers, number of fully connected layers, activation function and learning rate are some of the hyperparameters that significantly determine how well a CNN performs.. Generally, these hyperparameters are selected manually and varied for each CNN model depending on the application and dataset. During optimization, CNN could get stuck in local minima. To overcome this, metaheuristic algorithms are used for optimization. In this work, the CNN structure is first constructed with randomly chosen hyperparameters and these parameters are optimized using Genetic Algorithm (GA) and Particle Swarm Optimization (PSO) algorithm. A CNN with optimized hyperparameters is used for face recognition. CNNs optimized with these algorithms use RMSprop optimizer instead of stochastic gradient descent. This RMSprop optimizer helps the CNN reach global minimum quickly. It has been observed that optimizing with GA and PSO improves the performance of CNNs. It also reduces the time it takes for the CNN to reach the global minimum.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17762/ijritcc.v11i4s.6531"
    },
    {
        "id": 34392,
        "title": "Belief space-guided approach to self-adaptive particle swarm optimization",
        "authors": "Daniel von Eschwege, Andries Engelbrecht",
        "published": "2024-3",
        "citations": 0,
        "abstract": "AbstractParticle swarm optimization (PSO) performance is sensitive to the control parameter values used, but tuning of control parameters for the problem at hand is computationally expensive. Self-adaptive particle swarm optimization (SAPSO) algorithms attempt to adjust control parameters during the optimization process, ideally without introducing additional control parameters to which the performance is sensitive. This paper proposes a belief space (BS) approach, borrowed from cultural algorithms (CAs), towards development of a SAPSO. The resulting BS-SAPSO utilizes a belief space to direct the search for optimal control parameter values by excluding non-promising configurations from the control parameter space. The resulting BS-SAPSO achieves an improvement in performance of 3–55% above the various baselines, based on the solution quality of the objective function values achieved on the functions tested.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11721-023-00232-5"
    },
    {
        "id": 34393,
        "title": "Load optimization of campus distribution network based on multi-objective particle swarm optimization",
        "authors": "Pinghao Ni, Di Zhu, Jinghan He, Fang Zhang, Xiaojun Wang",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3004294"
    },
    {
        "id": 34394,
        "title": "Optimization of convolutional neural network for glass-forming ability prediction based on particle swarm optimization",
        "authors": "Meng-qi Wang, Yong-chao Liang, Bo Sun, Yuan-wei Pu, Ji-xing Xie",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mtcomm.2023.106808"
    },
    {
        "id": 34395,
        "title": "Location and Tracking Mode of Sports Rehabilitation Training With Self-Powered Sensors Based on Particle Swarm Optimization Algorithm",
        "authors": "Yu Ke",
        "published": "2023-9-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/jsen.2023.3241269"
    },
    {
        "id": 34396,
        "title": "THE PREDICTION OF EPB-TBM PERFORMANCE USING FIREFLY ALGORITHMS AND PARTICLE SWARM OPTIMIZATION",
        "authors": "Erfan Khoshzaher, Hamid Chakeri, Shahab Bazargan, Hamid Mousapour",
        "published": "2023",
        "citations": 0,
        "abstract": "Penetration rate is one of the most important parameters in determining excavation time in tunnelling operations. Providing a prediction model or a mathematical relationship can give a better understanding of this issue. A mathematical equation between input and output parameters can be optimized by using algorithms such as Particle Swarm Optimization and Firefly. Since drilling operations interact between ground and machine, therefore, the effective parameters on the penetration rate are divided into two general categories such as machine and geological factors. Effective geological factors include internal friction angle, cohesion, specific gravity, shear modulus and groundwater level. In addition, the important parameters of TBM are torque, thrust jacks, and rotation speed. By defining an initial mathematical function, two optimization algorithms, which look for the most optimal mode, the goal here is the same as the mean square error (MSE). Finally, by examining and comparing the performance of two algorithms, using the coefficient of determination and the mean square error, it found that the Firefly algorithm has a better performance than the Particle Swarm Optimization algorithm.",
        "keywords": "",
        "link": "http://dx.doi.org/10.17794/rgn.2023.5.7"
    },
    {
        "id": 34397,
        "title": "Estimating Nonlinear Regression Parameters using Particle Swarm Optimization and Genetic Algorithm",
        "authors": "Sabastine Emmanuel, Ikechukwu Okoye, Chinenye Ezenweke, Dolapo Shobanke, Isaac Adeniyi",
        "published": "2023-1-10",
        "citations": 0,
        "abstract": "Obtaining parameter estimates for nonlinear regression model using gauss-newton and gradient-based methods present some complex analytical challenges. In this paper we investigated the effectiveness and simplicity of Particle Swarm Optimization (PSO) and Genetic Algorithm (GA) on five nonlinear regression models with varying level of complexities. We developed function in R-programming for each models and performed 30 independent runs for at least 100 iterations for both PSO and GA. We evaluated PSO and GA performance in view of computation time, residual error produced and compared our results with values published online. Based on the results obtained, PSO significantly outperform GA in view of computation time and quality of parameter estimates. Even so, GA required fewer iterations and produced fairly accurate results. Further investigation shows that PSO and GA are both competitive, effective, simple to implement, and can be considered reliable for obtaining the parameter estimates of different nonlinear regression tasks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33003/fjs-2022-0606-1114"
    },
    {
        "id": 34398,
        "title": "A Transfer Learning-Based Adaptive Particle Swarm Optimization for Global Optimization Problem",
        "authors": "Xu Yang, Hongru Li",
        "published": "2023-7-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/ccc58697.2023.10241003"
    },
    {
        "id": 34399,
        "title": "Logistics Distribution Route Optimization Based on Improved Particle Swarm Optimization",
        "authors": "Hai Zhao, Ashutosh Sharma",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.31449/inf.v47i2.4011"
    },
    {
        "id": 34400,
        "title": "Optimized Design of Large-Body Structure of Pile Driver Based on Particle Swarm Optimization Improved BP Neural Network",
        "authors": "Jinmei Wu, Jiameng Hu, Yanqing Yang",
        "published": "2023-6-16",
        "citations": 2,
        "abstract": "Optimization of the pile driver’s large-body structure is important to achieve the driver’s overall light weight. This paper studies the large-body structure of a hydraulic static pile driver. We used the APDL parametric design language provided by ANSYS to construct a geometric model of the large-body structure and performed a static analysis of the finite element model. Under the assumption that the strength and stiffness meet the design requirements, the optimization model was constructed with the thickness of each plate of the large-body structure as the design variable, the structural strength and stiffness as the constraints, and the minimum mass as the objective function. Finally, two optimization algorithms were used to solve the model, and the comparison of the two sets of solutions shows that the improved BP neural network algorithm based on the particle swarm optimization algorithm performs better. The optimized mass of the large-body structure was reduced from 82,556.1 kg to 65,046.15 kg, a mass reduction of 21%. The lightweight design of the pile driver was achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13127200"
    },
    {
        "id": 34401,
        "title": "Research on Optimal Configuration of Active Distribution Network Energy Storage Security Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Xianglong Chen, Wei Xie",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aikiie60097.2023.10390395"
    },
    {
        "id": 34402,
        "title": "Research on Optimal Design of Wireless Sensor Network with Particle Swarm Optimization and Improved Firefly Algorithm",
        "authors": "Rui Li, Dong Gong, Yutong Tan",
        "published": "2023-1-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icpeca56706.2023.10075859"
    },
    {
        "id": 34403,
        "title": "Artificial neural network using particle swarm optimization and genetic algorithm on the air temperature forecast",
        "authors": "Ayun Hapsari, Budi Prasetiyo",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0126742"
    },
    {
        "id": 34404,
        "title": "Particle swarm optimization trained neural network for overhead line conductor temperature prediction",
        "authors": "Tomislav Sterc, Bozidar Filipovic-Grcic, Bojan Franc, Kresimir Mesic, Alan Zupan, Bruno Jurisic",
        "published": "2023-4-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smagrimet58412.2023.10128652"
    },
    {
        "id": 34405,
        "title": "Analysis and Comparison of Reactive Power Optimization Using Improved Genetic Algorithm and Improved Quantum Particle Swarm Algorithm in an Active Distribution Network",
        "authors": "Hamidreza. Amiri",
        "published": "2023-2-8",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictem56862.2023.10083893"
    },
    {
        "id": 34406,
        "title": "Research on Power Supply Chain Security Risk Monitoring based on Particle Swarm Optimization",
        "authors": "Junyi Li, Yating Jin, Huiying Weng, Wei Guo",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnisc60562.2023.00060"
    },
    {
        "id": 34407,
        "title": "Designing a Hybrid Method of Artificial Neural Network and Particle Swarm Optimization to Diagnosis Polyps from Colorectal CT Images",
        "authors": "Hossein Beigi Harchegani, Hamid Moghaddasi",
        "published": "2024-1",
        "citations": 0,
        "abstract": "Abstract\n\nBackground:\nSince colorectal cancer is one of the most important types of cancer in the world that often leads to death, computer-aided diagnostic (CAD) systems are a promising solution for early diagnosis of this disease with fewer side effects than conventional colonoscopy. Therefore, the aim of this research is to design a CAD system for processing colorectal Computerized Tomography (CT) images using a combination of an artificial neural network and a particle swarm optimizer.\n\n\nMethod:\nFirst, the data set of the research was created from the colorectal CT images of the patients of Loghman-e Hakim Hospitals in Tehran and Al-Zahra Hospitals in Isfahan who underwent colorectal CT imaging and had conventional colonoscopy done within a maximum period of one month after that. Then the steps of model implementation, including electronic cleansing of images, segmentation, labeling of samples, extraction of features, and training and optimization of the artificial neural network (ANN) with a particle swarm optimizer, were performed. A binomial statistical test and confusion matrix calculation were used to evaluate the model.\n\n\nResults:\nThe values of accuracy, sensitivity, and specificity of the model with a P value = 0.000 as a result of the McNemar test were 0.9354, 0.9298, and 0.9889, respectively. Also, the result of the P value of the binomial test of the ratio of diagnosis of the model and the radiologist from Loqman Hakim and Al-Zahra Hospitals was 0.044 and 0.021, respectively.\n\n\nConclusions:\nThe results of statistical tests and research variables show the efficiency of the CTC-CAD system created based on the hybrid of the ANN and particle swarm optimization compared to the opinion of radiologists in diagnosing colorectal polyps from CTC images.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.4103/ijpvm.ijpvm_373_22"
    },
    {
        "id": 34408,
        "title": "Evolutionary-state-driven multi-swarm cooperation particle swarm optimization for complex optimization problem",
        "authors": "Xu Yang, Hongru Li",
        "published": "2023-10",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ins.2023.119302"
    },
    {
        "id": 34409,
        "title": "Image Steganography Based on Hybrid Salp Swarm Algorithm and Particle Swarm Optimization",
        "authors": "",
        "published": "2024-2-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22266/ijies2024.0229.67"
    },
    {
        "id": 34410,
        "title": "Multilevel Thresholding Image Segmentation Based on Multi-swarm Particle Swarm optimization with a Dynamic Learning Strategy and Kapur’s entropy",
        "authors": "Emir Turajlić",
        "published": "2023-11-21",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/telfor59449.2023.10372741"
    },
    {
        "id": 34411,
        "title": "Hybrid Driving Training and Particle Swarm Optimization Algorithm-Based Optimal Control for Performance Improvement of Microgrids",
        "authors": "Dina A. Zaki, Hany M. Hasanien, Mohammed Alharbi, Zia Ullah, Mariam A. Sameh",
        "published": "2023-5-26",
        "citations": 3,
        "abstract": "This paper discusses the importance of microgrids in power systems and introduces a new method for enhancing their performance by improving the transient voltage response in the face of disturbances. The method involves using a hybrid optimization approach that combines driving training-based and particle swarm optimization techniques (HDTPS). This hybrid approach is used to fine-tune the system’s cascaded control scheme parameters, based on proportional–integral–accelerator (PIA) and proportional–integral controllers. The optimization problem is formulated using a central composite response surface methodology (CCRSM) to create an objective function. To validate the suggested control methodology, PSCAD/EMTDC software is used to carry out the simulations. The simulations explore various scenarios wherein the microgrid is transformed into an islanded system and is subjected to various types of faults and load changes. A comparison was made between the two proposed optimized controllers. The simulation results demonstrate the effectiveness of using a PIA-optimized controller; it improved the microgrid performance and greatly enhanced the voltage profile. In addition, the two controllers’ gains were optimized using only PSO to ensure that the outcomes of the HDTPS model demonstrated the same results. Finally, a comparison was made between the two optimization techniques (HDTPS and PSO); the results show a better impact when using the HDTPS model for controller optimization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/en16114355"
    },
    {
        "id": 34412,
        "title": "Cooperative coevolutionary multi-guide particle swarm optimization algorithm for large-scale multi-objective optimization problems",
        "authors": "Amirali Madani, Andries Engelbrecht, Beatrice Ombuki-Berman",
        "published": "2023-4",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.swevo.2023.101262"
    },
    {
        "id": 34413,
        "title": "A Comparison of Synchronous and Asynchronous Distributed Particle Swarm Optimization for Edge Computing",
        "authors": "Riccardo Busetti, Nabil El Ioini, Hamid Barzegar, Claus Pahl",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011815500003488"
    },
    {
        "id": 34414,
        "title": "Bacterial Foraging Particle Swarm Optimization based Wheeling Pricing Allocation through AF-mile and RF-mile approach",
        "authors": "Abhishek Saxena, Seema N Pandey, Shishir Dixit",
        "published": "2023-4-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csnt57126.2023.10134620"
    },
    {
        "id": 34415,
        "title": "Short-term Power Load Forecasting Based on Particle Swarm Optimization Long Short-term Memory Neural Network",
        "authors": "Ziteng Zhang, Wenhao Xu, Qingdong Gong",
        "published": "2023-2-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eebda56825.2023.10090722"
    },
    {
        "id": 34416,
        "title": "Sentiment Analysis Using Convolutional Neural Network (CNN) and Particle Swarm Optimization on Twitter",
        "authors": "Regina Anatasya Rudiyanto, Erwin Budi Setiawan",
        "published": "2024-2-1",
        "citations": 0,
        "abstract": "Over time, social media has always changed quickly. People can voice their ideas on various topics and communicate with each other through social media. One social media platform that allows users to express their ideas through tweets is Twitter. Sentiment is the route via which each person can express their ideas on a variety of subjects. The sentiment can be positive or negative. Sentiment analysis can be used to determine how Twitter users feel about particular subjects. Sentiment analysis on popular subjects in 2023, specifically the 2024 presidential contenders, will be done in this research. The dataset used in this research consists of 37,391 entries with 5 keywords. The research aims to understand how Twitter users respond and express their sentiments towards the presidential candidate through the use of deep learning classification techniques with Convolutional Neural Network (CNN), feature extraction using Term Frequency-Inverse Document Frequency (TF-IDF) method, and feature expansion with Word2Vec. Furthermore, this study employs Particle Swarm Optimization as an optimization technique to enhance the sentiment analysis model's performance. The test's results demonstrate a high degree of accuracy, offering a comprehensive picture of Twitter users' sentiments and perspectives toward the 2024 presidential contenders. This research helps to understand the dynamics of public opinion in the political context. Based on the evaluation results of the research, it yielded an accuracy of 78.2%, showcasing an improvement of 10.07% compared to the baseline.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33480/jitk.v9i2.5201"
    },
    {
        "id": 34417,
        "title": "Retracted: Design of Financial Management Model Using the Forward Neural Network Based on Particle Swarm Optimization Algorithm",
        "authors": "",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9839574"
    },
    {
        "id": 34418,
        "title": "Transformer fault diagnosis based on Chaotic Particle Swarm Optimization RBF Neural Network",
        "authors": "Aidong Ge, Jiakang Lei, Mingcan Sun",
        "published": "2023-10-1",
        "citations": 1,
        "abstract": "Abstract\nThis article uses logistic chaotic mapping to improve the particle swarm algorithm parameters and construct the chaotic particle swarm optimization (CPSO) algorithm. Then, the CPSO algorithm is used to optimize the width, weight, and center values of the Radial Basis Function Neural Networks (RBFNN) to improve the RBFNN model used to diagnose transformer fault types. Results show that the CPSO-RBFNN model has a small mean square error and high accuracy in diagnosing transformer faults.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/1742-6596/2625/1/012074"
    },
    {
        "id": 34419,
        "title": "Multi-objective Particle Swarm Optimization Algorithm for Feeder Capacity Planning of Distribution Network Considering Dynamic Load",
        "authors": "Xiang Yin, Jian Liu, Shi Cheng, Siqi Zang",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnepe60694.2023.10429172"
    },
    {
        "id": 34420,
        "title": "A Survey of Algorithms, Applications and Trends for Particle Swarm Optimization",
        "authors": "Jingzhong Fang, Weibo Liu, Linwei Chen, Stanislao Lauria, Alina Miron, Xiaohui Liu",
        "published": "2023-3-27",
        "citations": 15,
        "abstract": "Survey/review study\nA Survey of Algorithms, Applications and Trends for Particle Swarm Optimization\n\nJingzhong Fang 1, Weibo Liu 1,*, Linwei Chen 2, Stanislao Lauria 1, Alina Miron 1, and Xiaohui Liu 1\n\n\n1 Department of Computer Science, Brunel University London, Uxbridge, Middlesex, UB8 3PH, United Kingdom\n2 The School of Engineering, University of Warwick, Coventry CV4 7AL, United Kingdom\n* Correspondence: Weibo.Liu2@brunel.ac.uk\n \n \nReceived: 18 October 2022\nAccepted: 28 November 2022\nPublished: 27 March 2023\n \n\nAbstract: Particle swarm optimization (PSO) is a popular heuristic method, which is capable of effectively dealing with various optimization problems. A detailed overview of the original PSO and some PSO variant algorithms is presented in this paper. An up-to-date review is provided on the development of PSO variants, which include four types i.e., the adjustment of control parameters, the newly-designed updating strategies, the topological structures, and the hybridization with other optimization algorithms. A general overview of some selected applications (e.g., robotics, energy systems, power systems, and data analytics) of the PSO algorithms is also given. In this paper, some possible future research topics of the PSO algorithms are also introduced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53941/ijndi0201002"
    },
    {
        "id": 34421,
        "title": "Application K-Nearest Neighbor Method with Particle Swarm Optimization for Classification of Heart Disease",
        "authors": "Irmawati Carolina, Baginda Lubis, Adi Supriyatna, Rachman Komarudin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012446200003848"
    },
    {
        "id": 34422,
        "title": "A Novel Combination of Genetic Algorithm, Particle Swarm Optimization, and Teaching-Learning-Based Optimization for Distribution Network Reconfiguration in Case of Faults",
        "authors": "Nguyen Tung Linh",
        "published": "2024-2-8",
        "citations": 0,
        "abstract": "Reconfiguring distribution networks involves modifying their topological structure by managing switch states. This process is crucial in smart grids, as it can isolate faults, minimize power loss, and enhance system stability. However, in existing research, the reconfiguration task is often treated as a problem of either single- or multi-objective optimization and frequently overlooks the issue's multimodality. As a result, the solutions derived may be inadequate or unfeasible when facing environmental changes. In this study, the objective function of minimizing power loss considers the case of faults in the distribution grid. Coordinating the initial population division of the Genetic Algorithm (GA) with the Particle Swarm Optimization (PSO) and the Teaching and Learning-Based Optimization (TLBO) algorithms accelerates the process of finding the optimal solution, resulting in faster and more reliable results. The proposed method was tested on the IEEE-33 bus test system and was compared with other methods, demonstrating reliable results and superior efficiency.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48084/etasr.6718"
    },
    {
        "id": 34423,
        "title": "Multi-Objective Parameter Optimization of Submersible Well Pumps Based on RBF Neural Network and Particle Swarm Optimization",
        "authors": "Zhi-Min Liu, Xiao-Guang Gao, Yue Pan, Bei Jiang",
        "published": "2023-7-29",
        "citations": 1,
        "abstract": "In order to improve the hydraulic performance of a submersible well pump, steady and transient simulations were carried out based on ANSYS CFX software. The head and efficiency of the submersible well pump under standard operating conditions were taken as the optimization objectives, and the impeller outlet placement angle, outlet width, and vane wrap angle were selected as the optimization variables using the Plackett-Burman experimental design method. The RBF neural network training samples were constructed using the uniform experimental design method to build a hydraulic performance prediction model for the submersible well pump, and a multi-objective particle swarm optimization was used to solve the model and obtain the Pareto optimal solution set. Using the head and efficiency of the initial model as the boundary, the Pareto optimal solution and the corresponding structural parameters are sought. After the optimization, the head of the individual with the better head is increased by about 2.65 m, and the efficiency of the individual with the better efficiency is increased by about 2.3 percentage points compared with that of the initial model. The pressure gradient in the impeller flow channel is more obvious, the work capacity is significantly improved, the vortex area of the spatial guide vane is smaller, the flow line is more regular, and the pressure pulsation amplitude at the inlet and outlet of the impeller and the spatial guide vane is significantly reduced.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13158772"
    },
    {
        "id": 34424,
        "title": "Hyperparameter optimization for convolutional neural network by opposite-based particle swarm optimization and an empirical study of photomask defect classification",
        "authors": "Tzu-Yen Hong, Chin-Chien Chen",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.asoc.2023.110904"
    },
    {
        "id": 34425,
        "title": "Texture Filter Optimization Using Particle Swarm Optimization for Efficient Lung Image Classification",
        "authors": "",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47750/jptcp.2023.30.15.007"
    },
    {
        "id": 34426,
        "title": "A Load-Balanced Deployment Algorithm for Wireless Mesh Network Gateways in Open Campus areas using Improved Particle Swarm Optimization",
        "authors": "Youwu Liu, Rajamohan Parthasarathy",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ainit59027.2023.10212964"
    },
    {
        "id": 34427,
        "title": "Carbon Emission Prediction of Power Industry Based on Particle Swarm Optimization Long and Short Term Memory Neural Network",
        "authors": "Limei Wu, Honghong Hu, Lijun Wang",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/peeec60561.2023.00037"
    },
    {
        "id": 34428,
        "title": "Retracted: Application of Improved Particle Swarm Optimization Algorithm in Logistics Energy-Saving Picking Information Network",
        "authors": "",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9814620"
    },
    {
        "id": 34429,
        "title": "Prediction of Student Graduation with the Neural Network Method Based on Particle Swarm Optimization",
        "authors": "Hafis Nurdin, Sartini Sartini, Sumarna Sumarna, Yana Iqbal Maulana, Verry Riyanto",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "In private universities in Indonesia, student graduation is something that is worth paying attention to, because it will be an aspect of the success of the university. Universities certainly have data on students who graduated, where student graduation data is very important to be taken into consideration by private universities, however with a lot of data it will make it difficult for private universities to find information from this data. Other researchers have previously carried out student graduation data with the same data by examining student graduation data using other methods. So we need a data mining algorithm that has never been tested on student graduation data. The method used is the neural network method with an optimization method, namely the particle swarm optimization method, to test the data, which will later produce information that is very useful for universities. After testing the student graduation data and getting accuracy results using the neural network method of 84.55% and after being optimized using the particle swarm optimization method, the accuracy results were optimal with a value of 86.94%. These results can be used by private universities to predict that students will graduate on time before they take their final semester so that the student graduation rate will be high.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33395/sinkron.v8i4.12973"
    },
    {
        "id": 34430,
        "title": "Fault Diagnosis Strategy of Four-Switch Buck-Boost Converter Based on BP Neural Network Optimized by Particle Swarm Optimization",
        "authors": "Xueqi Liu, Xin Zhang, Kexin Hu",
        "published": "2023-8-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iciea58696.2023.10241891"
    },
    {
        "id": 34431,
        "title": "Distribution network reconfiguration strategy with soft open point using genetic algorithm and particle swarm optimization",
        "authors": "H.-W. Kim, S.-J. Ahn, S.-Y. Yun, J.-H. Choi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.1098"
    },
    {
        "id": 34432,
        "title": "Particle Swarm Training of a Neural Network for the Lower Upper Bound Estimation of the Prediction Intervals of Time Series",
        "authors": "Alexander Gusev, Alexander Chervyakov, Anna Alexeenko, Evgeny Nikulchev",
        "published": "2023-10-19",
        "citations": 1,
        "abstract": "Many time series forecasting applications use ranges rather than point forecasts. Producing forecasts in the form of Prediction Intervals (PIs) is natural, since intervals are an important component of many mathematical models. The LUBE (Lower Upper Bound Estimation) method is aimed at finding ranges based on solving optimization problems taking into account interval width and coverage. Using the Particle Swarm Training of simple neural network, we look for a solution to the optimization problem of the Coverage Width-Based Criterion (CWC), which is the exponential convolution of conflicting criteria PICP (Prediction Interval Coverage Probability) and PINRW (Prediction Interval Normalized Root-mean-square Width). Based on the concept of the Pareto compromise, it is introduced as a Pareto front in the space of specified criteria. The Pareto compromise is constructed as a relationship between conflicting criteria based on the found solution to the optimization problem. The data under consideration are the financial time series of the MOEX closing prices. Our findings reveal that a relatively simple neural network, comprising eight neurons and their corresponding 26 parameters (weights of neuron connections and neuron signal biases), is sufficient to yield reliable PIs for the investigated financial time series. The novelty of our approach lies in the use of a simple network structure (containing fewer than 100 parameters) to construct PIs for a financial time series. Additionally, we offer an experimental construction of the Pareto frontier, formed by the PICP and PINRW criteria.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11204342"
    },
    {
        "id": 34433,
        "title": "Setting Optimization of Distribution Network Current Protection Based on Constrained Multi‐Objectives Backbone Particle Swarm Optimization",
        "authors": "Xue Wang, Kun Luan",
        "published": "2024-3",
        "citations": 0,
        "abstract": "With the increase in residential electricity consumption, the number of branch lines connected to the 10 kV main line and the load all increase. When the main line is segmented into several shorter lines, the current protections of these lines are difficult to coordinate with each other. This condition may cause the number of protection mal‐operation increases, the power outage scope expands, and the reliability of the power supply decreases. Therefore, this paper studies the setting optimization method of distribution network current protections. First, a mathematical model of protection setting optimization is established with three objective functions keeping the fault clearing time minimal, the protection sensitivity highest, and the outage load minimal. Some constraints are considered, such as the cooperation between the protections of the adjacent lines. Second, the multi‐objective backbone particle swarm optimization algorithm is used. The problems of the traditional particle swarm optimization algorithm that lacks population diversity and easily falls into local optimization are solved by adopting the time‐varying variation and linear decreasing dynamic allocation strategy. Finally, the K‐means clustering algorithm is used to get the most representative optimal solution providing a variety of feasible solutions for the practical application. This paper takes a 10 kV line as an example to test the setting optimization method and compares the optimized settings with the traditional ones. The results show that the setting optimization method based on the constrained multi‐objective backbone particle swarm can effectively reduce the protection mal‐operations and improve the overall performance of distribution network protections. © 2023 Institute of Electrical Engineer of Japan and Wiley Periodicals LLC.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/tee.23977"
    },
    {
        "id": 34434,
        "title": "A Hybrid Particle Swarm Optimization and C4.5 for Network Intrusion Detection and Prevention System",
        "authors": "K.Nandha Kumar, D. Udaya Suriya Rajkumar, G. Viswanath, J. Mahalakshmi",
        "published": "2024-4-1",
        "citations": 0,
        "abstract": "Network Intrusion Detection and Prevention systems (NIDPS) ensure network security and used to effectively detect various attacks and completely stop them from intruding over a network. Since, securing sensitive information carried by various organizations is much more significant, developing enhanced security models become inevitable. To meet the growing demand in safeguarding the network from various known and unknown attacks. In this paper, a Hybrid Particle Swarm Optimization and C4.5 (HPSOCM) method is proposed to network based intrusion prevention system to detect unknown attacks and a signature based SNORT method to detect the known attacks in NIDS. In the hybrid method, we use data mining approach to mine the unknown attacks. Hence, we develop an anomalous detection model and train it using the data mining rules. The trained network is capable of detecting various unknown attacks. The conventional signature based SNORT method detects the known attacks by matching the detected threats from the KDD99 dataset. The proposed HPSOCM method is demonstrated using simulation and the performances were evaluated in terms of Accuracy, Specificity, Detection Rate and False Alarm Rate. The proposed method had produced better efficiency compared to various other existing methods.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47839/ijc.23.1.3442"
    },
    {
        "id": 34435,
        "title": "Particle Swarm Optimization of Deep Auto-Encoder Network Architectures for Anomaly-based Intrusion Detection Systems",
        "authors": "Quoc Trung Tran, Van Quan Nguyen, Thanh Long Ngo",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccais59597.2023.10382282"
    },
    {
        "id": 34436,
        "title": "Retracted: Low-Voltage Diagnosis of Energy Distribution Network Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9814723"
    },
    {
        "id": 34437,
        "title": "Flexible Load Collaborative Scheduling Method of Distribution Network Based on Particle Swarm Algorithm",
        "authors": "Jiayi Shang, Tianyu Zhao, Fei Li, Yamin Zheng, Haibo Lu, Zhipeng Zhang",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icocwc60930.2024.10470886"
    },
    {
        "id": 34438,
        "title": "Optimization Design of Particle Swarm Optimization for Intelligent Control of Rail Transit",
        "authors": "Shirong Liu",
        "published": "2023-8-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsi60108.2023.00018"
    },
    {
        "id": 34439,
        "title": "Neural Network Algorithm Based on Particle Swarm Optimization and Design of Immersive Intelligent English Teaching in College English Teaching System",
        "authors": "Yang Liu, Chaobin Zhang",
        "published": "2023-4-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdcece57866.2023.10151018"
    },
    {
        "id": 34440,
        "title": "FUSION OF HARRIS HAWK’S AND PARTICLE SWARM OPTIMIZATION TO IMPROVE PERFORMANCE IN WIRELESS NETWORK",
        "authors": "Herbert Raj P., Ravi Kumar P.",
        "published": "2023-6-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29284/ijasis.9.1.2023.20-28"
    },
    {
        "id": 34441,
        "title": "Drive Path Optimization for Electric Vehicles Using Particle Swarm Optimization",
        "authors": "George Onoja Idoko",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/atee58038.2023.10108264"
    },
    {
        "id": 34442,
        "title": "Multi-Guide Set-Based Particle Swarm Optimization for Multi-Objective Portfolio Optimization",
        "authors": "Kyle Erwin, Andries Engelbrecht",
        "published": "2023-1-17",
        "citations": 6,
        "abstract": "Portfolio optimization is a multi-objective optimization problem (MOOP) with risk and profit, or some form of the two, as competing objectives. Single-objective portfolio optimization requires a trade-off coefficient to be specified in order to balance the two objectives. Erwin and Engelbrecht proposed a set-based approach to single-objective portfolio optimization, namely, set-based particle swarm optimization (SBPSO). SBPSO selects a sub-set of assets that form a search space for a secondary optimization task to optimize the asset weights. The authors found that SBPSO was able to identify good solutions to portfolio optimization problems and noted the benefits of redefining the portfolio optimization problem as a set-based problem. This paper proposes the first multi-objective optimization (MOO) approach to SBPSO, and its performance is investigated for multi-objective portfolio optimization. Alongside this investigation, the performance of multi-guide particle swarm optimization (MGPSO) for multi-objective portfolio optimization is evaluated and the performance of SBPSO for portfolio optimization is compared against multi-objective algorithms. It is shown that SBPSO is as competitive as multi-objective algorithms, albeit with multiple runs. The proposed multi-objective SBPSO, i.e., multi-guide set-based particle swarm optimization (MGSBPSO), performs similarly to other multi-objective algorithms while obtaining a more diverse set of optimal solutions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a16020062"
    },
    {
        "id": 34443,
        "title": "Optimizing Broadband Access and Network Design in Wireless Mesh Networks using Multi-Objective Particle Swarm Optimization",
        "authors": "M. Neema, E.S. Gopi, Pulakunta Sandeep Reddy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.procs.2023.12.083"
    },
    {
        "id": 34444,
        "title": "Tri-branch feature pyramid network based on federated particle swarm optimization for polyp segmentation",
        "authors": "Kefeng Fan, Cun Xu, Xuguang Cao, Kaijie Jiao, Wei Mo",
        "published": "2024",
        "citations": 1,
        "abstract": "<abstract><p>Deep learning technology has shown considerable potential in various domains. However, due to privacy issues associated with medical data, legal and ethical constraints often result in smaller datasets. The limitations of smaller datasets hinder the applicability of deep learning technology in the field of medical image processing. To address this challenge, we proposed the Federated Particle Swarm Optimization algorithm, which is designed to increase the efficiency of decentralized data utilization in federated learning and to protect privacy in model training. To stabilize the federated learning process, we introduced Tri-branch feature pyramid network (TFPNet), a multi-branch structure model. TFPNet mitigates instability during the aggregation model deployment and ensures fast convergence through its multi-branch structure. We conducted experiments on four different public datasets$ \\colon $ CVC-ClinicDB, Kvasir, CVC-ColonDB and ETIS-LaribPolypDB. The experimental results show that the Federated Particle Swarm Optimization algorithm outperforms single dataset training and the Federated Averaging algorithm when using independent scattered data, and TFPNet converges faster and achieves superior segmentation accuracy compared to other models.</p></abstract>",
        "keywords": "",
        "link": "http://dx.doi.org/10.3934/mbe.2024070"
    },
    {
        "id": 34445,
        "title": "Improving the Functional Coverage Closure of Network-on-Chip using Particle Swarm Optimization",
        "authors": "N. Vamshi Krishna,  Aruna, J. Soumya",
        "published": "2023-7-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smacd58065.2023.10192207"
    },
    {
        "id": 34446,
        "title": "Hybrid Crow Search and Particle Swarm Algorithmic optimization based CH Selection method to extend Wireless Sensor Network operation",
        "authors": "Vinoth Kumar P, Venkatesh K",
        "published": "2024-4-5",
        "citations": 0,
        "abstract": "In ad hoc wireless sensor networks, the mobile nodes are deployed to gather data from source and transferring them to base station for reactive decision making. This process of data forwarding attributed by the sensor nodes incurs huge loss of energy which has the possibility of minimizing the network lifetime. In this context, cluster-based topology is determined to be optimal for reducing energy loss of nodes in WSNs. The selection of CH using hybrid metaheuristic algorithms is identified to be significant to mitigate the quick exhaustion of energy in entire network. This paper explores the concept of hybrid Crow Search and Particle Swarm Optimization Algorithm-based CH Selection (HCSPSO-CHS) mechanism is proposed with the merits of Flower Pollination Algorithm (FPA) and integrated Crow Search Algorithm (CSA) for efficient CH selection. It further adopted an improved PSO for achieving sink node mobility to improve delivery of packets to sink nodes. This HCSPSO-CHS approach assessed the influential factors like residual energy, inter and intra-cluster distances, network proximity and network grade during efficient CH selection. It facilitated better search process and converged towards the best global solution, such that frequent CH selection is avoided to maximum level. The outcomes of the suggested simulation HCSPSO-CHS confirm better performance depending on the maximum number of active nodes by 23.18%, prevent death of sensor nodes by 23.41% with augmented network lifetime of 33.58% independent of the number of nodes and rounds of data transmission.",
        "keywords": "",
        "link": "http://dx.doi.org/10.53759/7669/jmc202404028"
    },
    {
        "id": 34447,
        "title": "An artificial neural network-particle swarm optimization (ANN-PSO) approach to predict the aeration efficiency of venturi aeration system",
        "authors": "Anamika Yadav, Subha M. Roy",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.atech.2023.100230"
    },
    {
        "id": 34448,
        "title": "A Hybrid Algorithm of Quantum-Behaved Particle Swarm Optimization and Adam for ANN Training and Application for Classification Prediction",
        "authors": "Hanqiu Ye, Jianping Dong",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ntci60157.2023.10403715"
    },
    {
        "id": 34449,
        "title": "Optimization of NC CAD Machining Parameters Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Xianyi Li",
        "published": "2023-8-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14733/cadaps.2024.s6.53-62"
    },
    {
        "id": 34450,
        "title": "Simulation Research on Computer Network Attack and Defense Model Based on Particle Swarm Optimization Algorithm",
        "authors": "Wenting Ma, Xin Gao, Jianing Wang, Nannan Jiang, Lurong Sun",
        "published": "2023-10-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdacai59742.2023.00048"
    },
    {
        "id": 34451,
        "title": "A novel road traffic flow prediction model using hybrid Particle Swarm Optimization (PSO) and Radial Basis Function Neural Network (RBFNN)",
        "authors": "Shanhua Zhang, Hong Ki An",
        "published": "2023-8-10",
        "citations": 0,
        "abstract": "<p>Traffic congestion is a major problem in urban areas, leading to increased travel time, air pollution, and fuel consumption. Road impedance function, which describes the relationship between traffic status and travel time, plays an important role in predicting travel time and managing traffic flow. Traditional methods for estimating road impedance function rely on manual calibration and may have limitations in reflecting the complexity of traffic patterns. To address these challenges, researchers have proposed various machine learning models for predicting travel time and road impedance function. In this paper, a hybrid particle swarm optimization—radial basis function neural network model is proposed for improving the accuracy of the road impedance function. The model takes into consideration various vehicle types and is validated using travel time data collected from a road section in Huai’an City, China. The effectiveness of the proposed model is compared with the traditional road impedance function calibrated by nonlinear regression. The experimental results indicate that the Mean Relative Error (MRE) of PSORBFNN is increased by 3.89% and 6.28% respectively when compared with DPNR training samples and validation samples. When compared with DPPSO training and validation samples, the MRE of PSORBFNN is increased by 2.87% and 3.3% respectively. These findings suggest that the proposed model could guide and assist traffic engineers and practitioners in predicting travel time on road sections with improved accuracy.</p>",
        "keywords": "",
        "link": "http://dx.doi.org/10.32629/jai.v6i2.883"
    },
    {
        "id": 34452,
        "title": "Improved particle swarm optimization algorithms for network performance enhancement",
        "authors": "Dina Jamal Jabbar, Aseel H. Al-Nakkash, Rasha Thabit",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0189119"
    },
    {
        "id": 34453,
        "title": "A Study on Improved Particle Swarm Optimization Algorithm in Portfolio Optimization Problem",
        "authors": "Hao Wu, Qingxia Li, Wenhong Wei, Xiaohua Zeng",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10451733"
    },
    {
        "id": 34454,
        "title": "Financial Early Warning Optimization Model Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Chunyu Du",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icemce60359.2023.10491031"
    },
    {
        "id": 34455,
        "title": "Fuzzy Genetic Particle Swarm Optimization Convolution Neural Network Based On Oral Cancer Identification System",
        "authors": "R Dharani, S. Revathy, K. Danesh",
        "published": "2023-12-10",
        "citations": 0,
        "abstract": "Oral cancer is the eighth most common type of cancer in the world. Every year, 130,000 people in India die from mouth cancer. Getting a diagnosis from a clinical exam by skilled doctors and a biopsy takes time. When a problem is found early, it is always easier to treat. The primary goal of this work is to recognise disease-affected oral regions in a given oral image and classify the oral cancer disorder. This study employs unique Deep Learning algorithms to detect the location of disease-affected oral areas. This work employs the most effective feature extraction techniques, including appearance and patter-based features. Following feature extraction, the Bee Pulse Couple Neural Network (BeePCNN) algorithm is used to choose the best feature. Finally, Deep Learning is used to classify these attributes. An innovative FGPSOCNN reduces the computational complexity of CNN. On an additional real-time data set from Arthi Scan Hospital, a secondary evaluation is conducted. The experimental results indicate that the innovative FGPSOCNN performs better than existing methods.\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.37385/jaets.v5i1.2874"
    },
    {
        "id": 34456,
        "title": "Particle Swarm Optimization Algorithm for Gold Nanohole Array Design",
        "authors": "Francesco Floris, Margherita Angelini, Franco Marabelli",
        "published": "2023-5-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/iocn2023-14534"
    },
    {
        "id": 34457,
        "title": "Multi-swarm Particle Swarm Optimization with Chaotic Random Inertia Weight and Dynamic Learning Strategy for Multilevel Thresholding Image Segmentation",
        "authors": "Emir Turajlic",
        "published": "2024-2-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/it61232.2024.10475717"
    },
    {
        "id": 34458,
        "title": "A Hybrid Firefly with Dynamic Multi-swarm Particle Swarm Optimization for WSN Deployment",
        "authors": "Wei-Yan Chang Wei-Yan Chang, Prathibha Soma Wei-Yan Chang, Huan Chen Prathibha Soma, Hsuan Chang Huan Chen, Chun-Wei Tsai Hsuan Chang",
        "published": "2023-7",
        "citations": 0,
        "abstract": "\n                        <p>Enhancing the coverage area of the sensing range with the limiting resource is a critical problem in the wireless sensor network (WSN). Mobile sensors are patched coverage holes and they also have limited energy to move in large distances. Several recent studies indicated the metaheuristic algorithms can find an acceptable deployed solution in a reasonable time, especially the PSO-based algorithm. However, the speeds of convergence of most PSO-based algorithms are too fast which will lead to the premature problem to degrade the quality of deployed performance in WSN. A hybrid metaheuristic combined with dynamic multi-swarm particle swarm optimization and firefly algorithm will be presented in this paper to find an acceptable deployed solution with the maximum coverage rate and minimum energy consumption via static and mobile sensors. Moreover, a novel switch search mechanism between sub-swarms will also be presented for the proposed algorithm to avoid fall into local optimal in early convergence process. The simulation results show that the proposed method can obtain better solutions than other PSO-based deployment algorithms compared in this paper in terms of coverage rate and energy consumption.</p>\n<p>&nbsp;</p>\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.53106/160792642023072404001"
    },
    {
        "id": 34459,
        "title": "Decomposition and merging cooperative particle swarm optimization with random grouping for large-scale optimization problems",
        "authors": "Alanna McNulty, Beatrice Ombuki-Berman, Andries Engelbrecht",
        "published": "2023-11-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11721-023-00229-0"
    },
    {
        "id": 34460,
        "title": "Fusion Particle Swarm Optimization Algorithm in Automobile Engine Fault Diagnosis",
        "authors": "",
        "published": "2023-3-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.38007/kme.2023.040106"
    },
    {
        "id": 34461,
        "title": "Fault diagnosis of power transformer based on improved particle swarm optimization OS-ELM",
        "authors": "",
        "published": "2024-1-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.24425/aee.2019.125987"
    },
    {
        "id": 34462,
        "title": "Production Scheduling Optimization Method Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Chuchu Wang, Haijuan Zang",
        "published": "2023-5-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icmtim58873.2023.10246758"
    },
    {
        "id": 34463,
        "title": "NUMERICAL SOLUTION OF WAVELET NEURAL NETWORK LEARNING WEIGHTS USING ACCELERATED PARTICLE SWARM OPTIMIZATION ALGORITHM",
        "authors": "ANWER ZEB, SAIMA ANWAR LASHARI, ARSHAD KHAN, ABDULLAH KHAN, KASHIF NAZAR, MUHAMMAD ISHAQ",
        "published": "2023-1",
        "citations": 1,
        "abstract": " Artificial Neural Network (ANN) is a supervised learning nonlinear complex model. This characteristic enables ANN to be used in nonlinear system modeling and classification applications. This research work proposed a technique called Wavelet Neural Network (WNN), and in the hidden layers of WNN, Morlet and Mexican are used as an activation function. During the processing, the WNN gets stuck in the local minimum causing slow convergence. For evaluating such kinds of problems, numerous algorithms have been tried and used. Consequently, this proposed research work used a novel meta-heuristic search technique called Accelerated Particle Swarm Optimization (APSO) algorithm combined with the WNN. Due to the effective convergence and fast searching toward an optimal solution, the APSO algorithm is used. In the proposed APSOWNN algorithm, APSO searches for the best sub-search solution. In conclusion, this model is assessed on the basis of total of three different datasets like the 4-bit OR, 7-bit Parity and IRIS benchmark classification problems, and its efficiency is equated with criterion methods such like Wavelet Back Propagation Neural Network (WBPNN), Artificial Bee Colony Wavelet Neural Network (ABCWNN) and WNN. Finally, from the results of simulation, it has been concluded that the proposed algorithm’s performance is much better, as compared to the state-of-the-art algorithms in terms of mean square error.(MSE) and accuracy. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1142/s0218348x23400261"
    },
    {
        "id": 34464,
        "title": "Optimal capacitor bank placement and sizing using particle swarm optimization for power loss minimization in distribution network",
        "authors": "Prince Asabere, Francois Sekyere, Patrick Ayambire, Willie K. Ofosu",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jer.2024.03.007"
    },
    {
        "id": 34465,
        "title": "Reactive Power Optimization Based on the Application of an Improved Particle Swarm Optimization Algorithm",
        "authors": "Dimitris Mourtzis, John Angelopoulos",
        "published": "2023-7-9",
        "citations": 1,
        "abstract": "Climate change, improved energy efficiency, and access to contemporary energy services are among the key topics investigated globally. The effect of these transitions has been amplified by increased digitization and digitalization, as well as the establishment of reliable information and communication infrastructures, resulting in the creation of smart grids (SGs). A crucial aspect in optimizing energy production and distribution is reactive power optimization, which involves the utilization of algorithms such as particle swarm optimization (PSO). However, PSO algorithms can suffer from premature convergence and being trapped in local optima. Therefore, in this research the design and development of an improved PSO algorithm for minimization of power loss in the context of SGs is the key contribution. For digital experimentation and benchmarking of the proposed framework, the IEEE 30-bus standardized model is utilized, which has indicated that an improvement of approximately 11% compared to conventional PSO algorithms can be achieved.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/machines11070724"
    },
    {
        "id": 34466,
        "title": "Prediction of wear rates of Al-TiO2 nanocomposites using artificial neural network modified with particle swarm optimization algorithm",
        "authors": "Ismail Najjar, Ayman Sadoun, M.N. Alam, Adel Fathy",
        "published": "2023-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.mtcomm.2023.105743"
    },
    {
        "id": 34467,
        "title": "Nonlinear topology network routing shortest path based on improved particle swarm optimization algorithm",
        "authors": "Hui Zheng, Jin Jin, Dongshuai Jin, Yifan Wang, Guoquan Zhang, Shenguo Zhang",
        "published": "2023-10-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccasit58768.2023.10351742"
    },
    {
        "id": 34468,
        "title": "Fault Segment Location in Distributed Distribution Network Based on Improved Particle Swarm Optimization Algorithm",
        "authors": "Liansuo Zheng, Zhanshan Wang, Changlai Wang",
        "published": "2023-1-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsie55183.2023.10175228"
    },
    {
        "id": 34469,
        "title": "Storage quality prediction of winter jujube based on particle swarm optimization-backpropagation-artificial neural network (PSO-BP-ANN)",
        "authors": "Jingyi Zhang, Cunkun Chen, Caie Wu, Xiaohong Kou, Zhaohui Xue",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.scienta.2023.112789"
    },
    {
        "id": 34470,
        "title": "Steel Lazy Wave Riser Optimization Using Particle Swarm Optimization Algorithm",
        "authors": "Mayank Lal, Anurag Yenduri, Abhilash Sebastian",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "Abstract\nSteel lazy wave risers have become a preferred riser solution as offshore oil and gas developments are happening in deeper waters and harsher environments. Steel lazy wave risers work well with FPSOs even though FPSO motions are worse compared to other floating platforms such as Spars and Semisubmersibles. FPSOs offer a tremendous advantage compared to other floating platforms as they can be used in regions with inadequate pipeline infrastructure to transport oil and gas to shore. The targeted placement of buoyancy modules on steel lazy wave risers improves the strength and fatigue performance compared to steel catenary risers making them feasible for use with FPSO’s. Also, buoyancy modules on steel lazy wave risers help reduce the top tension compared to steel catenary risers which gains significance in ultra-deepwater developments where top tensions for steel catenary risers make them an infeasible riser solution.\nSteel lazy wave riser configuration design is dependent on a few parameters such as hang-off angle, length to start of buoyancy section, length of buoyancy section, type of buoyancy, and buoyancy factor. Theoretically, there are infinite solutions for a steel lazy wave riser configuration. Hence, the design of steel lazy wave riser is an optimization problem in which the parameters that govern the design can be varied to get an optimized configuration. In this paper, the particle swarm algorithm which is a bio-inspired algorithm is used to find an optimal solution for steel lazy wave riser configuration. The solution space is searched for an optimal steel lazy wave riser configuration based on an objective function which is a function of strength response, fatigue response, and cost. Solutions with poor interference response are penalized in the algorithm and rejected as part of the solution space search process. Finding an optimal solution automatically will help reduce the overall cost of risers which is a significant part of any offshore development. Also, it will help in making the riser design efficient from strength and fatigue point of view in addition to making it robust and streamlined.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1115/omae2023-103743"
    },
    {
        "id": 34471,
        "title": "Landslide identification using water cycle particle swarm optimization‐based deep generative adversarial network",
        "authors": "Lijesh Lekshmanan, Arockia Selva Saroja George",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "SummaryA natural vulnerability called a landslide threatens people, property, and infrastructure in many different places all over the world. Various landslide identification techniques are developed to assess the landslide hazard, but accurate identification of landslide occurrence particularly in certain regions remains a challenging issue, due to the complex scale‐dependent processes among geomorphometric features and landslides. To solve the shortcomings of landslide identification, the water cycle particle swarm optimization‐based deep generative adversarial network (WCPSO‐based Deep GAN) hybridization technique is presented. To develop the developed WCPSO, the water cycle algorithm (WCA) and particle swarm optimization (PSO) were hybridized. The landslide rainfall dataset is used as the source of the input data in this instance, and the Manhattan distance approach is then used to do feature selection. After performing data augmentation based on the results of the feature selection, the proposed WCPSO‐based deep GAN approach accurately detects the landslides. The developed WCPSO‐driven deep GAN's performance is also measured using the three metrics accuracy, specificity, and sensitivity, with a maximum accuracy of 0.937, higher specificity of 0.919, and higher sensitivity of 0.952.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/cpe.7617"
    },
    {
        "id": 34472,
        "title": "Particle Swarm Optimization for Wireless Sensor Network Lifespan Maximization",
        "authors": "Souad Kamel, Abeer Al Qahtani, Abdullah Saad Musaed Al-Shahrani",
        "published": "2024-4-2",
        "citations": 0,
        "abstract": "Despite the deployment of wireless sensor networks in diverse fields (health, environment, military applications, etc.) for tracking or monitoring, several challenges, such as extending the lifetime of the network under energy constraints, still need to be resolved. Lifetime is the operational time of the network during which it can perform dedicated tasks and satisfy the application requirements. The energy constraints dictate that the energy consumption of sensors should be minimized since in most cases the sensors are battery-powered. Various methods have been proposed to work around this problem using scheduling approaches. In this paper, particle swarm optimization-based scheduling was designed and implemented to maximize the lifetime of wireless sensor networks formulated as a Non-Disjoint Sets Cover (NDSC) problem. The experimental findings show that the proposed approach is extremely competitive to the state-of-the-art algorithms, as it is able to find the optimal and best-known solutions in the instances investigated.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48084/etasr.6752"
    },
    {
        "id": 34473,
        "title": "Improving Performance of Fuzzy-Based Handoff for Spectrum Utilization in Cognitive Radio Network Using Particle Swarm Optimization",
        "authors": "Sampurna Dadi Riskiono, Selo Sulistiyo, I. Wayan Mustika",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12720/jait.14.4.803-810"
    },
    {
        "id": 34474,
        "title": "Co-Channel Interference Mitigation in 5g Network using Particle Swarm Optimization",
        "authors": "Chinenye Eberechi Uchegbu, Okorocha Richard, Okore Uchenna Elekwa",
        "published": "2024",
        "citations": 0,
        "abstract": "The co-channel interference problem in 5G wireless networks is the subject of this research project. Even with the improvements brought forth by 5G, co-channel interference still degrades network speed and signal quality. Particle Swarm Optimization (PSO) is the method used in this study to minimize this interference and improve network performance by fine-tuning resource allocation settings. PSO-based interference mitigation, network modeling, simulation, an overview of the literature, and comparative analysis are all included in the study. The study is valuable for communication engineers since it explores PSO as a means of improving network quality and expanding our knowledge of wireless technology, even though it is restricted to co-channel interference and PSO. In the sphere of 5G wireless communication, this discovery represents a substantial advancement. The application of particle swarm optimization has shown to be innovative in addressing the complex problem of co-channel interference. Insights into the possibilities of clever optimization strategies for interference reduction can be gained from the applied models and results. With 5G networks set to revolutionize the digital environment, these findings provide a strong basis for future research efforts focused at refining interference avoidance techniques and ultimately boosting the performance and dependability of these networks.",
        "keywords": "",
        "link": "http://dx.doi.org/10.51583/ijltemas.2023.121203"
    },
    {
        "id": 34475,
        "title": "A Hybrid Feature Selection Approach based on Random Forest and Particle Swarm Optimization for IoT Network Traffic Analysis",
        "authors": "Santosh H Lavate, P. K. Srivastava",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "The complexity and volume of network traffic has increased significantly due to the emergence of the “Internet of Things” (IoT). The classification accuracy of the network traffic is dependent on the most pertinent features. In this paper, we present a hybrid feature selection method that takes into account the optimization of Particle Swarms (PSO) and Random Forests. The data collected by the security firm, CIC-IDS2017, contains a large number of attacks and traffic instances. To improve the classification accuracy, we use the framework's RF algorithm to identify the most important features. Then, the PSO algorithm is used to refine the selection process. According to our experiments, the proposed method performed better than the other methods when it comes to the classification accuracy. It achieves a ~99.9% accuracy when using a hybrid of Random Forest and PSO. The hybrid approach also helps improve the model's performance. The suggested method can be utilized by security analysts and network administrators to identify and prevent attacks on the IoT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37391/ijeer.110244"
    },
    {
        "id": 34476,
        "title": "Optimization and Performance Analysis of Particle Swarm Optimization Algorithm in Learning Behavior System",
        "authors": "Miaoxiu Guo",
        "published": "2023-10-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/easct59475.2023.10393572"
    },
    {
        "id": 34477,
        "title": "A Review on Convergence Analysis of Particle Swarm Optimization",
        "authors": "Dereje Tarekegn, Surafel Tilahun, Tekle Gemechu",
        "published": "2023-8-18",
        "citations": 3,
        "abstract": "Particle swarm optimization (PSO) is one of the popular nature-inspired metaheuristic algorithms. It has been used in different applications. The convergence analysis is among the key theoretical studies in PSO. This paper discusses major contributions in the convergence analysis of PSO. A systematic classification will be used for the review purpose. Possible future works are also highlighted as to investigate the performance of PSO variants to deal with COPs through theoretical perspective and general discussions on experimental results on merits of the proposed approach.",
        "keywords": "",
        "link": "http://dx.doi.org/10.4018/ijsir.328092"
    },
    {
        "id": 34478,
        "title": "Two-Swarm Cooperative Particle Swarm Optimization Including Prediction Using Gaussian Process Regression",
        "authors": "Tomohiro Hayashida, Ichiro Nishizaki, Shinya Sekizaki, Yuki Kashihara",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/smc53992.2023.10393969"
    },
    {
        "id": 34479,
        "title": "Multi-objective Reactive Power Optimization of a Distribution Network based on Improved Quantum-behaved Particle Swarm Optimization",
        "authors": "Weifeng Song, Gang Ma, Yuxuan Zhao, Weikang Li, Yuxiang Meng",
        "published": "2023-10-3",
        "citations": 0,
        "abstract": "\nBackground::\nReactive power optimization (RPO) is crucial for distribution networks\nin the context of large-scale renewable distributed generation (RDG) access.\n\n\nbackground:\nReactive power optimization (RPO) is crucial for distribution networks in the context of large-scale renewable distributed generation access.\n\n\nObjective::\nTo address the problems caused by the connection of RDG, an RPO model and an improved\nquantum-behaved particle swarm optimization (IQPSO) algorithm are proposed.\n\n\nMethod:\nIn this study, a dynamic S-type function is proposed as the objective function of the minimum\nactive power loss, whereas an exponential function is proposed as the objective function of\nthe minimum voltage deviation to establish an RPO objective function. The operating cost of distribution\nis considered as the third objective function. To address the RPO problem, a QPSO algorithm\nbased on the ε-greedy strategy is proposed in this paper. ModifiedIEEE33 bus and IEEE69\nbus systems were used to evaluate the proposed RPO method in simulations\n\n\nResults::\nThe simulation results reveal that the IQPSO algorithm obtains a better solution, and the\nproposed RPO model can considerably reduce active power loss, node voltage deviation, and distribution\nnetwork operating costs.\n\n\nConclusion::\nThe RPO model and IQPSO algorithm proposed in this study provide a highperformance\nmethod to analyze and optimize reactive power management in distribution network.\n\n\nconclusion:\nThe RPO model and IQPSO algorithm proposed in this paper provides a high-performance method to analyze and optimize reactive power management in distribution network.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.2174/0123520965262291230927052452"
    },
    {
        "id": 34480,
        "title": "Exponential Particle Swarm Optimization Algorithm for Complexly Structured Images Segmentation",
        "authors": "Samer El-Khatib, Yuri Skobtsov, Sergey Rodzin",
        "published": "2023-7-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/engproc2023033047"
    },
    {
        "id": 34481,
        "title": "Prediction of Heart Disease Using Decision Tree in Comparison with Particle Swarm Optimization to Improve Accuracy",
        "authors": "Ina Maryani, . Rousyati, . Indriyanti, Dany Pratmanto, Yustina Kristania, Mawadatul Maulidah",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012447300003848"
    },
    {
        "id": 34482,
        "title": "Capacity Consistency Prediction and Process Parameter Optimization of Lithium‐Ion Battery based on Neural Network and Particle Swarm Optimization Algorithm",
        "authors": "Youjun Han, Hongyuan Yuan, Ying Shao, Jin Li, Xuejie Huang",
        "published": "2023-8",
        "citations": 0,
        "abstract": "AbstractThe grading capacity of lithium‐ion battery is an important basis for evaluating battery quality. Aiming at the difficulty of determining the critical control factors and the threshold of the control parameters in the lithium‐ion battery manufacturing process, a capacity prediction and process parameter optimization model of lithium‐ion battery is proposed by combining the back propagation (BP) and particle swarm optimization (PSO) algorithms. First, the BP method is applied to establish the nonlinear mapping relationship between process data and grading capacity, which is regarded as the capacity consistency prediction model. Second, using the prediction model as fitness function and combining with PSO algorithm, the optimization model of process parameters is established. Finally, under the given initial process parameters from the lithium‐ion battery pilot line, it is carried out to obtain the best process parameter formula. The results show that the BP method has an accurate capacity consistency prediction effect. Combined with PSO algorithm, the optimized process parameters are obtained, which significantly improves the capacity consistency of lithium‐ion batteries. The results serve as an engineering application method to guide the selection and confirmation of process parameters at the battery design stage.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/adts.202300125"
    },
    {
        "id": 34483,
        "title": "An improved discrete particle swarm optimization approach for a multi-objective optimization model of an urban logistics distribution network considering traffic congestion",
        "authors": "K. Li, D. Li, H.Q. Ma",
        "published": "2023-7-23",
        "citations": 1,
        "abstract": "To optimize urban logistics networks, this paper proposes a multi-objective optimization model for urban logistics distribution networks (ULDN). The model optimizes vehicle usage costs, transportation costs, penalty costs for failing to meet time windows, and carbon emission costs, while also considering the impact of urban road traffic congestion on total costs. To solve the model, a DPSO (Discrete Particle Swarm Optimization) algorithm based on the basic principle of PSO (Particle Swarm Optimization) is proposed. The DPSO introduces multiple populations to handle multiple targets and uses a variable neighbourhood search strategy to improve the search ability of particles, which helps to improve the local search ability of the algorithm. Simulation results demonstrate the effectiveness of the proposed model in avoiding traffic congestion, reducing carbon emissions costs, and time penalty costs. The optimization comparison results between DPSO and PSO also verify the superiority of the DPSO algorithm. The proposed model can be applied to real-world urban logistics networks to improve their efficiency, reduce costs, and minimize environmental impact.",
        "keywords": "",
        "link": "http://dx.doi.org/10.14743/apem2023.2.468"
    },
    {
        "id": 34484,
        "title": "Particle Swarm Optimization-Based Unconstrained Polygonal Fitting of 2D Shapes",
        "authors": "Costas Panagiotakis",
        "published": "2024-1-7",
        "citations": 0,
        "abstract": "In this paper, we present a general version of polygonal fitting problem called Unconstrained Polygonal Fitting (UPF). Our goal is to represent a given 2D shape S with an N-vertex polygonal curve P with a known number of vertices, so that the Intersection over Union (IoU) metric between S and P is maximized without any assumption or prior knowledge of the object structure and the location of the N-vertices of P that can be placed anywhere in the 2D space. The search space of the UPF problem is a superset of the classical polygonal approximation (PA) problem, where the vertices are constrained to belong in the boundary of the given 2D shape. Therefore, the resulting solutions of the UPF may better approximate the given curve than the solutions of the PA problem. For a given number of vertices N, a Particle Swarm Optimization (PSO) method is used to maximize the IoU metric, which yields almost optimal solutions. Furthermore, the proposed method has also been implemented under the equal area principle so that the total area covered by P is equal to the area of the original 2D shape to measure how this constraint affects IoU metric. The quantitative results obtained on more than 2800 2D shapes included in two standard datasets quantify the performance of the proposed methods and illustrate that their solutions outperform baselines from the literature.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/a17010025"
    },
    {
        "id": 34485,
        "title": "Retracted: Evaluation Model of Physical Education Effect: On the Application of Radial Basis Function-Particle Swarm Optimization Neural Network (RBFNN-PSO)",
        "authors": "",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1155/2023/9835213"
    },
    {
        "id": 34486,
        "title": "A Capability Fitting and Data Reconstruction Model Based on Particle Swarm Optimization-Bidirectional Deep Neural Network for Search and Rescue System of Systems",
        "authors": "Yan Gao, Hu Liu, Fu Niu, Yongliang Tian",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/access.2023.3240444"
    },
    {
        "id": 34487,
        "title": "Efficiency-optimized 6G: A virtual network resource orchestration strategy by enhanced particle swarm optimization",
        "authors": "Sai Zou, Junrui Wu, Haisheng Yu, Wenyong Wang, Lisheng Huang, Wei Ni, Yan Liu",
        "published": "2023-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.dcan.2023.06.008"
    },
    {
        "id": 34488,
        "title": "Application of the particle swarm optimization algorithm-back propagation neural network algorithm introducing new parameter terms in the application field of industrial design",
        "authors": "Yuan Tian, Yu Chang",
        "published": "2024-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.rineng.2023.101728"
    },
    {
        "id": 34489,
        "title": "Estimation of Iron Loss in Permanent Magnet Synchronous Motors Based on Particle Swarm Optimization and a Recurrent Neural Network",
        "authors": "Kai Xu, Youguang Guo, Gang Lei, Jianguo Zhu",
        "published": "2023-12-11",
        "citations": 0,
        "abstract": "The popularity of permanent magnet synchronous motors (PMSMs) has increased in recent years due to their high efficiency, compact size, and low maintenance needs. Calculating iron loss in PMSMs is crucial for designing and optimizing PMSMs to achieve high efficiency and a long lifespan, as this can significantly affect motor performance. However, multiple factors influence the accuracy of iron loss calculations in PMSMs, including the intricate magnetic behavior of the motor under different operating conditions, as well as the influence of the motor’s dynamic behavior during the operation process. This paper proposes a method based on particle swarm optimization (PSO) and a recurrent neural network (RNN) to estimate the iron loss in PMSMs, independent of the empirical iron loss formula. This method establishes an iron loss calculation model considering high-order harmonics, rotating magnetization, and temperature factors. Accounting for the multifactor influence, the model studies the law of loss change under different magnetic flux densities, frequencies, and temperature conditions. To avoid the deviation problem caused by conventional polynomial fitting, a multilayer RNN and PSO are used to train and optimize the neural network. Iron loss in complex cases beyond the measurement range can be accurately estimated. The proposed method helps achieve a PMSM iron loss calculation model with broad applicability and high accuracy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/magnetism3040025"
    },
    {
        "id": 34490,
        "title": "An effective hybrid particle swarm—artificial neural network optimization for predicting green bio-fiber mechanical characteristics and optimizing biomaterial performance",
        "authors": "Nashat Nawafleh, Faris M Al-Oqla",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "Abstract\nNatural fiber-reinforced composites are currently utilized in several applications due to worldwide environmental and cost concerns. However, these composites have production challenges such as poor reinforcement-matrix adhesion, that sophisticates the prediction of their mechanical properties. This study presents a novel, robust hybrid particle swarm—artificial neural network optimization (PSO-ANN) methodology to assess and create accurate predictions of the green bio-fibers to optimize and improve the mechanical features of biomaterials for green bio-products instead of performing tedious experimental works. As the mechanical qualities of green bio-fibers might differ from one fiber to another due to several interacted parameters, high complexity in predicting the bio-fiber capabilities exists. Therefore, this work utilizes suitable methods with a non-linear activation function to predict the mechanical characteristics of natural fibers that allow the researchers to improve the choices of natural fibers for biomaterials on the basis of cellulose content, the microfibrillar angle, and the diameter of natural fibers, decreasing the duration of the process required to characterize materials experimentally. The reliability of the introduced PSO-ANN model was verified by the investigations of the fiber’s tensile stress and Young’s modulus. Results showed that the presented model is capable of consistently and accurately monitoring the mechanical performance to a large degree, in comparison with experimental results. This in fact would facilitate and simplify the process of selecting the best natural fiber composites, which speeds up the experimental characterization phase and improves energy efficiency in the process of converting energy into monetary income, which would have ramifications for both economies and ecosystems. The anticipated method would also boost scientific evaluation of green fibers, confirming their role as a replacement material for green product fulfillment in future eco-friendly manufacturing.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1088/2631-6331/ad1b28"
    },
    {
        "id": 34491,
        "title": "Data Preprocessing Optimization Algorithm Based on Improved Particle Swarm Optimization",
        "authors": "Shen Wuqiang, Shen Guiquan, Cui Lei, Zeng Jijun",
        "published": "2023-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icnetic59568.2023.00152"
    },
    {
        "id": 34492,
        "title": "Optimization of box cover plate parameters based on particle swarm optimization algorithm",
        "authors": "Y. Gong, P. Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2023.2929"
    },
    {
        "id": 34493,
        "title": "FACTS Devices Optimization for Optimal Power Flow Using  Particle Swarm Optimization In Sulselrabar System",
        "authors": "Makmur SAINI",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15199/48.2024.04.13"
    },
    {
        "id": 34494,
        "title": "A new NIALM system design based on neural network architecture and adaptive springy particle swarm optimization algorithm",
        "authors": "Saeid Rastegar, Rui Araújo, Milad Malekzadeh, Alvaro Gomes, Humberto Jorge",
        "published": "2023-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12053-023-10125-5"
    },
    {
        "id": 34495,
        "title": "Optimal protective relaying scheme of distributed generation connected distribution network using particle swarm optimization-gravitational search algorithm technique",
        "authors": "Arathi Pothakanahalli Bheemasenarao, Shankaralingappa C Byalihal",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "<span lang=\"EN-US\">This paper develops particle swarm optimization integrated with gravitational search algorithm (PSO-GSA) to coordinate the relays in a distribution system with distributed generation (DG) connectivity. This algorithm combines PSO and GSA to improve the performance of the relay protection system. To prevent relay malfunctions following DG penetration, a suitable primary and backup relay is chosen. The PSO-GSA is coded using MATLAB software and tested on an IEEE 4-bus system simulated in Simulink. Results indicate that, when compared to using regular PSO and GSA procedures individually, the PSO-GSA technique reduces the operating time of the relay significantly.</span>",
        "keywords": "",
        "link": "http://dx.doi.org/10.11591/ijece.v13i3.pp2568-2578"
    },
    {
        "id": 34496,
        "title": "Cancer Detection Using a New Hybrid Method Based on Pattern Recognition in MicroRNAs Combining Particle Swarm Optimization Algorithm and Artificial Neural Network",
        "authors": "Sepideh Molaei, Stefano Cirillo, Giandomenico Solimando",
        "published": "2024-3-19",
        "citations": 0,
        "abstract": "MicroRNAs (miRNAs) play a crucial role in cancer development, but not all miRNAs are equally significant in cancer detection. Traditional methods face challenges in effectively identifying cancer-associated miRNAs due to data complexity and volume. This study introduces a novel, feature-based technique for detecting attributes related to cancer-affecting microRNAs. It aims to enhance cancer diagnosis accuracy by identifying the most relevant miRNAs for various cancer types using a hybrid approach. In particular, we used a combination of particle swarm optimization (PSO) and artificial neural networks (ANNs) for this purpose. PSO was employed for feature selection, focusing on identifying the most informative miRNAs, while ANNs were used for recognizing patterns within the miRNA data. This hybrid method aims to overcome limitations in traditional miRNA analysis by reducing data redundancy and focusing on key genetic markers. The application of this method showed a significant improvement in the detection accuracy for various cancers, including breast and lung cancer and melanoma. Our approach demonstrated a higher precision in identifying relevant miRNAs compared to existing methods, as evidenced by the analysis of different datasets. The study concludes that the integration of PSO and ANNs provides a more efficient, cost-effective, and accurate method for cancer detection via miRNA analysis. This method can serve as a supplementary tool for cancer diagnosis and potentially aid in developing personalized cancer treatments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/bdcc8030033"
    },
    {
        "id": 34497,
        "title": "Software Effort Estimation Using Cascade Neural Network Optimized Based on Modified Particle Swarm Optimization (MPSO-CNN)",
        "authors": "SAURABH BILGAIYAN, Mohammed Abdulmajeed Moharram, Santwana Sagnika",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1504/ijpqm.2023.10055552"
    },
    {
        "id": 34498,
        "title": "Enhancing heed protocol using the particle swarm optimization algorithm in underwater wireless sensor network",
        "authors": "Ruqaiya D. Jalal, Salah A. Aliesawi",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0190525"
    },
    {
        "id": 34499,
        "title": "Adaptive Hyperparameter Fine-Tuning for Boosting the Robustness and Quality of the Particle Swarm Optimization Algorithm for Non-Linear RBF Neural Network Modelling and Its Applications",
        "authors": "Zohaib Ahmad, Jianqiang Li, Tariq Mahmood",
        "published": "2023-1-3",
        "citations": 9,
        "abstract": "A method is proposed for recognizing and predicting non-linear systems employing a radial basis function neural network (RBFNN) and robust hybrid particle swarm optimization (HPSO) approach. A PSO is coupled with a spiral-shaped mechanism (HPSO-SSM) to optimize the PSO performance by mitigating its constraints, such as sluggish convergence and the local minimum dilemma. Three advancements are incorporated into the hypothesized HPSO-SSM algorithms to achieve remarkable results. First, the diversity of the search process is promoted to update the inertial weight ω based on the logistic map sequence. Then, two distinct parameters are trained in the original position update algorithm to enhance the work efficiency of the successive generation. Finally, the proposed approach employs a spiral-shaped mechanism as a local search operator inside the optimum solution space. Moreover, the HPSO-SSM method concurrently improves the RBFNN parameters and network size, building a model with a compact configuration and higher precision. Two non-linear benchmark functions and the total phosphorus (TP) modelling issue in a waste water treatment process (WWTP) are utilized to assess the overall efficacy of the creative technique. The results of testing indicate that the projected HPSO-SSM-RBFNN algorithm performed very effectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/math11010242"
    },
    {
        "id": 34500,
        "title": "Wind energy system fault classification and detection using deep convolutional neural network and particle swarm optimization‐extreme gradient boosting",
        "authors": "Chun‐Yao Lee, Edu Daryl C. Maceren",
        "published": "2024-3-12",
        "citations": 0,
        "abstract": "AbstractWind energy is crucial in the global shift towards a sustainable energy system. Thus, this research innovatively addresses the challenges in wind energy system fault classification and detection, emphasising the integration of robust machine learning methodologies. Our study focuses on enhancing fault management through supervisory control and data acquisition (SCADA) systems, addressing imbalanced data representation issues and error vulnerabilities. A key innovation lies in applying particle swarm optimisation‐tuned extreme gradient boosting (XGBoost) on imbalanced SCADA datasets, combining resampled SCADA data with deep learning features produced by deep convolutional neural networks. The novel use of PSO‐XGBoost showcases effectiveness in optimising parameters and ensuring model robustness. Furthermore, our research contributes to supervised and unsupervised anomaly detection models using Seasonal‐Trend decomposition using locally estimated scatterplot smoothing and PSO‐XGBoost, presenting substantial advancements in fault classification and prediction metrics. Overall, the study offers a unique, integrated framework for fault management, demonstrating improved reliability in predictive maintenance architectures. Lastly, it highlights the transformative potential of advanced machine learning in enhancing sustainability within efficient and clean energy production.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/esi2.12144"
    },
    {
        "id": 34501,
        "title": "Dynamic particle swarm optimization-radial function extremum neural network method of HCF probability analysis for compressor blade",
        "authors": "Jingshan Wei, Qun Zheng, Wei Yan, Bin Jiang",
        "published": "2023-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijfatigue.2023.107900"
    },
    {
        "id": 34502,
        "title": "Multi-Objective Path Optimization in Fog Architectures Using the Particle Swarm Optimization Approach",
        "authors": "Nerijus Morkevičius, Agnius Liutkevičius, Algimantas Venčkauskas",
        "published": "2023-3-14",
        "citations": 4,
        "abstract": "IoT systems can successfully employ wireless sensor networks (WSNs) for data gathering and fog/edge computing for processing collected data and providing services. The proximity of edge devices to sensors improves latency, whereas cloud assets provide higher computational power when needed. Fog networks include various heterogeneous fog nodes and end-devices, some of which are mobile, such as vehicles, smartwatches, and cell phones, while others are static, such as traffic cameras. Therefore, some nodes in the fog network can be randomly organized, forming a self-organizing ad hoc structure. Moreover, fog nodes can have different resource constraints, such as energy, security, computational power, and latency. Therefore, two major problems arise in fog networks: ensuring optimal service (application) placement and determining the optimal path between the user end-device and the fog node that provides the services. Both problems require a simple and lightweight method that can rapidly identify a good solution using the constrained resources available in the fog nodes. In this paper, a novel two-stage multi-objective path optimization method is proposed that optimizes the data routing path between the end-device and fog node(s). A particle swarm optimization (PSO) method is used to determine the Pareto Frontier of alternative data paths, and then the analytical hierarchy process (AHP) is used to choose the best path alternative according to the application-specific preference matrix. The results show that the proposed method works with a wide range of objective functions that can be easily expanded. Moreover, the proposed method provides a whole set of alternative solutions and evaluates each of them, allowing us to choose the second- or third-best alternative if the first one is not suitable for some reason.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/s23063110"
    },
    {
        "id": 34503,
        "title": "Self-optimization examination system based on improved particle swarm optimization",
        "authors": "Xiangran Du, Min Zhang, Yulin He",
        "published": "2023-2-21",
        "citations": 0,
        "abstract": "Abstract\nArtificial intelligence has been applied to many fields successfully and saved many human and material resources. The intelligent examination system is a typical application case, which makes teachers can not only master the study situation of every candidate at any time but also design further study plans with the help of the examination system. A self-optimization examination system is shown in this paper, which is carried out by an improved particle swarm optimization. The intelligent examination system can surmount two difficulties shown in the construction of the traditional examining system, one is the setting of the attributes of the examination questions, and another is the maintenance of the database of the examination questions. The experiment shows that the novel method can not only optimize the attributes of the questions in the examination database intelligently but also maintain the examination database effectively through massive training.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/nleng-2022-0271"
    },
    {
        "id": 34504,
        "title": "Optimization of pump allocation in real water networks for water quality improvement using particle swarm optimization",
        "authors": "Bingjing Lu, Minxi Zhang, Zeyang Yan, Guoliang Yu",
        "published": "2023-6-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/oceanslimerick52467.2023.10244548"
    }
]