[
    {
        "id": 24505,
        "title": "Gesture Recognition in Millimeter-Wave Radar based on Spatio-Temporal Feature Sequences",
        "authors": "Qun Fang, YiHui Yan, GuoQing Ma",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Gesture recognition is a pivotal technology in the realm of intelligent education, and millimeter-wave (mmWave) signals possess advantages such as high resolution and strong penetration capability. This paper introduces a highly accurate and robust gesture recognition method using mmWave radar. The method involves capturing the raw signals of hand movements with the mmWave radar module and preprocessing the received radar signals, including Fourier transformation, distance compression, Doppler processing, and noise reduction through moving target indication (MTI). The preprocessed signals are then fed into the Convolutional Neural Network-Time Domain Convolutional Network (CNN-TCN) model to extract spatio-temporal features, with recognition performance evaluated through classification. Experimental results demonstrate that this method achieves an accuracy rate of 98.2% in domain-specific recognition and maintains a consistently high recognition rate across different neural networks, showcasing exceptional recognition performance and robustness",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131610"
    },
    {
        "id": 24506,
        "title": "Automated Scoring of Clinical Patient Notes Using Advanced NLP and Pseudo Labeling",
        "authors": "Jingyu Xu, Yifeng Jiang, Bin Yuan, Shulin Li, Tianbo Song",
        "published": "2023-11-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaica58456.2023.10405427"
    },
    {
        "id": 24507,
        "title": "Towards Semantic Role Labeling of Legal Documents for Improving NLP/IR Tasks in the Law Domain",
        "authors": "Subinay Adhikary",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3632754.3632774"
    },
    {
        "id": 24508,
        "title": "Learning Semantic Role Labeling from Compatible Label Sequences",
        "authors": "Tao Li, Ghazaleh Kazeminejad, Susan Brown, Vivek Srikumar, Martha Palmer",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.1041"
    },
    {
        "id": 24509,
        "title": "iSAI-NLP 2023 Committee",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354614"
    },
    {
        "id": 24510,
        "title": "iSAI-NLP 2023 Tentative Program",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354669"
    },
    {
        "id": 24511,
        "title": "iSAI-NLP 2023 Copyright Page",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354677"
    },
    {
        "id": 24512,
        "title": "iSAI-NLP 2023 Cover Page",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354898"
    },
    {
        "id": 24513,
        "title": "iSAI-NLP 2023 Message from General Chair",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354579"
    },
    {
        "id": 24514,
        "title": "iSAI-NLP 2023 Message from Program Chairs",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354885"
    },
    {
        "id": 24515,
        "title": "What aspects of NLP models and brain datasets affect brain-NLP alignment?",
        "authors": "SUBBA REDDY OOTA, Mariya Toneva",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1273-0"
    },
    {
        "id": 24516,
        "title": "NLP+Vis: NLP Meets Visualization",
        "authors": "Shafiq Joty, Enamul Hoque, Jesse Vig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-tutorial.1"
    },
    {
        "id": 24517,
        "title": "Umeed: VR Game Using NLP Models and Latent Semantic Analysis for Conversation Therapy for People with Speech Disorders",
        "authors": "",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "UmeedVR aims to create a conversational therapy VR game using natural language processing for patients with Speech Disorders like Autism or Aphasia. This study developed 5 psychological task sets and 3 environments via Maya and Unity. The Topic-Modeling AI, employing 25 live participants' recordings and 980+ TwineAI datasets, generated initial VR grading with a coherence score averaging 6.98 themes in 5-minute conversations across scenarios, forming a foundation for enhancements. Employing latent semantic analysis (gensimcorpus Python) and Term-Frequency-Inverse Document-Frequency (TF-IDF), grammatical errors and user-specific improvements were addressed. Results were visualized via audio-visual plots, highlighting conversation topics based on occurrence and interpretability. UMEED enhances cognitive and intuitive skills, elevating average topics from 6.98 to 13.56 in a 5- minute conversation with a 143.12 coherence score. LSA achieved 98.39% accuracy, topic modeling 100%. Significantly, real-time grammatical correction integration in the game was realized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131408"
    },
    {
        "id": 24518,
        "title": "🚀 NLP Colloquium",
        "authors": "Ayana Niwa, Sho Yokoi, Junya Takayama, Itsumi Saito",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5715/jnlp.31.300"
    },
    {
        "id": 24519,
        "title": "News Signals: An NLP Library for Text and Time Series",
        "authors": "Chris Hokamp, Demian Ghalandari, Parsa Ghaffari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.21"
    },
    {
        "id": 24520,
        "title": "Do not Trust the Experts: How the Lack of Standard Complicates NLP for Historical Irish",
        "authors": "Oksana Dereza, Theodorus Fransen, John P. Mccrae",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.10"
    },
    {
        "id": 24521,
        "title": "Simple2In1: A Simple Method for Fusing Two Sequences from Different Captioning Systems into One Sequence for a Small-scale Thai Dataset",
        "authors": "Wuttinan Longjaroen, Thodsaporn Chay-Intr, Kotaro Funakoshi, Ananlada Chotimongkol, Sasiporn Usanavasin",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10355030"
    },
    {
        "id": 24522,
        "title": "torchdistill Meets Hugging Face Libraries for Reproducible, Coding-Free Deep Learning Studies: A Case Study on NLP",
        "authors": "Yoshitomo Matsubara",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.18"
    },
    {
        "id": 24523,
        "title": "The State of the Art of Natural Language Processing—A Systematic Automated Review of NLP Literature Using NLP Techniques",
        "authors": "Jan Sawicki, Maria Ganzha, Marcin Paprzycki",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "ABSTRACT\nNowadays, natural language processing (NLP) is one of the most popular areas of, broadly understood, artificial intelligence. Therefore, every day, new research contributions are posted, for instance, to the arXiv repository. Hence, it is rather difficult to capture the current “state of the field” and thus, to enter it. This brought the id-art NLP techniques to analyse the NLP-focused literature. As a result, (1) meta-level knowledge, concerning the current state of NLP has been captured, and (2) a guide to use of basic NLP tools is provided. It should be noted that all the tools and the dataset described in this contribution are publicly available. Furthermore, the originality of this review lies in its full automation. This allows easy reproducibility and continuation and updating of this research in the future as new researches emerge in the field of NLP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/dint_a_00213"
    },
    {
        "id": 24524,
        "title": "A Validation of the Effectiveness of NLP Self Growth Program",
        "authors": "Jeongbeom Kang, Songhee Han",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22143/hss21.14.2.193"
    },
    {
        "id": 24525,
        "title": "Strengthening Relationships Between Indigenous Communities, Documentary Linguists, and Computational Linguists in the Era of NLP-Assisted Language Revitalization",
        "authors": "Darren Flavelle, Jordan Lachler",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.c3nlp-1.4"
    },
    {
        "id": 24526,
        "title": "Missing Information, Unresponsive Authors, Experimental Flaws: The Impossibility of Assessing the Reproducibility of Previous Human Evaluations in NLP",
        "authors": "Anya Belz, Craig Thomson, Ehud Reiter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.1"
    },
    {
        "id": 24527,
        "title": "O-026 Incremental value of arterial spin labeling (ASL) over conventional MRI sequences in the detection of intracranial arteriovenous malformations in patients with hereditary hemorrhagic telangiectasia (HHT)",
        "authors": "W Han, A Alyafaie, Y Li, S Hetts",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1136/jnis-2023-snis.26"
    },
    {
        "id": 24528,
        "title": "Agreement of Resting Brain Perfusion using Two Different Pseudo-Continuous Arterial Spin Labeling Sequences and the Associations with Lipid Biomarkers",
        "authors": "Kevin Decker, Faria Sanjana, Nick Rizzi, Mary Kramer, Alexander Cerjanic, Curtis Johnson, Christopher Martens",
        "published": "2023-5",
        "citations": 0,
        "abstract": " Objective: We developed a modified pseudo-continuous arterial spin labeling (pCASL) sequence for measuring cerebrovascular reactivity (CVR) to hypercapnia in humans; however, the method has yet to be validated against an established pCASL sequence for assessing brain perfusion at rest. The purpose of this project was to compare resting brain perfusion from our modified sequence (Rest-CVR) to the pCASL sequence developed by the Human Connectome Project (HCP). The secondary purpose was to determine the association of these pCASL sequences with lipid biomarkers. Methods: Resting brain perfusion was assessed using both sequences in 7 middle-aged adult participants (56 ± 5 years old) using a 64-channel head coil inside a Siemens Prisma 3T MRI scanner. The modified Rest-CVR sequence included a shorter scan time (~3 minutes) with a single post-labeling delay and duration of 1800ms, FOV= 215mm2, slice thickness 2.27mm, TR=4510ms, and TE=20ms. Blood samples were also collected to determine the association of each sequence with circulating lipid biomarkers to test the sensitivity of each sequence to clinically relevant risk factors of cerebrovascular disease. Results: Outcomes from the two pCASL sequences were significantly correlated [R2 = 0.88; F (1,5) = 35.06 p = 0.002]. However, resting brain perfusion from Rest-CVR was significantly lower than HCP [Rest-CVR: 58.84 ± 15.22 vs. HCP: 81.12 ± 12.54 ml/min/100g; p = 0.0008]. Resting brain perfusion measurements from both sequences were negatively associated with low density lipoprotein (LDL) cholesterol (HCP: r = -0.97; p = 0.0001 and Rest-CVR: r = -0.87; p = 0.008) suggesting sensitivity of both to a clinically relevant risk factor for cerebrovascular disease. However, neither sequence was associated with total cholesterol, triglycerides, or high-density lipoprotein (HDL) cholesterol (p>0.05 for all). Conclusion: Rest-CVR was determined to be a reliable measure of resting brain perfusion in that it correlated with the HCP protocol; however, the lower magnitude relative to HCP makes it a less valid approach for accurately determining brain perfusion. Resting brain perfusion from both sequences was negatively associated with LDL suggesting both are sensitive to clinically relevant outcomes. The shorter Rest-CVR sequence may be most suitable for studies in which an exact estimate of brain perfusion is not required such as when assessing a relative change to hypercapnia.  Grant Support: NIH/NIGMS - P20 GM113125  This is the full abstract presented at the American Physiology Summit 2023 meeting and is only available in HTML format. There are no additional versions or additional content available for this abstract. Physiology was not involved in the peer review process. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1152/physiol.2023.38.s1.5733801"
    },
    {
        "id": 24529,
        "title": "Transformer-based Hebrew NLP models for Short Answer Scoring in Biology",
        "authors": "Abigail Gurin Schleifer, Beata Beigman Klebanov, Moriah Ariely, Giora Alexandron",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bea-1.46"
    },
    {
        "id": 24530,
        "title": "PyTAIL: An Open Source Tool for Interactive and Incremental Learning of NLP Models with Human in the Loop for Online Data",
        "authors": "Shubhanshu Mishra, Jana Diesner",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.22"
    },
    {
        "id": 24531,
        "title": "Natural Language Processing (NLP) for Code in Python",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/resmil.v9i1.24"
    },
    {
        "id": 24532,
        "title": "Voicemail Urgency Detection Using Context Dependent and Independent NLP Techniques",
        "authors": "Asma Trabelsi, Séverine Soussilane, Emmanuel Helbert",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011685800003393"
    },
    {
        "id": 24533,
        "title": "Unveiling the Power of Pre - Trained Language Models in NLP Applications",
        "authors": "Shrinath Pai",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231115202502"
    },
    {
        "id": 24534,
        "title": "Discrimination of Multiple Homologous Sequences Based on DNA Logic Gate and Elemental Labeling Technology",
        "authors": "Qi Kang, Beibei Chen, Man He, Bin Hu",
        "published": "2024-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1021/acs.analchem.3c05915"
    },
    {
        "id": 24535,
        "title": "Improving NLP Model Performance on Small Educational Data Sets Using Self-Augmentation",
        "authors": "Keith Cochran, Clayton Cohn, Peter Hastings",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011857200003470"
    },
    {
        "id": 24536,
        "title": "Comparative Evaluation of NLP Approaches for Requirements Formalisation",
        "authors": "Shekoufeh Rahimi, Kevin Lano, Sobhan Tehrani, Chenghua Lin, Yiqi Liu, Muhammad Umar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012318700003645"
    },
    {
        "id": 24537,
        "title": "A CONCEPTUAL MODEL OF A MULTILINGUAL INFORMATION SYSTEM FOR NLP SCIENTIFIC AND EDUCATIONAL ACTIVITIES",
        "authors": "Ж.Б. Садирмекова, М.А. Самбетбаева, Г.С. Боранкулова, А.С. Еримбетова",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Целью работы является разработка полиязычной информационной системы для научно-образовательной деятельности NLP. Оригинальность предлагаемого подхода состоит в том, что для систематизации знаний, данных и информационных ресурсов и организации осмысленного доступа к ним будет использоваться разработанная в рамках данного проекта онтология предметной области, а также в качестве основы программного обеспечения будут использоваться стандарты и средства технологий Semantic Web. Разработанная в рамках этого исследования онтология станет концептуальной основой полиязычной информационной системы поддержки научной и образовательной деятельности NLP, которая обеспечит систематизацию всей информации по указанным методам, ее интеграцию в единое информационное пространство, удобную навигацию, а также содержательный доступ к ней.\nThe goal is to develop a multilingual information system for NLP scientific and educational activities. The originality of the approach proposed in the study is that the ontology of the subject area developed within the framework of this project will be used to systematize knowledge, data and information resources and organize meaningful access to them, as well as the standards and tools of Semantic Web technologies will be used as the basis of the software. The ontology developed within the framework of this study will become the conceptual basis of a multilingual information system for supporting scientific and educational activities of NLP, which will provide systematization of all information on these methods, its integration into a single information space, convenient navigation through it, as well as meaningful access to it.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25743/dir.2022.44.86.038"
    },
    {
        "id": 24538,
        "title": "Harmful Content on Social Media Detection Using by NLP",
        "authors": "Iqra Naz, Rehhmat Illahi",
        "published": "2023-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.11648/j.advances.20230402.13"
    },
    {
        "id": 24539,
        "title": "NLP in the Legal World",
        "authors": "Jerrold Soh",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4670517"
    },
    {
        "id": 24540,
        "title": "Natural language processing (NLP) to facilitate abstract review in medical research: the application of BioBERT to exploring the 20-year use of NLP in medical research",
        "authors": "Safoora Masoumi, Hossein Amirkhani, Najmeh Sadeghian, Saeid Shahraz",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "Abstract\nBackground\nAbstract review is a time and labor-consuming step in the systematic and scoping literature review in medicine. Text mining methods, typically natural language processing (NLP), may efficiently replace manual abstract screening. This study applies NLP to a deliberately selected literature review problem, the trend of using NLP in medical research, to demonstrate the performance of this automated abstract review model.\n\nMethods\nScanning PubMed, Embase, PsycINFO, and CINAHL databases, we identified 22,294 with a final selection of 12,817 English abstracts published between 2000 and 2021. We invented a manual classification of medical fields, three variables, i.e., the context of use (COU), text source (TS), and primary research field (PRF). A training dataset was developed after reviewing 485 abstracts. We used a language model called Bidirectional Encoder Representations from Transformers to classify the abstracts. To evaluate the performance of the trained models, we report a micro f1-score and accuracy.\n\nResults\n The trained models’ micro f1-score for classifying abstracts, into three variables were 77.35% for COU, 76.24% for TS, and 85.64% for PRF.\nThe average annual growth rate (AAGR) of the publications was 20.99% between 2000 and 2020 (72.01 articles (95% CI: 56.80–78.30) yearly increase), with 81.76% of the abstracts published between 2010 and 2020. Studies on neoplasms constituted 27.66% of the entire corpus with an AAGR of 42.41%, followed by studies on mental conditions (AAGR = 39.28%). While electronic health or medical records comprised the highest proportion of text sources (57.12%), omics databases had the highest growth among all text sources with an AAGR of 65.08%. The most common NLP application was clinical decision support (25.45%).\n\nConclusions\nBioBERT showed an acceptable performance in the abstract review. If future research shows the high performance of this language model, it can reliably replace manual abstract reviews.\n",
        "keywords": "",
        "link": "http://dx.doi.org/10.1186/s13643-024-02470-y"
    },
    {
        "id": 24541,
        "title": "CPE-Identifier: Automated CPE Identification and CVE Summaries Annotation with Deep Learning and NLP",
        "authors": "Wanyu Hu, Vrizlynn Thing",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012403500003648"
    },
    {
        "id": 24542,
        "title": "Using NLP to Enrich Scientific Knowledge Graphs: A Case Study to Find Similar Papers",
        "authors": "Xavier Quevedo, Janneth Chicaiza",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011671100003393"
    },
    {
        "id": 24543,
        "title": "Validating the PNL in NLP",
        "authors": "Babak Mahdavi-Damghani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4556106"
    },
    {
        "id": 24544,
        "title": "NATURAL LANGUAGE PROCESSING (NLP) FOR CODE IN PYTHON (2020)",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/jcr.07.05.470"
    },
    {
        "id": 24545,
        "title": "Continuous Anomaly Detection and Labeling for the Fermilab Linac",
        "authors": "Jason St. John",
        "published": "2023-2-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2172/1958797"
    },
    {
        "id": 24546,
        "title": "TEXT SUMMERIZATION USING NLP",
        "authors": "",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets34791"
    },
    {
        "id": 24547,
        "title": "How Digital Transformation Affects Enter Prisetotal Factor Productivity from the Perspective of NLP",
        "authors": "雪妍 向",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/ecl.2024.131062"
    },
    {
        "id": 24548,
        "title": "Proposing Self-Reflective Debriefing Model for Preventing Burnout among Missionaries: An Approach Based on NLP Therapy and Cognitive Schema Therapy",
        "authors": "Hannah Park,  ",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14493/ksoms.2024.1.129"
    },
    {
        "id": 24549,
        "title": "AI Contact Center IP-R&amp;D Scheme based on Patent NLP Analysis",
        "authors": "JungHeui Kim, Young-Min Kim",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14801/jkiit.2024.22.2.151"
    },
    {
        "id": 24550,
        "title": "Kidney CT Image Analysis Using CNN",
        "authors": "Harshit Mittal",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Medical image analysis is a vital component of modern medical practice, and the accuracy of such analysis is critical for accurate diagnosis and treatment. Computed tomography (CT) scans are commonly used to visualize the kidneys and identify abnormalities such as cysts, tumors, and stones. Manual interpretation of CT images can be time-consuming and subject to human error, leading to inaccurate diagnosis and treatment. Deep learning models based on Convolutional Neural Networks (CNNs) have shown promise in improving the accuracy and speed of medical image analysis. In this study, we present a CNN-based model to accurately classify CT images of the kidney into four categories: Normal, Cyst, Tumor, and Stone, using the CT KIDNEY DATASET. The proposed CNN model achieved an accuracy of 99.84% on the test set, with a precision of 0.9964, a recall of 0.9986, and a F1-score of 0.9975 for all categories. The model was able to accurately classify all images in the test set, indicating its high accuracy in identifying abnormalities in CT images of the kidney. The results of this study demonstrate the potential of deep learning models based on CNNs in accurately classifying CT images of the kidney, which could lead to improved diagnosis and treatment outcomes for patients. This study contributes to the growing body of literature on the use of deep learning models in medical image analysis, highlighting the potential of these models in improving the accuracy and efficiency of medical diagnosis.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131403"
    },
    {
        "id": 24551,
        "title": "Weak Supervision Approach for Arabic Named Entity Recognition",
        "authors": "Olga Simek, Courtland VanDam",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Arabic named entity recognition (NER) is a challenging problem, especially in conversational data such as social media posts. To address this problem, we propose an Arabic weak learner NER model called ANER-HMM, which leverages low quality predictions that provide partial recognition of entities. By combining these predictions, we achieve state of the art NER accuracy for cases for out-of-domain predictions. ANER-HMM leverages a hidden markov model to combine multiple predictions from weak learners and gazetteers. We demonstrate that ANER-HMM outperforms the state-of-the-art Arabic NER methods without requiring any labeled data or training deep learning models which often require large computing resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131602"
    },
    {
        "id": 24552,
        "title": "Developing Research Projects in SE and NLP",
        "authors": "",
        "published": "2024-2-9",
        "citations": 0,
        "abstract": "Research projects are necessary for conducting research or generating work products. Most of the work however, focuses more on the aspects of research within a domain instead of moving towards interdisciplinary work. In this chapter, the author proposes to develop research projects in perspective of SE and NLP. The future scope is also presented herein.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/daai/4/1/2"
    },
    {
        "id": 24553,
        "title": "Exploration Advisory Tool: AI and NLP in the Geosciences",
        "authors": "B. Entrup, M. Dillen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3997/2214-4609.2023101230"
    },
    {
        "id": 24554,
        "title": "Resume Parser Using ML and NLP",
        "authors": "",
        "published": "2023-11-24",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets46536"
    },
    {
        "id": 24555,
        "title": "From Descriptive to Predictive: Forecasting Emerging Research Areas in Software Traceability Using NLP from Systematic Studies",
        "authors": "Zaki Pauzi, Andrea Capiluppi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011964100003464"
    },
    {
        "id": 24556,
        "title": "Developing of NLP models by model based software developement",
        "authors": "Zsolt Krutilla",
        "published": "2023",
        "citations": 0,
        "abstract": "In the case of software development, we can talk about several methodologies, such as the waterfall model, test-driven software development, agile software development, but the question rightly arises whether software development methods in the traditional sense are applicable to the development of natural language processing language models, especially from the aspect of AI and dictionary-based NLP models. Learning AI models is substantially different from the classical software development process. Whereas in classical software development, developers explicitly describe the operation and behavior to the computer, in AI model learning, the models themselves learn from the input data. This paper presents a possible solution that applies the agile Scrum methodology used in classical software development to the development of dictionary-based NLP models, and identify the agile development opportunities in case of the machine learning-based NLP models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47833/2023.2.csc.024"
    },
    {
        "id": 24557,
        "title": "Results on Prime labeling and square difference labeling of Graphs",
        "authors": " M. Ganeshan",
        "published": "2023-11-29",
        "citations": 0,
        "abstract": "The insight of labeling to the vertices and edges in graphs has flourished with types of labeling being applied in different areas by the researchers. Prominent among the types of labeling is Prime labeling and square difference labeling,  of graphs. In this paper we show the admittance of  Prime labeling  and square difference labeling  for few finite, simple, connected and undirected graphs.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/tjjpt.v44.i5.2517"
    },
    {
        "id": 24558,
        "title": "What Do NLP Researchers Believe? Results of the NLP Community Metasurvey",
        "authors": "Julian Michael, Ari Holtzman, Alicia Parrish, Aaron Mueller, Alex Wang, Angelica Chen, Divyam Madaan, Nikita Nangia, Richard Yuanzhe Pang, Jason Phang, Samuel R. Bowman",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.903"
    },
    {
        "id": 24559,
        "title": "HiTEK Pre-processing for Speech and Text: NLP",
        "authors": "Naveenkumar T Rudrappa,  , Mallamma V Reddy, M Hanumanthappa",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17485/ijst/v16i19.296"
    },
    {
        "id": 24560,
        "title": "NLP-PIPE Incorporation into ONTO6 Framework Workflow",
        "authors": "Uldis Straujums",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22364/bjmc.2023.11.1.09"
    },
    {
        "id": 24561,
        "title": "ARTIFICIAL INTELLIGENCE AND LEARNING ENVIRONMENTS: THE ROLE OF NLP",
        "authors": "Vincenza Barra, Felice Corona",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/iceri.2023.1504"
    },
    {
        "id": 24562,
        "title": "ChatGPT: Unlocking the Future of NLP in Finance",
        "authors": "Adam Zaremba, Ender Demir",
        "published": "2023",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4323643"
    },
    {
        "id": 24563,
        "title": "SENTIMENT ANALYSIS ON TWITTER DATASET USING NLP",
        "authors": "",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets45970"
    },
    {
        "id": 24564,
        "title": "Research on Text Classification Method Based on NLP",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070213"
    },
    {
        "id": 24565,
        "title": "NLP-based predictive model for identifying and presenting construction accident scenarios",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.shin436"
    },
    {
        "id": 24566,
        "title": "Transfer Learning in Natural Language Processing (NLP)",
        "authors": "Jasmin Bharadiya",
        "published": "2023-6-5",
        "citations": 1,
        "abstract": "Purpose: The purpose of this study is to address the limited use of transfer learning techniques in radio frequency machine learning and to propose a customized taxonomy for radio frequency applications. The aim is to enable performance gains, improved generalization, and cost-effective training data solutions in this specific domain.\r\nMethodology: The research design employed in this study involves a comprehensive review of existing literature on transfer learning in radio frequency machine learning. The researchers collected relevant papers from reputable sources and analyzed them to identify patterns, trends, and insights. The method of data collection primarily relied on examining and synthesizing existing literature. Data analysis involved identifying key findings and developing a customized taxonomy for radio frequency applications.\r\nFindings: The study's findings highlight the limited utilization of transfer learning techniques in radio frequency machine learning. While transfer learning has shown significant performance improvements in computer vision and natural language processing, its potential in the wireless communications domain has yet to be fully explored. The customized taxonomy proposed in this study provides a consistent framework for analyzing and comparing existing and future efforts in this field.\r\nRecommendations: Based on the findings, the study recommends further research and experimentation to explore the potential of transfer learning techniques in radio frequency machine learning. This includes investigating performance gains, improving generalization capabilities, and addressing concerns related to training data costs. Additionally, collaborations between researchers and practitioners in the field are encouraged to facilitate knowledge exchange and foster innovation. Practice: To practitioners in the field of radio frequency machine learning, this study emphasizes the potential benefits of incorporating transfer learning techniques. It encourages practitioners to explore the application of transfer learning in their specific domain, leveraging prior knowledge to enhance performance and address training data challenges. It also highlights the importance of staying informed about the latest developments and collaborating with experts in the field. Policy: To policy makers, the study underscores the need for supportive policies that promote research and development in radio frequency machine learning. It recommends creating an environment that fosters innovation, encourages collaborations between academia and industry, and provides resources and incentives for further exploration of transfer learning techniques. Policy makers should consider the potential impact of transfer learning on the wireless communications industry and support initiatives that enhance its adoption and implementation.\r\n ",
        "keywords": "",
        "link": "http://dx.doi.org/10.47672/ejt.1490"
    },
    {
        "id": 24567,
        "title": "PSYCHOLOGICAL INTERACTIONS LANGUAGE AND THINKING BASED ON NLP",
        "authors": "Аріф Ельмір",
        "published": "2023-7-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.52058/2786-5274-2023-9(23)-8-16"
    },
    {
        "id": 24568,
        "title": "What's in a Domain? Anaylsis of URL Features",
        "authors": "John Hawkins",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Many data science problems require processing log data derived from web pages, apis or other internet traffic sources. URLs are one of the few ubiquitous data fields that describe internet activity, hence they require effective processing for a wide variety of machine learning applications. While URLs are structurally rich, the structure can be both domain specific and subject to change over time, making feature engineering for URLs an ongoing challenge.  In this research we outline the key structural components of URLs and discuss the information available within each. We describe methods for generating features on these URL components and share an open source implementation of these ideas. In addition, we describe a method for exploring URL feature importance that allows for comparison and analysis of the information available inside URLs. We experiment with a collection of URL classification datasets and demonstrate the utility of these tools. Package and source code is open on https://pypi.org/project/url2features.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131409"
    },
    {
        "id": 24569,
        "title": "The Role of Typological Feature Prediction in NLP and Linguistics",
        "authors": "Johannes Bjerva",
        "published": "2024-1-20",
        "citations": 0,
        "abstract": "Abstract\nComputational typology has gained traction in the field of Natural Language Processing (NLP) in recent years, as evidenced by the increasing number of papers on the topic and the establishment of a Special Interest Group on the topic (SIGTYP), including the organization of successful workshops and shared tasks. A considerable amount of work in this sub-field is concerned with prediction of typological features, for example, for databases such as the World Atlas of Language Structures (WALS) or Grambank. Prediction is argued to be useful either because (1) it allows for obtaining feature values for relatively undocumented languages, alleviating the sparseness in WALS, in turn argued to be useful for both NLP and linguistics; and (2) it allows us to probe models to see whether or not these typological features are encapsulated in, for example, language representations. In this article, we present a critical stance concerning prediction of typological features, investigating to what extent this line of research is aligned with purported needs—both from the perspective of NLP practitioners, and perhaps more importantly, from the perspective of linguists specialized in typology and language documentation. We provide evidence that this line of research in its current state suffers from a lack of interdisciplinary alignment. Based on an extensive survey of the linguistic typology community, we present concrete recommendations for future research in order to improve this alignment between linguists and NLP researchers, beyond the scope of typological feature prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00498"
    },
    {
        "id": 24570,
        "title": "A Survey on Attention mechanism in NLP",
        "authors": "Nan Zhang, Junyeong Kim",
        "published": "2023-2-5",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceic57457.2023.10049971"
    },
    {
        "id": 24571,
        "title": "Using Ensemble Learning in Language Variety Identification",
        "authors": "Mihaela Gaman",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.23"
    },
    {
        "id": 24572,
        "title": "Multilingual Automatic Extraction of Linguistic Data from Grammars",
        "authors": "Albert Kornilov",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.fieldmatters-1.10"
    },
    {
        "id": 24573,
        "title": "A Review of Text Summarization Techniques Using NLP",
        "authors": "Kartik Aggarwal",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "Techniques that employ natural language processing (NLP), often known as text summarizing, automatically construct summaries of extensive texts. Extractive and abstractive summarization are two main categories that may be used to classify these methods. In extractive summarizing, the most significant lines or phrases from a text are isolated and used to generate a summary. On the other hand, in abstractive summarization, a summary is generated that is clear, short, and accurate in its representation of the text's primary concepts. NLP methods like sentence segmentation, part-of-speech tagging, named entity recognition, and semantic analysis are used in generating a summary from a text and locating and extracting relevant information from the text. Text summarizing is a subject that has received a significant amount of study and has applications in various fields, including the summation of news articles, documents, and emails, among other things.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36647/ciml/04.02.a001"
    },
    {
        "id": 24574,
        "title": "Gender Bias in Machine Translation: a statistical evaluation of Google Translate and DeepL for English, Italian and German",
        "authors": "Argentina Anna Rescigno,  , Johanna Monti,  ,  ,  ",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.26615/issn.2683-0078.2023_001"
    },
    {
        "id": 24575,
        "title": "EXPLORING TRENDING TOPICS ON E-COMMERCE USING NLP",
        "authors": "",
        "published": "2023-12-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets47256"
    },
    {
        "id": 24576,
        "title": "Temporal Generalizability in Multimodal Misinformation Detection",
        "authors": "Nataliya Stepanova, Björn Ross",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.6"
    },
    {
        "id": 24577,
        "title": "ChatGPT: Unlocking the future of NLP in finance",
        "authors": "Adam Zaremba, Ender Demir",
        "published": "2023-11-1",
        "citations": 6,
        "abstract": "This paper reviews the current state of ChatGPT technology in finance and its potential to improve existing NLP-based financial applications. We discuss the ethical and regulatory considerations, as well as potential future research directions in the field. The literature suggests that ChatGPT has the potential to improve NLP-based financial applications, but also raises ethical and regulatory concerns that need to be addressed. The paper highlights the need for research in robustness, interpretability, and ethical considerations to ensure responsible use of ChatGPT technology in finance.",
        "keywords": "",
        "link": "http://dx.doi.org/10.61351/mf.v1i1.43"
    },
    {
        "id": 24578,
        "title": "Model Agnostic Approach for NLP Backdoor Detection",
        "authors": "Hema Karnam Surendrababu",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/colcaci59285.2023.10226144"
    },
    {
        "id": 24579,
        "title": "ImbGAFS: GA Feature Selection for AUC in Bird Strike Prediction",
        "authors": "Aji Gautama Putrada, Sidik Prabowo",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Several studies discuss airplane failure prediction due to bird strikes. However, these studies need to analyze further the imbalance in their dataset. Our research aim is to create an airplane failure prediction by bird strike using a machine learning method optimized using GA feature selection. GA feature selection uses AUC maximization as the objective function to tackle imbalance problems in the bird strike dataset. First, we obtained the airplane bird strike dataset from Kaggle. We carry out preprocessing on the dataset.We then compared and chose one of four stateof-the-art machine learning methods: SVM, MLP, logistic regression, and random forest. The selection process involves oversampling methods, synthetic minority oversampling technique (SMOTE), and optimum threshold selection, which involves geometric mean (g- mean) and area under curve (AUC) values. Finally, we optimize airplane failure prediction by performing AUC maximization using GA feature selection. Our test results show that random forest is the best machinelearning method in airplane failure prediction compared to SVM, logistic regression, and MLP. SMOTE can increase random forest AUC from 0.845 to 0.878. Finally, the random forest model from ImbGAFS is better than the conventional method without feature selection. The increase in the AUC value is from 0.878 to 0.889. Then, after carrying out optimal threshold selection, ImbGAFS+random forest also has better sensitivity, specificity, and g-mean than conventional methods. The increase is from 0.7737, 0.8350, and 0.8037 to 0.8033, 0.8301, and 0.8166, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131614"
    },
    {
        "id": 24580,
        "title": "NormNet: Normalize Noun Phrases for More Robust NLP",
        "authors": "Minlong Peng, Mingming Sun",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.136"
    },
    {
        "id": 24581,
        "title": "Identifying Depressive Tweets using Natural Language Processing (NLP) Frameworks",
        "authors": "Damilola Oladimeji, Laura Garland, Qingzhong Liu",
        "published": "2023-5-27",
        "citations": 0,
        "abstract": "The number of patients diagnosed with depression yearly is a growing concern among mental health advocates. Consequently, the ef ect of this ailment is detrimental to not only the patient but also family members, as well as their jobs or school. Many factors, ranging from hereditary conditions to life-altering experiences, can trigger depression, and symptoms vary between individuals. Hence, the disparity of symptoms in diagnosing depression makes it dif icult to identify early on. Fortunately, the prevalence of social media platforms has led to individuals posting updates on various aspects of their lives, particularly their mental health. These platforms now provide valuable data sources for mental health researchers, aiding in the timely diagnosis of depression. In this research, we use sentiment analysis to identify depressed tweets from random tweets. We used six natural language processing frameworks for our classification. They are BERT, XLNet, ALBERT, DeBERTa, RoBERTa, and ELECTRA. Our results show that BERT performs best with an accuracy of 99%, while ALBERT is the model with the lowest accuracy rate at 87%. This research shows that by leveraging NLP frameworks, we can successfully utilize machine learning for the early detection of depression and help diagnose individuals struggling with this ailment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130920"
    },
    {
        "id": 24582,
        "title": "Matching Products with Deep NLP Models",
        "authors": "Leonidas Akritidis, Panayiotis Bozanis",
        "published": "2023-7-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iisa59645.2023.10345922"
    },
    {
        "id": 24583,
        "title": "Voice Assisted Text Summarizer Using NLP",
        "authors": "T.N. Charanya, T.C. Sankar",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452662"
    },
    {
        "id": 24584,
        "title": "Brands, Verticals and Contexts: Coherence Patterns in Consumer Attention",
        "authors": "John Hawkins",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Consumers are expected to partially reveal their preferences and interests through the media they consume. The development of visual attention measurement with eye tracking technologies allows us to investigate the consistency of these preferences across the creative executions of a given brand and over all brands within a given vertical.  In this study we use a large-scale attention measurement dataset to analyse a collection of digital display advertising impressions across a variety of industry verti- cals. We evaluate the extent to which the high attention contexts for a given brand’s ads remain consistent for that brand, and the extent to which those contexts remain consistent across many brands within an industry vertical.  The results illustrate that consumer attention on advertising can vary significantly across creatives for a specific brand, and across a vertical. Nevertheless, there are coherence effects across campaigns that are stronger than random, and that contain actionable information at the level of industry vertical categorisation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131410"
    },
    {
        "id": 24585,
        "title": "Exocentric Structures and Labeling",
        "authors": "Yong-Ha Kim,  ",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "Chomsky (2001) has proposed a phase-based compu- tation, which takes a hybrid approach adopting derivational, but slightly representational, structure building. What is important in this proposal is that T is never finite in itself, but can bear a full φ-feature set only when it is selected by the phase head C. Chomsky (2008) in turn has assumed further that T can agree and attract its goal, the subject only after it inherits relevant features from C. This means that T is only partially projected without Spec when C is introduced into the derivation. This non-cyclic structure building is possible within a phase, hence slight representational flavor. However, Chosmky (2013, 2015) discarded this phase-based partially representational approach, to the effect that TP should complete its projection, which is now reinterpreted as an exocentric structure consisting of two maximal projections (with no specifiers). In this paper, we will explore the reason why Chomsky recently rejected the non-cyclic structure building within a phase. And we will note problems with this approach, and try to seek a solution in the recent MERGE system proposed by Chomsky (2019, 2020, 2021, 2022, Forthcoming).",
        "keywords": "",
        "link": "http://dx.doi.org/10.14342/smog.2023.119.29"
    },
    {
        "id": 24586,
        "title": "A NLP-learning Powered Customizable Approach Towards Auto-blocking Distracting Websites",
        "authors": "Yulin Zhang, Yu Sun",
        "published": "2023-1-28",
        "citations": 0,
        "abstract": "Over the past few decades, the problem of distraction and its accompanying side effects has taken its root deeply in all parts of our daily life and extended its ever-increasing influences among young generations [2]. In addition to its alarming prevalence, another characteristic of distraction that raises most concerns is how easily we can get distracted from our tasks at hand while using the electronic devices as a means of solving problems [3]. This paper attempts to address this society-wide problem thoroughly and universally through a technical approach of detecting, analyzing, and blocking the websites intelligently. Our design highlights the applications of machine learning and natural language processing, and is implemented purely in Python, Javascript, and several other web development languages. After retrieving the web content from the target websites through the web scraping process, summarizing the data to a number of short paragraphs via the use of NLP, we were able to perform data analysis on the result and finally block the websites accordingly [4]. With the help of this extension, students and those who wish to improve their concentration in work will be able to put more focus on the tasks at hand and thus boost their work efficiency under any working conditions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.130209"
    },
    {
        "id": 24587,
        "title": "Dimensions of Explanatory Value in NLP Models",
        "authors": "Kees van Deemter",
        "published": "2023-9-1",
        "citations": 0,
        "abstract": "AbstractPerformance on a dataset is often regarded as the key criterion for assessing NLP models. I argue for a broader perspective, which emphasizes scientific explanation. I draw on a long tradition in the philosophy of science, and on the Bayesian approach to assessing scientific theories, to argue for a plurality of criteria for assessing NLP models. To illustrate these ideas, I compare some recent models of language production with each other. I conclude by asking what it would mean for institutional policies if the NLP community took these ideas onboard.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00480"
    },
    {
        "id": 24588,
        "title": "MUNI-NLP Systems for Low-resource Indic Machine Translation",
        "authors": "Edoardo Signoroni, Pavel Rychly",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.91"
    },
    {
        "id": 24589,
        "title": "N-Gram-Based Serbian Text Classification",
        "authors": "Petar Prvulović, Nemanja Radosavljević, Dušan Vujošević, Dhinaharan Nagamalai, Jelena Vasiljević",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Natural language processing is an active area of research which finds many applications in variety of fields. Low-resource languages are a challenge as they lack curated datasets, stemmers and other elements used in text processing. Statistical approach is an alternative which can be used to bypass lack of rule-based implementations. The paper presents a model for classification of unstructured text in Serbian language. The model uses n-gram-based stemming to create document attributes vectors. Vectors are created on 3-, 4- and 5-grams. Vector reduction is tested on two criteria: n-gram entropy and number of occurrences, and two lengths: 1000 and 2000 n-grams. The support vector machine is used to classify documents. The model is trained and tested on a dataset collected from a Serbian news portal. Classification accuracy of over 80% is achieved. The presented model provides a good basis for range of applications in business decision automation for low-resource languages.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131613"
    },
    {
        "id": 24590,
        "title": "Trend Surfing: Effective and Efficient Retrieval of Unusual Temporal Trends",
        "authors": "Jing Ao, Kara Schatz, Rada Chirkova",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Locating unusual temporal trends in data cubes is a recurrent task in a variety of application domains. We consider a version of this problem in which one looks for the data dimensions that are best correlated with the given unusual temporal trends. Our goal is to make such data-cube navigation in search of unusual temporal trends both effective and efficient. Challenges in achieving this goal arise from the rarity of the trends to be located, as well as from the combinatorics involved in locating in data cubes nodes with unusual trends. We show that exhaustive solutions are worst-case intractable, and introduce tractable heuristic algorithms that enable effective and efficient data-cube navigation in a particular manner that we call trend surfing. We report the results of testing the proposed algorithms on three real-life data sets; these results showcase the effectiveness and efficiency of the algorithms against the exhaustive baseline.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131608"
    },
    {
        "id": 24591,
        "title": "Alt-Tech Topic Modeling Incorporating Atopic Model Selection Strategy",
        "authors": "Sanaz Rasti, Sarah Anne Dunne, Eugenia Siapera",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "The rapid growth of Alt-tech platforms and concerns over their less stringent content moderation policies, make them a good case for opinion mining. This study aims at investigating the topic models that exist in specific Alt-tech channel on Telegram, using data collected in two time points of 2021 and 2023. Three different topic models of LDA, NMF and Contextualized NTM were explored and a model selection procedure was proposed to choose the best performing model among all. To validate the model selection algorithm quantitatively and qualitatively, the approach was tested on publicly available labelled datasets. For all the experiments, data was pre-processed employing an effective NLP pre-processing procedure along with an Alt-tech customised list of stop-words. Using the validated topic model selection algorithm, LDA topics with Ngram range = (4, 4) were extracted from the targeted Alt-tech dataset. The findings from topic models were qualitatively evaluated by a social scientist and are further discussed. The conclusion of the work suggests that the proposed model selection procedure is effective for corresponding corpus length and context. Future work avenues are suggested to improve the outcome of Alt-tech topic modeling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131601"
    },
    {
        "id": 24592,
        "title": "SocBERT: A Pretrained Model for Social Media Text",
        "authors": "Yuting Guo, Abeed Sarker",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.5"
    },
    {
        "id": 24593,
        "title": "The Case for Scalable, Data-Driven Theory: A Paradigm for Scientific Progress in NLP",
        "authors": "Julian Michael",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bigpicture-1.4"
    },
    {
        "id": 24594,
        "title": "The Helsinki-NLP Submissions at NADI 2023 Shared Task: Walking the Baseline",
        "authors": "Yves Scherrer, Aleksandra Miletić, Olli Kuparinen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.arabicnlp-1.73"
    },
    {
        "id": 24595,
        "title": "Thesis Distillation: Investigating The Impact of Bias in NLP Models on Hate Speech Detection",
        "authors": "Fatma Elsafoury",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bigpicture-1.5"
    },
    {
        "id": 24596,
        "title": "Detecting depression using natural language processing (NLP) techniques",
        "authors": "Hawra A. Al Mohsin, Ebrahim A. Mattar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1049/icp.2024.1034"
    },
    {
        "id": 24597,
        "title": "Natural Language Processing (NLP): Enabling Machines to Understand and Process",
        "authors": "",
        "published": "2024-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.48047/ijfans/09/03/29"
    },
    {
        "id": 24598,
        "title": "Named Entity Recognition Using NLP",
        "authors": "Keerthana R",
        "published": "2024-2-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.61463/ijset.vol.12.issue2.142"
    },
    {
        "id": 24599,
        "title": "A method for parallel microscale protein labeling and precise control over the average degree of labeling (aDoL)",
        "authors": "Qiaoqiao Ruan, Cheng Zhao",
        "published": "2023-6-2",
        "citations": 0,
        "abstract": "AbstractA widely used approach for protein conjugation is through the lysine residues reacting with NHS- or other active esters. However, it is a challenge to precisely control the degree of labeling (DoL) due to the instability of active ester and variability of reaction efficiencies. Here, we provide a protocol for better control of aDoL using existing Copper-free Click Chemistry reagents. It is a two-step reaction with one purification in between. Briefly, proteins of interest were first activated with azide-NHS. After removing unreacted azide-NHS, the protein-N3 is then reacted with a limited amount of complementary click tag. Our studies have shown the click tag will fully react with the protein-N3 after 24 h’ incubation, and therefore does not require additional purification steps. As such, the aDoL is equal to the input molar ratio of the click tag and the protein. Furthermore, this approach offers a much simpler and more economical way to perform parallel microscale labeling. Once a protein is pre-activated with N3-NHS, any fluorophore or molecule with the complementary click tag can be attached to the protein by mixing the two ingredients. Quantities of the protein used in the click reaction can be at any desired amount. In one example, we labeled an antibody in parallel with 9 different fluorophores using a total of 0.5 mg of antibody. In another example, we labeled Ab with targeted aDoL value from 2 to 8. In a stability comparison study, we have found the conjugated fluorophore using the suggested click protocol stayed attached to the protein longer than with standard NHS-fluorophore labeling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s41598-023-36163-8"
    },
    {
        "id": 24600,
        "title": "Chunker Based Sentiment Analysis for Nepali Text",
        "authors": "Archit Yajnik, Sabu Lama Tamang",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "The article represents the Sentiment Analysis (SA) of a Nepali sentence. Skip-gram model is used for the word to vector encoding. In the first experiment the vector representation of each sentence is generated by using Skip-gram model followed by the Multi-Layer Perceptron (MLP) classification and it is observed that the F1 score of 0.6486 is achieved for positive-negative classification with overall accuracy of 68%. Whereas in the second experiment the verb chunks are extracted using Nepali parser and carried out the similar experiment on the verb chunks. F1 score of 0.6779 is observedfor positive -negative classification with overall accuracy of 85%. Hence, Chunker based sentiment analysis is proven to be better than sentiment analysis using sentences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131406"
    },
    {
        "id": 24601,
        "title": "Evaluating The Performance of Feature Extraction Techniques Using Classification Techniques",
        "authors": "Harshit Mittal",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "Dimensionality reduction techniques are widely used in machine learning to reduce the computational complexity of the model and improve its performance by identifying the most relevant features. In this research paper, we compare various dimensionality reduction techniques, including Principal Component Analysis(PCA), Independent Component Analysis(ICA), Local Linear Embedding(LLE), Local Binary Patterns(LBP), and Simple Autoencoder, on the Olivetti dataset, which is a popular benchmark dataset in the field of face recognition. We evaluate the performance of these dimensionality reduction techniques using various classification algorithms, including Support Vector Classifier (SVC), Linear Discriminant Analysis (LDA), Logistic Regression (LR), K-Nearest Neighbors (KNN), and Support Vector Machine (SVM). The goal of this research is to determine which combination of dimensionality reduction technique and classification algorithm is the most effective for the Olivetti dataset. Our research provides insights into the performance of various dimensionality reduction techniques and classification algorithms on the Olivetti dataset. These results can be useful in improving the performance of face recognition systems and other applications that deal with high-dimensional data.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131402"
    },
    {
        "id": 24602,
        "title": "Formal Verification of Ecosystem Restoration Requirements using UML and Alloy",
        "authors": "Tiago Sousa, Benoˆıt Ries, Nicolas Guelfi",
        "published": "2023-9-16",
        "citations": 1,
        "abstract": "United Nations have declared the current decade (2021-2030) as the ”UN Decade on Ecosystem Restoration” to join R&D forces to fight against the ongoing environmental crisis. Given the ongoing degradation of earth ecosystems and the related crucial services that they offer to the human society, ecosystem restoration has become a major society-critical issue. It is required to develop rigorously software applications managing ecosystem restoration. Reliable models of ecosystems and restoration goals are necessary. This paper proposes a rigorous approach for ecosystem requirements modeling using formal methods from a model-driven software engineering point of view. The authors describe the main concepts at stake with a metamodel in UML and introduce a formalization of this metamodel in Alloy. The formal model is executed with Alloy Analyzer, and safety and liveness properties are checked against it. This approach helps ensuring that ecosystem specifications are reliable and that the specified ecosystem meetsthe desired restoration goals, seen in our approach as liveness and safety properties. The concepts and activities of the approach are illustrated with CRESTO, a real-world running example of a restored Costa Rican ecosystem",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131609"
    },
    {
        "id": 24603,
        "title": "AED: An black-box NLP classifier model attacker",
        "authors": "Yueyang Liu, Yan Huang, Zhipeng Cai",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126489"
    },
    {
        "id": 24604,
        "title": "Company Permissibility for Business Activities using NLP",
        "authors": "Praseetha P, Deepthi P, Dr N Srinivasan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.019"
    },
    {
        "id": 24605,
        "title": "Legal NLP Meets MiCAR: Advancing the Analysis of Crypto White Papers",
        "authors": "Carolina Camassa",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nllp-1.14"
    },
    {
        "id": 24606,
        "title": "Prakriti Chatbot using NLP",
        "authors": "Vaidehi Kuite -, Bhawna Muthal -, Kunal Mali -, Aditi Dawange -",
        "published": "2024-4-15",
        "citations": 0,
        "abstract": "This literature explores the connection of traditional Ayurvedic ideas and modern technologies, providing a new perspective.\n\nEvaluate Ayurvedic Prakriti using Prakriti Bot, an AI-powered chatbot. Ayurveda classifies individuals into three prakriti types: Pitta, Kapha, and Vata. We offer a website with a chatbot to swiftly determine an individual's ayurvedic constitution, as traditional prakriti evaluation can be time-consuming. Prakriti bot simplifies evaluation by providing personalised health recommendations and Ayurvedic teaching materials. The website bridges the gap between traditional ayurvedic medicine and modern healthcare by enabling regional language option and personalised report generation.",
        "keywords": "",
        "link": "http://dx.doi.org/10.36948/ijfmr.2024.v06i02.17084"
    },
    {
        "id": 24607,
        "title": "Robust Code Summarization",
        "authors": "Debanjan Mondal, Abhilasha Lodha, Ankita Sahoo, Beena Kumari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.5"
    },
    {
        "id": 24608,
        "title": "Heterogeneous Entity Matching with Complex Attribute Associations using BERT and Neural Networks",
        "authors": "Jiamin Lu, Shitao Wang",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Across various domains, data from different sources such as Baidu Baike and Wikipedia often manifest in distinct forms. Current entity matching methodologies predominantly focus on homogeneous data, characterized by attributes that share the same structure and concise attribute values. However, this orientation poses challenges in handling data with diverse formats. Moreover, prevailing approaches aggregate the similarity of attribute values between corresponding attributes to ascertain entity similar- ity. Yet, they often overlook the intricate interrelationships between attributes, where one attribute may have multiple associations. The simplistic approach of pairwise attribute comparison fails to harness the wealth of information encapsulated within entities.To address these challenges, we introduce a novel en- tity matching model, dubbed ”Entity Matching Model for Capturing Complex Attribute Relationships (EMMCCAR),” built upon pre-trained models. Specifically, this model transforms the matching task into a sequence matching problem to mitigate the impact of varying data formats. Moreover, by introducing attention mechanisms, it identifies complex relationships between attributes, emphasizing the degree of matching among multiple attributes rather than one-to-one correspondences. Through the integration of the EMM-CCAR model, we adeptly surmount the challenges posed by data heterogeneity and intricate attribute interdependencies. In comparison with the prevalent DER-SSM and Ditto approaches, our model achieves improvements of approximately 4% and 1% in F1 scores, respectively. This furnishes a robust solution for addressing the intricacies of attribute complexity in entity matching.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131605"
    },
    {
        "id": 24609,
        "title": "Variation and Instability in Dialect-Based Embedding Spaces",
        "authors": "Jonathan Dunn",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.7"
    },
    {
        "id": 24610,
        "title": "NLP-Powered Oncology Patient Summary",
        "authors": "T.C. Kalaiselvi, C.N. Vanitha, R. Vinodavarshini",
        "published": "2023-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceca58529.2023.10395425"
    },
    {
        "id": 24611,
        "title": "Enhancing Recommender Systems with NLP-based Biased Singular Value Decomposition",
        "authors": "Hong Xu",
        "published": "2023-7-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isctis58954.2023.10213075"
    },
    {
        "id": 24612,
        "title": "Use Cases of GPT-3 NLP Model: A Bibliometric Network Analyze",
        "authors": "Saniye Kuleli, Mehmet anon",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4533404"
    },
    {
        "id": 24613,
        "title": "MUNI-NLP Submission for Czech-Ukrainian Translation Task at WMT23",
        "authors": "Pavel Rychly, Yuliia Teslia",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.wmt-1.14"
    },
    {
        "id": 24614,
        "title": "Web based intelligent wonderbot for college website using NLP",
        "authors": "",
        "published": "2024-1-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets48733"
    },
    {
        "id": 24615,
        "title": "Invoice Data Extraction and Analysis using ML and NLP",
        "authors": "",
        "published": "2023-6-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets41860"
    },
    {
        "id": 24616,
        "title": "Deduplication of Textual Data by NLP Approaches",
        "authors": "Kiana Ghassabi, Peyman Pahlevani, Daniel E. Lucani",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vtc2023-spring57618.2023.10199538"
    },
    {
        "id": 24617,
        "title": "Exploring Prompting Large Language Models as Explainable Metrics",
        "authors": "Ghazaleh Mahmoudi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eval4nlp-1.18"
    },
    {
        "id": 24618,
        "title": "HOW DO NLP-SUPPORTED SCAFFOLDING TECHNIQUES SUPPORT STUDENTS’ WRITTEN REFLECTIONS?",
        "authors": "Ahmed Butt, Saira Anwar, Muhsin Menekse",
        "published": "2023-3",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2023.2036"
    },
    {
        "id": 24619,
        "title": "NLP-Powered Short Video Enrichment System",
        "authors": "Harsh Mali, Amit Nara, Jaya Gupta, Smit Panchal",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425151"
    },
    {
        "id": 24620,
        "title": "Decoding the Encoded – Linguistic Secrets of Language Models: A Systematic Literature Review",
        "authors": "H Avetisyan, D Broneske",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "Language models’ growing role in natural language processing neces- sitates a deeper understanding of their linguistic knowledge. Linguistic probing tasks have become crucial for model explainability, designed to evaluate models’ understanding of vari-ous linguistic phenomena. Objective: This systematic review critically assesses the linguistic knowledge of language models via linguistic probing, providing a comprehensive overview ofthe understood linguistic phenomena and identifying future research areas. Method: We performed an extensive search of relevant academic databases and analyzed 57 articles pub- lished between October 2018 and October 2022. Results: While language models exhibit extensive linguistic knowledge, limitations persist in their comprehension of specific phe- nomena. The review also points to a need for consensus on evaluating language models’ linguistic knowledge and the linguistic terminology used. Conclusion: Our review offers an extensive look into linguistic knowledge of language models through linguistic probing tasks. This study underscores the importance of understanding these models’ linguistic capabilities for effective use in NLP applications and for fostering more explainable AI systems.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131606"
    },
    {
        "id": 24621,
        "title": "The application of NLP in information retrieval",
        "authors": "Xurui Wang",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "The field of Natural Language Processing (NLP) has experienced impressive advancements and has found diverse applications. This paper presents a comprehensive review of the development of NLP in the field of information retrieval. It explores different stages of NLP techniques and methods, including keyword matching, rule-based approaches, statistical methods, and the utilization of machine learning and deep learning technologies. Furthermore, the paper provides detailed insights into the specific applications of NLP in domains such as academic information retrieval, medical information retrieval, travel information retrieval, and e-commerce information retrieval. It analyzes the current state of NLP applications in these domains, highlights their advantages, and discusses their associated limitations. Finally, the paper emphasizes the continuous advancement of the NLP field, with a particular focus on semantic understanding, personalized retrieval, and multimodal information retrieval, to better adapt to diverse data types and user requirements. The paper concludes by summarizing the main points discussed and providing future directions.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/42/20230795"
    },
    {
        "id": 24622,
        "title": "Voice Enabled Command Line Interface Using Symbl.ai(NLP Tool).",
        "authors": "",
        "published": "2024-3-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets49720"
    },
    {
        "id": 24623,
        "title": "Streamlining Invoice Management: Leveraging OCR and NLP for Efficiency",
        "authors": "",
        "published": "2024-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets51690"
    },
    {
        "id": 24624,
        "title": "FRONT-END NUTRITION LABELING AND ECO-LABELING MODELS FOR PUBLIC HEALTH PROMOTION",
        "authors": "Dinu Țurcanu, Rodica Siminiuc",
        "published": "2023-10-21",
        "citations": 0,
        "abstract": "Creating food systems that provide healthy food for everyone without exploiting human or planetary resources, is one of the greatest challenges of this century. Front-end nutrition labeling and eco-efficiency systems have been proposed as a means of addressing health disparities and sustainable food and nutrition security. The aim of the study is the exploratory analysis of existing front-end nutrition labeling and eco-efficiency systems in order to make informed decisions about the further development of an effective labeling system. To carry out the study, the method of systematic document review and data triangulation was applied. The review provided information on the impact of color-coded labels and warnings in driving consumer purchasing behavior towards healthier products. Each labeling system had different attributes that should be taken into account when developing front-end nutrition labeling and eco-efficiency policies, depending on local contexts. However, front-end labeling is unlikely to be a panacea for changing consumer behavior but can target small incremental changes at different levels and actors in the food system.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52326/jss.utm.2023.6(3).06"
    },
    {
        "id": 24625,
        "title": "Bedeutung von Künstlicher Intelligenz in der Sozialen Arbeit",
        "authors": "Gesa Alena Linnemann, Julian Löhe, Beate Rottkemper",
        "published": "2023-6",
        "citations": 0,
        "abstract": "ZusammenfassungDie Bedeutung des Einsatzes von Verfahren, die unter dem Begriff der Künstlichen Intelligenz (KI) zusammenzufassen sind, wird sowohl für gesellschaftliche Prozesse als auch den Auftrag an die Soziale Arbeit zunehmend erkannt und diskutiert. Mit diesem Artikel wird ein Beitrag zum Diskurs geleistet, indem vertieft der Bereich der Sprachverarbeitung durch KI, das Natural Language Processing (NLP), in den Blick genommen wird. Verarbeitung natürlicher Sprache ist aufgrund der hohen Bedeutung kommunikativer Prozesse für die Praxis der Sozialen Arbeit von besonderer Relevanz, zugleich wird die Profession der Sozialen Arbeit tangiert. Bezugnehmend auf Staub-Bernasconis Handlungstheorie werden Implikationen und Diskussionspunkte von NLP identifiziert und diskutiert. Zudem werden mögliche Gratifikationen für Klient*innen herausgearbeitet, die sich u. a. aus der Wirkung und sozialen Interaktion ergeben. Hier wird die Media-Equation-Theorie von Nass und Reeves als Erkenntnisfolie herangezogen. Vor diesen Perspektiven ergeben sich sowohl Risiken (u. a. die Gefahr einer modularisierten Herauslösung genuin sozialarbeiterischer Tätigkeit) als auch Chancen (u. a. Teilhabe, niederschwelliger Zugang, Zugriff auf breitere Datenbasis).",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s12592-023-00455-7"
    },
    {
        "id": 24626,
        "title": "LAxplore: An NLP-Based Tool for Distilling Learning Analytics and Learning Design Instruments out of Scientific Publications",
        "authors": "Atezaz Ahmad, Jan Schneider, Daniel Schiffner, Esad Islamovic, Hendrik Drachsler",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012163600003598"
    },
    {
        "id": 24627,
        "title": "An NLP-Enhanced Approach to Test Comorbidities Risk Scoring Based on Unstructured Health Data for Hospital Readmissions Prediction",
        "authors": "Tahir Hameed, Haris Khan, Saad Khan, Mutahira Khalid, Asim Abbas, Syed Bukhari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011944500003414"
    },
    {
        "id": 24628,
        "title": "Replace and Report: NLP Assisted Radiology Report Generation",
        "authors": "Kaveri Kale, Pushpak Bhattacharyya, Kshitij Jadhav",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.683"
    },
    {
        "id": 24629,
        "title": "Relational Sentence Embedding for Flexible Semantic Matching",
        "authors": "Bin Wang, Haizhou Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.repl4nlp-1.20"
    },
    {
        "id": 24630,
        "title": "Chatbot for Mental health support using NLP",
        "authors": "Vanshika Gupta, Varun Joshi, Akshat Jain, Inakshi Garg",
        "published": "2023-5-26",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incet57972.2023.10170573"
    },
    {
        "id": 24631,
        "title": "Shifted PAUQ: Distribution shift in text-to-SQL",
        "authors": "Oleg Somov, Elena Tutubalina",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.18"
    },
    {
        "id": 24632,
        "title": "LexiGuard: Elevating NLP robustness through effortless adversarial fortification",
        "authors": "Marwan Omar",
        "published": "2023-10-7",
        "citations": 0,
        "abstract": "NLP models have demonstrated susceptibility to adversarial attacks, thereby compromising their robustness. Even slight modifications to input text possess the capacity to deceive NLP models, leading to inaccurate text classifications. In the present investigation, we introduce Lexi-Guard: an innovative method for Adversarial Text Generation. This approach facilitates the rapid and efficient generation of adversarial texts when supplied with initial input text. To illustrate, when targeting a sentiment classification model, the utilization of product categories as attributes is employed, ensuring that the sentiment of reviews remains unaltered. Empirical assessments were conducted on real-world NLP datasets to showcase the efficacy of our technique in producing adversarial texts that are both more semantically meaningful and exhibit greater diversity, surpassing the capabilities of numerous existing adversarial text generation methodologies. Furthermore, we leverage the generated adversarial instances to enhance models through adversarial training, demonstrating the heightened resilience of our generated attacks against model retraining endeavors and diverse model architectures.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2977-3903/2/2023012"
    },
    {
        "id": 24633,
        "title": "Character-Level Chinese Backpack Language Models",
        "authors": "Hao Sun, John Hewitt",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.blackboxnlp-1.8"
    },
    {
        "id": 24634,
        "title": "NLP startup funding in 2022",
        "authors": "Robert Dale",
        "published": "2023-1",
        "citations": 1,
        "abstract": "AbstractIt’s no secret that the commercial application of NLP technologies has exploded in recent years. From chatbots and virtual assistants to machine translation and sentiment analysis, NLP technologies are now being used in a wide variety of applications across a range of industries. With the increasing demand for technologies that can process human language, investors have been eager to get a piece of the action. In this article, we look at NLP startup funding over the past year, identifying the applications and domains that have received investment.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1017/s1351324923000013"
    },
    {
        "id": 24635,
        "title": "Research on NLP Based Automatic Summarization Generation Method for Medical Texts",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23977/acss.2023.070903"
    },
    {
        "id": 24636,
        "title": "NLP-Programme erkennen in Radiologieberichten IDH-Genotyp von diffusen Gliomen",
        "authors": "",
        "published": "2024-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1055/a-2208-9631"
    },
    {
        "id": 24637,
        "title": "Health Care Natural Language Processing (NLP) Using MOORA Method",
        "authors": "",
        "published": "2023-3-5",
        "citations": 0,
        "abstract": "The field of natural language processing (NLP) is being increasingly applied to the realm of healthcare. This abstract delves into the intersection of health care and NLP, highlighting how this technology is being used to enhance various aspects of the healthcare industry. From analyzing medical records and extracting relevant information to aiding in diagnosis and treatment recommendations, NLP is playing a pivotal role in transforming how healthcare professionals interact with data and make informed decisions. This abstract provides an overview of the key applications and benefits of employing NLP in healthcare, showcasing its potential to improve patient outcomes and streamline medical processes. This research seeks to harness the power of advanced computational linguistics to revolutionize various aspects of the healthcare industry. By enabling computers to understand and interpret human language, NLP has the potential to drive transformative changes NLP-powered systems can analyze vast amounts of medical literature, patient records, and research findings to provide healthcare practitioners with timely and relevant information. This assists in making well-informed decisions regarding diagnoses, treatment plans, and prognoses. NLP techniques facilitate the extraction of pertinent information from unstructured medical records, including patient histories and doctor's notes. This structured data can then be used for research, trend analysis, and epidemiological studies, contributing to evidence-based medicine. Versatile with unique alternatives a new method for optimization is proposed MOORA. This method is objective denotes the matrix of responses of the alternatives, however, proposing better policies, which rates are used. Well established. Multi-objective another method for optimization is used for comparison, reference point method. Then, various competitions this proved to be the best choice among the methods. From the result   BC2GM is in 1st rank whereas BC5- Disease is in lowest rank.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/cset/1/1/2"
    },
    {
        "id": 24638,
        "title": "Common Flaws in Running Human Evaluation Experiments in NLP",
        "authors": "Craig Thomson, Ehud Reiter, Anya Belz",
        "published": "2024-3-13",
        "citations": 0,
        "abstract": "Abstract\nWhile conducting a coordinated set of repeat runs of human evaluation experiments in NLP, we discovered flaws in every single experiment we selected for inclusion via a systematic process. In this squib, we describe the types of flaws we discovered, which include coding errors (e.g., loading the wrong system outputs to evaluate), failure to follow standard scientific practice (e.g., ad hoc exclusion of participants and responses), and mistakes in reported numerical results (e.g., reported numbers not matching experimental data). If these problems are widespread, it would have worrying implications for the rigor of NLP evaluation experiments as currently conducted. We discuss what researchers can do to reduce the occurrence of such flaws, including pre-registration, better code development practices, increased testing and piloting, and post-publication addressing of errors.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00508"
    },
    {
        "id": 24639,
        "title": "Should Carbon Footprint Labeling Be Mandatory for All Food Products? Rct Shows No Benefit Beyond Labeling the Top Third",
        "authors": "Pierre Chandon, Jad Chaaban, Shemal Doshi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4476227"
    },
    {
        "id": 24640,
        "title": "Prime labeling and prime distance labeling of some classes of graphs",
        "authors": "Ram Dayal, A. Parthiban",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0156720"
    },
    {
        "id": 24641,
        "title": "The depiction of Orania in the media (2013-2022): A quantitative analysis using Natural Language Processing (NLP)",
        "authors": "Burgert Senekal",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": "The current article investigates the depiction of the town of Orania in the media. Being an exclusive Afrikaner town, this town is highly controversial and is often seen as a remnant of apartheid, leading residents of this town to form the perception that the media treats them unfairly. Using Natural Language Processing (NLP) techniques, namely a lexicon-based sentiment analysis classification and a machine-learning political bias classification, it is shown that the vast majority of news reports and opinion pieces on this town exhibit minimal political bias, and publications on this town are evenly distributed between left and right political bias. In addition, while the majority of news reports and opinion pieces published on this town are neutral, more publications are positive than negative. However, differences in the depiction of this town based on the language of publications are also discussed, with English publications more negative and Afrikaans publications more positive, and the majority of publications on this town are in Afrikaans. Overall, the study finds that while some individual publications present Orania in a very negative light, in general, the media reports on this town in a balanced way.",
        "keywords": "",
        "link": "http://dx.doi.org/10.38140/com.v28i.7280"
    },
    {
        "id": 24642,
        "title": "Student Emotional Complexity Analysis with NLP and Machine Learning in Educational Contexts",
        "authors": "Sayak Mukhopadhyay, Mangal Singh",
        "published": "2023-12-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ocit59427.2023.10430594"
    },
    {
        "id": 24643,
        "title": "Using NLP for Functional Size Measurement of IoT Devices",
        "authors": "Salma Salem, Hassan Soubra",
        "published": "2023-11-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icicis58388.2023.10391192"
    },
    {
        "id": 24644,
        "title": "Toward training NLP models to take into account privacy leakages",
        "authors": "Gaspard Berthelier, Antoine Boutet, Antoine Richard",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386735"
    },
    {
        "id": 24645,
        "title": "Validity, Reliability, and Significance: Empirical Methods for NLP and Data Science",
        "authors": "Richard Futrell",
        "published": "2023-3-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_r_00467"
    },
    {
        "id": 24646,
        "title": "Product Review Assistance Based on Feature Sentiment Analysis Using NLP",
        "authors": "Vaishali Jabade, Prasad Sanap, Ajinkya Sathe",
        "published": "2023-11-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incoft60753.2023.10425395"
    },
    {
        "id": 24647,
        "title": "METAPROBE: A Representation- and Task-Agnostic Probe",
        "authors": "Yichu Zhou, Vivek Srikumar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.blackboxnlp-1.18"
    },
    {
        "id": 24648,
        "title": "Ling-CL: Understanding NLP Models through Linguistic Curricula",
        "authors": "Mohamed Elgaar, Hadi Amiri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.834"
    },
    {
        "id": 24649,
        "title": "The Law and NLP: Bridging Disciplinary Disconnects",
        "authors": "Robert Mahari, Dominik Stammbach, Elliott Ash, Alex Pentland",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.224"
    },
    {
        "id": 24650,
        "title": "Assessing Distractors in Multiple-Choice Tests",
        "authors": "Vatsal Raina, Adian Liusie, Mark Gales",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eval4nlp-1.2"
    },
    {
        "id": 24651,
        "title": "An Interactive Teaching Mode based on Artificial Intelligence Teaching",
        "authors": "Zhefu Song, Zhihua Wang, Zhaoyang Fu, Chao Wu",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "With the continuous development of artificial intelligence, its impact on people's lives is becoming increasingly significant. Countries, universities, and students have increased their emphasis on learning artificial intelligence knowledge. This article designs and proposes a teaching mode called mo-tutor, which achieves the goal of learning artificial intelligence (AI)knowledge through video playback, segmented speech explanations, picture and text sketching, and online coding. This mode effectively coordinates the AI knowledge system and reduces the barrier for students to learn AI.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131611"
    },
    {
        "id": 24652,
        "title": "Health Care Natural Language Processing (NLP) Using MOORA Method",
        "authors": "",
        "published": "2023-3-6",
        "citations": 0,
        "abstract": "The field of natural language processing (NLP) is being increasingly applied to the realm of healthcare. This abstract delves into the intersection of health care and NLP, highlighting how this technology is being used to enhance various aspects of the healthcare industry. From analyzing medical records and extracting relevant information to aiding in diagnosis and treatment recommendations, NLP is playing a pivotal role in transforming how healthcare professionals interact with data and make informed decisions. This abstract provides an overview of the key applications and benefits of employing NLP in healthcare, showcasing its potential to improve patient outcomes and streamline medical processes. This research seeks to harness the power of advanced computational linguistics to revolutionize various aspects of the healthcare industry. By enabling computers to understand and interpret human language, NLP has the potential to drive transformative changes NLP-powered systems can analyze vast amounts of medical literature, patient records, and research findings to provide healthcare practitioners with timely and relevant information. This assists in making well-informed decisions regarding diagnoses, treatment plans, and prognoses. NLP techniques facilitate the extraction of pertinent information from unstructured medical records, including patient histories and doctor's notes. This structured data can then be used for research, trend analysis, and epidemiological studies, contributing to evidence-based medicine. Versatile with unique alternatives a new method for optimization is proposed MOORA. This method is objective denotes the matrix of responses of the alternatives, however, proposing better policies, which rates are used. Well established. Multi-objective another method for optimization is used for comparison, reference point method. Then, various competitions this proved to be the best choice among the methods. From the result   BC2GM is in 1st rank whereas BC5- Disease is in lowest rank.",
        "keywords": "",
        "link": "http://dx.doi.org/10.46632/cset/1/1/02"
    },
    {
        "id": 24653,
        "title": "UTILIZING DEEP LEARNING NLP IN AUTO CLASSIFICATION OF OCRED DOCUMENTS",
        "authors": "",
        "published": "2023-4-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets35582"
    },
    {
        "id": 24654,
        "title": "Keynote - AI for the Public Sector and the Case of Legal NLP",
        "authors": "Matthias Stürmer",
        "published": "2023-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icedeg58167.2023.10122084"
    },
    {
        "id": 24655,
        "title": "Towards Faithful Model Explanation in NLP: A Survey",
        "authors": "Qing Lyu, Marianna Apidianaki, Chris Callison-Burch",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "Abstract\nEnd-to-end neural Natural Language Processing (NLP) models are notoriously difficult to understand. This has given rise to numerous efforts towards model explainability in recent years. One desideratum of model explanation is faithfulness, that is an explanation should accurately represent the reasoning process behind the model’s prediction. In this survey, we review over 110 model explanation methods in NLP through the lens of faithfulness. We first discuss the definition and evaluation of faithfulness, as well as its significance for explainability. We then introduce recent advances in faithful explanation, grouping existing approaches into five categories: similarity-based methods, analysis of model-internal structures, backpropagation-based methods, counterfactual intervention, and self-explanatory models. For each category, we synthesize its representative studies, strengths, and weaknesses. Finally, we summarize their common virtues and remaining challenges, and reflect on future work directions towards faithful explainability in NLP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00511"
    },
    {
        "id": 24656,
        "title": "Artificially Intelligent Cultural Perspectives with NLP: Exploring Japanese Cultural Heritage Collections with AI (Slides)",
        "authors": "Jim Samuel",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4342744"
    },
    {
        "id": 24657,
        "title": "Two-stage Pipeline for Multilingual Dialect Detection",
        "authors": "Ankit Vaidya, Aditya Kane",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.22"
    },
    {
        "id": 24658,
        "title": "Implementing an NLP Tool to Address SDOH Needs",
        "authors": "Urmila Ravichandran, Danielle Jungst, Emily Kwan",
        "published": "2023-6-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ichi57859.2023.00091"
    },
    {
        "id": 24659,
        "title": "PREDICTION OF CONSTRUCTION SITE ACCIDENTS USING TEXT MINING AND NLP",
        "authors": "",
        "published": "2024-3-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets50057"
    },
    {
        "id": 24660,
        "title": "AraDiaWER: An Explainable Metric For Dialectical Arabic ASR",
        "authors": "Abdulwahab Sahyoun, Shady Shehata",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.fieldmatters-1.8"
    },
    {
        "id": 24661,
        "title": "Prime labeling and prime distance labeling of some simple graphs",
        "authors": "Ram Dayal, A. Parthiban, G. Samdanielthompson, P. Selvaraju",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1063/5.0170323"
    },
    {
        "id": 24662,
        "title": "Revisiting labeling theory: empirical test of informal labeling process",
        "authors": "Wonki Lee",
        "published": "2024-3-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1080/0735648x.2023.2264263"
    },
    {
        "id": 24663,
        "title": "NLP based Text Summarization of Fintech RFPs",
        "authors": "Krutika Patil, Medha Badamikar, Sheetal Sonawane",
        "published": "2023-3-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscds56580.2023.10104748"
    },
    {
        "id": 24664,
        "title": "Spam Detection using NLP and Machine Learning Techniques",
        "authors": "Sooraj Tomar, Harshit Krishna, Krishnaraj N",
        "published": "2023-12-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icercs57948.2023.10433949"
    },
    {
        "id": 24665,
        "title": "Innovative Personal Assistance: Speech Recognition and NLP-Driven Robot Prototype",
        "authors": "Michelle Valerie, Irma Salamah,  Lindawati",
        "published": "2023-7-31",
        "citations": 0,
        "abstract": "This paper presents the development and evaluation of a personal assistant robot prototype with advanced speech recognition and natural language processing (NLP) capabilities. Powered by a Raspberry Pi microprocessor, it is the core component of the robot's hardware. It is designed to receive commands and promptly respond by performing the requested actions, utilizing integrated speech recognition and NLP technologies. The prototype aims to enhance meeting efficiency and productivity through audio-to-text conversion and high-quality image capture. Results show excellent performance, with accuracy rates of 100% in Indonesian and 99% in English. The efficient processing speed, averaging 9.07 seconds per minute in Indonesian and 15.3 seconds per minute in English, further enhances the robot's functionality. Additionally, integrating a high-resolution webcam enables high-quality image capture at 1280 x 720 pixels. Real-time integration with Google Drive ensures secure storage and seamless data management. The findings highlight the prototype's effectiveness in facilitating smooth interactions and effective communication, leveraging NLP for intelligent language understanding. Integrating NLP-based speech recognition, visual documentation, and data transfer provides a comprehensive platform for managing audio, text, and image data. The personal assistant robot prototype presented in this research represents a significant advancement in human-robot interaction, particularly in meeting and collaborative work settings. Further refinements in NLP can enhance efficiency and foster seamless human-robot interaction experiences.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25077/jnte.v12n2.1105.2023"
    },
    {
        "id": 24666,
        "title": "Twitter Sentiment Analysis and Prediction using NLP",
        "authors": "M. Sindhu, T.C. Sabareeswari, A. Tamilselvi",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452611"
    },
    {
        "id": 24667,
        "title": "Hate Speech Classifiers are Culturally Insensitive",
        "authors": "Nayeon Lee, Chani Jung, Alice Oh",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.c3nlp-1.5"
    },
    {
        "id": 24668,
        "title": "AutoML for NLP",
        "authors": "Kevin Duh, Xuan Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-tutorials.5"
    },
    {
        "id": 24669,
        "title": "ÚFAL Submission for SIGTYP Supervised Cognate Detection Task",
        "authors": "Tomasz Limisiewicz",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.sigtyp-1.14"
    },
    {
        "id": 24670,
        "title": "Towards Explainable and Accessible AI",
        "authors": "Brandon Duderstadt, Yuvanesh Anand",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.28"
    },
    {
        "id": 24671,
        "title": "Depression Classification from Thai Text Twitter Post based on NLP-generated Corpus",
        "authors": "Vorraya Suttiprapa, Surapong Uttama",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/incit60207.2023.10413094"
    },
    {
        "id": 24672,
        "title": "Legal Case Classification Using Machine Learning with NLP",
        "authors": "Manjusha Singh Tomar, Vishal Gupta",
        "published": "2023-12-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdsaai59313.2023.10452618"
    },
    {
        "id": 24673,
        "title": "Utilizing Mixture Methods for Classifier in NLP: An Essential Consideration",
        "authors": "Ms. Kavita, Harveer Singh",
        "published": "2023-1-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisc56616.2023.10085077"
    },
    {
        "id": 24674,
        "title": "Automated Detection of Spam on Instagram using Classifiers and NLP",
        "authors": "Priyadarsini K, Dewansh Chatter, Aniket Dhand",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.127"
    },
    {
        "id": 24675,
        "title": "Murreviikko - A Dialectologically Annotated and Normalized Dataset of Finnish Tweets",
        "authors": "Olli Kuparinen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.3"
    },
    {
        "id": 24676,
        "title": "Decaging-to-labeling: Development and investigation of quinone methide warhead for protein labeling",
        "authors": "Fuhu Guo, Shengnan Qin, Ziqi Liu, Peng R. Chen, Xinyuan Fan",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.bioorg.2023.107088"
    },
    {
        "id": 24677,
        "title": "Secondary Labeling: A Novel Labeling Strategy for Image Manipulation Detection",
        "authors": "Yang Wei, Bin Xiao, Xiuli Bi, Zhuoran Ma, Yang Liu, Zhuo Ma",
        "published": "2023-10-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3581783.3613839"
    },
    {
        "id": 24678,
        "title": "A Multilingual Evaluation of NER Robustness to Adversarial Inputs",
        "authors": "Akshay Srinivasan, Sowmya Vajjala",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.repl4nlp-1.4"
    },
    {
        "id": 24679,
        "title": "Generating Video Game Scripts with Style",
        "authors": "Gaetan Lopez Latouche, Laurence Marcotte, Ben Swanson",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlp4convai-1.11"
    },
    {
        "id": 24680,
        "title": "Question and Answering System For Investment Promotion Based on NLP",
        "authors": "P M R A Panditharathna, Samantha Rajapaksha",
        "published": "2023-1-24",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconat57137.2023.10080255"
    },
    {
        "id": 24681,
        "title": "A Chatbot System for Education NLP Using Deep Learning",
        "authors": "C. Kavitha, K. Pavun Kavitha",
        "published": "2023-4-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142830"
    },
    {
        "id": 24682,
        "title": "GUI: An Interface for Hate Speech Detection using NLP Technique",
        "authors": "Archika Jain, Sandhya Sharma",
        "published": "2023-8-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiss58487.2023.10250527"
    },
    {
        "id": 24683,
        "title": "A Review of Research Based on NLP Foundation Models in China from the Perspective of Bibliometrics",
        "authors": "Zhang Nan, Lu Juhui",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.57237/j.cst.2023.04.002"
    },
    {
        "id": 24684,
        "title": "Question Generation System Using NLP",
        "authors": "Mrs D R Nanda Devi",
        "published": "2023-7-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37622/ijcse/13.1.2023.1-9"
    },
    {
        "id": 24685,
        "title": "An Empirical Study on Active Learning for Multi-label Text Classification",
        "authors": "Mengqi Wang, Ming Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.12"
    },
    {
        "id": 24686,
        "title": "Exploration, detection, and mitigation: Unveiling gender bias in NLP",
        "authors": "Chunxiao Zhang",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Natural Language Processing (NLP) systems have a mundane impact, yet they harbour either obvious or potential gender bias. The automation of decision-making in NLP models even exacerbates unfair treatment. In recent years, researchers have started to notice this issue and have made some approaches to detect and mitigate these biases, yet no consensus on the approaches exists. This paper discusses the interdisciplinary field of linguistics and computer sciences by presenting the most common gender bias categories and breaking them down with ethical and artificial intelligence approaches. Specific methods for detecting and minimizing bias are shown around biases present in raw data, annotator, model, and the linguistic gender system. In this paper, an overview of the hotspots and future perspectives of this research topic is presented. Limitations of some detection methods are pinpointed, providing novel insights into future research. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.54254/2755-2721/52/20241234"
    },
    {
        "id": 24687,
        "title": "mSCAN: A Dataset for Multilingual Compositional Generalisation Evaluation",
        "authors": "Amélie Reymond, Shane Steinert-Threlkeld",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.11"
    },
    {
        "id": 24688,
        "title": "Inductive Bias Is in the Eye of the Beholder",
        "authors": "Michael Wilson, Robert Frank",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.12"
    },
    {
        "id": 24689,
        "title": "Low-Dimensional Text Representations for Sentiment Analysis NLP Tasks",
        "authors": "Leonidas Akritidis, Panayiotis Bozanis",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01913-y"
    },
    {
        "id": 24690,
        "title": "Layerwise universal adversarial attack on NLP models",
        "authors": "Olga Tsymboi, Danil Malaev, Andrei Petrovskii, Ivan Oseledets",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.10"
    },
    {
        "id": 24691,
        "title": "Cognitive Computing for Natural Language Processing (NLP) and Understanding Medical Imaging Narratives",
        "authors": "Himanshu Makhija",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iccsai59793.2023.10420976"
    },
    {
        "id": 24692,
        "title": "The State-of-art Applications of NLP: Evidence from ChatGPT",
        "authors": "Yuming Zhao",
        "published": "2023-5-21",
        "citations": 3,
        "abstract": "Contemporarily, CharGPT, one of the latest applications of natural language processing (NLP) based on a popular deep learning model developed by OpenAI, has attracted tremendous attention of researchers. On this basis, this study takes NLP as an example to provide a basic introduction to the development history and application of NLP, and lists some models in the development process. These are valuable knowledge that is still used in OpenAI applications. Before in-depth study of the components and models of ChatGPT, this paper also mentioned the basic introduction of chat robots. Accorind to the analysis, it is shown that people are increasingly interested in the use of ChatGPT in various applications, including language translation and question answering. However, it also lists several limitations of ChatGPT, e.g., its tendency to generate biased or inappropriate responses. The future prospects of ChatGPT or similar products are also mentioned later. Moreover, the main findings of the paper and proposes potential avenues for future research are presented. Overall, these results shed light on guiding further exploration of NLP.S.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/hset.v49i.8512"
    },
    {
        "id": 24693,
        "title": "Edit Aware Representation Learning via Levenshtein Prediction",
        "authors": "Edison Marrese-Taylor, Machel Reid, Alfredo Solano",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.6"
    },
    {
        "id": 24694,
        "title": "Job Recommendation System Using NLP",
        "authors": "Sneha Kumari",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "Abstract: Recommender systems is one of the most successful machine learning applications. We are exposed to the products/information recommended by these systems everywhere in our daily life. This project will introduce several recommender systems in NLP, specifically in the domain of online recruitment. I will explain the important ideas behind the recommender systems in our web application, it might be also similar with those in recruiting platforms like LinkedIn, Xing. One of my main jobs is to design and develop recommender systems on the skill-based matching app. Before getting into this specific topic, I would like to go over the general concepts and methods of current recommender system in different domains. We have provided a brief overview of the approaches, techniques, and applications of recommendation systems in this paper. One significant application of recommendation systems is in the field of job recruitment, where candidates are chosen using online job recruitment portals based on their profiles, employment histories, and behavioral tendencies. According to a recent survey, this field has not been thoroughly investigated up to this point, and the current job recommender system has many flaws. They analyze resumes, profiles, and job descriptions, but because of the \"cold start\" problem, new job postings and candidate profiles are not properlymatched. In some cases, potential candidates lose their jobs as a result of inadequate job descriptions and education information in the ontology.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.52183"
    },
    {
        "id": 24695,
        "title": "Interpretability is not Explainability: New Quantitative XAI Approach with a focus on Recommender Systems in Education",
        "authors": "Riccardo Porcedda",
        "published": "2023-9-19",
        "citations": 0,
        "abstract": "The field of eXplainable Artificial Intelligence faces challenges due to the absence of a widely accepted taxonomy that facilitates the quantitative evaluation of explainability in Machine Learning algorithms.  In this paper, we propose a novel taxonomy that addresses the current gap in the literature by providing a clear and unambiguous understanding of the key concepts and relationships in XAI. Our approach is rooted in a systematic analysis of existing definitions and frameworks, with a focus on transparency, interpretability, completeness, complexity and understandability as essential dimensions of explainability. This comprehensive taxonomy aims to establish a shared vocabulary for future research.  To demonstrate the utility of our proposed taxonomy, we examine a case study of a Recommender System designed to curate and recommend the most suitable online resources from MERLOT. By employing the SHAP package, we quantify and enhance the explainability of the RS within the context of our newly developed taxonomy.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131612"
    },
    {
        "id": 24696,
        "title": "Nlp Based Machine Learning Approaches for Text Summarization",
        "authors": "Dr. Rajeshwara Rao, B. Harika, A. Srikanth, Y. Vahini",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4362940"
    },
    {
        "id": 24697,
        "title": "Smart Patient Records using NLP and Blockchain",
        "authors": "Akash Dubey, Kartik Jain, K. Kalaiselvi",
        "published": "2023-1-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icssit55814.2023.10061111"
    },
    {
        "id": 24698,
        "title": "Intelligent Sanskrit translator using NLP",
        "authors": "Vaidehi Deshmukh, Arti Khaparde",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3594441.3594465"
    },
    {
        "id": 24699,
        "title": "Natural Language Processing (NLP)-Driven Subjective Answer Ranking",
        "authors": "Nikitha A",
        "published": "2023-8-9",
        "citations": 0,
        "abstract": "Exams for universities and boards are administered offline each year. Many students show up for subjective exams. It took a lot of work to manually evaluate such a big number of papers. The evaluation's quality can occasionally fluctuate depending on the evaluator's attitude. The evaluation process takes a lot of time and effort. Objective or multiple choice questions are commonly found in competitive and entrance tests. These tests are reviewed using a machine because that is how they were administered, making evaluation simple. The manual evaluation of subjective papers is a difficult and taxing undertaking. A major obstacle when utilizing artificial intelligence (AI) to analyze subjective articles is a lack of understanding and acceptance of the findings. There have been numerous attempts to use computer science to evaluate student responses. To accomplish this objective, the majority of the effort, however, needs standard counts or precise terms. There are also not enough carefully selected data sets. In order to evaluate descriptive responses automatically, this paper proposes a novel approach that makes use of various machine learning, natural language processing, and tools like WorldNet, Word2vec, word mover's distance (WMD), cosine similarity, Multinomial Naive Bayes (MNB), and term frequency-inverse document frequency (TF-IDF). Responses are assessed using solution statements and keywords, and a machine learning model is built to forecast the grades of responses. Overall, the results indicate that WMD outperforms cosine similarity. The machine learning model could also be employed independently with appropriate training. Without the MNB model, experimentation produces an accuracy of 88%. Using MNB, the error rate is further decreased by 1.3%. Keywords - Subjective answer evaluation, big data, machine",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem25075"
    },
    {
        "id": 24700,
        "title": "Text Summarization Using NLP",
        "authors": "Mr. Harshal Bharati",
        "published": "2024-1-31",
        "citations": 0,
        "abstract": "Abstract: This Project represents the work associated with Text Summarization. In this paper, we present a framework for summarizing the massive facts. The proposed framework depends on highlight extraction from internet, using each morphological element and semantic data. Presently, in which large facts is available on the internet, it's far maximum important to offer the improved approaches to extract the statistics quickly and most successfully. It may be very hard for human beings to manually extract the precis of a large document of text. There are lots of text substances to be had on the internet. So, there's a hassle of looking for related files from the quantity of documents to be had and absorbing associated statistics from it. In essence to determine out the previous issues, the automated textual content summarization could be very a whole lot essential. Text Summarization is the method of figuring out the most vital and significant information in a input report or set of related input files and compressing all the inputs into a shorter version preserving its normal goals.",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2024.56564"
    },
    {
        "id": 24701,
        "title": "Eggs Separation Process by Image Processing",
        "authors": "Narumol Chumuang, Thidarat Pinthong",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10355031"
    },
    {
        "id": 24702,
        "title": "Token-level Fitting Issues of Seq2seq Models",
        "authors": "Guangsheng Bao, Zhiyang Teng, Yue Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.repl4nlp-1.23"
    },
    {
        "id": 24703,
        "title": "Temporal Domain Adaptation for Historical Irish",
        "authors": "Oksana Dereza, Theodorus Fransen, John P. Mccrae",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.6"
    },
    {
        "id": 24704,
        "title": "SQUEEZEBERT: BRIDGING THE GAP BETWEEN COMPUTER VISION AND NLP FOR ENHANCED EFFICIENCY",
        "authors": "",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets45993"
    }
]