[
    {
        "id": 301,
        "title": "A comparison of random forest based algorithms: random credal random forest versus oblique random forest",
        "authors": "Carlos J. Mantas, Javier G. Castellano, Serafín Moral-García, Joaquín Abellán",
        "published": "2019-11",
        "citations": 56,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00500-018-3628-5"
    },
    {
        "id": 302,
        "title": "Stroke Disease Prediction Using Random Forest Method",
        "authors": "Priyo Wahyu Setiyo Aji, Suprianto Suprianto",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.2643"
    },
    {
        "id": 303,
        "title": "Prediction of Credit Eligibility Using the Random Forest Method",
        "authors": "Noval Firmansah, Uce Indahyanti",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.3515"
    },
    {
        "id": 304,
        "title": "Markowitz Random Forest: Weighting Random Forest Trees with Modern Portfolio Theory",
        "authors": "Eleftherios Kouloumpris, Ioannis Vlahavas",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4310571"
    },
    {
        "id": 305,
        "title": "Classification: Practice - Random Forest",
        "authors": "",
        "published": "2018",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4135/9781526469144"
    },
    {
        "id": 306,
        "title": "Klasifikasi Malicious URL Menggunakan Algoritma Improved Random Forest dan Random Forest Berbasis Web",
        "authors": "",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "URLs are very much on the network of computer systems. Moreover, nowadays all activities use an online system. Starting from social media, and marketplaces to group chat applications. An early prevention system from malicious URL attacks is needed to counteract the large number of URLs circulating in the online system. Previously detection of malicious URLs based on blacklisting and UURLs are very much on the network of computer systems. Moreover, nowadays all activities use an online system. Starting from social media, marketplaces to group chat applications. An early prevention system from malicious URL attacks is needed to counteract the large number of URLs circulating in the online system. Previously, malicious URL detection based on Blacklisting and Heuristic URLs could not recognize the new type of malicious URL without first being analyzed. For this reason, a technique is needed to detect malicious URLs using machine learning. The lack of machine learning in the detection of malicious URLs is that it is not 100% able to detect malicious URLs precisely. This study will use an improved random forest approach with a random forest as a classifier to detect malicious URLs. Improved Random Forest is a Random Forest that is used using evaluator features and filter instances to improve the accuracy of ordinary random forests. This study concluded that both methods of improved random forest and ordinary random forest have an accuracy value above 98%.",
        "link": "http://dx.doi.org/10.22216/jsi.v9i1.1378"
    },
    {
        "id": 307,
        "title": "Random Forest Identification of Pulsars",
        "authors": "Ankhita Sathanur",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.58445/rars.17"
    },
    {
        "id": 308,
        "title": "Random Forest and Boosting",
        "authors": "",
        "published": "2021-5-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1017/9781108591102.016"
    },
    {
        "id": 309,
        "title": "An Improvised Random Forest Model for Breast Cancer Classification",
        "authors": "Dr. Tina Elizabeth Mathew",
        "published": "2022-5-18",
        "citations": 3,
        "abstract": "Breast Cancer is considered as the most common cancer in females with high incidence rate. The evolution of modern facilities has helped in reducing the mortality rate, yet the incidence is still the highest among all cancers affecting women. Early diagnosis is a predominant factor for survival. Hence techniques to assist the current modalities are essential. Machine learning techniques have been used so as to produce better prediction and classification models which will aid in better and earlier disease diagnosis and classification. Random Forest is a supervised machine learning classifier that helps in better classification. Random Forests are applied to the Wisconsin breast cancer dataset and the performance of the classifier is evaluated for breast cancer classification. Here in this study an improvised random forest model which uses a cost sensitive learning approach for classification is proposed and it is found to have a better performance than the traditional random forest approach. The model gave an accuracy of 97.51%.",
        "link": "http://dx.doi.org/10.14704/nq.2022.20.5.nq22227"
    },
    {
        "id": 310,
        "title": "Comparison of artificial neural network, random forest and random perceptron forest for forecasting the spatial impurity distribution",
        "authors": "Andrey V. Shichkin, Alexander G. Buevich, Alexander P. Sergeev",
        "published": "2018",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/1.5045411"
    },
    {
        "id": 311,
        "title": "Random forest (machine learning)",
        "authors": "Andrew Murphy, Candace Moore",
        "published": "2019-4-23",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.53347/rid-67772"
    },
    {
        "id": 312,
        "title": "Data-driven multinomial random forest: a new random forest variant with strong consistency",
        "authors": "JunHao Chen, XueLi Wang, Fei Lei",
        "published": "2024-2-23",
        "citations": 0,
        "abstract": "AbstractIn this paper, we modify the proof methods of some previously weakly consistent variants of random forest into strongly consistent proof methods, and improve the data utilization of these variants in order to obtain better theoretical properties and experimental performance. In addition, we propose the Data-driven Multinomial Random Forest (DMRF) algorithm, which has the same complexity with BreimanRF (proposed by Breiman) while satisfying strong consistency with probability 1. It has better performance in classification and regression tasks than previous RF variants that only satisfy weak consistency, and in most cases even surpasses BreimanRF in classification tasks. To the best of our knowledge, DMRF is currently a low-complexity and high-performing variation of random forest that achieves strong consistency with probability 1.",
        "link": "http://dx.doi.org/10.1186/s40537-023-00874-6"
    },
    {
        "id": 313,
        "title": "Transparent rule generator random forest (TRG-RF): an interpretable random forest",
        "authors": "Arpita Nath Boruah, Saroj Kumar Biswas, Sivaji Bandyopadhyay",
        "published": "2023-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12530-022-09434-4"
    },
    {
        "id": 314,
        "title": "Quantum Computing with Random Forest",
        "authors": "Pavel Cherkashin",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper examines the possibilities of Quantum Random Forest (QRF), a combination of quantum mechanics and machine learning, when viewed in the context of the Golden Ratio and fractal resonance. We suggest that this combination could create new opportunities for computing.",
        "link": "http://dx.doi.org/10.31219/osf.io/7c2y5"
    },
    {
        "id": 315,
        "title": "Implementation of Data Mining in Diabetes Disease Prediction Using Random Forest and XGBoost Methods",
        "authors": "Muhammad Salsabil, Nuril Lutvi Azizah",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.3290"
    },
    {
        "id": 316,
        "title": "On learning Random Forests for Random Forest-clustering",
        "authors": "Manuele Bicego, Francisco Escolano",
        "published": "2021-1-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr48806.2021.9412014"
    },
    {
        "id": 317,
        "title": "Characteristics of Sexual Homicide: Based on Random Forest Analysis",
        "authors": "Hyeokjun Kwon, Jonghan Sea",
        "published": "2022-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36889/kcr.2022.3.31.1.165"
    },
    {
        "id": 318,
        "title": "M-ary Random Forest - A new multidimensional partitioning approach to Random Forest",
        "authors": "Vikas Jain, Ashish Phophalia",
        "published": "2021-11",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-020-10047-9"
    },
    {
        "id": 319,
        "title": "How random is the random forest? Random forest algorithm on the service of structural imaging biomarkers for Alzheimer's disease: from Alzheimer's disease neuroimaging initiative (ADNI) database",
        "authors": "StavrosI Dimitriadis, Dimitris Liparas,  Alzheimer's DNI",
        "published": "2018",
        "citations": 50,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.4103/1673-5374.233433"
    },
    {
        "id": 320,
        "title": "Forecasting of Turkish housing price index: ARIMA, random forest, ARIMA-random forest",
        "authors": "Ebru Çaglayan Akay, Kadriye Hilal Topal, Saban Kizilarslan, Hoseng Bulbul",
        "published": "2019-12-30",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17261/pressacademia.2019.1134"
    },
    {
        "id": 321,
        "title": "Random Forest Optimization for Radionuclide Identification",
        "authors": "A Amrhar, M Monterial",
        "published": "2020-8-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1769166"
    },
    {
        "id": 322,
        "title": "GDSC data set and random forest model scripts  v1",
        "authors": "Peter Anderson",
        "published": "No Date",
        "citations": 0,
        "abstract": "This location contains the GDSC data set with 145 oncogene mutation statuses and ~1200 chemical descriptors. For instructions how to run binary classification (to predict compound activity vs inactivity) or regression (to predict values of log IC50), see the README.classification.txt and README.regression.txt files, respectively. ",
        "link": "http://dx.doi.org/10.17504/protocols.io.3j9gkr6"
    },
    {
        "id": 323,
        "title": "Analysis of forest cover in Parque Nacional Tingo María (Peru) using the random forest algorithm",
        "authors": "Ronald Puerta, José Iannacone",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "The establishment of natural protected areas is one of the most effective strategies to conserve forests and their biodiversity; however, the uncontrolled advance of deforestation resulting from the change of use to expand the agricultural frontier has become a threat to these intangible areas. This research aimed to analyze the dynamics of forest cover in Parque Nacional Tingo María (PNTM) and its buffer zone (ZA) located in the high jungle of the Huánuco region of Peru. The main input was Sentinel-2 images that were classified using the Random Forest algorithm. As a result, coverage maps were obtained for the study area corresponding to the years 2017, 2019, 2021 and 2023, achieving considerable thematic accuracy. During the evaluation periods, the rates of change from forest to non-forest within the PNTM presented low values -0.26% (2017 - 2019); -1.24% (2019 - 2021) and -0.02% (2021 - 2023). While the forests in the ZA have undergone a dynamic transition, with rates of change of -2.97%; -4.39% and -1.15% derived from land use change. The landscape metrics suggest that the forests of the PNTM are moderately fragmented, and the forests of the ZA are strongly fragmented, which leads to the conclusion that the protected natural area has fulfilled its objective of maintaining vegetation cover.",
        "link": "http://dx.doi.org/10.17268/sci.agropecu.2023.025"
    },
    {
        "id": 324,
        "title": "Predicting Epithelial Ovarian Cancer First Recurrence with Random Survival Forest:  Comparison Parametric, Semi-Parametric, and Random Survival Forest Methods",
        "authors": "Maryam Deldar, Robab Anbiaee, Kourosh Sayehmiri",
        "published": "2021-3-9",
        "citations": 0,
        "abstract": "Objective: Rapid technological advances in the last century and the large amount of information have made it difficult to analyze a large number of independent variables. In such circumstances, the existence of interactions of different degrees in the model is expected, in this case, the Cox model cannot be useful and the nonparametric method of random survival forest can be a useful alternative. This study compares the prediction error of random survival forest with Cox and Weibull models in predicting the time to the first recurrence in patients with epithelial ovarian cancer.\r\nMethod: In this retrospective study, the records of patients with epithelial ovarian cancer who referred to Imam Hossein Hospital in Tehran from 2007 to 2018 were used. To investigate the factors affecting the first recurrence of these patients, RSF was fitted to the data. Finally, prediction error of Cox, Weibull and RSF were compared using C-Index and Brier score.\r\nResults: Brier score was calculated 0.16 for RSF, and 0.24 for Cox, also C-Index was calculated 0.34 for RSF and 0.42 for Cox. Brier score was calculated 0.092 for Cox and 0.089 for Weibull, so the prediction error of RSF was lower than both Cox and Weibull models.\r\nConclusion: Random survival forest with a suitable fit on many variables and without the need for a special default with a prediction error less than the Weibull and Cox methods can predict the response variable when confronted with high-dimensional data.",
        "link": "http://dx.doi.org/10.18502/jbe.v6i4.5680"
    },
    {
        "id": 325,
        "title": "Landslide Susceptibility Model based on Random Forest classification",
        "authors": "Flavius Sirbu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Random Forest (RF) is a classification algorithm used successfully in geomorphological and hazard mapping (S&#238;rbu et al., 2019). It performs a defined number of classifications, based on decision trees, on random samples with replacement, from the original training data. Because of this, the algorithm is especially robust for errors and outliers in the training data and it is also very good in producing uncertainty estimates for the variability of results on each of the classified features. Its resulting data can also be used, with different methods, to produce a ranking of the independent variables used in the classification.The present study was performed on a given data set, in central Italy, containing 7,360 slope units covering an area of 4,095 km2. The slope units are classified twice, based on different methodologies, into units with or without landslides. Also each slope unit has assigned 26 attributes that were used as independent variables (Alvioli et al., 2022). The slope units are treated as spatially independent from each other, and have been randomly split 70%-30%, into training and validation data respectively.The model was setup as a computer code, in the R software environment. It uses different libraries to integrate the input data, run the algorithm, run a validation and measure the performance of the model and finally produce the output data. Most of the model settings were used with their default value, with the number of classification trees (ntree) being the only important setting that was fine tuned to a value of 1501 based on different model runs.The results of the two classifications (one for each classification of the dependent variable) are relatively similar, proving once again the robustness of the RF algorithm when it comes to minor to medium changes in the input data. The first classification had an AUC (area under the curve) value of 0.829 compared with the AUC value of 0.817 for the second classification. For each classification, a ranking of the independent variables was produce, with the standard deviation of slope being the most important predictor. Other predictors with relative high importance were elevation and curvatures.The results show that RF is an important classifier, which can be used with relatively low custom settings and on almost any data set in order to produce a reliable susceptibility map. Its integration with the R software makes it easy to run the whole process virtually automatic. The computer code for the model will be made freely available.",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-733"
    },
    {
        "id": 326,
        "title": "Development of a quantitative investment algorithm based on Random Forest",
        "authors": "Tatyana Novikova, Svetlana Evdokimova, Gotsui Wu",
        "published": "2022-12-13",
        "citations": 0,
        "abstract": "In modern research of the stock market, specialists and scientists are improving algorithms and models, combining them with each other, with strategies and market conditions for stock selection. This paper presents an overview of stock selection models for quantitative investment, which was the basis for the proposed procedure and algorithm of quantitative investment, which allow modeling the investment process. The developed algorithm is based on the CART decision tree and Random Forest, which includes the bagging algorithm. The bagging algorithm divides the training set into several new training sets that build their own calculation models, and then their results are summed and integrated to obtain the final prediction. The randomness of Random Forest comes into play in the process of selecting samples from the training dataset and in selecting features to calculate the best split points. However, the proposed strategy is more stable than other stock selection strategies, is more suitable for building quantitative stock selection models, the proposed algorithm has an advantage over other algorithms, and is also more promising for further development.",
        "link": "http://dx.doi.org/10.12737/2219-0767-2022-15-4-53-60"
    },
    {
        "id": 327,
        "title": "K-Random Forests: a K-means style algorithm for Random Forest clustering",
        "authors": "Manuele Bicego",
        "published": "2019-7",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn.2019.8851820"
    },
    {
        "id": 328,
        "title": "Review for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2022-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v1/review2"
    },
    {
        "id": 329,
        "title": "A Comparative Study of Random Forest and Double Random Forest Models from View Points of Their Interpretability",
        "authors": "Adlina Khairunnisa, Khairil Anwar Notodiputro, Bagus Sartono",
        "published": "2024-2-29",
        "citations": 0,
        "abstract": "Purpose: This study aims to compare the performance of ensemble trees such as Random Forest (RF) and Double Random Forest (DRF) from view points of interpretability of the models. Both models have strong predictive performance but the inner working of the models is not human understandable. Model interpretability is required to explain the relationship between the predictors and the response. We apply association rules to simplify the essence of the models.Methods: This study compares interpretability of RF and DRF using association rules. Each decision tree formed from each model is converted into if-then rules by following the path from root node to leaf nodes. The data was selected in such a way that they were underfit data. This is due to the fact that DRF has been shown by other researchers to overcome the underfitting problem faced by RF. A Simulation study has been conducted to evaluate the extracted rules from RF and DRF. The rules extracted from both models are compared in terms of model interpretability based on support and confidence values. Association rules may also be applied to identify the characteristics of poor people who are working in Yogyakarta.Result: The simulation results revealed that the interpretability of DRF outperformed RF especially in the case of modelling underfit data.  On the other hand, using empirical data we have been able to characterize the profile of poor people who are working in Yogyakarta based on the most frequent rules.Novelty: Research on interpretable DRF is still rare, especially the interpretation model using association rules. Previous studies focused only on interpreting the random forest model using association rules. In this study, the rules extracted from the random forest and double random forest models are compared based on the quality of the rules extracted.",
        "link": "http://dx.doi.org/10.15294/sji.v11i1.48721"
    },
    {
        "id": 330,
        "title": "A Random Forest-based Classification Method for Prediction of Car Price",
        "authors": "Vengatesan K.",
        "published": "2020-3-30",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37200/ijpr/v24i3/pr2020298"
    },
    {
        "id": 331,
        "title": "Speech Features for Monitoring Alzheimer’s Disease Using Random Forest Classifier",
        "authors": "Lior Hason",
        "published": "No Date",
        "citations": 0,
        "abstract": "Detecting Alzheimer’s disease (AD) and disease progression based on the patient's speech data can aid non-invasive, cost-effective, real-time early diagnostic and repetitive monitoring in minimum time and effort using machine learning (ML) classification approaches. The paper aims to predict early AD diagnosis and evaluate stages of AD through exploratory analysis of acoustic features, non-stationarity, and non-linearity testing, and applying data augmentation techniques on AD and cognitively normal (CN) spontaneous speech. After evaluating the proposed AD and AD stages classification models, an accuracy of 82.2% and 71.5% was achieved using the Random Forest classifier, respectively. This will enrich the Alzheimer’s research community with further understanding of methods to improve models for AD classification and addressing nonstationarity and non-linearity principles on audio features to determine the best-suited acoustic features for AD identification.",
        "link": "http://dx.doi.org/10.32920/25412647"
    },
    {
        "id": 332,
        "title": "Review for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2023-4-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v2/review1"
    },
    {
        "id": 333,
        "title": "Loan Risk Prediction based on Random Forest Model",
        "authors": "Ella Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAs people's consumption habits change, loan plays a crucial role in our modern society. It provides individuals who do not have sufficient money with funds to purchase residential property or start a business. However, for avoiding unpleasant loan defaults, all financial institutions will first assess the borrower's risk index. By predicting the default risk of the borrower to decide whether to lend money. Machine learning algorithms, including random forest, linear regression and so on, have been benefited most of the real-world applications. With the development of machine learning methods, this paper, based on the personal history loan data of an institution studies the loan default risk, and uses the random forest classification model to predict the possibility of loan default. The result showed that the accuracy of this method was 85.62%, which show its application ability of real-world loan prediction and benefits the manager to decide the degree of risk for loan grant.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3094217/v1"
    },
    {
        "id": 334,
        "title": "Random Forest based Copy-Move Forgery Detection",
        "authors": "Jawad Khan",
        "published": "No Date",
        "citations": 0,
        "abstract": "Proving the authenticity of images is animportant part of image forensics. Copy-move forgery is amethod of forgery commonly followed in blind image forensics.We propose the use of a modified Auto Color Correlogram toobtain feature vectors from the forged image. The featuresextracted are sent as input to a RBF-SVM that gives a score forthe possibility of a copy-move situation. We then use anormalized cross correlation for feature matching with thesame feature vectors and then produce texture attributes assmoothness and Entropy. Based on the entropy andsmoothness we use a linear regression model to classify thisand obtain a predicted score. The two outputs obtained arepassed as input to a Random forest classifier which classifiesthe image as either forged or not forged.",
        "link": "http://dx.doi.org/10.31219/osf.io/vc42d"
    },
    {
        "id": 335,
        "title": "Review for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2023-4-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v2/review2"
    },
    {
        "id": 336,
        "title": "Sentiment Analysis on Twitter about Domestic Violence Using Random Forest and Extreme Gradient Boosting Methods",
        "authors": "Robi'atul Asyaroh, Arif Senja Fitrani",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.2459"
    },
    {
        "id": 337,
        "title": "Survey on Random Forest Algorithm used in Mood analysis",
        "authors": "",
        "published": "2018-4-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21884/ijmter.2018.5087.qrqzm"
    },
    {
        "id": 338,
        "title": "Speech Features for Monitoring Alzheimer’s Disease Using Random Forest Classifier",
        "authors": "Lior Hason",
        "published": "No Date",
        "citations": 0,
        "abstract": "Detecting Alzheimer’s disease (AD) and disease progression based on the patient's speech data can aid non-invasive, cost-effective, real-time early diagnostic and repetitive monitoring in minimum time and effort using machine learning (ML) classification approaches. The paper aims to predict early AD diagnosis and evaluate stages of AD through exploratory analysis of acoustic features, non-stationarity, and non-linearity testing, and applying data augmentation techniques on AD and cognitively normal (CN) spontaneous speech. After evaluating the proposed AD and AD stages classification models, an accuracy of 82.2% and 71.5% was achieved using the Random Forest classifier, respectively. This will enrich the Alzheimer’s research community with further understanding of methods to improve models for AD classification and addressing nonstationarity and non-linearity principles on audio features to determine the best-suited acoustic features for AD identification.",
        "link": "http://dx.doi.org/10.32920/25412647.v1"
    },
    {
        "id": 339,
        "title": "PCA Embedded Random Forest",
        "authors": "Charles Gardner, Dan Chia-Tien Lo",
        "published": "2021-3-10",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/southeastcon45413.2021.9401949"
    },
    {
        "id": 340,
        "title": "Application of Random Forest Algorithm with Bayesian Optimization to Reservoir Prediction: Application of Random Forest Algorithm with Bayesian Optimization to Reservoir Prediction",
        "authors": "Yubin Ma, Danping Cao, Jihao Feng",
        "published": "2023-11-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ntci60157.2023.10403755"
    },
    {
        "id": 341,
        "title": "Evaluation of Random Forest in Crime Prediction: Comparing Three-Layered Random Forest and Logistic Regression",
        "authors": "Gyeongseok Oh, Juyoung Song, Hyoungah Park, Chongmin Na",
        "published": "2022-9-2",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/01639625.2021.1953360"
    },
    {
        "id": 342,
        "title": "Gıda Güvencesi Düzeyi Sınıflandırılmasında Kullanılan Önemli Göstergelerin Random Forest Yöntemine Göre Belirlenmesi",
        "authors": "Özlem EŞTÜRK",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "Seasonal agricultural workers are the most disadvantaged group of work forces in terms of poverty even though they are significant contributors to the agricultural economy in Turkey. The objectives of this study were to determine the food security status of seasonal agricultural workers and to determine the most important variables in the classification of household food security status for the seasonal agriculture workers. Responses of seasonal apricot workers in Malatya to 18 questions of the Household Food Security Survey Module (HFSSM) were analyzed using the Random Forests (RF) algorithm (n = 65). Results indicated that 55.4% of households suffered from food insecurity, where 7.7% of them with moderate hunger and 13.8% of them with severe hunger. The area under curve value of the RF model was estimated at 0.846 as the classification accuracy. The question “running out of food before having money to buy more” was the most important variable in the classification of the food security groups. Seasonal agricultural workers are prone to food insecurity and poverty due to low income and job insecurity in Turkey and in the world. Therefore, it is important to implement social aid programs to solve food insecurity issue in risk groups like seasonal agricultural workers.",
        "link": "http://dx.doi.org/10.31200/makuubd.1038467"
    },
    {
        "id": 343,
        "title": "Classification of Vacational High School Graduates’ Ability in Industry using Extreme Gradient Boosting (XGBoost), Random Forest And Logistic Regression",
        "authors": "Afikah Agustiningsih, Yulian Findawati",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.734"
    },
    {
        "id": 344,
        "title": "Feasibility of Random Forest with Fully Homomorphic Encryption Applied to Network Data",
        "authors": "Shusaku Uemura, Kazuhide Fukushima",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012394600003648"
    },
    {
        "id": 345,
        "title": "OPTIMIZATION OF RANDOM FOREST ALGORITHM FOR BREAST CANCER DETECTION",
        "authors": "Sarika Chaudhary, Yojna Arora, Neelam Yadav",
        "published": "2020-5",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21276/ijircst.2020.8.3.4"
    },
    {
        "id": 346,
        "title": "Multiclass Classification of Paddy Leaf Diseases Using Random Forest Classifier",
        "authors": "K Saminathan, B Sowmiya, Devi M Chithra",
        "published": "2023-6",
        "citations": 2,
        "abstract": "With increase in population, improving the quality and quantity of food is essential. Paddy is a vital food crop serving numerous people in various continents of the world. The yield of paddy is affected by numerous factors. Early diagnosis of disease is needed to prevent the plants from successive stage of disease. Manual diagnosis by naked eye is the traditional method widely adopted by farmers to identify leaf diseases. However, when the task involves manual disease diagnosis, problems like the hiring of domain experts, time consumption, and inaccurate results will arise. Inconsistent results may lead to improper treatment of plants. To overcome this problem, automatic disease diagnosis is proposed by researchers. This will help the farmers to accurately diagnose the disease swiftly without the need for expert. This manuscript develops model to classify four types of paddy leaf diseases bacterial blight, blast, tungro and brown spot. To begin with, the image is preprocessed by resizing and conversion to RGB Red, Green and Blue (RGB) and Hue, Saturation and Value (HSV) color space. Segmentation is done. Global features namely: hu moments, Haralick and color histogram are extracted and concatenated. Data is split in to training part and testing part in 70:30 ratios. Images are trained using multiple classifiers like Logistic Regression, Random Forest Classifier, Decision Tree Classifier, K-Nearest Neighbor (KNN) Classifier, Linear Discriminant Analysis (LDA),Support Vector Machine (SVM) and Gaussian Naive Bayes. This study reports Random Forest classifier as the best classifier. The Accuracy of the proposed model gained 92.84% after validation and 97.62% after testing using paddy disordered samples. 10 fold cross validation is performed. Performance of classification algorithms is measured using confusion matrix with precision, recall, F1- score and support as parameters.",
        "link": "http://dx.doi.org/10.18178/joig.11.2.195-203"
    },
    {
        "id": 347,
        "title": "Include that Figure 2 (parameter ranking for random forest) in the final MS",
        "authors": "",
        "published": "2017-7-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/gmd-2016-301-rc2"
    },
    {
        "id": 348,
        "title": "Peer Review #1 of \"CRF: detection of CRISPR arrays using random forest (v0.1)\"",
        "authors": "",
        "published": "2017-4-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.3219v0.1/reviews/1"
    },
    {
        "id": 349,
        "title": "Peer Review #2 of \"CRF: detection of CRISPR arrays using random forest (v0.2)\"",
        "authors": "",
        "published": "2017-4-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.3219v0.2/reviews/2"
    },
    {
        "id": 350,
        "title": "Peer Review #2 of \"CRF: detection of CRISPR arrays using random forest (v0.1)\"",
        "authors": "",
        "published": "2017-4-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj.3219v0.1/reviews/2"
    },
    {
        "id": 351,
        "title": "Random Forest vs. Mahalanobis Ensemble and Multi-Objective LDA [Slides]",
        "authors": "Andre Green",
        "published": "2021-8-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2172/1818082"
    },
    {
        "id": 352,
        "title": "Random Forest Feature Selection for Partial Label Learning",
        "authors": "Xianran Sun, Jing Chai",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4390627"
    },
    {
        "id": 353,
        "title": "Review of RainForest: A random forest algorithm for quantitative precipitation estimation over Swizerland",
        "authors": "",
        "published": "2020-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5194/amt-2020-284-rc1"
    },
    {
        "id": 354,
        "title": "Predicting Forest Fire with Linear Regression and Random Forest",
        "authors": "Ruide Guan",
        "published": "2023-4-13",
        "citations": 1,
        "abstract": "Forest fire is a global problem and it bothers a lot of countries. It not only threatens human life, but also causes serious damage to the environment and great economic losses. Therefore, forest fire is particularly important for forest fire prevention. and economic loss. However there many methods can be used to predict the forest fires then the forest fires could be stopped even before it happened. So, in the research will be talking about two methods in analyzing forest fire data set in order to predict the forest fires, they are linear regression and random forest. And before analyzing the data, the data will be pre-processed by PCA in order to get a more accurate result. Finally compare the result from linear regression and random forest to compare which method has a higher accuracy and better performance. And from the result and the comparison linear regression showed to be perform better in predicting forest fire.",
        "link": "http://dx.doi.org/10.54097/hset.v44i.7159"
    },
    {
        "id": 355,
        "title": "Using logistic regression and random forest techniques to predict the degradation of forest roads",
        "authors": "saeid shabani, akram ahmadi, mohsen mostafa, hassan faramarzi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe destruction of forest roads has significant adverse impacts on forest accessibility, resulting in heightened maintenance and environmental expenses, as well as posing potential threats to human life. Enhancing the sustainable and secure accessibility to forest regions necessitates a more comprehensive knowledge of the deterioration of forest pathways across temporal and spatial dimensions. The objective of this study is to utilize destruction prediction models to identify pertinent variables related to the state of the Hyrcanian forest road network in Golestan province. Additionally, the study aims to determine the most significant explanatory variables. To achieve the research objective, a set of 50 points were established along forest roads at a uniform distance of 200 meters from each other. The response variable, which pertains to the visibility of the forest road infrastructure, was recorded in binary format. Additionally, the explanatory variables were documented along a strip transect with a width of 10 meters perpendicular to the road. The study employed two conventional logistic regression models and a novel random forest model to forecast the deterioration of forest roads. Three indicators consist of TWI, natural ground gradient and cover density of cut slope, can predict road damage, as demonstrated by the implementation of two models. The random forest model exhibited superior accuracy to logistic regression, as evidenced by its success rate of 0.73 and prediction rate of 0.68. The results indicate that machine learning models offer significant insights into predicting road conditions and ensuring access to the Hyrcanian forests.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3247554/v1"
    },
    {
        "id": 356,
        "title": "Application of Support Vector Machine, Random Forest, and Genetic Algorithm Optimized Random Forest Models in Groundwater Potential Mapping",
        "authors": "Seyed Amir Naghibi, Kourosh Ahmadi, Alireza Daneshi",
        "published": "2017-7",
        "citations": 312,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11269-017-1660-3"
    },
    {
        "id": 357,
        "title": "Forest fire mapping: a comparison between GIS-based Random Forest and Bayesian models",
        "authors": "Farzaneh Noroozi, Gholamabbas Ghanbarian, Roja Safaeian, Hamid Reza Pourghasemi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn recent decades, fires in natural ecosystems, particularly forests and rangelands, have emerged as a significant threat. To address this challenge, our study aims to identify and prioritize forest fire-prone areas while highlighting key environmental and anthropogenic factors contributing to forest fires in Iran's Firouzabad region, Fars province. We compiled a forest fire incident map using data from the Data Center of the Natural Resources Department in Fars province, cross-referenced with field surveys. We examined 80 forest fire sites, randomly divided into a \"training dataset\" (70%) and a \"validation dataset\" (30%). We created “Forest Fire Susceptibility” (FFS) maps using GIS-based Bayesian and Random Forest (RF) methodologies, incorporating twelve unique environmental and human-induced variables. The performance of these methodologies was evaluated using the \"Area Under the Curve-AUC.\" RF outperformed the Bayesian model with AUC scores of 0.876 and 0.807, respectively. The RF model identified 37.86% of the area as having a high fire risk, compared to the Bayesian model's estimate of 48.46%. Key factors influencing fire occurrences included elevation, mean annual precipitation, distance to roads, and mean annual temperature. Conversely, variables such as slope direction, topographic wetness index, and slope percent had a lesser impact. Given the presence of at-risk flora and fauna species in the area, our findings provide essential tools for pinpointing high fire susceptibility zones, aiding regional authorities in implementing preventive measures to mitigate fire hazards in forest ecosystems. In conclusion, our methodologies allow for the rapid creation of contemporary fire susceptibility maps based on fresh data.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3476357/v1"
    },
    {
        "id": 358,
        "title": "Weather prediction using Random Forest Classifier",
        "authors": "",
        "published": "2021-6-13",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.37896/sr8.6/013"
    },
    {
        "id": 359,
        "title": "Deception Detection using Random Forest-based Ensemble Learning",
        "authors": "Kun Bu, Kandethody Ramachandran",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThe purpose of this work is to detect people lying using different ensemble machine learning algorithms to conclude a better classification model through comparison. Random Forest (RF) did an efficient work while dealing with both classification and regression problems; In this paper, we proposed a Random Forest-based ensemble learning, which is the combination of RF with SVM, GLM, KNNs, and GBM to improve the model performance. The data set that we used to fit into the machine learning models is Miami University Deception Detection Database (MU3D). MU3D is a free resource containing 320 videos of Black and White targets, female and male, telling truths and lies. We fit the MU3D video level data set into Random Forest-based ensemble learning models, which includes RF + SVM.Linear, RF + SVM.Poly, RF + GLM, RF + KNNs, RF + GBM (Stochastic Gradient Boosting) and RF + WSRF (Weighted Subspace Random Forest). As a comprehensive comparison of the model performance, we conclude our new combination of algorithms performs better than the traditional machine learning models. Our contribution in this work provides a robust classification method which improves the predicted performance while avoiding model overfitting.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2460665/v1"
    },
    {
        "id": 360,
        "title": "Random Forest",
        "authors": "V Kishore Ayyadevara",
        "published": "2018",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-1-4842-3564-5_5"
    },
    {
        "id": 361,
        "title": "Random-Splitting Random Forest with Multiple Mixed-Data Covariates",
        "authors": "Mohammad Fayaz, Alireza Abadi, Soheila Khodakarim",
        "published": "2023-10-31",
        "citations": 0,
        "abstract": "Introduction:The bagging (BG) and random forest (RF) are famous supervised statistical learning methods based on the classification and regression trees. The BG and RF can deal with different types of responses such as categorical, continuous, etc. There are curves, time series, functional data, or observations that are related to each other based on their domain in many statistical applications. The RF methods are extended to some cases for functional data as covariates or responses in many pieces of literature. Among them, random-splitting is used to summarize the functional data to the multiple related summary statistics such as average, etc.\r\nMethods: This research article extends this method and introduces the mixed data BG (MD-BG) and RF (MD-RF) algorithm for multiple functional and non-functional, or mixed and hybrid data, covariates and it calculates the variable importance plot (VIP) for each covariate.\r\nResults: The main differences between MD-BG and MD-RF are in choosing the covariates that in the first, all covariates remain in the model but the second uses a random sample of covariates. The MD-RF helps to unmask the most important parts of functional covariates and the most important non-functional covariates.\r\nConclusion: We apply our methods on the two datasets of DTI and Tecator and compare their performances for continuous and categorical responses with developed R package (“RSRF”) in the GitHub.",
        "link": "http://dx.doi.org/10.18502/jbe.v9i1.13974"
    },
    {
        "id": 362,
        "title": "Dimensional Reduction in Microarray Data Classification Using Minimum Redundancy Maximum Relevance and Random Forest",
        "authors": "Lailan Harahap",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Di Indonesia prevalensi kanker pada data Riskesdes tahun 2018 terdapat 1,79 per 1.000 penduduk mengidap penyakit kanker. Akibat tingginya prevalensi kanker maka diperlukan pendeteksian kanker sejak dini. Salah satu cara mendeteksi kanker yaitu dengan teknologi microarray dimana teknologi ini dapat memantau ribuan ekpresi gen secara bersamaan dalam satu percobaan. Namun, data microarray memiliki dimensi yang besar sehingga diperlukan proses reduksi dimensi data microarray pada penyakit prostate cancer da gastric cancer agar dapat menghilangkan atribut yang redundansi dan meningkatkan akurasi pada klasifikasi. Reduksi dilakukan menggunakan MRMR (FCQ dan FCD) dengan k 10,20,30,40,50,60,70,80,90 dan 100. Klasifikasi dilakukan menggunakan RF dengan membentuk 100 tree. Hasil akurasi terbaik pada klasifikasi data prostate cancer yaitu dengan FCQ 100% pada k=10, tanpa reduksi 95% dan akurasi terendah dengan FCD 52% pada k=90. Sedangkan hasil akurasi terbaik klasifikasi data gastric cancer yaitu dengan FCQ dan FCD 100% pada semua k dan akurasi terendah yaitu tanpa reduksi 83%.",
        "link": "http://dx.doi.org/10.33022/ijcs.v12i1.3133"
    },
    {
        "id": 363,
        "title": "Using Random Forest feature importance results to predict zoonosis",
        "authors": "Roger Geertz Gonzalez",
        "published": "No Date",
        "citations": 0,
        "abstract": "ABSTRACTThis study fills a gap in the literature regarding using machine learning techniques within the field of zoonoses. Instead of using linear and logistic inference modeling like in previous (Knowledge, Attitudes, and Practices (KAP) studies, this study incorporates Random Forest (RF) to identify important features that predict zoonotic diseases using survey and blood serology data. Using RF, we found that the most important features related to zoonoses were villages where households were 46 or larger and where participants owned many animals such as ducks, cats, and pigs. Compared to previous KAP studies in other countries where ethnicity, age, and education background were important features regarding knowledge, awareness, and practices relating to zoonoses, the KAP Cambodia case was different because these features were not found to be important.",
        "link": "http://dx.doi.org/10.1101/2023.05.04.23289530"
    },
    {
        "id": 364,
        "title": "An Effective Intrusion Detection Model based on Random Forest Algorithm with I-SMOTE",
        "authors": ". Weijinxia, . Longchun, . Wanwei, . Zhaojing, . Duguanyao, . Yangfan",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010393801750182"
    },
    {
        "id": 365,
        "title": "Random Forest ve K-Nearest Neighbor Yöntemleri ile Günlük Akım Modellemesi",
        "authors": "Hüseyin Yildirim DALKILIÇ, Sefa Nur YEŞİLYURT, Pijush SAMUİ",
        "published": "2021-12-18",
        "citations": 0,
        "abstract": "Water is an indispensable natural resource for living life. Therefore, protection and control of water resources are of great importance. Since river flow estimation and modeling are very important in cases such as the management of water resources, irrigation, it is included in the literature as an issue that needs constant research and development. A large number of techniques are being used for estimation and modeling; thus, the estimation results are gradually improving with the development of the studies carried out, the comparison of techniques, and the determination and removal of the shortcomings. In this study, Random Forest and K-Nearest Neighbors  nonlinear regression models, which are two of the machine learning methods, were used to evaluating the estimation results, to find the better estimation method, and to determine the advantages and disadvantages of these methods. In addition, Random Search and Grid Search methods were used to make the hyperparameter selection and comparison for the Random Forest model. In this study, in which daily flow data of 1981-2011 of the two stations in the Euphrates were used, and, when compared to other models, it was observed that better results were obtained when Random Search was applied to determine the hyperparameters of the Random Forest model.",
        "link": "http://dx.doi.org/10.18185/erzifbed.949126"
    },
    {
        "id": 366,
        "title": "Enhancing Portfolio Performance: A Random Forest Approach to Volatility Prediction and Optimization",
        "authors": "Vedant Rathi, Meghana Kshirsagar, Conor Ryan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012464600003636"
    },
    {
        "id": 367,
        "title": "Research on Optimization of Random Forest Algorithm Based on Feature Engineering",
        "authors": "Lei Yang, Yong Fan, Yungui Chen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0012273400003807"
    },
    {
        "id": 368,
        "title": "Research on Forecasting of China's Monetary Policy Based on Random Forest Algorithm.pdf",
        "authors": "chuanxin qiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper uses the random forest algorithm model to quantify and predict the monetary policy of the People's Bank of China under the input of 16 indicators macroeconomic indicators. It is compared with three other machine learning algorithms (CART decision tree, support vector machine and neural network algorithm), discrete selection model and combined prediction model. The results show that the random forest algorithm shows better prediction accuracy in predicting the direction of the central bank's monetary policy.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12083805"
    },
    {
        "id": 369,
        "title": "Loan Risk Prediction based on Random Forest Model",
        "authors": "Ella Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "As people's consumption habits change, loan plays a crucial role in our modern society. It provides individuals who do not have sufficient money with funds to purchase residential property or start a business. However, for avoiding unpleasant loan defaults, all financial institutions will first assess the borrower's risk index. By predicting the default risk of the borrower to decide whether to lend money. Machine learning algorithms, including random forest, linear regression and so on, have been benefited most of the real-world applications. With the development of machine learning methods, this paper, based on the personal history loan data of an institution studies the loan default risk, and uses the random forest classification model to predict the possibility of loan default. The result showed that the accuracy of this method was 85.62%, which show its application ability of real-world loan prediction and benefits the manager to decide the degree of risk for loan grant.",
        "link": "http://dx.doi.org/10.20944/preprints202306.1630.v1"
    },
    {
        "id": 370,
        "title": "A review of uncertainty evaluation methods for random forest regression",
        "authors": "A Thompson",
        "published": "2023-2-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.47120/npl.ms41"
    },
    {
        "id": 371,
        "title": "Research on Forecasting of China's Monetary Policy Based on Random Forest Algorithm.pdf",
        "authors": "chuanxin qiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper uses the random forest algorithm model to quantify and predict the monetary policy of the People's Bank of China under the input of 16 indicators macroeconomic indicators. It is compared with three other machine learning algorithms (CART decision tree, support vector machine and neural network algorithm), discrete selection model and combined prediction model. The results show that the random forest algorithm shows better prediction accuracy in predicting the direction of the central bank's monetary policy.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12083805.v2"
    },
    {
        "id": 372,
        "title": "Extended Random Histogram Forest for Unsupervised Anomaly Detection",
        "authors": "Pouyan Ansarirad, Sattar Hashemi",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAnomaly detection is a fundamental task in the field of unsupervised machine learning, aimed at identifying instances that significantly deviate from other input data. This problem has various applications, including identifying defective products in industries, detecting network intrusions, medical diagnostics, and many other cases. Despite extensive research conducted in this field, a solution with satisfactory performance under all conditions and types of data has not yet been achieved. One effective unsupervised method is the Random Histogram Forest (RHF) approach, which utilizes a probabilistic approach. Based on the evaluation metric of average precision of the area under the precision-recall curve (AP), this approach has shown better performance compared to other methods in terms of AP. However, due to its inherent mechanism, this approach also has limitations. In this article, these limitations are examined, and solutions and methods are proposed to address these constraints, and an extension approach called Extended Random Histogram Forest (ERHF) is introduced for unsupervised anomaly detection. ERHF utilizes data projection and dimensionality reduction methods to enhance the compatibility between the data and the internal mechanism of RHF. Instead of randomly selecting splitting points in the process of constructing random trees, the Skewness score is used to choose more targeted splitting points. Additionally, multidimensional hyperplanes with random slopes are used for data partitioning instead of pointwise splits. Furthermore, the mechanism for calculating the anomaly score of instances is modified to enable the use of subsampling. The performance evaluation of the proposed ERHF method using various metrics (AP, AUC, Recall, F1) on ODDS datasets demonstrates that ERHF significantly outperforms the RHF method.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3321436/v1"
    },
    {
        "id": 373,
        "title": "Explainable AI and Random Forest Based Reliable Intrusion Detection system",
        "authors": "Syed Wali, Irfan Khan",
        "published": "No Date",
        "citations": 5,
        "abstract": "<p>Emerging\nCyber threats with an increased dependency on vulnerable cyber-networks have\njeopardized all stakeholders, making Intrusion Detection Systems (IDS) the\nessential network security requirement. \nSeveral IDS have been proposed in the past decade for preventing systems\nfrom cyber-attacks. Machine learning (ML) based IDS have shown remarkable\nperformance on conventional cyber threats. However, the introduction of\nadversarial attacks in the cyber domain highlights the need to upgrade these IDS\nbecause conventional ML-based approaches are vulnerable to adversarial attacks.\nTherefore, the proposed IDS framework leverages the performance of conventional\nML-based IDS and integrates it with Explainable AI (XAI) to deal with\nadversarial attacks. Global Explanation of AI model, extracted by SHAP (Shapley\nadditive explanation) during the training phase of Primary Random Forest\nClassifier (RFC), is used to reassess the credibility of predicted outcomes. In\nother words, an outcome with low credibility is reassessed by secondary\nclassifiers. This SHAP-based approach helps in filtering out all disguised\nmalicious network traffic and can also enhance user trust by adding\ntransparency to the decision-making process. Adversarial robustness of the\nproposed IDS was assessed by Hop Skip Jump Attack and CICIDS dataset, where IDS\nshowed 98.5% and 100% accuracy, respectively. Furthermore, the performance of\nthe proposed IDS is compared with conventional algorithms using recall,\nprecision, accuracy, and F1-score as evaluation metrics. This comparative\nanalysis and series of experiments endorse the credibility of the proposed\nscheme, depicting that the integration of XAI with conventional IDS can ensure\ncredibility, integrity, and availability of cyber-networks.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.17169080.v1"
    },
    {
        "id": 374,
        "title": "Review for \"Liu regression after random forest for prediction and modeling in high‐dimension\"",
        "authors": "",
        "published": "2021-10-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cem.3393/v1/review1"
    },
    {
        "id": 375,
        "title": "Research on Forecasting of China's Monetary Policy Based on Random Forest Algorithm.pdf",
        "authors": "chuanxin qiu",
        "published": "No Date",
        "citations": 0,
        "abstract": "This paper uses the random forest algorithm model to quantify and predict the monetary policy of the People's Bank of China under the input of 16 indicators macroeconomic indicators. It is compared with three other machine learning algorithms (CART decision tree, support vector machine and neural network algorithm), discrete selection model and combined prediction model. The results show that the random forest algorithm shows better prediction accuracy in predicting the direction of the central bank's monetary policy.",
        "link": "http://dx.doi.org/10.36227/techrxiv.12083805.v1"
    },
    {
        "id": 376,
        "title": "Explainable AI and Random Forest Based Reliable Intrusion Detection system",
        "authors": "Syed Wali, Irfan Khan",
        "published": "No Date",
        "citations": 2,
        "abstract": "<p>Emerging\nCyber threats with an increased dependency on vulnerable cyber-networks have\njeopardized all stakeholders, making Intrusion Detection Systems (IDS) the\nessential network security requirement. \nSeveral IDS have been proposed in the past decade for preventing systems\nfrom cyber-attacks. Machine learning (ML) based IDS have shown remarkable\nperformance on conventional cyber threats. However, the introduction of\nadversarial attacks in the cyber domain highlights the need to upgrade these IDS\nbecause conventional ML-based approaches are vulnerable to adversarial attacks.\nTherefore, the proposed IDS framework leverages the performance of conventional\nML-based IDS and integrates it with Explainable AI (XAI) to deal with\nadversarial attacks. Global Explanation of AI model, extracted by SHAP (Shapley\nadditive explanation) during the training phase of Primary Random Forest\nClassifier (RFC), is used to reassess the credibility of predicted outcomes. In\nother words, an outcome with low credibility is reassessed by secondary\nclassifiers. This SHAP-based approach helps in filtering out all disguised\nmalicious network traffic and can also enhance user trust by adding\ntransparency to the decision-making process. Adversarial robustness of the\nproposed IDS was assessed by Hop Skip Jump Attack and CICIDS dataset, where IDS\nshowed 98.5% and 100% accuracy, respectively. Furthermore, the performance of\nthe proposed IDS is compared with conventional algorithms using recall,\nprecision, accuracy, and F1-score as evaluation metrics. This comparative\nanalysis and series of experiments endorse the credibility of the proposed\nscheme, depicting that the integration of XAI with conventional IDS can ensure\ncredibility, integrity, and availability of cyber-networks.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.17169080"
    },
    {
        "id": 377,
        "title": "Dissimilarity Random Forest Clustering",
        "authors": "Manuele Bicego",
        "published": "2020-11",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdm50108.2020.00105"
    },
    {
        "id": 378,
        "title": "Review for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": " Timothée Poisot",
        "published": "2022-10-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v1/review1"
    },
    {
        "id": 379,
        "title": "Review for \"Liu regression after random forest for prediction and modeling in high‐dimension\"",
        "authors": "",
        "published": "2021-12-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cem.3393/v2/review1"
    },
    {
        "id": 380,
        "title": "Review for \"Predicting the functional outcomes of anti-LGI1 encephalitis using a random forest model\"",
        "authors": "",
        "published": "2022-2-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ane.13619/v1/review1"
    },
    {
        "id": 381,
        "title": "Social Network Analysis of BSI Data Leakage Using Naive Bayes, Support Vector Machine (SVM), and Random Forest Classification Algorithms",
        "authors": "Mokhamad Diki Armanda, Rohman Dijaya",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21070/ups.4132"
    },
    {
        "id": 382,
        "title": "Ovarian Cancer Prediction Using PCA, K-PCA, ICA and Random Forest",
        "authors": "Asiye Sahin, Nermin Ozcan, Gokhan Nur",
        "published": "2021-12-27",
        "citations": 1,
        "abstract": "Ovarian cancer, which is the most common in women and occurs mostly in the post-menopausal period, develops with the uncontrolled proliferation of the cells in the ovaries and the formation of tumors. Early diagnosis is very difficult and in most cases, it is a type of cancer that is in advanced stages when first diagnosed. While it tends to be treated successfully in the early stages where it is confined to the ovary, it is more difficult to treat in the advanced stages and is often fatal. For this reason, it has been focused on studies that predict whether people have ovarian cancer. In our study, we designed a RF-based ovarian cancer prediction model using a data set consisting of 49 features including blood routine tests, general chemistry tests and tumor marker data of 349 real patients. Since the data set containing too many dimensions will increase the time and resources that need to be spent, we reduced the dimension of the data with PCA, K-PCA and ICA methods and examined its effect on the result and time saving. The best result was obtained with a score of 0.895 F1 by using the new smaller-sized data obtained by the PCA method, in which the dimension was reduced from 49 to 6, in the RF method, and the training of the model took 18.191 seconds. This result was both better as a success and more economical in terms of time spent during model training compared to the prediction made over larger data with 49 features, where no dimension reduction method was used. The study has shown that in predictions made with machine learning models over large-scale medical data, dimension reduction methods will provide advantages in terms of time and resources by improving the prediction results.",
        "link": "http://dx.doi.org/10.54856/jiswa.202112168"
    },
    {
        "id": 383,
        "title": "Calibration of sea ice drift forecasts using random forest algorithms",
        "authors": "Cyril Palerme, Malte Müller",
        "published": "No Date",
        "citations": 0,
        "abstract": "&lt;p&gt;There is a growing demand for accurate sea-ice forecasts in the Arctic due to increasing maritime traffic. Although the capabilities of numerical models steadily improve, sea-ice forecasts produced by numerical prediction systems are affected by biases. In order to reduce forecast errors, statistical methods can be used for calibration.&lt;/p&gt;&lt;p&gt;In this study, two calibration methods have been developed for calibrating sea-ice drift forecasts from an operational prediction system (TOPAZ4) in the Arctic. These methods are based on random forest algorithms, a machine learning technique suitable for assessing non-linear relationships between a set of predictors and a target variable. While all the algorithms developed in this study use the same set of predictors, two set of algorithms have been developed using either buoy or synthetic-aperture radar (SAR) observations for the target variable. Furthermore, different algorithms have been developed for predicting the direction and the speed of sea-ice drift, as well as for different lead times. The random forest algorithms use predictor variables from sea-ice concentration observations during the initialization of the forecasts, sea-ice forecasts from the TOPAZ4 prediction system, wind forecasts from the European Centre for Medium-Range Weather Forecasts, and some geographical information.&lt;/p&gt;&lt;p&gt;The performances of the calibrated forecasts have been evaluated and compared to those from the TOPAZ4 forecasts using buoy observations from the International Arctic Buoy Programme. Depending on the calibration method, the mean absolute error is reduced, on average, between 5.9 % and 8.1 % for the direction, and between 7.1 % and 9.6 % for the speed of sea-ice drift. However, there is a large spatial variability in the performances of these algorithms, and the random forest algorithms have particularly poor performances in the Canadian Archipelago, an area characterized by narrow channels and the presence of landfast ice.&lt;/p&gt;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu21-14317"
    },
    {
        "id": 384,
        "title": "Diagnosing lameness with the Random Forest classification algorithm using thermal cameras and digital colour parameters",
        "authors": "Yasin ALTAY, Rabia ALBAYRAK DELİALİOĞLU",
        "published": "2022-4-1",
        "citations": 3,
        "abstract": "Lameness is a serious disease that affects the health and welfare of dairy cattle whilst also causing yield and economic losses. The primary goal of this study is to determine if lameness can be detected early on in herd management using the Random Forest (RF) algorithm and the surface temperatures of the cows' hoof soles, as well as the digital colour parameters generated by processing these thermal camera images. Ages, hoof sole temperatures, and digital colour characteristics of 40 Simmental cattle were used as independent variables in this study, while lameness was evaluated by scoring and employed as a dependent variable after being updated as a binary variable. The parameters ntree= 100 and mtry= 3 were used to develop the RF algorithm for predicting lameness in animals. As a result, the RF algorithm correctly classified 19 of 22 healthy animals and incorrectly classified 3, while it correctly classified 15 of 18 unhealthy animals and incorrectly classified 3. The classification success of the RF algorithm was 85%, sensitivity, specificity and area under the ROC curve (AUC) were 0.864, 0.833, and 0.848±0.059, respectively, and it was successful in detecting lameness. Also, AUC, which is one of the RF algorithm's classification performances, was found to be statistically significant (P&lt;0.05). As a direct consequence it can be stated that the RF algorithm is a suitable classifier in terms of the use of animal hoof sole temperatures and digital colour parameters obtained through image processing in the detection of lameness in herd management.",
        "link": "http://dx.doi.org/10.29136/mediterranean.1065527"
    },
    {
        "id": 385,
        "title": "Decision letter for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2022-11-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v1/decision1"
    },
    {
        "id": 386,
        "title": "Decision letter for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2023-5-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v3/decision1"
    },
    {
        "id": 387,
        "title": "Review for \"Predicting the functional outcomes of anti-LGI1 encephalitis using a random forest model\"",
        "authors": "",
        "published": "2022-3-24",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ane.13619/v2/review1"
    },
    {
        "id": 388,
        "title": "Modeling network of research sites for monitoring carbon flows by Random Forest method",
        "authors": "Valentina Dobryakova, Natalya Moskvina, Andrey Dobryakov, Lilia Zhegalina",
        "published": "2022",
        "citations": 0,
        "abstract": "Environmental observing networks provide information for understanding and predicting the spatial and temporal dynamics of Earth biophysical processes. The optimization of resources for large-scale environmental monitoring activities is required. The paper describes and then tests spatial structure of Tyumen region research sites network. The network is based on principles of landscape approach, taking into account cost minimization. At the baseline of research, two testing sets of 40 and 105 points were determined. Proposed locations were evaluated using Random Forest (RF) method. The study accomplished in two stages for each test set. At the first stage, the model was trained; its capacity and indicators of additional diagnostics were studied. At the second stage, the trained model was used to predict the points formed of regular grid covering entire territory of this region (544 points). In conclusion, the obtained results were compared with similar point sets of the same volume but generated randomly. Primary Productivity Gross (GPP) was chosen as predictable variable because it is one of the major complex environmental indicators associated with carbon production in this area. The ability of an area to absorb or produce carbon is one of the main parameters that determine climate processes. As independent variables characterizing geosystemic processes, a set of indicators associated with climate, terrain parameters, and variability of soil resources has been selected. The problem was solved using Forest-Based Classification and Regression tool from Spatial Statistics—Modeling Spatial Relationships toolkit of ArcGIS Pro software package. As the result of the study, a high forecast accuracy and reliability for both approaches to research sites locations was obtained. The study was based on open source data.",
        "link": "http://dx.doi.org/10.35595/2414-9179-2022-1-28-645-658"
    },
    {
        "id": 389,
        "title": "Model Random Forest Regression Untuk Peramalan Penyebaran Covid-19 Di Indonesia",
        "authors": " Diana Tri Susetianingtias,  Eka Patriya,  Rodiah",
        "published": "2022-9-29",
        "citations": 1,
        "abstract": "Penyebaran COVID-19 sangat cepat yang membuat pada tanggal 27 Februrari 2020, sudah menginfeksi 78630 orang di China dan 2747 orang lainnya meninggal dunia. Keberadaan COVID-19 di Indonesia sendiri pertama kali terkonfirmasi pada tanggal 2 Maret 2020. Pada penelitian ini, peneliti akan melakukan peramalan penyebaran COVID-19 di Indonesia menggunakan metode Random Forest Regression. Raw Dataset yang digunakan adalah dataset yang di dapat dari situs www.kaggle.com yang berisikan record sebanyak 10695 record yang dirangkum dari tanggal 1 Maret 2020 hingga 21 Januari 2021. Jumlah fitur yang dimiliki raw dataset sebanyak 37 fitur. Proses preprocessing pada penelitian ini terdiri dari konversi fitur, seleksi fitur dan mendapatkan fitur untuk model. Metode seleksi fitur yang digunakan adalah Recursive Feature Elimination yang berhasil menyeleksi fitur dari dataset yang tadinya berjumlah 37 menjadi 20 fitur. Pelatihan model menggunakan training set yang berjumlah 8555 record. Peramalan menggunakan model Random Forest Regression akan menggunakan validation set yang berjumlah 2139 record. Hasil perhitungan error pada model Random Forest Regression tidak besar, yaitu sebesar 6.477 untuk peramalan New Cases, dan 0.2469 untuk peramalan New Deaths  yang artinya hasil nilai yang diramalkan dengan nilai aktual tidak berbeda jauh.",
        "link": "http://dx.doi.org/10.51454/decode.v2i2.48"
    },
    {
        "id": 390,
        "title": "The Impact of Simulated Spectral Noise on Random Forest and Oblique Random Forest Classification Performance",
        "authors": "Na’eem Hoosen Agjee, Onisimo Mutanga, Kabir Peerbhay, Riyad Ismail",
        "published": "2018",
        "citations": 7,
        "abstract": "Hyperspectral datasets contain spectral noise, the presence of which adversely affects the classifier performance to generalize accurately. Despite machine learning algorithms being regarded as robust classifiers that generalize well under unfavourable noisy conditions, the extent of this is poorly understood. This study aimed to evaluate the influence of simulated spectral noise (10%, 20%, and 30%) on random forest (RF) and oblique random forest (oRF) classification performance using two node-splitting models (ridge regression (RR) and support vector machines (SVM)) to discriminate healthy and low infested water hyacinth plants. Results from this study showed that RF was slightly influenced by simulated noise with classification accuracies decreasing for week one and week two with the addition of 30% noise. In comparison to RF, oRF-RR and oRF-SVM yielded higher test accuracies (oRF-RR: 5.36%–7.15%; oRF-SVM: 3.58%–5.36%) and test kappa coefficients (oRF-RR: 10.72%–14.29%; oRF-SVM: 7.15%–10.72%). Notably, oRF-RR test accuracies and kappa coefficients remained consistent irrespective of simulated noise level for week one and week two while similar results were achieved for week three using oRF-SVM. Overall, this study has demonstrated that oRF-RR can be regarded a robust classification algorithm that is not influenced by noisy spectral conditions.",
        "link": "http://dx.doi.org/10.1155/2018/8316918"
    },
    {
        "id": 391,
        "title": "Review for \"Predicting the functional outcomes of anti-LGI1 encephalitis using a random forest model\"",
        "authors": "",
        "published": "2022-3-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ane.13619/v1/review2"
    },
    {
        "id": 392,
        "title": "Decision letter for \"Predicting predator–prey interactions in terrestrial endotherms using random forest\"",
        "authors": "",
        "published": "2023-5-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1111/ecog.06619/v2/decision1"
    },
    {
        "id": 393,
        "title": "Random Subspaces and Random Forest",
        "authors": "Igor I. Baskin, Gilles Marcou, Dragos Horvath, Alexandre Varnek",
        "published": "2017-7-28",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/9781119161110.ch18"
    },
    {
        "id": 394,
        "title": "Perbandingan Hasil Klasifikasi Data Iris menggunakan Algoritma K-Nearest Neighbor dan Random Forest",
        "authors": "Budiono Rahman, Fatkhurokhman Fauzi, Saeful Amri",
        "published": "2023-5-25",
        "citations": 0,
        "abstract": "Data mining merupakan suatau metode yang baik untuk menangani data skala besar. Performasi menjadi penting dalam metode data mining. Dua metode yang memiliki performasi terbaik diantaranya K-Nearest Neighbor (KNN) dan Random Forest (RF). Artikel ini membahas terkait perbandingan performasi K-NN dan RF. Data yang digunakan pada penelitian ini adalah Iris. Data dibagi menjadi 80% data training dan 20% data testing. Validasi performasi menggunakan nilai akurasi dan F1-Score. Berdasarkan nilai. Berdasarkan hasil yang didapat metode RF lebih baik dibandingkan dengan metode K-NN. Nilai akurasi yang didapat oleh metode RF adalah 1.00 atau 100% dan nilai F1-Score sebesar 1.00.",
        "link": "http://dx.doi.org/10.26714/jodi.v1i1.135"
    },
    {
        "id": 395,
        "title": "Implementation of Seismic Facies Analysis Using The Random Forest Classification",
        "authors": "A. Butorin, G. Mokhov",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3997/2214-4609.202159080"
    },
    {
        "id": 396,
        "title": "Machine Learning for Skin Permeability Prediction: Random Forest and XGBoost Regression",
        "authors": "Kevin Ita, Joyce Prinze",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4415496"
    },
    {
        "id": 397,
        "title": "Review for \"Heavy Metal Content Prediction Based on Random Forest and Sparrow Search Algorithm\"",
        "authors": "Suresh Thennadil",
        "published": "2022-4-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1002/cem.3445/v1/review2"
    },
    {
        "id": 398,
        "title": "Classification of pseudo-random sequences based on the random forest algorithm",
        "authors": "Alexander V. Kozachok, Andrey A. Spirin, Alexander I. Kozachok, Alexey N. Tsibulia",
        "published": "2020-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ivmem51402.2020.00016"
    },
    {
        "id": 399,
        "title": "Comparison of KNN and Random Forest Algorithms in Classifying EMG Signals",
        "authors": "Çağatay ERSİN, Mustafa YAZ",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "Depending on the growing average age and busy work life, muscle disorders are also increasing. Disturbing use life hurts the upper limb due to casing. Electromyography (EMG) muscle sensors are used to detect muscle diseases. To obtain more accurate results, the perception of the data received with the EMG sensors is required. This evaluation was compared with electromyography (EMG) muscle sensors used as a muscle measurement tool and those taken from the upper limb and KNN explanations and Random Forest examinations, which are the predictions of machine learning in this context and give more accurate results than other effects. Three EMG muscle sensors are attached to the upper limb of the user and taken from 0o, 45o and 90o angles with the microcontroller development board. It has been read and tested with the resulting machine-learning readings. The percentages of the accuracy of the highest accuracy KNN and Random Forest locations were chosen for their assumptions and use in use.",
        "link": "http://dx.doi.org/10.31590/ejosat.1285176"
    },
    {
        "id": 400,
        "title": "An Action Unit based Hierarchical Random Forest Model to Facial Expression Recognition",
        "authors": "Jingying Chen, Mulan Zhang, Xianglong Xue, Ruyi Xu, Kun Zhang",
        "published": "2017",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0006274707530760"
    }
]