[
    {
        "id": 21305,
        "title": "Automatic Question Answer Generation using T5 and NLP",
        "authors": "Altaj Virani, Rakesh Yadav, Prachi Sonawane, Smita Jawale",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icscss57650.2023.10169726"
    },
    {
        "id": 21306,
        "title": "nanoT5: Fast &amp; Simple Pre-training and Fine-tuning of T5 Models with Limited Resources",
        "authors": "Piotr Nawrot",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.11"
    },
    {
        "id": 21307,
        "title": "Clinical Text Anonymization, its Influence on Downstream NLP Tasks and the Risk of Re-Identification",
        "authors": "Iyadh Ben Cheikh Larbi, Aljoscha Burchardt, Roland Roller",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-srw.11"
    },
    {
        "id": 21308,
        "title": "Low-Dimensional Text Representations for Sentiment Analysis NLP Tasks",
        "authors": "Leonidas Akritidis, Panayiotis Bozanis",
        "published": "2023-6-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s42979-023-01913-y"
    },
    {
        "id": 21309,
        "title": "Blackbird Language Matrices Tasks for Generalization",
        "authors": "Paola Merlo, Chunyang Jiang, Giuseppe Samo, Vivi Nastase",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.genbench-1.13"
    },
    {
        "id": 21310,
        "title": "Triple-Compressed BERT for Efficient Implementation on NLP Tasks",
        "authors": "Zhipeng Peng, Yongjie Zhao",
        "published": "2023-9-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/eiecs59936.2023.10435469"
    },
    {
        "id": 21311,
        "title": "Using Bidirectional Prompt Learning in NLP Few Shot Tasks",
        "authors": "Li Ding, Shiren Ye",
        "published": "2023-3-22",
        "citations": 1,
        "abstract": "Few-Shot Learning, a subfield of machine learning, aims to solve the problem of learning new tasks with only a small amount of annotated data. Compared to traditional supervised learning, Few-Shot Learning is more challenging because there are very few training samples available during the training process, which means that the model must learn quickly and generalize to new samples. Prompt learning is a recently emerged training paradigm in natural language processing, which can quickly leverage the language capabilities of large pre-trained language models to achieve fast start-up. Based on the prompt learning paradigm, this paper proposes to use its conjugate tasks to further enhance the model's ability in few-shot learning. The experimental results show that the proposed method can effectively improve the performance of the model on multiple datasets and can be combined quickly with other methods for joint optimization.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v3i1.6362"
    },
    {
        "id": 21312,
        "title": "SExpSMA-based T5: Serial exponential-slime mould algorithm based T5 model for question answer and distractor generation",
        "authors": "Nikhila T. Bhuvan, Jisha G, Shamna N V",
        "published": "2024-2-17",
        "citations": 0,
        "abstract": "Generally, multiple choice questions are an effective and extensive form used in standard tests in order to evaluate the learner’s skills and knowledge. Nonetheless, the multiple-choice question composition particularly the distractor construction is quite difficult. The distracters are needed to be both plausible and inappropriate and adequate to mystify the learners who did not master the information. Thus, the distractor generation emergence is important that can help several standard tests in an extensive range of domain. In this research, question-answer generation system is developed with a distractor model by developing an optimized T5 model. At first, BERT tokenization is used to pre-process the passage/context and question, which are given as the input to train the approach. Then, the question and answer generation is performed by utilizing the T5 approach that is trained by proposed Serial Exponential-Slime Mould approach (SExpSMA). Exponential weighted moving average is extended to Serial Exponential weighted moving average and incorporated in Slime Mould Algorithm (SMA) to propose SExpSMA. In addition, the proposed SExpSMA-based T5 model is employed to generate distractors for the questions. Eventually, experimentation analysis exhibits that proposed SExpSMA-based T5 model achieves better outcomes regarding the metrics, like ROUGE, BLEU, and METEOR with the values of 0.919, 0.918, 0.488, respectively.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3233/idt-230629"
    },
    {
        "id": 21313,
        "title": "A Unified Knowledge Graph Augmentation Service for Boosting Domain-specific NLP Tasks",
        "authors": "Ruiqing Ding, Xiao Han, Leye Wang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.24"
    },
    {
        "id": 21314,
        "title": "Grammar-Constrained Decoding for Structured NLP Tasks without Finetuning",
        "authors": "Saibo Geng, Martin Josifoski, Maxime Peyrard, Robert West",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.674"
    },
    {
        "id": 21315,
        "title": "TaskWeb: Selecting Better Source Tasks for Multi-task NLP",
        "authors": "Joongwon Kim, Akari Asai, Gabriel Ilharco, Hannaneh Hajishirzi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.680"
    },
    {
        "id": 21316,
        "title": "nav-nlp at RadSum23: Abstractive Summarization of Radiology Reports using BART Finetuning",
        "authors": "Sri Macharla, Ashok Madamanchi, Nikhilesh Kancharla",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.55"
    },
    {
        "id": 21317,
        "title": "Hierarchical Inductive Bias in the L2 Textbook-T5 and Child-T5 Language Model: A Study of Data and Architecture",
        "authors": "Keonwoo Koo, Jaemin Lee, Myung-Kwan Park",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.17154/kjal.2023.12.39.4.179"
    },
    {
        "id": 21318,
        "title": "Improving NLP Model Performance on Small Educational Data Sets Using Self-Augmentation",
        "authors": "Keith Cochran, Clayton Cohn, Peter Hastings",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0011857200003470"
    },
    {
        "id": 21319,
        "title": "Tokenization Consistency Matters for Generative Models on Extractive NLP Tasks",
        "authors": "Kaiser Sun, Peng Qi, Yuhao Zhang, Lan Liu, William Wang, Zhiheng Huang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-emnlp.887"
    },
    {
        "id": 21320,
        "title": "NLU on Data Diets: Dynamic Data Subset Selection for NLP Classification Tasks",
        "authors": "Jean-michel Attendu, Jean-philippe Corbeil",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.sustainlp-1.9"
    },
    {
        "id": 21321,
        "title": "UTSA-NLP at RadSum23: Multi-modal Retrieval-Based Chest X-Ray Report Summarization",
        "authors": "Tongnian Wang, Xingmeng Zhao, Anthony Rios",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.58"
    },
    {
        "id": 21322,
        "title": "Specialist or Generalist? Instruction Tuning for Specific NLP Tasks",
        "authors": "Chufan Shi, Yixuan Su, Cheng Yang, Yujiu Yang, Deng Cai",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.947"
    },
    {
        "id": 21323,
        "title": "Reformulating NLP tasks to Capture Longitudinal Manifestation of Language Disorders in People with Dementia.",
        "authors": "Dimitris Gkoumas, Matthew Purver, Maria Liakata",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.986"
    },
    {
        "id": 21324,
        "title": "Prompt Engineering for Cross-Model Symbolic Knowledge Distillation between T5-GPT",
        "authors": "Jisoo Baik, Namo Bang, Heuiyeen Yeen, MinJu Kim, Myoung-wan Koo",
        "published": "2024-3-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5626/ktcp.2024.30.3.137"
    },
    {
        "id": 21325,
        "title": "Cracking the code: A research study on neuro-linguistic programming (NLP) and its impact on organizational success",
        "authors": " Shradha Bohra,  Nikita Shukla",
        "published": "2023-7-30",
        "citations": 0,
        "abstract": "Neuro-Linguistic Programming (NLP) is a valuable technique for enhancing communication skills, motivation, and mentality in organizations. It helps individuals build rapport, understand others' perspectives, and convey messages with clarity and impact. NLP can help individuals achieve personal goals that go beyond monetary and performance targets, boost employee morale, loyalty, effort, and profitability. The study uses a secondary research method, which involves using existing data and research reports. The data required for conducting the study is available online, such as websites, articles, and reports mainly helps individuals in achieving organizational goals by improving communication, motivation, and mentality. It helps individuals set clear, well-defined objectives aligned with their values and aspirations, and develops appealing objectives that drive action and attention. Techniques like anchoring, reframing negative thoughts, and using positive language patterns can help individuals maintain a good view, overcoming challenges, and remaining motivated while working towards organizational goals. Communicating and influencing skills are equally important for organizational performance, and NLP provides excellent tools for improving these talents. Individuals can learn to create rapport with others, enhance their listening skills, and successfully communicate their message with NLP. These abilities are especially useful when working with team members, stakeholders, or clients, as they allow individuals to influence and convince others. NLP provides problem-solving and decision-making tools and models, such as the Disney Strategy and the Well-Formed Outcome model, which help individuals develop innovative solutions, evaluate their practicality, and develop successful action plans to attain their goals. The significance of rapport and understanding others is highlighted in NLP, allowing individuals to form deeper connections and cooperate more successfully with colleagues and team members. NLP offers a range of techniques and strategies that can greatly support individuals in achieving their organizational goals. By utilizing NLP, individuals can enhance goal setting, motivation, communication skills, mindset, and problem-solving abilities, ultimately leading to improved performance and success.",
        "keywords": "",
        "link": "http://dx.doi.org/10.30574/ijsra.2023.9.2.0521"
    },
    {
        "id": 21326,
        "title": "Analysis of the Relationship Between the Personality of the Lecturer and the Learner and its Impact on Learning Achievement",
        "authors": "Kwanrutai Saelim, Tatchalerm Sudhipongpracha, Rachada Kongkachandra",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354789"
    },
    {
        "id": 21327,
        "title": "It Takes Two to Tango: Navigating Conceptualizations of NLP Tasks and Measurements of Performance",
        "authors": "Arjun Subramonian, Xingdi Yuan, Hal Daumé III, Su Lin Blodgett",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.202"
    },
    {
        "id": 21328,
        "title": "Kannada Textual Error Correction Using T5 Model",
        "authors": "Sushmitha Ramaneedi, Peeta Basa Pati",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126228"
    },
    {
        "id": 21329,
        "title": "HOP to the Next Tasks and Domains for Continual Learning in NLP",
        "authors": "Umberto Michieli, Mete Ozay",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Continual Learning (CL) aims to learn a sequence of problems (i.e., tasks and domains) by transferring knowledge acquired on previous problems, whilst avoiding forgetting of past ones. Different from previous approaches which focused on CL for one NLP task or domain in a specific use-case, in this paper, we address a more general CL setting to learn from a sequence of problems in a unique framework. Our method, HOP, permits to hop across tasks and domains by addressing the CL problem along three directions: (i) we employ a set of adapters to generalize a large pre-trained model to unseen problems, (ii) we compute high-order moments over the distribution of embedded representations to distinguish independent and correlated statistics across different tasks and domains, (iii) we process this enriched information with auxiliary heads specialized for each end problem. Extensive experimental campaign on 4 NLP applications, 5 benchmarks and 2 CL setups demonstrates the effectiveness of our HOP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1609/aaai.v38i13.29349"
    },
    {
        "id": 21330,
        "title": "Towards Semantic Role Labeling of Legal Documents for Improving NLP/IR Tasks in the Law Domain",
        "authors": "Subinay Adhikary",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3632754.3632774"
    },
    {
        "id": 21331,
        "title": "PALS: Personalized Active Learning for Subjective Tasks in NLP",
        "authors": "Kamil Kanclerz, Konrad Karanowski, Julita Bielaniewicz, Marcin Gruza, Piotr Miłkowski, Jan Kocon, Przemyslaw Kazienko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.823"
    },
    {
        "id": 21332,
        "title": "One does not fit all! On the Complementarity of Vision Encoders for Vision and Language Tasks",
        "authors": "Gregor Geigle, Chen Liu, Jonas Pfeiffer, Iryna Gurevych",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.repl4nlp-1.9"
    },
    {
        "id": 21333,
        "title": "Let’s Speak Trajectories: A Vision To Use NLP Models For Trajectory Analysis Tasks",
        "authors": "Mashaal Musleh, Mohamed F. Mokbel",
        "published": "2024-4-8",
        "citations": 0,
        "abstract": "The availability of trajectory data combined with various real life practical applications have sparked the interest of the research community to design a plethora of algorithms for various trajectory analysis techniques. However, there is an apparent lack of full-fledged systems that provide the infrastructure support for trajectory analysis techniques, which hinders the applicability of most of the designed algorithms. Inspired by the tremendous success of the BERT deep learning model in solving various Natural Language Processing (NLP) tasks, our vision is to have a BERT-like system for trajectory analysis tasks. We envision that in a few years, we will have such system, where no one needs to worry again about each specific trajectory analysis operation. Whether it is trajectory imputation, similarity, clustering, or whatever, it would be one system that researchers, developers, and practitioners can deploy to get high accuracy for their trajectory operations. Our vision stands on a solid ground that trajectories in a space are highly analogous to statements in a language. We outline the challenges and the road to our vision. Exploratory results confirm the promise and possibility of our vision.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3656470"
    },
    {
        "id": 21334,
        "title": "A Data-Driven Exploration of a New Islamic Fatwas Dataset for Arabic NLP Tasks",
        "authors": "Ohoud Alyemny, Hend Al-Khalifa, Abdulrahman Mirza",
        "published": "2023-10-19",
        "citations": 0,
        "abstract": "Islamic content is a broad and diverse domain that encompasses various sources, topics, and perspectives. However, there is a lack of comprehensive and reliable datasets that can facilitate conducting studies on Islamic content. In this paper, we present fatwaset, the first public Arabic dataset of Islamic fatwas. It contains Islamic fatwas that we collected from various trusted and authenticated sources in the Islamic fatwa domain, such as agencies, religious scholars, and websites. Fatwaset is a rich resource as it does not only contain fatwas but also includes a considerable set of their surrounding metadata. It can be used for many natural language processing (NLP) tasks, such as language modeling, question answering, author attribution, topic identification, text classification, and text summarization. It can also support other domains that are related to Islamic culture, such as philosophy and language art. We describe the methodology and criteria we used to select the content, as well as the challenges and limitations we faced. Additionally, we perform an Exploratory Data Analysis (EDA), which investigates the dataset from different perspectives. The results of the EDA reveal important information that greatly benefits researchers in this area.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/data8100155"
    },
    {
        "id": 21335,
        "title": "NCUEE-NLP at BioLaySumm Task 2: Readability-Controlled Summarization of Biomedical Articles Using the PRIMERA Models",
        "authors": "Chao-Yi Chen, Jen-Hao Yang, Lung-Hao Lee",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.62"
    },
    {
        "id": 21336,
        "title": "Thesis Distillation: Investigating The Impact of Bias in NLP Models on Hate Speech Detection",
        "authors": "Fatma Elsafoury",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bigpicture-1.5"
    },
    {
        "id": 21337,
        "title": "A Method of Generating Chinese News Text Summaries Based on the T5-PEGASUS-PGN Model",
        "authors": "一平 曹",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.12677/csa.2024.143053"
    },
    {
        "id": 21338,
        "title": "Developing of NLP models by model based software developement",
        "authors": "Zsolt Krutilla",
        "published": "2023",
        "citations": 0,
        "abstract": "In the case of software development, we can talk about several methodologies, such as the waterfall model, test-driven software development, agile software development, but the question rightly arises whether software development methods in the traditional sense are applicable to the development of natural language processing language models, especially from the aspect of AI and dictionary-based NLP models. Learning AI models is substantially different from the classical software development process. Whereas in classical software development, developers explicitly describe the operation and behavior to the computer, in AI model learning, the models themselves learn from the input data. This paper presents a possible solution that applies the agile Scrum methodology used in classical software development to the development of dictionary-based NLP models, and identify the agile development opportunities in case of the machine learning-based NLP models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47833/2023.2.csc.024"
    },
    {
        "id": 21339,
        "title": "MatSci-NLP: Evaluating Scientific Language Models on Materials Science Language Tasks Using Text-to-Schema Modeling",
        "authors": "Yu Song, Santiago Miret, Bang Liu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.201"
    },
    {
        "id": 21340,
        "title": "VBD-NLP at BioLaySumm Task 1: Explicit and Implicit Key Information Selection for Lay Summarization on Biomedical Long Documents",
        "authors": "Phuc Phan, Tri Tran, Hai-Long Trieu",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.60"
    },
    {
        "id": 21341,
        "title": "Visually-augmented pretrained language models for NLP tasks without images",
        "authors": "Hangyu Guo, Kun Zhou, Wayne Xin Zhao, Qinyu Zhang, Ji-Rong Wen",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.833"
    },
    {
        "id": 21342,
        "title": "shs-nlp at RadSum23: Domain-Adaptive Pre-training of Instruction-tuned LLMs for Radiology Report Impression Generation",
        "authors": "Sanjeev Kumar Karn, Rikhiya Ghosh, Kusuma P, Oladimeji Farri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.57"
    },
    {
        "id": 21343,
        "title": "The Impact Of a Firm's Business Model Change on Its Competitiveness: From Atlasjet to Atlasglobal",
        "authors": "Rukiye SÖNMEZ, Aysegül DÜZGÜN, Esra ÖN",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "This study scrutinized the business model change of Atlasglobal, having operated in the Turkish airline industry, and attempted to explain in what direction the change affected the firm's financial performance along with its competitive practices. First, the study focused on the change occurring over time to explain the impact in question. Then, we explained the change with the help of the case analysis method within qualitative research design, while a quantitative approach was employed to reveal the impact of the change on the firm success. The results uncovered that the firm's financial performance decreased after the business model change. On the other hand, we concluded that marketing and promotional moves increased financial performance more than other types of moves, while capacity moves reduced the performance compared to others.",
        "keywords": "",
        "link": "http://dx.doi.org/10.29023/alanyaakademik.1117517"
    },
    {
        "id": 21344,
        "title": "Company Permissibility for Business Activities using NLP",
        "authors": "Praseetha P, Deepthi P, Dr N Srinivasan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.019"
    },
    {
        "id": 21345,
        "title": "Comparative Evaluation of NLP Approaches for Requirements Formalisation",
        "authors": "Shekoufeh Rahimi, Kevin Lano, Sobhan Tehrani, Chenghua Lin, Yiqi Liu, Muhammad Umar",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012318700003645"
    },
    {
        "id": 21346,
        "title": "NLP-based predictive model for identifying and presenting construction accident scenarios",
        "authors": "",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.36334/modsim.2023.shin436"
    },
    {
        "id": 21347,
        "title": "A CONCEPTUAL MODEL OF A MULTILINGUAL INFORMATION SYSTEM FOR NLP SCIENTIFIC AND EDUCATIONAL ACTIVITIES",
        "authors": "Ж.Б. Садирмекова, М.А. Самбетбаева, Г.С. Боранкулова, А.С. Еримбетова",
        "published": "2023-2-28",
        "citations": 0,
        "abstract": "Целью работы является разработка полиязычной информационной системы для научно-образовательной деятельности NLP. Оригинальность предлагаемого подхода состоит в том, что для систематизации знаний, данных и информационных ресурсов и организации осмысленного доступа к ним будет использоваться разработанная в рамках данного проекта онтология предметной области, а также в качестве основы программного обеспечения будут использоваться стандарты и средства технологий Semantic Web. Разработанная в рамках этого исследования онтология станет концептуальной основой полиязычной информационной системы поддержки научной и образовательной деятельности NLP, которая обеспечит систематизацию всей информации по указанным методам, ее интеграцию в единое информационное пространство, удобную навигацию, а также содержательный доступ к ней.\nThe goal is to develop a multilingual information system for NLP scientific and educational activities. The originality of the approach proposed in the study is that the ontology of the subject area developed within the framework of this project will be used to systematize knowledge, data and information resources and organize meaningful access to them, as well as the standards and tools of Semantic Web technologies will be used as the basis of the software. The ontology developed within the framework of this study will become the conceptual basis of a multilingual information system for supporting scientific and educational activities of NLP, which will provide systematization of all information on these methods, its integration into a single information space, convenient navigation through it, as well as meaningful access to it.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25743/dir.2022.44.86.038"
    },
    {
        "id": 21348,
        "title": "Studying the Dependence of Embedding Representations on the Target of NLP Tasks",
        "authors": "Bárbara Stéphanie Neves Oliveira, Ticiana L. Coelho da Silva, José A. F. de Macêdo",
        "published": "2023-9-25",
        "citations": 0,
        "abstract": "In many human languages, linguistic units represent text structure. Vector semantics is used in NLP to represent these units, known as embeddings. Evaluating the learned representations is crucial for identifying critical differences between the diverse existing embedding models in task-specific selection. However, the evaluation process is complex, with two approaches: intrinsic and extrinsic. While useful, aggregated evaluations often lack consistency due to result misalignment. This work investigates the dependencies and correlations between embeddings and NLP tasks. The goal is how to initially verify if the embeddings' dimensions (i.e., features) depend on the final task. The study then explores two research questions and presents findings from experiments.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5753/stil.2023.234166"
    },
    {
        "id": 21349,
        "title": "Model Agnostic Approach for NLP Backdoor Detection",
        "authors": "Hema Karnam Surendrababu",
        "published": "2023-7-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/colcaci59285.2023.10226144"
    },
    {
        "id": 21350,
        "title": "Security Evaluation of Emojis in NLP Tasks",
        "authors": "Hao Ma, Wanying Cao, Jiale Peng, Jiadong Ren, Yuqing Zhang",
        "published": "2024-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigcomp60711.2024.00012"
    },
    {
        "id": 21351,
        "title": "Comparing the performance of ChatGPT and state-of-the-art climate NLP models on climate-related text classification tasks",
        "authors": "Dimitar Trajanov, Gorgi Lazarev, Ljubomir Chitkushev, Irena Vodenska",
        "published": "2023",
        "citations": 3,
        "abstract": "Recently, there has been a surge in general-purpose language models, with ChatGPT being the most advanced model to date. These models are primarily used for generating text in response to user prompts on various topics. It needs to be validated how accurate and relevant the generated text from ChatGPT is on the specific topics, as it is designed for general conversation and not for context-specific purposes. This study explores how ChatGPT, as a general-purpose model, performs in the context of a real-world challenge such as climate change compared to ClimateBert, a state-of-the-art language model specifically trained on climate-related data from various sources, including texts, news, and papers. ClimateBert is fine-tuned on five different NLP classification tasks, making it a valuable benchmark for comparison with the ChatGPT on various NLP tasks. The main results show that for climate-specific NLP tasks, ClimateBert outperforms ChatGPT.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202343602004"
    },
    {
        "id": 21352,
        "title": "Alt-Tech Topic Modeling Incorporating Atopic Model Selection Strategy",
        "authors": "Sanaz Rasti, Sarah Anne Dunne, Eugenia Siapera",
        "published": "2023-9-16",
        "citations": 0,
        "abstract": "The rapid growth of Alt-tech platforms and concerns over their less stringent content moderation policies, make them a good case for opinion mining. This study aims at investigating the topic models that exist in specific Alt-tech channel on Telegram, using data collected in two time points of 2021 and 2023. Three different topic models of LDA, NMF and Contextualized NTM were explored and a model selection procedure was proposed to choose the best performing model among all. To validate the model selection algorithm quantitatively and qualitatively, the approach was tested on publicly available labelled datasets. For all the experiments, data was pre-processed employing an effective NLP pre-processing procedure along with an Alt-tech customised list of stop-words. Using the validated topic model selection algorithm, LDA topics with Ngram range = (4, 4) were extracted from the targeted Alt-tech dataset. The findings from topic models were qualitatively evaluated by a social scientist and are further discussed. The conclusion of the work suggests that the proposed model selection procedure is effective for corresponding corpus length and context. Future work avenues are suggested to improve the outcome of Alt-tech topic modeling.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131601"
    },
    {
        "id": 21353,
        "title": "SocBERT: A Pretrained Model for Social Media Text",
        "authors": "Yuting Guo, Abeed Sarker",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.5"
    },
    {
        "id": 21354,
        "title": "SONGS CONTINUATION GENERATION TECHNOLOGY BASED ON TEST GENERATION STRATEGIES, TEXTMINING AND LANGUAGE MODEL T5",
        "authors": "O. Mediakov, V. Vysotska",
        "published": "2024-1-4",
        "citations": 0,
        "abstract": "Context. Pre-trained large language models are currently the driving force behind the development of not only NLP, but also deep learning systems in general. Model transformers are able to solve virtually all problems that currently exist, provided that certain requirements and training practices are met. In turn, words, sentences and texts are the basic and most important way of communication between intellectually developed beings. Of course, speech and texts are used to convey certain emotions, events, etc. One of the main ways of using language to describe experienced emotions is songs with lyrics. However, often due to the need to preserve rhyme and rhyming, the dimensions of verse lines, song structure, etc., artists have to use repetition of lines in the lyrics. In addition, the process of writing texts can be long.\r\nObjective of the study is to develop information technology for generating the continuation of song texts based on the T5 machine learning model with (SA, specific author) and without (NSA, non-specific author) consideration of the author's style.\r\nMethod. Choosing a decoding strategy is important for the generation process. However, instead of favoring a particular strategy, the system will support multiple strategies. In particular, the following 8 strategies: Contrastive search, Top-p sampling, Top-k sampling, Multinomial sampling, Beam search, Diverse beam search, Greedy search, and Beam-search multinomial sampling.\r\nResults. A machine learning model was developed to generate the continuation of song lyrics using large language models, in particular the T5 model, to accelerate, complement and increase the flexibility of the songwriting process.\r\nConclusions. The created model shows excellent results of generating the continuation of song texts on test data. Analysis of the raw data showed that the NSA model has less degrading results, while the SA model needs to balance the amount of text for each author. Several text metrics such as BLEU, RougeL and RougeN are calculated to quantitatively compare the results of the models and generation strategies. The value of the BLEU metric is the most variable, and its value varies significantly depending on the strategy. At the same time, Rouge metrics have less variability, a smaller range of values. For comparison, 8 different decoding methods for text generation, supported by the transformers library, were used. From all the results of the text comparison, it is clear that the metrically best method of song text generation is beam search and its variations, in particular beam sampling. Contrastive search usually outperformed the conventional greedy approach. The top-p and top-k methods are not clearly superior to each other, and in different situations gave different results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.15588/1607-3274-2023-4-15"
    },
    {
        "id": 21355,
        "title": "Automated Detection of Spam on Instagram using Classifiers and NLP",
        "authors": "Priyadarsini K, Dewansh Chatter, Aniket Dhand",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.127"
    },
    {
        "id": 21356,
        "title": "AED: An black-box NLP classifier model attacker",
        "authors": "Yueyang Liu, Yan Huang, Zhipeng Cai",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.neucom.2023.126489"
    },
    {
        "id": 21357,
        "title": "Use Cases of GPT-3 NLP Model: A Bibliometric Network Analyze",
        "authors": "Saniye Kuleli, Mehmet anon",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4533404"
    },
    {
        "id": 21358,
        "title": "T5. NEXT GENERATION DISEASE MODELING FOR PSYCHIATRIC DISORDERS: AN ASTROCYTIC AGE-IN-A-DISH MODEL",
        "authors": "Uchit Bhaskar, Melanie Carless",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.euroneuro.2023.08.295"
    },
    {
        "id": 21359,
        "title": "Towards Faithful Model Explanation in NLP: A Survey",
        "authors": "Qing Lyu, Marianna Apidianaki, Chris Callison-Burch",
        "published": "2024-3-15",
        "citations": 0,
        "abstract": "Abstract\nEnd-to-end neural Natural Language Processing (NLP) models are notoriously difficult to understand. This has given rise to numerous efforts towards model explainability in recent years. One desideratum of model explanation is faithfulness, that is an explanation should accurately represent the reasoning process behind the model’s prediction. In this survey, we review over 110 model explanation methods in NLP through the lens of faithfulness. We first discuss the definition and evaluation of faithfulness, as well as its significance for explainability. We then introduce recent advances in faithful explanation, grouping existing approaches into five categories: similarity-based methods, analysis of model-internal structures, backpropagation-based methods, counterfactual intervention, and self-explanatory models. For each category, we synthesize its representative studies, strengths, and weaknesses. Finally, we summarize their common virtues and remaining challenges, and reflect on future work directions towards faithful explainability in NLP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/coli_a_00511"
    },
    {
        "id": 21360,
        "title": "From Pretraining Data to Language Models to Downstream Tasks: Tracking the Trails of Political Biases Leading to Unfair NLP Models",
        "authors": "Shangbin Feng, Chan Young Park, Yuhan Liu, Yulia Tsvetkov",
        "published": "2023",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.656"
    },
    {
        "id": 21361,
        "title": "Text Categorization on News Headlines Deploying Opinion Mining in NLP",
        "authors": "R. Punithavathi, V. Raghul, D. Sanjay, R. Vishal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.023"
    },
    {
        "id": 21362,
        "title": "Mental Health Assessment using AI with Sentiment Analysis and NLP",
        "authors": "Shaswat Srivastava, S. Suchitra, Vardhit Saraogi, K. Arthi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.107"
    },
    {
        "id": 21363,
        "title": "Characterised LLMs Affect its Evaluation of Summary and Translation",
        "authors": "Yuan Lu, Yu-Ting Lin",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eval4nlp-1.15"
    },
    {
        "id": 21364,
        "title": "Rock Mass Classification of T5 Tunnel Between Anamur-Kaledran",
        "authors": "Mehmet AYDOĞDU, Sedat TÜRKMEN",
        "published": "2023-3-30",
        "citations": 0,
        "abstract": "Çalışma, Mersin ile Antalya illeri arasında yapımı süren karayolunun Anamur ilçesi ile Kaledran arasında açılan T5 tünelinin mühendislik jeolojisi özellikleri ve kaya kütle sınıflaması çalışmalarını içermektedir. Anamur-Kaledran arası yol projesinde yeralan T5 tüneli 780 m uzunluğundadır. Bu çalışmada tünel güzergahının jeolojik özelliklerinin araştırılması ve değerlendirilmesiyle tünelde geçilecek birimlerin kaya kütle sınıflamasının yapılması ve kazı – destek yöntemlerinin belirlenmesi amaçlanmıştır. Çalışma alanında Paleozoyik yaşlı metamorfik birimler egemen olup, tünel güzergahı bol eklemli, kırıklı ve çatlaklı Ordovisiyen yaşlı şistlerden oluşmaktadır. Şistler etkin paleotektonizmaya bağlı olarak deformasyona uğramış, parçalı – çok parçalı zonlar içermektedir. Belirlenen mühendislik özelliklerine göre RMR, Q ve NATM kaya sınıflamaları ile tünel güzergahı boyunca altı farklı kaya kütle sınıfı belirlenmiş ve bu gruplara göre kazı destekleme sınıflaması yapılmıştır. Kaya sınıflamaları sonucunda tünelin giriş ve çıkış kesimlerinin zayıf kaya, orta kesimlerinin orta kaya sınıfında olduğu belirlenmiştir.",
        "keywords": "",
        "link": "http://dx.doi.org/10.21605/cukurovaumfd.1273813"
    },
    {
        "id": 21365,
        "title": "Understanding Large Language Model Based Metrics for Text Summarization",
        "authors": "Abhishek Pradhan, Ketan Todi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eval4nlp-1.12"
    },
    {
        "id": 21366,
        "title": "Proposing Self-Reflective Debriefing Model for Preventing Burnout among Missionaries: An Approach Based on NLP Therapy and Cognitive Schema Therapy",
        "authors": "Hannah Park,  ",
        "published": "2024-2-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.14493/ksoms.2024.1.129"
    },
    {
        "id": 21367,
        "title": "A new discrete-time epidemic model describing information spread and its impact on the agree-disagree model",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/7973"
    },
    {
        "id": 21368,
        "title": "A T5-based interpretable reading comprehension model with more accurate evidence training",
        "authors": "Boxu Guan, Xinhua Zhu, Shangbo Yuan",
        "published": "2024-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ipm.2023.103584"
    },
    {
        "id": 21369,
        "title": "Tamil Text Error Correction with Multi-lingual T5 Model",
        "authors": "Vaan Amuthu Elango, Peeta Basa Pati",
        "published": "2023-5-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/vitecon58111.2023.10157315"
    },
    {
        "id": 21370,
        "title": "BLIP-NLP Model for Sentiment Analysis",
        "authors": "PVVS Srinivas, Kota Gayathri, Kola Bhavitha,  Jahnavi, K.Dunti Sarath",
        "published": "2023-7-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icecaa58104.2023.10212253"
    },
    {
        "id": 21371,
        "title": "iSAI-NLP 2023 Committee",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354614"
    },
    {
        "id": 21372,
        "title": "THESOCIAL BALANCE, ITS ANALYSIS FROM THE PERSPECTIVE OF THE EFQM MODEL AND ITS IMPACT ON SOLIDARITY ECONOMIES",
        "authors": " GINA MARICELA CEDEÑO ÁVILA et al.",
        "published": "2023-4-7",
        "citations": 0,
        "abstract": "In compliance with the second general provision of the Organic Law of Popular and Solidarity Economy (LOEPS), the organizations subject to this law, will incorporate to their management report the SOCIAL BALANCE; In the framework of legal compliance this research aims to demonstrate the fusion of the theoretical foundations of the EFQM Model of excellence in the management of Organizations of Popular and Solidarity Economy applying the principles and fundamentals of quality in the macro dimensions defined within the model Of Social Balance proposed in Ecuador.\r\nFor this study we used the field research and the descriptive, in addition to the deductive, inductive and analytical methods, and the techniques of the survey and observation, as a conclusion has been obtained that the methodologies fusion proposed by the Control Entity are Which are indispensable in the application of the EFQM model, the analysis of the results of the Social Balance in relation to the theory has been divided into two groups:  the first five are the Facilitating Agents or Agents Criteria in which are the leadership, people, strategies, alliances And resources and processes, products and services, which describe how results are achieved, and must be proven by documentary evidence.The last four are the Results Criteria where we find: results in people, results in the members of the organization, results in society and key results, these describe what has resulted in the organization after the theoretical application of the EFQM model And the dimensions of the Social Balance from the management perspective with quality.The model has the logical scheme REDER which allows planning, doing, checking and acting on the criteria and results, so it is recommended to prioritize the quality standards in which EPS organizations must improve urgently, to ensure their operation and fulfill With the principles established in Article 4 of the LOEPS.",
        "keywords": "",
        "link": "http://dx.doi.org/10.52783/rlj.v11i7s.1453"
    },
    {
        "id": 21373,
        "title": "Con-Metaverse: Its Potentiality, Challenges, and Possible Applications through NLP and Review",
        "authors": "Jisoo Park, Chaeyoen Yu, Youjin Jang, Sungjin Kim",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1061/9780784485231.063"
    },
    {
        "id": 21374,
        "title": "iSAI-NLP 2023 Tentative Program",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354669"
    },
    {
        "id": 21375,
        "title": "Automatic Text Summarization and Translation using NLP With its functioning in AI: A Comprehensive Review",
        "authors": "",
        "published": "2023-12-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.56726/irjmets47585"
    },
    {
        "id": 21376,
        "title": "An Abstractive Summarization and Conversation Bot using T5 and its Variants",
        "authors": "Sudharson D, K. S. Thrisha Vaishnavi, S. Hariprakassh, B. Abiram, K. Saranya, Poonam Tanwar",
        "published": "2023-11-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icaiccit60255.2023.10465740"
    },
    {
        "id": 21377,
        "title": "iSAI-NLP 2023 Copyright Page",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354677"
    },
    {
        "id": 21378,
        "title": "iSAI-NLP 2023 Cover Page",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354898"
    },
    {
        "id": 21379,
        "title": "The Role of Artificial Intelligence and its Impact on the Human Element in Business Organizations (Emirates Telecommunications Corporation as a Model)",
        "authors": "Shadia Idris, Ayed Al Harthi",
        "published": "2023-11-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21275/sr231115163313"
    },
    {
        "id": 21380,
        "title": "Gradual Language Model Adaptation Using Fine-Grained Typology",
        "authors": "Marcell Richard Fekete, Johannes Bjerva",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.sigtyp-1.19"
    },
    {
        "id": 21381,
        "title": "iSAI-NLP 2023 Message from General Chair",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354579"
    },
    {
        "id": 21382,
        "title": "The Use of Khislavichi Lect Morphological Tagging to Determine its Position in the East Slavic Group",
        "authors": "Ilia Afanasev",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.vardial-1.18"
    },
    {
        "id": 21383,
        "title": "Development of an NLP-Based Automatic Data Retrieval Model",
        "authors": "Thejas P, S Anupama Kumar, Y S Kiran Kumar",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icosec58147.2023.10275917"
    },
    {
        "id": 21384,
        "title": "NLP-Based Next-Word Prediction Model",
        "authors": "Sarbjit Singh, Divyansh Doshi, AK Kohli, Teena Neupane",
        "published": "2023-11-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/csitss60515.2023.10334073"
    },
    {
        "id": 21385,
        "title": "iSAI-NLP 2023 Message from Program Chairs",
        "authors": "",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354885"
    },
    {
        "id": 21386,
        "title": "A Legal News Summarisation Model Based on RoBERTa, T5 and Dilated Gated CNN",
        "authors": "Weijian Qin, Xudong Luo",
        "published": "2023-11-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ictai59109.2023.00134"
    },
    {
        "id": 21387,
        "title": "Self-Supervised Learning’s Impact on AI and NLP",
        "authors": "Mohamed El-Hadi",
        "published": "2023-5-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21608/jstc.2023.297946"
    },
    {
        "id": 21388,
        "title": "Improving Prediction Backward-Compatiblility in NLP Model Upgrade with Gated Fusion",
        "authors": "Yi-An Lai, Elman Mansimov, Yuqing Xie, Yi Zhang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-eacl.74"
    },
    {
        "id": 21389,
        "title": "Pretrained Sentence Embedding and Semantic Sentence Similarity Language Model for Text Classification in NLP",
        "authors": "V.Valli Mayil, T.Ratha Jeyalakshmi",
        "published": "2023-3-18",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aisp57993.2023.10134937"
    },
    {
        "id": 21390,
        "title": "Performance of hollow and aluminum foam-filled multi-cell thin-walled aluminum alloy tubes (6063-T5) under axial impact",
        "authors": "Xianhui Li, Yao Yin, Xiang Zhu, Rui Wang, Tieying Li, Qi Zhang, Wenbo Li",
        "published": "2023-1",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.istruc.2022.12.019"
    },
    {
        "id": 21391,
        "title": "What aspects of NLP models and brain datasets affect brain-NLP alignment?",
        "authors": "SUBBA REDDY OOTA, Mariya Toneva",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32470/ccn.2023.1273-0"
    },
    {
        "id": 21392,
        "title": "Looking for a word or for its meaning? The impact of induction tasks on adolescents' visual search for verbal material",
        "authors": "Nicolas Vibert, Daniel Darles, Christine Ros, Jason L. G. Braasch, Jean-François Rouet",
        "published": "2023-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3758/s13421-023-01420-8"
    },
    {
        "id": 21393,
        "title": "“Dr LLM, what do I have?”: The Impact of User Beliefs and Prompt Formulation on Health Diagnoses",
        "authors": "Wojciech Kusa, Edoardo Mosca, Aldo Lipani",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlpmc-1.2"
    },
    {
        "id": 21394,
        "title": "Impact Force Mechanism of a Trimaran Model and Its Experimental Validation",
        "authors": "Jiaqi Li, Shili Sun",
        "published": "2023-9-17",
        "citations": 0,
        "abstract": "In recent years, trimarans have been used in high-speed transport and in warships, but studies of them have made little progress. We designed a trimaran model and used it to perform a water-entry experiment to find a way to reduce the slamming pressure. The process of the model entering the water was divided into several steps, and different theoretical models were designed for each step, together with their force analysis. Relying on our experimental platform, we designed three flexible coating thicknesses and six drop heights as the different working conditions. With an analysis of the results under these experimental conditions, the experiment clearly indicates that the flexible cladding on the model can decrease the impact force when the model slams into water. Furthermore, the theoretical models and their corresponding force analyses are validated by the experimental results.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app131810382"
    },
    {
        "id": 21395,
        "title": "HELPING TO LEARN MODEL CONCEPTUALIZATION TASKS WITH MONO-GUIDE",
        "authors": "Martin Schaffernicht",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/inted.2023.1601"
    },
    {
        "id": 21396,
        "title": "SPEECH THERAPY MODEL BASED ON NEURO LINGUISTIC PROGRAMMING (NLP): OPTIMIZATION OF DEAF                   SPEECH ABILITY",
        "authors": "Sakaria Sakaria, Asia M",
        "published": "2023-5-31",
        "citations": 0,
        "abstract": "This study aims to describe the feasibility and effectiveness of a Neuro Linguistic Programming (NLP) based speech therapy model. The speech therapy model was developed using the Borg and Gall model at Makassar State SLB through the stages of research and information gathering, planning, development of initial product forms, and preliminary field trials. Data from expert validation results were analyzed using descriptive statistics, and data on the ability to speak with the deaf was analyzed using inferential statistical tests (t-test paired samples). The results of the study indicate that the developed speech therapy model is appropriate and effective for use in speech therapy for the deaf. The feasibility speech therapy model is used because it meets the feasibility aspects, namely the feasibility of supporting theory, the feasibility of orientation and goals, the feasibility of the reaction principle, the feasibility of therapeutic procedures, the feasibility of support systems, and the feasibility of implementing therapy. Speech therapy models based on Neuro Linguistic Programming (NLP) can improve the ability of the deaf to pronounce and understand the meaning of vocabulary and reduce anxiety when speaking.",
        "keywords": "",
        "link": "http://dx.doi.org/10.26858/retorika.v16i1.46721"
    },
    {
        "id": 21397,
        "title": "Domain-Specific Language Model Post-Training for Indonesian Financial NLP",
        "authors": "Ni Putu Intan Maharani, Ayu Purwarianti, Yoga Yustiawan, Fauzy Caesar Rochim",
        "published": "2023-10-10",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceei59426.2023.10346625"
    },
    {
        "id": 21398,
        "title": "Two Decades of the ACL Anthology: Development, Impact, and Open Challenges",
        "authors": "Marcel Bollmann, Nathan Schneider, Arne Köhn, Matt Post",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.10"
    },
    {
        "id": 21399,
        "title": "TAMIL- NLP: Roles and Impact of Machine Learning and Deep Learning with Natural Language Processing for Tamil",
        "authors": "S. Gokila, S. Rajeswari, S. Deepa",
        "published": "2023-4-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iconstem56934.2023.10142680"
    },
    {
        "id": 21400,
        "title": "Korean Language NLP Model Based Emotional Analysis of LGBTQ Social Media Communities",
        "authors": "Younghyun Chi, Jang Hyun Kim, Seungjong Sun",
        "published": "2023-1-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/imcom56909.2023.10035659"
    },
    {
        "id": 21401,
        "title": "Efficient NLP Model Finetuning via Multistage Data Filtering",
        "authors": "Xu Ouyang, Shahina Mohd Azam Ansari, Felix Xiaozhu Lin, Yangfeng Ji",
        "published": "2023-8",
        "citations": 0,
        "abstract": "As model finetuning is central to the modern NLP, we set to maximize its efficiency. Motivated by redundancy in training examples and the sheer sizes of pretrained models, we exploit a key opportunity: training only on important data. To this end, we set to filter training examples in a streaming fashion, in tandem with training the target model. Our key techniques are two: (1) automatically determine a training loss threshold for skipping backward training passes; (2) run a meta predictor for further skipping forward training passes. We integrate the above techniques in a holistic, three-stage training pro- cess. On a diverse set of benchmarks, our method reduces the required training examples by up to 5.3× and training time by up to 6.8×, while only seeing minor accuracy degradation. Our method is effective even for training one epoch, where each training example is encountered only once. It is simple to implement and is compatible with the existing finetuning techniques. Code is available at: https://github.com/xo28/efficient-NLP-multistage-training",
        "keywords": "",
        "link": "http://dx.doi.org/10.24963/ijcai.2023/455"
    },
    {
        "id": 21402,
        "title": "A Character-Level Restoration of Sukhothai Inscriptions Using The Masked Language Model",
        "authors": "Sujitra Tongkhum, Sukree Sinthupinyo",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10355005"
    },
    {
        "id": 21403,
        "title": "Detection of Linguistic Bad Smells in GRL Models: An NLP Approach",
        "authors": "Nouf Alturayeif, Jameleddine Hassine",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/models-c59198.2023.00062"
    },
    {
        "id": 21404,
        "title": "Diffusion model for adversarial attack against NLP models",
        "authors": "Shilin Qiu, Min Gou, Tao Liang",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1117/12.3026312"
    },
    {
        "id": 21405,
        "title": "Abstractive Text Summarization using Pre-Trained Language Model \"Text-to-Text Transfer Transformer (T5)\"",
        "authors": "Qurrota A’yuna Itsnaini, Mardhiya Hayaty, Andriyan Dwi Putra, Nidal A.M Jabari",
        "published": "2023-4-7",
        "citations": 1,
        "abstract": "Automatic Text Summarization (ATS) is one of the utilizations of technological sophistication in terms of text processing assisting humans in producing a summary or key points of a document in large quantities. We use Indonesian language as objects because there are few resources in NLP research using Indonesian language. This paper utilized PLTMs (Pre-Trained Language Models) from the transformer architecture, namely T5 (Text-to-Text Transfer Transformer) which has been completed previously with a larger dataset. Evaluation in this study was measured through comparison of the ROUGE (Recall-Oriented Understudy for Gisting Evaluation) calculation results between the reference summary and the model summary. The experiments with the pre-trained t5-base model with fine tuning parameters of 220M for the Indonesian news dataset yielded relatively high ROUGE values, namely ROUGE-1 = 0.68, ROUGE-2 = 0.61, and ROUGE-L = 0.65. The evaluation value worked well, but the resulting model has not achieved satisfactory results because in terms of abstraction, the model did not work optimally. We also found several errors in the reference summary in the dataset used.",
        "keywords": "",
        "link": "http://dx.doi.org/10.33096/ilkom.v15i1.1532.124-131"
    },
    {
        "id": 21406,
        "title": "Extracting Entities from Video and Tagging them - NLP Model",
        "authors": " Anshika Pareek,  Aditi Mohan,  Naveen Rathi",
        "published": "2023-4-23",
        "citations": 0,
        "abstract": "In order to give consumers access to all the crucial details or the excitement of the films, video summarising seeks to create a high-quality text-based summary of the videos. In order to summarise a video, audio files must first be converted to text files, and then the video files. This whole Natural Language Processing's transformer architecture is used in conjunction with the process. Despite the fact that there have been numerous studies on text summarising, we propose our model, an extractive-video summarizer, which is based on cutting-edge pre-trained ML models and open-source libraries. The following regime is utilised by the extractive video summarizer: Creating a transdisciplinary collection of movies, extracting audio from video files, and creating text from audio recordings are just a few examples. the text summarization using (V)Entity extraction and extractive summarizers. Hindi and English, two widely spoken languages in India, were the main subjects of our research. To sum up, our model performs remarkably well and produces appropriate tags for videos.",
        "keywords": "",
        "link": "http://dx.doi.org/10.48175/ijarsct-9353"
    },
    {
        "id": 21407,
        "title": "NLP+Vis: NLP Meets Visualization",
        "authors": "Shafiq Joty, Enamul Hoque, Jesse Vig",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-tutorial.1"
    },
    {
        "id": 21408,
        "title": "Thai Knowledge-Augmented Language Model Adaptation (ThaiKALA)",
        "authors": "Pavaris Ruangchutiphophan, Chanatip Saetia, Thititorn Seneewong Na Ayutthaya, Tawunrat Chalothorn",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10355001"
    },
    {
        "id": 21409,
        "title": "Model-tuning Via Prompts Makes NLP Models Adversarially Robust",
        "authors": "Mrigank Raman, Pratyush Maini, J Kolter, Zachary Lipton, Danish Pruthi",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.576"
    },
    {
        "id": 21410,
        "title": "Balancing Robustness and Covertness in NLP Model Watermarking: A Multi-Task Learning Approach",
        "authors": "Long Dai, Jiarong Mao, Liaoran Xu, Xuefeng Fan, Xiaoyi Zhou",
        "published": "2023-7-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iscc58397.2023.10218209"
    },
    {
        "id": 21411,
        "title": "A Relatedness Measure to Identify the Business Model Pattern and Its Impact on Firm’s Value Chain",
        "authors": "Paritosh Jha, Marco Cucculelli",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4721743"
    },
    {
        "id": 21412,
        "title": "Exploring the Impact of Transliteration on NLP Performance: Treating Maltese as an Arabic Dialect",
        "authors": "Kurt Micallef, Fadhl Eryani, Nizar Habash, Houda Bouamor, Claudia Borg",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.cawl-1.4"
    },
    {
        "id": 21413,
        "title": "Research on NLP Based Chinese English Translation Text Quality Rating Model",
        "authors": "Jingxia Ma",
        "published": "2023-4-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/iceib57887.2023.10170373"
    },
    {
        "id": 21414,
        "title": "Sen2Pro: A Probabilistic Perspective to Sentence Embedding from Pre-trained Language Model",
        "authors": "Lingfeng Shen, Haiyun Jiang, Lemao Liu, Shuming Shi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.repl4nlp-1.26"
    },
    {
        "id": 21415,
        "title": "NLP based model to convert English speech to Gujarati text for deaf &amp; dumb people",
        "authors": "Nasrin Aasofwala, Shanti Verma, Kalyani Patel",
        "published": "2023-7-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icccnt56998.2023.10308284"
    },
    {
        "id": 21416,
        "title": "Reading is not believing: A multimodal adversarial attacker for Chinese-NLP model",
        "authors": "Zhaocheng Ge, Hanping Hu, Tengfei Zhao, Dingmeng Shi",
        "published": "2023-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cose.2022.103052"
    },
    {
        "id": 21417,
        "title": "Garbage in, garbage out: An analysis of HTML text extractors and their impact on NLP performance",
        "authors": "Vlad Dumitru, Denis Iorga, Stefan Ruseti, Mihai Dascalu",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/cscs59211.2023.00070"
    },
    {
        "id": 21418,
        "title": "Parameter estimation for ocean background vertical diffusivity coefficients in the Community Earth System Model (v1.2.1) and its impact on El Niño–Southern Oscillation forecasts",
        "authors": "Zheqi Shen, Yihao Chen, Xiaojing Li, Xunshu Song",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "Abstract. This study investigates parameter estimation (PE) to enhance climate forecasts of a coupled general circulation model by adjusting the background vertical diffusivity coefficients in its ocean component. These parameters were initially identified through sensitivity experiments and subsequently estimated by assimilating the sea surface temperature and temperature–salinity profiles. This study expands the coupled data assimilation system of the Community Earth System Model (CESM) and the ensemble adjustment Kalman filter (EAKF) to enable parameter estimation. PE experiments were performed to establish balanced initial states and adjusted parameters for forecasting the El Niño–Southern Oscillation (ENSO). Comparing the model states between the PE experiment and a state estimation (SE) experiment revealed that PE can significantly reduce the uncertainty of these parameters and improve the quality of analysis. The forecasts obtained from PE and SE experiments further validate that PE has the potential to improve the forecast skill for ENSO.\n                    ",
        "keywords": "",
        "link": "http://dx.doi.org/10.5194/gmd-17-1651-2024"
    },
    {
        "id": 21419,
        "title": "Mass media and its impact on opinion dynamics of the nonlinear q-voter model",
        "authors": "Roni Muslim, Rinto Anugraha NQZ, Muhammad Ardhi Khalif",
        "published": "2024-1",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2023.129358"
    },
    {
        "id": 21420,
        "title": "Advancement in NLP with Decision Tree: The Impact of social media on Enhancing Women's Safety in Indian Cities",
        "authors": " C. Gazala Akhtari  C. Gazala Akhtari",
        "published": "2023-12-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.46243/jst.2023.v8.i12.pp195-207"
    },
    {
        "id": 21421,
        "title": "Artificial Neural Network Based Diabetes Prediction Model and Reducing Impact of Class Imbalance on Its Performance",
        "authors": "Priyabrata Sahu, Jibendu Kumar Mantri",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4538967"
    },
    {
        "id": 21422,
        "title": "Study on Material Damage Accumulation Model and Its Numerical Implementation under Repeated Impact Loading",
        "authors": "",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.3901/jme.2023.02.138"
    },
    {
        "id": 21423,
        "title": "Administration Model 4.0 and its Impact on the Improvement of Public Services",
        "authors": "X.A Mosquera Rodríguez, A.L Medina Burbano",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "The present investigation analyzed the relationship between the satisfaction of the users of a public company in charge of the vehicle registration process in the city of Babahoyo, province of Los Ríos, Ecuador, and the implementation of an administration model 4.0 carried out through a system of management information in the area of license plate issuance, given the increase in users of this service and the need to guarantee and improve their satisfaction. For this purpose, some models related to management information systems and the public administration model 4.0 were analyzed. Later, analyzing the results of a survey applied to a sample of service users and officials of the public company, it was possible to diagnose the situation of the company’s registration area. The investigation evidenced the existence of unfriendly systems with the information needs of the institution, in addition to a low level of commitment on the part of the staff, which is demonstrated in the reduced or non-existent post-service follow-up, all of which causes user dissatisfaction. It is concluded that it is advisable to design and apply customer relationship management under the 4.0 public administration model that allows an increase in the level of user satisfaction.\r\nKeywords: CRM, quality management, users’ service, public management, transportation.\r\nResumen \r\nLa presente investigación analizó la relación entre la satisfacción de los usuarios de una Empresa pública encargada del proceso de matriculación vehicular en la ciudad de Babahoyo, provincia de Los Ríos, Ecuador y la implementación de un modelo de administración 4.0 realizada a través de un sistema de información gerencial en el área de emisión de matrículas, ante el incremento de usuarios de este servicio y la necesidad de garantizar y mejorar su satisfacción. Para el efecto se analizaron algunos modelos relacionados con los sistemas de información gerencial y el modelo de administración pública 4.0, y posteriormente, analizando los resultados de una encuesta aplicada a una muestra de usuarios del servicio y a funcionarios de la Empresa pública, se pudo diagnosticar la situación del área de matriculación de la empresa. La investigación evidenció la existencia de sistemas poco amigables con las necesidades de información de la institución, además de un bajo nivel de compromiso por parte del personal, que se demuestra en el reducido o inexistente seguimiento post servicio, todo lo cual provoca insatisfacción de los usuarios. Se concluye que es recomendable diseñar y aplicar un sistema de gestión de relaciones con el cliente bajo el modelo de administración pública 4.0 que permita el incremento del nivel de satisfacción de los usuarios.\r\nPalabras Clave: CRM, gestión de calidad, atención al usuario, administración pública, transportación. How to",
        "keywords": "",
        "link": "http://dx.doi.org/10.18502/espoch.v3i1.14457"
    },
    {
        "id": 21424,
        "title": "Umeed: VR Game Using NLP Models and Latent Semantic Analysis for Conversation Therapy for People with Speech Disorders",
        "authors": "",
        "published": "2023-8-19",
        "citations": 0,
        "abstract": "UmeedVR aims to create a conversational therapy VR game using natural language processing for patients with Speech Disorders like Autism or Aphasia. This study developed 5 psychological task sets and 3 environments via Maya and Unity. The Topic-Modeling AI, employing 25 live participants' recordings and 980+ TwineAI datasets, generated initial VR grading with a coherence score averaging 6.98 themes in 5-minute conversations across scenarios, forming a foundation for enhancements. Employing latent semantic analysis (gensimcorpus Python) and Term-Frequency-Inverse Document-Frequency (TF-IDF), grammatical errors and user-specific improvements were addressed. Results were visualized via audio-visual plots, highlighting conversation topics based on occurrence and interpretability. UMEED enhances cognitive and intuitive skills, elevating average topics from 6.98 to 13.56 in a 5- minute conversation with a 143.12 coherence score. LSA achieved 98.39% accuracy, topic modeling 100%. Significantly, real-time grammatical correction integration in the game was realized.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/csit.2023.131408"
    },
    {
        "id": 21425,
        "title": "Designing NLP applications to support ICD coding: an impact analysis and guidelines to enhance baseline performance when processing patient discharge notes",
        "authors": "Jessica Jha, Mario Almagro, Hegler Tissot",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "Financial costs are a major concern in the healthcare system, with medical billing and coding playing a key role in facilitating transactions and financing procedures. Billing involves filing claims with insurance companies and requires scrutiny of clinical summaries and electronic health records to correctly match diagnoses, prescriptions, and procedures to standardized codes. Accuracy in assigning International Classification of Diseases (ICD) codes is critical to proper reimbursement of care. Incorrect codes waste time and resources, and cause administrative and financial problems for hospitals, insurance companies and patients. Manual medical coding is a labor-intensive and error-prone process that creates additional administrative burden and inconvenience for hospitals, insurance companies, and patients. To simplify the process, clinical records are often processed to automatically identify and extract clinical concepts and corresponding ICD codes. Deep learning and natural language processing techniques have shown promise in a variety of tasks but applying them to medical coding has been challenging. Accurate coding requires a deep understanding of medical terminology, context, and guidelines that may be difficult to capture with traditional deep learning methods. Although deep learning shows promise in healthcare, its specific impact on ICD coding is not fully understood, and translating scalable deep learning methods into practical improvements in ICD coding remains a challenge. Evaluating deep learning models under the scenarios of real-world coding and comparing them to established practice is critical to determining their true effectiveness. In this work, we address the automation of ICD coding by highlighting pitfalls and contrasting different perspectives. We investigated automatic ICD coding using baseline machine learning models, with a focus on identifying ICD-9 codes in discharge notes from Medical Information Mart for Intensive Care (MIMIC) database. A thorough evaluation of different models and approaches is crucial to avoid over-reliance on any method. Our findings show that simpler methods can achieve comparable results to deep learning models while still requiring fewer computational resources.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55976/jdh.22023119463-81"
    },
    {
        "id": 21426,
        "title": "T5 language models for text simplification",
        "authors": "Д.Д. Васильев, D.D. Vasiliev,, А.В. Пятаева, A.V. Pyataeva,",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.15827/0236-235x.142.228-236"
    },
    {
        "id": 21427,
        "title": "HealthCare Chatbot Using NLP Techniques and Deep Learning Algorithm",
        "authors": "Narayana Darapaneni, Deepthi V, Divya Chowdaiah, Anwesh Reddy Paduri, Shashank P Raikar, Ramyasri R, Sunil Bhagwat, Mahesh Deshpande",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.13052/rp-9788770040723.102"
    },
    {
        "id": 21428,
        "title": "Financial News Classification Model for NLP-based Bond Portfolio Construction",
        "authors": "Thanos Konstantinidis, Arnau Bonet Farres, Yao Lei Xu, Tony G. Constantinides, Danilo P. Mandic",
        "published": "2023-6-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/dsp58604.2023.10167921"
    },
    {
        "id": 21429,
        "title": "STAT Intelligence: Data Management and Monitoring Platform for BCG Economy Model",
        "authors": "Pattama Krataithong, Marut Buranarach, Patipat Tumsangthong, Theerawat Wutthitasarn",
        "published": "2023-11-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/isai-nlp60301.2023.10354544"
    },
    {
        "id": 21430,
        "title": "Mass Media and Its Impact on Opinion Dynamics of the Nonlinear q-Voter Model",
        "authors": "Roni Muslim, Rinto Anugraha NQZ, Muhammad Ardhi Khalif",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4384780"
    },
    {
        "id": 21431,
        "title": "Fair Enough: Standardizing Evaluation and Model Selection for Fairness Research in NLP",
        "authors": "Xudong Han, Timothy Baldwin, Trevor Cohn",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eacl-main.23"
    },
    {
        "id": 21432,
        "title": "BuggIn: Automatic Intrinsic Bugs Classification Model using NLP and ML",
        "authors": "Pragya Bhandari, Gema Rodríguez-Pérez",
        "published": "2023-12-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3617555.3617875"
    },
    {
        "id": 21433,
        "title": "Vocals - An App for Vocally Impaired using NLP Conversational Model",
        "authors": "Prashasthi K Kanchan, Sahana S, Shreya K Loni, R S Raksha, Tina Babu",
        "published": "2023-4-7",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/i2ct57861.2023.10126416"
    },
    {
        "id": 21434,
        "title": "Unveiling the Post-Covid Economic Impact Using NLP Techniques",
        "authors": "Kanishk Barhanpurkar, Nikita Mandlik, Anand Singh Rajawat, S.B. Goyal, Traian Candin Mihaltan, Chaman Verma, Maria Simona Raboaca",
        "published": "2023-6-29",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/ecai58194.2023.10194111"
    },
    {
        "id": 21435,
        "title": "Exploring the Impact ofAI-powered Collaborative and Interactive NLP Apps on EFL Teaching in the Post-COVID-19 Era",
        "authors": "Coffi Martinien ZOUNHIN TOBOULA,",
        "published": "2023-3-11",
        "citations": 1,
        "abstract": "The COVID-19 pandemic has disrupted traditional language learning, leading to a shift towards online teaching and requiring new approaches to language education. This study examines the effectiveness of AI-powered collaborative and interactive Natural Language Processing (NLP) applications on English as a Foreign Language (EFL) instruction in a post-COVID-19 online education environment. The study used a mixed-methods approach, incorporating statistical and in-depth qualitative data gathering and processing strategies. EFL teachers and students from the University of Abomey-Calavi (UAC) in Benin were surveyed, interviewed, and observed during online language learning sessions. The data were analysed using both descriptive and inferential statistics. The study employed questionnaire surveys to analyse quantitative data and used the thematic (content) analysis method to isolate the most important trends and themes hidden within the qualitative data collected through semi-structured interviews and online class observations. Results showed the challenges and opportunities of using AI-powered collaborative and interactive language learning in EFL teaching, the learning methodologies and assessment approaches used in AI-enabled collaborative e-learning, the role of technology in supporting pervasive learning, and the impact of professional development for teachers in ICT on integrating AI-assisted collaborative e-learning in EFL instruction. The findings offer new perspectives on the effects of AI-supported collaborative and interactive language learning on EFL teaching and its implications for EFL teachers and students in the post-pandemic era.",
        "keywords": "",
        "link": "http://dx.doi.org/10.5121/ijci.2023.120213"
    },
    {
        "id": 21436,
        "title": "Arabic Abstractive Summarization Using the Multilingual T5 Model",
        "authors": "Abdelrhman A. Karim, Mohammed Usama, Manar A. Ibrahim, Youssef Hatem, Waleed Wael, Ahmad T. Mazrua, Ghada K. El-Monayer, Magy Elbanhawy, Khaled Foad, Ibrahim F. Moawad",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icci61671.2024.10485135"
    },
    {
        "id": 21437,
        "title": "Explainable NLP Model for Predicting Patient Admissions at Emergency Department Using Triage Notes",
        "authors": "Emilien Arnaud, Mahmoud Elbattah, Pedro A. Moreno-Sánchez, Gilles Dequen, Daniel Aiham Ghazali",
        "published": "2023-12-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/bigdata59044.2023.10386753"
    },
    {
        "id": 21438,
        "title": "Ensemble-NQG-T5: Ensemble Neural Question Generation Model Based on Text-to-Text Transfer Transformer",
        "authors": "Myeong-Ha Hwang, Jikang Shin, Hojin Seo, Jeong-Seon Im, Hee Cho, Chun-Kwon Lee",
        "published": "2023-1-9",
        "citations": 6,
        "abstract": "Deep learning chatbot research and development is exploding recently to offer customers in numerous industries personalized services. However, human resources are used to create a learning dataset for a deep learning chatbot. In order to augment this, the idea of neural question generation (NQG) has evolved, although it has restrictions on how questions can be expressed in different ways and has a finite capacity for question generation. In this paper, we propose an ensemble-type NQG model based on the text-to-text transfer transformer (T5). Through the proposed model, the number of generated questions for each single NQG model can be greatly increased by considering the mutual similarity and the quality of the questions using the soft-voting method. For the training of the soft-voting algorithm, the evaluation score and mutual similarity score weights based on the context and the question–answer (QA) dataset are used as the threshold weight. Performance comparison results with existing T5-based NQG models using the SQuAD 2.0 dataset demonstrate the effectiveness of the proposed method for QG. The implementation of the proposed ensemble model is anticipated to span diverse industrial fields, including interactive chatbots, robotic process automation (RPA), and Internet of Things (IoT) services in the future.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/app13020903"
    },
    {
        "id": 21439,
        "title": "Development of a Scheffe’s Model to Predict the Duration of Project Tasks",
        "authors": "Kenneth Oba",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4754401"
    },
    {
        "id": 21440,
        "title": "We Need to Talk About Reproducibility in NLP Model Comparison",
        "authors": "Yan Xue, Xuefei Cao, Xingli Yang, Yu Wang, Ruibo Wang, Jihong Li",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.586"
    },
    {
        "id": 21441,
        "title": "THE IMPACT OF DIFFERENT TYPES OF STIMULI ON GENDER DIFFERENCES IN MENTAL ROTATION TASKS",
        "authors": "Natalia Segura Caballero, Günter Maresch",
        "published": "2023-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.21125/iceri.2023.0469"
    },
    {
        "id": 21442,
        "title": "Experimental Validation of an Actor-Critic Model Predictive Force Controller for Robot-Environment Interaction Tasks",
        "authors": "Alessandro Pozzi, Luca Puricelli, Vincenzo Petrone, Enrico Ferrentino, Pasquale Chiacchio, Francesco Braghin, Loris Roveda",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5220/0012160700003543"
    },
    {
        "id": 21443,
        "title": "Advancing Abstractive Bangla Text Summarization: A Deep Learning Approach Using Seq2seq Encoder- Decoder Model and T5 Transformer",
        "authors": "S M Tasnimul Hasan, Md Ashfaqur Rahman, Md Mahamudul Hasan, Mohammad Rakibul Hasan, Md Moinul Hoque",
        "published": "2023-12-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/sti59863.2023.10464712"
    },
    {
        "id": 21444,
        "title": "Hybrid Optimization Based BERT Model for Drug Detection in NLP",
        "authors": "C G Kruthika, N N Namitha Devi, Vijayananda V Madlur, K Asha, T M Aruna",
        "published": "2023-12-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/mysurucon59703.2023.10396892"
    },
    {
        "id": 21445,
        "title": "Optimal control in a mathematical model of a spread of the obesity epidemic and its impact on diabetes",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.28919/cmbn/8041"
    },
    {
        "id": 21446,
        "title": "Hubbard model and its impact on the thermoelectric properties of the penta-graphene structure",
        "authors": "Mona Abdi, Bandar Astinchap",
        "published": "2024-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cjph.2024.02.026"
    },
    {
        "id": 21447,
        "title": "GNR: A universal and efficient node ranking model for various tasks based on graph neural networks",
        "authors": "Hongbo Qu, Yu-Rong Song, Ruqi Li, Min Li",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2023.129339"
    },
    {
        "id": 21448,
        "title": "When Your Language Model Cannot Even Do Determiners Right: Probing for Anti-Presuppositions and the Maximize Presupposition! Principle",
        "authors": "Judith Sieker, Sina Zarrieß",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.blackboxnlp-1.14"
    },
    {
        "id": 21449,
        "title": "Simplified Fast Affine Projection Algorithm in Echo Cancellation Tasks",
        "authors": "V. I. Djigan",
        "published": "2023-5-29",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/weconf57201.2023.10147942"
    },
    {
        "id": 21450,
        "title": "🚀 NLP Colloquium",
        "authors": "Ayana Niwa, Sho Yokoi, Junya Takayama, Itsumi Saito",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.5715/jnlp.31.300"
    },
    {
        "id": 21451,
        "title": "News Signals: An NLP Library for Text and Time Series",
        "authors": "Chris Hokamp, Demian Ghalandari, Parsa Ghaffari",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.21"
    },
    {
        "id": 21452,
        "title": "Robot Control for Simultaneous Impact Tasks through Time-Invariant Reference Spreading",
        "authors": "Jari J. van Steen, Nathan van de Wouw, Alessandro Saccon",
        "published": "2023-5-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.23919/acc55779.2023.10156028"
    },
    {
        "id": 21453,
        "title": "Do not Trust the Experts: How the Lack of Standard Complicates NLP for Historical Irish",
        "authors": "Oksana Dereza, Theodorus Fransen, John P. Mccrae",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.10"
    },
    {
        "id": 21454,
        "title": "Summary Cycles: Exploring the Impact of Prompt Engineering on Large Language Models’ Interaction with Interaction Log Information",
        "authors": "Jeremy Block, Yu-Peng Chen, Abhilash Budharapu, Lisa Anthony, Bonnie Dorr",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.eval4nlp-1.7"
    },
    {
        "id": 21455,
        "title": "Explainability in NLP model: Detection of Covid-19 Twitter Fake News",
        "authors": "Wan Yit Yong, Rajesh Jaiswal, Fernando Perez Tellez",
        "published": "2023-12-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3633083.3633212"
    },
    {
        "id": 21456,
        "title": "Optimal siting for different level of DG penetration and Its Impact on Radial Distribution system under different voltage-dependent load Model",
        "authors": "",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.20508/ijrer.v13i1.13701.g8705"
    },
    {
        "id": 21457,
        "title": "Mediation Model of Social Media Usage within Organizations and its Impact on Employees during the Covid-19 Pandemic",
        "authors": "",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.54663/2182-9306.2023.v11.n21.27-47"
    },
    {
        "id": 21458,
        "title": "ESTABLISHMENT AND DEVELOPMENT OF THE NETWORK PLATFORM MODEL IN CHINA AND ITS IMPACT ON THE FORMATION OF THE DIGITAL ECONOMY",
        "authors": "Mykyta Slyusar",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.32782/hst-2023-14-91-19"
    },
    {
        "id": 21459,
        "title": "A simple mathematical model of cyclic hypoxia and its impact on hypofractionated radiotherapy",
        "authors": "Edward Taylor",
        "published": "2023-3",
        "citations": 1,
        "abstract": "AbstractPurposeThere is evidence that the population of cells that experience fluctuating oxygen levels (“acute,” or, “cyclic” hypoxia) are more radioresistant than chronically hypoxic ones and hence, this population may determine radiotherapy (RT) response, in particular for hypofractionated RT, where reoxygenation may not be as prominent. A considerable effort has been devoted to examining the impact of hypoxia on hypofractionated RT; however, much less attention has been paid to cyclic hypoxia specifically and the role its kinetics may play in determining the efficacy of these treatments. Here, a simple mathematical model of cyclic hypoxia and fractionation effects was worked out to quantify this.MethodsCancer clonogen survival fraction was estimated using the linear quadratic model, modified to account for oxygen enhancement effects. An analytic approximation for oxygen transport away from a random network of capillaries with fluctuating oxygen levels was used to model inter‐fraction tissue oxygen kinetics. The resulting survival fraction formula was used to derive an expression for the iso‐survival biologically effective dose (BED), BEDiso-SF. These were computed for some common extra‐cranial hypofractionated RT regimens.ResultsUsing relevant literature parameter values, inter‐fraction fluctuations in oxygenation were found to result in an added 1–2 logs of clonogen survival fraction in going from five fractions to one for the same nominal BED (i.e., excluding the effects of oxygen levels on radiosensitivity). BEDiso-SF's for most ultra‐hypofractionated (five or fewer fractions) regimens in a given tumor site are similar in magnitude, suggesting iso‐efficacy for common fractionation schedules.ConclusionsAlthough significant, the loss of cell‐killing with increasing hypofractionation is not nearly as large as previous estimates based on the assumption of complete reoxygenation between fractions. Most ultra‐hypofractionated regimens currently in place offer sufficiently high doses to counter this loss of cell killing, although care should be taken in implementing single‐fraction regimens.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1002/mp.16200"
    },
    {
        "id": 21460,
        "title": "Structural equation model in exploring urban sprawl and its impact on commuting time in 162 US urbanized areas",
        "authors": "Md Hamidur Rahman, Angela Antipova",
        "published": "2024-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.cities.2024.104855"
    },
    {
        "id": 21461,
        "title": "Business model innovation and its impact on corporate sustainability",
        "authors": "Kaltrina Kajtazi, Gadaf Rexhepi, Arshian Sharif, Ilknur Ozturk",
        "published": "2023-11",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.jbusres.2023.114082"
    },
    {
        "id": 21462,
        "title": "A language model for medical predictive tasks",
        "authors": "Fernando Chirigati",
        "published": "2023-7-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1038/s43588-023-00493-4"
    },
    {
        "id": 21463,
        "title": "BASING THE TASKS OF TECHNOLOGY EDUCATION IN THE CONDITIONS OF NEW DEVELOPMENT OF UZBEKISTAN, THE CONTENT OF ITS EDUCATIONAL MATERIALS",
        "authors": "Avazbayev Atajan Ismailovich,  ",
        "published": "2023-6-1",
        "citations": 0,
        "abstract": "Effective organization of the educational process, in particular, finding the right content of the basics of teaching in technology education, improving them in terms of content, taking into account the aspects related to education in the context of government decisions, the development of science, technology and technology serves to improve the educational process and its organizers.",
        "keywords": "",
        "link": "http://dx.doi.org/10.37547/ijasr-03-06-07"
    },
    {
        "id": 21464,
        "title": "torchdistill Meets Hugging Face Libraries for Reproducible, Coding-Free Deep Learning Studies: A Case Study on NLP",
        "authors": "Yoshitomo Matsubara",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.18"
    },
    {
        "id": 21465,
        "title": "Kani: A Lightweight and Highly Hackable Framework for Building Language Model Applications",
        "authors": "Andrew Zhu, Liam Dugan, Alyssa Hwang, Chris Callison-Burch",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.nlposs-1.8"
    },
    {
        "id": 21466,
        "title": "An Automated Machine Learning NLP Model for Enhancing the Translation of English Causative Sentences into Malayalam Language",
        "authors": "Rony Tom, Juby Mathew",
        "published": "2023-11-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/aicera/icis59538.2023.10419876"
    },
    {
        "id": 21467,
        "title": "Calculation of embodied GHG emissions in early building design stages using BIM and NLP-based semantic model healing",
        "authors": "Kasimir Forth, Jimmy Abualdenien, André Borrmann",
        "published": "2023-4",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.enbuild.2023.112837"
    },
    {
        "id": 21468,
        "title": "Optimised NLP Model for MCQ Generation through Advanced Batching and Tokenization",
        "authors": "S Mahesh Kumar, Sai Srikanth, Shabrish B Hegde",
        "published": "2023-12-31",
        "citations": 0,
        "abstract": "Abstract: This research presents a pioneering methodology forenhancing Natural Language Processing (NLP) models through optimized Word Sense Disambiguation (WSD) and Multiple- Choice Question (MCQ) generation. By employing innovative strategies in batching and tokenization, this study revolutionizes the efficiency and accuracy of NLP tasks. This approach entails meticulous optimization of tokenization processes and concurrent batch operations, resulting in substantial computational efficien- cies without compromising the precision of WSD and MCQ generation. The proposed framework sets a new standard in NLP, offering robust enhancements in computational efficacy andlanguage comprehension tasks",
        "keywords": "",
        "link": "http://dx.doi.org/10.22214/ijraset.2023.57368"
    },
    {
        "id": 21469,
        "title": "Effect of choosing a variogram model to predict salinity and its impact on the environment and geotechnical structures",
        "authors": "Ahmed Seddiki, Salim Dehimi",
        "published": "2023-1-12",
        "citations": 0,
        "abstract": "Various disciplines, engineering, humanities, and other sciences require interpolating many parameters. Geostatistics, with its structural analysis step, is widely used for this purpose. Variography is the valuable step used to assess the correlation and dependence of the data. However, the wrong choice of the variogram model encounter all the predictive attended results. This article illustrates how the use of inappropriate variogram models can seriously conduct to a misleading of predicted results for such analysis. The influence of the selection of the semi-variogram model is highlighted and illustrated by thematic maps developed using three different models (Gaussian, spherical and exponential). To avoid such a drawback, a methodical approach to select the most suitable model, based on the calculation and analysis of the mean error (ME), the mean square error (MSE), the root of the square error mean (REQM), mean standard error (ESM) and root of mean standard error (REQSM), is proposed in the present research study. Such contribution could reduce the negative effects of the choice of variogram model on the interpolation operation using the kriging technique.",
        "keywords": "",
        "link": "http://dx.doi.org/10.47577/tssj.v39i1.8314"
    },
    {
        "id": 21470,
        "title": "Cross-Channel Integration and its Impact on Customers’ Behavioral Intentions: A Serial Mediation Model",
        "authors": "Chetan Srivastava, Raja Debashis",
        "published": "2024-2-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.62206/sajm.30.4.2023.123-149"
    },
    {
        "id": 21471,
        "title": "Automating Code-Related Tasks Through Transformers: The Impact of Pre-training",
        "authors": "Rosalia Tufano, Luca Pascarella, Gabriele Bavota",
        "published": "2023-5",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icse48619.2023.00203"
    },
    {
        "id": 21472,
        "title": "The State of the Art of Natural Language Processing—A Systematic Automated Review of NLP Literature Using NLP Techniques",
        "authors": "Jan Sawicki, Maria Ganzha, Marcin Paprzycki",
        "published": "2023-8-1",
        "citations": 0,
        "abstract": "ABSTRACT\nNowadays, natural language processing (NLP) is one of the most popular areas of, broadly understood, artificial intelligence. Therefore, every day, new research contributions are posted, for instance, to the arXiv repository. Hence, it is rather difficult to capture the current “state of the field” and thus, to enter it. This brought the id-art NLP techniques to analyse the NLP-focused literature. As a result, (1) meta-level knowledge, concerning the current state of NLP has been captured, and (2) a guide to use of basic NLP tools is provided. It should be noted that all the tools and the dataset described in this contribution are publicly available. Furthermore, the originality of this review lies in its full automation. This allows easy reproducibility and continuation and updating of this research in the future as new researches emerge in the field of NLP.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1162/dint_a_00213"
    },
    {
        "id": 21473,
        "title": "Strengthening Relationships Between Indigenous Communities, Documentary Linguists, and Computational Linguists in the Era of NLP-Assisted Language Revitalization",
        "authors": "Darren Flavelle, Jordan Lachler",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.c3nlp-1.4"
    },
    {
        "id": 21474,
        "title": "Missing Information, Unresponsive Authors, Experimental Flaws: The Impossibility of Assessing the Reproducibility of Previous Human Evaluations in NLP",
        "authors": "Anya Belz, Craig Thomson, Ehud Reiter",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.insights-1.1"
    },
    {
        "id": 21475,
        "title": "A Validation of the Effectiveness of NLP Self Growth Program",
        "authors": "Jeongbeom Kang, Songhee Han",
        "published": "2023-4-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.22143/hss21.14.2.193"
    },
    {
        "id": 21476,
        "title": "A dynamic model of lexical experience for tracking of oral reading fluency",
        "authors": "Beata Beigman Klebanov, Michael Suhan, Zuowei Wang, Tenaha O’reilly",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bea-1.48"
    },
    {
        "id": 21477,
        "title": "Improving NLP Accuracy with Stack-Propagation and Knowledge Distillation: A Joint Model for Intent Detection and Slot Filling",
        "authors": "Yuan Wang, Zhoumeng Yang, Xiyan Zhang",
        "published": "2023-4-13",
        "citations": 0,
        "abstract": " Intent detection and slot filling are fundamental tasks in Natural Language Understanding (NLU), constituting important components of intelligent question-answering systems. These tasks are closely interrelated, forming a core aspect of semantic understanding in natural language processing. In this paper, we propose an architecture using Stack-Propagation to improve the accuracy of NLU tasks. In stack propagation, we use a joint model that mainly incorporates token-level intent detection data with sentence word vectors as input for slot filling to capture intent semantic knowledge. Additionally, we use knowledge distillation (KD) to improve model efficiency and enhance the correlation between the two tasks. Our proposed framework significantly differs from existing joint models as it directly leverages intent information in the joint model and adopts token-level intent information for slot filling to ease error propagation. Furthermore, our model can explicitly incorporate intent information for slot filling with Stack-Propagation, making the interaction procedure more interpretable, while other models only interact with hidden states implicitly between the two tasks. We experimentally evaluated our model on two publicly available datasets, and the results demonstrate that it achieves state-of-the-art performance and outperforms previous methods by a significant margin, indicating its superiority in addressing the slot-filling and intent detection tasks. In future research, we will combine the stack-propagation frame with the KD module in the Transform model, which can boost our model performance to move forward a single step in the NLU task.",
        "keywords": "",
        "link": "http://dx.doi.org/10.54097/fcis.v3i2.7525"
    },
    {
        "id": 21478,
        "title": "GTMicro—microservice identification approach based on deep NLP transformer model for greenfield developments",
        "authors": "Deepali Bajaj, Urmil Bharti, Isha Gupta, Priya Gupta, Asha Yadav",
        "published": "2024-3-8",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s41870-024-01766-5"
    },
    {
        "id": 21479,
        "title": "Enabling digital transformation and knowledge migration: the impact of NLP, AI, and ML in mobile applications",
        "authors": "P Mah, I Skalna, B Paliwoda, J BANACH",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.29119/1641-3466.2023.184.14"
    },
    {
        "id": 21480,
        "title": "Hypothesizing Multimodal Influence: Assessing the Impact of Textual and Non-Textual Data on Financial Instrument Pricing Using NLP and Generative AI",
        "authors": "Karolina Bolesta, Gabin Taibi, Codruta Mare, Branka Hadji Misheva, Christian Hopp, Joerg Osterrieder",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2139/ssrn.4698153"
    },
    {
        "id": 21481,
        "title": "Impact of integrated writing tasks on thinking and writing skills of Indian ESL learners",
        "authors": "",
        "published": "2023-1-12",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.37074/jalt.2023.6.1.7"
    },
    {
        "id": 21482,
        "title": "An Hierarchical Latent Variable Model Of Synergistic Transformational Leadership Using Pls-Sem And Its Impact On Knowledge Sharing And Sustainability Organization Performance In Private Universities",
        "authors": "",
        "published": "2023-1-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.47750/qas/24.193.41"
    },
    {
        "id": 21483,
        "title": "NLP BASED TEXT SUMMARIZATION USING BART MODEL",
        "authors": "Selvakumar M,  , Sibiharan S, Soundhiri S",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "User interest and response prediction are critical tasks in online advertising, Advertisers may more effectively target their advertising, increase their click-through rates (CTRs), and boost their conversion rates by accurately predicting user interests and behaviors. In recent years, deep learning has developed into a potent tool for predicting consumer interest and response. Deep learning models can accurately predict user interests and responses because they are able to understand complicated patterns from huge quantities of user behavior data. In this study, we suggest a deep learning-based system for online advertising response and interest prediction. Two deep-learning models make up our framework: Thismodel forecasts the likelihood that a user will click on an advertisement. Model for predicting user interest: This model forecasts the likelihood that a user would click on a particular kind of advertising campaign. The models are developed using data from a sizable datasetof user behavior, such as user clicks, ad views, anddemographic data. Compared to conventional approaches, our system has several advantages for predicting user interest and response. First, unlike existing methods, our system can identify Key Words: Deep learning, LST model, user interest prediction, response prediction.",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem26083"
    },
    {
        "id": 21484,
        "title": "LMentry: A Language Model Benchmark of Elementary Language Tasks",
        "authors": "Avia Efrat, Or Honovich, Omer Levy",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.666"
    },
    {
        "id": 21485,
        "title": "Impact of incidental visualizations on primary tasks",
        "authors": "João Moreira, Daniel Mendes, Daniel Gonçalves",
        "published": "2023-10",
        "citations": 0,
        "abstract": " Incidental visualizations are meant to be seen at-a-glance, on-the-go, and during short exposure times. They will always appear side-by-side with an ongoing primary task while providing ancillary information relevant to those tasks. They differ from glanceable visualizations because looking at them is never their major focus, and they differ from ambient visualizations because they are not embedded in the environment, but appear when needed. However, unlike glanceable and ambient visualizations that have been studied in the past, incidental visualizations have yet to be explored in-depth. In particular, it is still not clear what is their impact on the users’ performance of primary tasks. Therefore, we conducted an empirical online between-subjects user study where participants had to play a maze game as their primary task. Their goal was to complete several mazes as quickly as possible to maximize their score. This game was chosen to be a cognitively demanding task, bound to be significantly affected if incidental visualizations have a meaningful impact. At the same time, they had to answer a question that appeared while playing, regarding the path followed so far. Then, for half the participants, an incidental visualization was shown for a short period while playing, containing information useful for answering the question. We analyzed various metrics to understand how the maze performance was impacted by the incidental visualization. Additionally, we aimed to understand if working memory would influence how the maze was played and how visualizations were perceived. We concluded that incidental visualizations of the type used in this study do not disrupt people while they played the maze as their primary task. Furthermore, our results strongly suggested that the information conveyed by the visualization improved their performance in answering the question. Finally, working memory had no impact on the participants’ results. ",
        "keywords": "",
        "link": "http://dx.doi.org/10.1177/14738716231180892"
    },
    {
        "id": 21486,
        "title": "A Model Framework for the Estimation of Animal ‘Suffering’: Its Use in Predicting and Retrospectively Assessing the Impact of Experiments on Animals",
        "authors": "David B. Morton",
        "published": "2023-2-22",
        "citations": 3,
        "abstract": "This paper presents and illustrates, with a working example, a hypothesis for the assessment of ongoing severity before and during an experiment that will enable humane endpoints and intervention points to be applied accurately and reproducibly, as well as helping to implement any national legal severity limits in subacute and chronic animal experiments, e.g., as specified by the competent authority. The underlying assumption of the model framework is that the degree of deviation from normality of specified measurable biological criteria will reflect the level of pain, suffering, distress and lasting harm incurred by or during an experiment. The choice of criteria will normally reflect the impact on an animal and have to be chosen by scientists and those caring for the animals. They will usually include measurements of good health such as temperature, body weight, body condition and behaviour, which vary according to the species, husbandry and experimental protocols and, in some species, unusual parameters such as time of the year (e.g., migrating birds). In animal research legislation, endpoints or severity limits may be specified so that individual animals do not suffer unnecessarily or endure severe pain and distress that is long-lasting (Directive 2010/63/EU, Art.15.2). In addition, the overall severity is estimated and classified as part of the harm: benefit licence assessment. I present a mathematical model to analyse the measurement data to determine the degree of harm (or severity) incurred. The results can be used to initiate alleviative treatment if required or if permitted during the course of an experiment. In addition, any animal determined to have breached the severity classification of a procedure can be humanely killed, treated or withdrawn from the experiment. The system incorporates the flexibility to be used in most animal research work by being tailored to the research, the procedures carried out and the species under investigation. The criteria used to score severity can also be used as additional scientific outcome criteria and for an analysis of the scientific integrity of the project.",
        "keywords": "",
        "link": "http://dx.doi.org/10.3390/ani13050800"
    },
    {
        "id": 21487,
        "title": "Emotional reactivity and its impact on neural circuitry for attention-emotion interaction through regression-based machine learning model",
        "authors": "Raghavendra Prasad, Shashikanta Tarai, Arindam Bit",
        "published": "2024-4-16",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1007/s11571-024-10106-z"
    },
    {
        "id": 21488,
        "title": "How Much do Knowledge Graphs Impact Transformer Models for Extracting Biomedical Events?",
        "authors": "Laura Zanella, Yannick Toussaint",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bionlp-1.12"
    },
    {
        "id": 21489,
        "title": "Theoretical model and experimental verification of flexoelectric response of porous plate under impact load and its application as passive and protective impact sensor",
        "authors": "Hengchang Su, Xianhong Meng, Bing Hou, Rui Bao, Li-Hua Shao",
        "published": "2024-5",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.ijimpeng.2024.104929"
    },
    {
        "id": 21490,
        "title": "NLP BASED TEXT SUMMARIZATION USING BART MODEL",
        "authors": "Sangavi N,  , Umamaheswari M, Subasri V",
        "published": "2023-10-1",
        "citations": 0,
        "abstract": "Text summarization plays a major role which can be used to summarize articles, papers, documents, etc. It greatly helps the students, business executives, librarian, teachers and many people in different profiles to quickly get the gist of research papers, latest news, trends in industry, summarize books, articles, etc. Summarizing provides a concise overview of a document which helps us to make better decisions and communicate information more effectively. In this project we are going to implement an nlp based text summarization using bart model and finally deployed using django framework. Bart hugging face transformer model is one of the nlp models. Its  input and output are in the form of sequence. The high- dimensional representation of the input is learnt by the encoder  and then mapped to the decoder. The bart model is first pre- trained on a big text (like book corpus or wikipedia).  Pretraining ensures that the model \"understands the language\" and has a solid foundation from which to learn and how to carry out further tasks. Since it will determine how successfully the model can be trained for tasks like text classification or text summarization, the model's capacity to understand language is more effective. The pre-trained weights and weights in the bart model are fine-tuned on question answering, text summarization, sequence classification, etc. Therefore, using bart model we can able to generate text in both extractive and abstractive way, by which we can get the simpler summarization with the important sentences and also more fluent and accurate summarization by understanding the meaning of the text. Finally, to provide a user-friendly interface, by which the users can easily use the text summarization, the project will be deployed using django framework. It allows us to easily build web applications. Key Words: BART, NLP, summarization, Wikipedia, pretrained",
        "keywords": "",
        "link": "http://dx.doi.org/10.55041/ijsrem26032"
    },
    {
        "id": 21491,
        "title": "The Mediterranean diet as a healthy dietary model and its impact on the immune system and intestinal microbiota",
        "authors": "Patricio Salazar, Adriana Pedreañez",
        "published": "2023-9-20",
        "citations": 0,
        "abstract": "The relationship between nutrition and immunity is very complex, because each phase of the immune response can be affected by the lack of essential nutrients such as vitamins and minerals. In addition, it has been described that the most prevalent non-communicable diseases worldwide, such as metabolic syndrome, diabetes mellitus, cardiovascular diseases and cancer, underlie the activation of inflammatory mechanisms, which can compromise immune functions, often caused or accompanied by alterations in nutritional patterns and intestinal microbiota. In this context, it is clear that diet is a key modulator of the immune system and much interest is emerging in the area of nutrition as a means of treatment and prevention. The Mediterranean diet has been widely described as positively influencing and is proposed not only as a potential tool in the clinical management of different diseases, but also for global health promotion. Therefore, the aim of this review is to address the current knowledge on the regulatory role of the nutritional components present in the Mediterranean diet on the immune system and the intestinal microbiota.",
        "keywords": "",
        "link": "http://dx.doi.org/10.32457/ijmss.v10i3.2242"
    },
    {
        "id": 21492,
        "title": "Nuclear armament and its impact on the security of South Asia \"India and Pakistan as a model",
        "authors": "Mohammad Qasim Hadi",
        "published": "2023-5-11",
        "citations": 0,
        "abstract": "India and Pakistan are one of those countries that sought to possess nuclear weapons in order to be a deterrent factor and achieve the desired balance required from their hearts. Pakistan and neighboring rival India detonated nuclear explosions just days apart in May 1998. Since then, the two South Asian countries have been developing the fastest growing stockpiles of nuclear warheads and missile launch systems. Retired Indian Navy Admiral Arun Prakash noted, “India and Pakistan are perilously close to the point of ever-growing nuclear arsenals. This could turn into an unreasonable race driven by mutual suspicion rather than the actual needs of deterrence and maintenance of stability.” .\r\nNotably, in recent years, the two countries have already tested a wide range of ballistic missiles capable of carrying nuclear warheads, including tactical systems. At the same time, India adopts a policy (not to pre-empt the use of nuclear weapons) at a time when Pakistan was more showcasing its nuclear power. Therefore, we will study in this research the impact of the Indian-Pakistani nuclear armament on the security of South Asia",
        "keywords": "",
        "link": "http://dx.doi.org/10.25130/tjfps.v1i31.42"
    },
    {
        "id": 21493,
        "title": "Model for Coupling Scheme and its Impact on Neurons Behaviour",
        "authors": "Afifurrahman Afifurrahman",
        "published": "2023-6-8",
        "citations": 0,
        "abstract": "Collective oscillations is typical phenomena observed in the systems biology including neurons. Investigating the mechanisms for which it occurs in neural networks evokes a significant interest among neuroscientists. From mathematical point of view, the coupling schemes rule the neuron’s behaviours ranging from microscopic to macroscopic scales. This paper aims to study the impacts of coupling schemes in a minimal network of two fully coupled identical oscillators (e.g., neurons). We proceed with the research by employing the numerical approach and time-series analysis. We consider both Kuramoto-like oscillator and Leaky integrate-and-fire neuron as the objects of study. In the former case, we found the phase of two oscillators are perfectly locked and stable if their frequency are identical, as stated by the main theorem. In the latter case, the membrane potentials of two neurons are perfectly synchronized, characterized by the same firing rate, due to the effect of excitatory delta pulses.",
        "keywords": "",
        "link": "http://dx.doi.org/10.34312/euler.v11i1.19964"
    },
    {
        "id": 21494,
        "title": "A spatial model to understand tuberculosis granuloma formation and its impact on disease progression",
        "authors": "Peng Feng",
        "published": "2024-3-27",
        "citations": 0,
        "abstract": "Abstract\nTuberculosis (TB) is caused by a bacterium called Mycobacterium tuberculosis (Mtb). When Mtb enters inside the pulmonary alveolus, it is phagocytosed by the alveolar macrophages, followed by a cascade of immune responses. This leads to the recruitment and accumulation of additional macrophages and T cells in the pulmonary tissues. A key outcome of this is the formation of granuloma, the hallmark of TB infection. In this paper, we develop a mathematical model of the evolution of granuloma by a system of partial differential equations that is based on the classical Keller–Segel chemotaxis equation. We investigate the effect of different parameters on the formation of granuloma. We present numerical simulation results that illustrate the impact of different parameters. The implication of our result on the disease progression is also discussed.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1515/jncds-2023-0035"
    },
    {
        "id": 21495,
        "title": "Buoyancy-driven natural ventilation: The role of thermal stratification and its impact on model accuracy",
        "authors": "Lup Wai Chew",
        "published": "2023",
        "citations": 1,
        "abstract": "Since the invention of mechanical ventilation systems, natural ventilation has been deemed inferior compared to active systems for ventilation of buildings. The recent COVID-19 pandemic and raising awareness of climate change issues have rekindled the interests in natural ventilation as a sustainable method for ventilation and pollutant removal. Modelling natural ventilation is challenging due to uncontrollable outdoor conditions. Simple models such as the well-mixed air model assume uniform indoor air temperature. However, thermal stratification can induce significant temperature differences in the vertical direction, thereby violating the well-mixed assumption. This study evaluates the performance of the well-mixed model, the two-layer stratification model, and computational fluid dynamics (CFD) models in predicting the indoor air temperature under buoyancy-driven displacement ventilation. Compared to experimental measurements, the well-mixed model significantly overpredicts the indoor air temperature without thermal stratification since it assumes a uniform indoor air temperature. The two-layer stratification model overpredicts the upper layer air temperature and underpredicts the lower layer air temperature. The CFD models can capture the trend of the thermal stratification of a gradual increase in temperature with height. However, the CFD models underpredict the indoor air temperature, possibly due to errors introduced by the assumption of adiabatic indoor surfaces. Since simplified models cannot resolve thermal stratification, high-fidelity models, such as CFD models, should be used to model natural ventilation. Experimental studies of natural ventilation should include measurements of the thermal stratification, as well as the temperatures or heat fluxes on the indoor surfaces so the results can be used to develop and evaluate numerical models.",
        "keywords": "",
        "link": "http://dx.doi.org/10.1051/e3sconf/202339602038"
    },
    {
        "id": 21496,
        "title": "Leveraging Large Language Model as Support for Human Problem Solving: An Exploration of Its Appropriation and Impact",
        "authors": "Qingxiaoyang Zhu, Hao-Chuan Wang",
        "published": "2023-10-14",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1145/3584931.3606965"
    },
    {
        "id": 21497,
        "title": "Friction stir spot welding of A6063S-T5 with composite coated films",
        "authors": "Terumichi MURAKOSHI, Yuki TAKASHIMA, Toshiya SHIBAYANAGI",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.2207/qjjws.41.185"
    },
    {
        "id": 21498,
        "title": "Hierarchical Latent Dynamics Model with Multiple Timescales for Learning Long-Horizon Tasks",
        "authors": "Kentaro Fujii, Shingo Murata",
        "published": "2023-11-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1109/icdl55364.2023.10364442"
    },
    {
        "id": 21499,
        "title": "Transformer-based Hebrew NLP models for Short Answer Scoring in Biology",
        "authors": "Abigail Gurin Schleifer, Beata Beigman Klebanov, Moriah Ariely, Giora Alexandron",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.bea-1.46"
    },
    {
        "id": 21500,
        "title": "Lévy noise with infinite activity and the impact on the dynamic of an SIRS epidemic model",
        "authors": "Sanae El Attouga, Driss Bouggar, Mohamed El Fatini, Astrid Hilbert, Roger Pettersson",
        "published": "2023-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.1016/j.physa.2023.128701"
    },
    {
        "id": 21501,
        "title": "IMPACT OF AGAVE EXTRACT ON ATHEROSCLEROSIS IN RAT MODEL: ASSESSING ITS THERAPEUTIC POTENTIAL, ELUCIDATING ITS MECHANISMS, IMPLICATIONS FOR CARDIOVASCULAR HEALTH, AND ENHANCING TREATMENT OPTIONS",
        "authors": "Ghanwa Amjad, Aneeza Masood, Maria Zahid, Andleeb Zahra, Syed Khalil Ullah, Sania Riaz",
        "published": "2023-11-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.53555/jptcp.v30i18.3561"
    },
    {
        "id": 21502,
        "title": "Walter Burns at SemEval-2023 Task 5: NLP-CIMAT - Leveraging Model Ensembles for Clickbait Spoiling",
        "authors": "Emilio Villa Cueva, Daniel Vallejo Aldana, Fernando Sánchez Vega, Adrián Pastor López Monroy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.95"
    },
    {
        "id": 21503,
        "title": "Identifying and Adapting Transformer-Components Responsible for Gender Bias in an English Language Model",
        "authors": "Abhijith Chintam, Rahel Beloch, Willem Zuidema, Michael Hanna, Oskar van der Wal",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "keywords": "",
        "link": "http://dx.doi.org/10.18653/v1/2023.blackboxnlp-1.29"
    },
    {
        "id": 21504,
        "title": "The Soviet of Commissars of the Baltic Fleet and Its Political Tasks in 1918",
        "authors": "Evgeny A. Leonov",
        "published": "2023-8-25",
        "citations": 0,
        "abstract": "The article examines the activities of the Soviet of Commissars of the Baltic Fleet (SCBF) within the framework of the political tasks that were assigned to it when it was created. In 1918, there was still no full-fl edged centralised ideological work in the Baltic until the appearance of the political departments of the Baltic Fleet in February 1919. Therefore, at that time, this task was partially performed by the SCBF. The article describes the general reasons and conditions for the creation of the SCBF in the context of the political situation in the Baltic Fleet in the spring of 1918. It also analyses the goals and objectives set by the SCBF in the framework of political work with the fl eet personnel and the results of the political activity itself. The article considers both previously published and new material on the issue under consideration.",
        "keywords": "",
        "link": "http://dx.doi.org/10.25807/22225064_2023_75_179"
    }
]