[
    {
        "id": 17171,
        "title": "A study on position control of continuum arm using MAML(Model-Agnostic Meta-Learning) for adapting changing conditions",
        "authors": "Alok Sahoo, pavan chakraborty",
        "published": "No Date",
        "citations": 0,
        "abstract": "Non linear deformation of spring based continuum manipulators cause difficulty in predicting the position of the tip. When we put different tools on the tip for various purposes, the difficulty further increases. Model less control of the manipulator has shown great success in tip positioning of these types of manipulators. One of the major drawbacks of model less control is the requirement of a large data set and time. Hence, this paper studies the effect of the implementation of MAML(Model-Agnostic Meta-Learning) for fast adaptation of different offset conditions. The effects have  been studied in the simulation environment and on the real prototype. The continuum arm used for the experimentation is a tendon based non constant curvature spring based manipulator. An average error of 0.03m has been achieved on the prototype. MAML was successful in bringing down the relative tip positioning error of the manipulator from 7.02% to 1.55% in the simulation environment. It also showed success in bringing down the relative tip positioning error from 11.06% to 4.09% on real prototype. We also studied the effectiveness of the same in trajectory following.",
        "link": "http://dx.doi.org/10.36227/techrxiv.14839671"
    },
    {
        "id": 17172,
        "title": "A study on position control of continuum arm using MAML(Model-Agnostic Meta-Learning) for adapting changing conditions",
        "authors": "Alok Sahoo, pavan chakraborty",
        "published": "No Date",
        "citations": 0,
        "abstract": "Non linear deformation of spring based continuum manipulators cause difficulty in predicting the position of the tip. When we put different tools on the tip for various purposes, the difficulty further increases. Model less control of the manipulator has shown great success in tip positioning of these types of manipulators. One of the major drawbacks of model less control is the requirement of a large data set and time. Hence, this paper studies the effect of the implementation of MAML(Model-Agnostic Meta-Learning) for fast adaptation of different offset conditions. The effects have  been studied in the simulation environment and on the real prototype. The continuum arm used for the experimentation is a tendon based non constant curvature spring based manipulator. An average error of 0.03m has been achieved on the prototype. MAML was successful in bringing down the relative tip positioning error of the manipulator from 7.02% to 1.55% in the simulation environment. It also showed success in bringing down the relative tip positioning error from 11.06% to 4.09% on real prototype. We also studied the effectiveness of the same in trajectory following.",
        "link": "http://dx.doi.org/10.36227/techrxiv.14839671.v1"
    },
    {
        "id": 17173,
        "title": "A Study on Position Control of a Continuum Arm Using MAML (Model-Agnostic Meta-Learning) for Adapting Different Loading Conditions",
        "authors": "Alok Ranjan Sahoo, Pavan Chakraborty",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2022.3147797"
    },
    {
        "id": 17174,
        "title": "BSE-MAML: Model Agnostic Meta-Reinforcement Learning via Bayesian Structured Exploration",
        "authors": "Haonan Wang, Yiyun Zhang, Dawei Feng, Dongsheng Li, Feng Huang",
        "published": "2020-11",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/scc49832.2020.00017"
    },
    {
        "id": 17175,
        "title": "Robust Maml: Prioritization Task Buffer with Adaptive Learning Process for Model-Agnostic Meta-Learning",
        "authors": "Thanh Nguyen, Tung Luu, Trung Pham, Sanzhar Rakhimkul, Chang D. Yoo",
        "published": "2021-6-6",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp39728.2021.9413446"
    },
    {
        "id": 17176,
        "title": "Enhancing Predictions of N2o Emissions During Manure Composting Using Model-Agnostic Meta-Learning (Maml)",
        "authors": "Shuai Shi, Jiaxin Bao, Zhiheng Guo, Yue Han, Yonghui Xu, Ugochi  Uzoamaka Egbeagu, Liyan Zhao, Nana Jiang, Lei Sun, Xinda Liu, Wanying Liu, Nuo Chang, Jining Zhang, Yu Sun, Xiuhong Xu, Song Fu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4625505"
    },
    {
        "id": 17177,
        "title": "Modified Model-Agnostic Meta-Learning",
        "authors": "Aashay Pawar",
        "published": "2020-12-20",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icmlant50963.2020.9355973"
    },
    {
        "id": 17178,
        "title": "A Novel Model Based on Deep Convolutional Generation of Adversarial Networks Using Meta-Learning (MAML-DCGAN)",
        "authors": "Wei Guo, Zhen Chen, Pingli Lu",
        "published": "2023-11-17",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cac59555.2023.10450246"
    },
    {
        "id": 17179,
        "title": "Speaker Code Based Speaker Adaptive Training Using Model Agnostic Meta-Learning",
        "authors": "Huaxin Wu, Genshun Wan, Jia Pan",
        "published": "2020-10-25",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2020-2296"
    },
    {
        "id": 17180,
        "title": "Task-Agnostic Generalized Meta-learning Based on MAML for Few-Shot Bearing Fault Diagnosis",
        "authors": "Xitao Yang, Lijun Zhang, Jinjia Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-46305-1_10"
    },
    {
        "id": 17181,
        "title": "Sparse Model-Agnostic Meta-Learning Algorithm for Few-Shot Learning",
        "authors": "Sibo Gai, Donglin Wang",
        "published": "2019-9",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cchi.2019.8901909"
    },
    {
        "id": 17182,
        "title": "Dynamic Model-Agnostic Meta-Learning for Incremental Few-Shot Learning",
        "authors": "Jansen Keith L. Domoguen, Prospero C. Naval",
        "published": "2022-8-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpr56361.2022.9956522"
    },
    {
        "id": 17183,
        "title": "Few Shot Learning For Point Cloud Data Using Model Agnostic Meta Learning",
        "authors": "Rishi Puri, Avideh Zakhor, Raul Puri",
        "published": "2020-10",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icip40778.2020.9190819"
    },
    {
        "id": 17184,
        "title": "Model Agnostic Semi-Supervised Meta-Learning Elucidates Understudied Out-of-distribution Molecular Interactions",
        "authors": "You Wu, Li Xie, Yang Liu, Lei Xie",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractMany biological problems are understudied due to experimental limitations and human biases. Although deep learning is promising in accelerating scientific discovery, its power compromises when applied to problems with scarcely labeled data and data distribution shifts. We developed a semi-supervised meta learning framework Meta Model Agnostic Pseudo Label Learning (MMAPLE) to address these challenges by effectively exploring out-of-distribution (OOD) unlabeled data when transfer learning fails. The power of MMAPLE is demonstrated in multiple applications: predicting OOD drug-target interactions, hidden human metabolite-enzyme interactions, and understudied interspecies microbiome metabolite-human receptor interactions, where chemicals or proteins in unseen data are dramatically different from those in training data. MMAPLE achieves 11% to 242% improvement in the prediction-recall on multiple OOD benchmarks over baseline models. Using MMAPLE, we reveal novel interspecies metaboliteprotein interactions that are validated by bioactivity assays and fill in missing links in microbiome-human interactions. MMAPLE is a general framework to explore previously unrecognized biological domains beyond the reach of present experimental and computational techniques.",
        "link": "http://dx.doi.org/10.1101/2023.05.17.541172"
    },
    {
        "id": 17185,
        "title": "Adaptive-MAML: Few-shot metal surface defects diagnosis based on model-agnostic meta-learning",
        "authors": "Shanchen Pang, Lin Zhang, Yundong Yuan, Wenshang Zhao, Shudong Wang, Shuang Wang",
        "published": "2023-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.measurement.2023.113612"
    },
    {
        "id": 17186,
        "title": "Domain-Invariant Speaker Vector Projection by Model-Agnostic Meta-Learning",
        "authors": "Jiawen Kang, Ruiqi Liu, Lantian Li, Yunqi Cai, Dong Wang, Thomas Fang Zheng",
        "published": "2020-10-25",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2020-2562"
    },
    {
        "id": 17187,
        "title": "Tripletmaml: A Metric-Based Model-Agnostic Meta-Learning Algorithm for Few-Shot Classification",
        "authors": "AYLA GÜLCÜ, Zeki Kus, İsmail  Taha Samed Özkan, Osman  Furkan Karakuş",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4576776"
    },
    {
        "id": 17188,
        "title": "Speaker Adaptive Training Using Model Agnostic Meta-Learning",
        "authors": "Ondrej Klejch, Joachim Fainberg, Peter Bell, Steve Renals",
        "published": "2019-12",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/asru46091.2019.9003751"
    },
    {
        "id": 17189,
        "title": "Bayesian Model-Agnostic Meta-Learning with Matrix-Valued Kernels for Quality Estimation",
        "authors": "Abiola Obamuyide, Marina Fomicheva, Lucia Specia",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.repl4nlp-1.23"
    },
    {
        "id": 17190,
        "title": "Model-Agnostic Meta-Learning for Relation Classification with Limited Supervision",
        "authors": "Abiola Obamuyide, Andreas Vlachos",
        "published": "2019",
        "citations": 20,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/p19-1589"
    },
    {
        "id": 17191,
        "title": "Meta weight learning via model-agnostic meta-learning",
        "authors": "Zhixiong Xu, Xiliang Chen, Wei Tang, Jun Lai, Lei Cao",
        "published": "2021-4",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.neucom.2020.08.034"
    },
    {
        "id": 17192,
        "title": "Uncertainty in Model-Agnostic Meta-Learning using Variational Inference",
        "authors": "Cuong Nguyen, Thanh-Toan Do, Gustavo Carneiro",
        "published": "2020-3",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wacv45572.2020.9093536"
    },
    {
        "id": 17193,
        "title": "MODEL-AGNOSTIC META-LEARNING FOR RESILIENCE OPTIMIZATION OF ARTIFICIAL INTELLIGENCE SYSTEM",
        "authors": "V. V. Moskalenko",
        "published": "2023-6-30",
        "citations": 1,
        "abstract": "Context. The problem of optimizing the resilience of artificial intelligence systems to destructive disturbances has not yet been fully solved and is quite relevant for safety-critical applications. The task of optimizing the resilience of an artificial intelligence system to disturbing influences is a high-level task in relation to efficiency optimization, which determines the prospects of using the ideas and methods of meta-learning to solve it. The object of current research is the process of meta-learning aimed at optimizing the resilience of an artificial intelligence system to destructive disturbances. The subjects of the study are architectural add-ons and the meta-learning method which optimize resilience to adversarial attacks, fault injection, and task changes.\r\nObjective. Stated research goal is to develop an effective meta-learning method for optimizing the resilience of an artificial intelligence system to destructive disturbances.\r\nMethod. The resilience optimization is implemented by combining the ideas and methods of adversarial learning, fault-tolerant learning, model-agnostic meta-learning, few-shot learning, gradient optimization methods, and probabilistic gradient approximation strategies. The choice of architectural add-ons is based on parameter-efficient knowledge transfer designed to save resources and avoid the problem of catastrophic forgetting.\r\nResults. A model-agnostic meta-learning method for optimizing the resilience of artificial intelligence systems based on gradient meta-updates or meta-updates using an evolutionary strategy has been developed. This method involves the use of tuner and metatuner blocks that perform parallel correction of the building blocks of a original deep neural network. The ability of the proposed approach to increase the efficiency of perturbation absorption and increase the integral resilience indicator of the artificial intelligence system is experimentally tested on the example of the image classification task. The experiments were conducted on a model with the ResNet-18 architecture, with an add-on in the form of tuners and meta-tuners with the Conv-Adapter architecture. In this case, CIFAR-10 is used as a base set on which the model was trained, and CIFAR-100 is used as a set for generating samples on which adaptation is performed using a few-shot learning scenarios. We compare the resilience of the artificial intelligence system after pre-training tuners and meta-tuners using the adversarial learning algorithm, the fault-tolerant learning algorithm, the conventional model-agnostic meta-learning algorithm, and the proposed meta-learning method for optimizing resilience. Also, the meta-learning algorithms with meta-gradient updating and meta-updating based on the evolutionary strategy are compared on the basis of the integral resilience indicator.\r\nConclusions. It has been experimentally confirmed that the proposed method provides a better resilience to random bit-flip injection compared to fault injection training by an average of 5%. Also, the proposed method provides a better resilience to Ladversarial evasion attacks compared to adversarial training by an average of 4.8%. In addition, an average 4.8% increase in the resilience to task changes is demonstrated compared to conventional fine-tuning of tuners. Moreover, meta-learning with an evolutionary strategy provides, on average, higher values of the resilience indicator. On the downside, this meta-learning method requires more iterations.",
        "link": "http://dx.doi.org/10.15588/1607-3274-2023-2-9"
    },
    {
        "id": 17194,
        "title": "Learning to Switch CNNs with Model Agnostic Meta Learning for Fine Precision Visual Servoing",
        "authors": "Prem Raj, Vinay P. Namboodiri, L. Behera",
        "published": "2020-10-24",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iros45743.2020.9341756"
    },
    {
        "id": 17195,
        "title": "GeoAI: A Model-Agnostic Meta-Ensemble Zero-Shot Learning Method for Hyperspectral Image Analysis and Classification",
        "authors": "Konstantinos Demertzis, Lazaros Iliadis",
        "published": "2020-3-7",
        "citations": 22,
        "abstract": "Deep learning architectures are the most effective methods for analyzing and classifying Ultra-Spectral Images (USI). However, effective training of a Deep Learning (DL) gradient classifier aiming to achieve high classification accuracy, is extremely costly and time-consuming. It requires huge datasets with hundreds or thousands of labeled specimens from expert scientists. This research exploits the MAML++ algorithm in order to introduce the Model-Agnostic Meta-Ensemble Zero-shot Learning (MAME-ZsL) approach. The MAME-ZsL overcomes the above difficulties, and it can be used as a powerful model to perform Hyperspectral Image Analysis (HIA). It is a novel optimization-based Meta-Ensemble Learning architecture, following a Zero-shot Learning (ZsL) prototype. To the best of our knowledge it is introduced to the literature for the first time. It facilitates learning of specialized techniques for the extraction of user-mediated representations, in complex Deep Learning architectures. Moreover, it leverages the use of first and second-order derivatives as pre-training methods. It enhances learning of features which do not cause issues of exploding or diminishing gradients; thus, it avoids potential overfitting. Moreover, it significantly reduces computational cost and training time, and it offers an improved training stability, high generalization performance and remarkable classification accuracy.",
        "link": "http://dx.doi.org/10.3390/a13030061"
    },
    {
        "id": 17196,
        "title": "Towards Model-Agnostic Federated Learning over Networks",
        "authors": "Alexander Jung",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>We present a model-agnostic federated learning method for decentralized data with an intrinsic network structure.The network structure reflects similarities between the (statistics of) local datasets and, in turn, their associated local models. Our method is an instance of empirical risk minimization, using a regularization term that is constructed from the network structure of data. In particular, we require well-connected local models, forming clusters, to yield similar predictions on a common test set. In principle our method can be applied to any collection of local models. The only restriction put on these local models is that they allow for efficient implementation of regularized empirical risk minimization (training). Such implementations might be available in the form of high-level programming frameworks such as scikit-learn, Keras or PyTorch.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22058978"
    },
    {
        "id": 17197,
        "title": "Federated Learning for Sleep Stage Classification on Edge Devices via a Model-Agnostic Meta-Learning-Based Pre-Trained Model",
        "authors": "SungHwan Moon, Tae Seong Kim, Jihye Ryu, Won Hee Lee",
        "published": "2023-9-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icce-berlin58801.2023.10375664"
    },
    {
        "id": 17198,
        "title": "Towards Model-Agnostic Federated Learning over Networks",
        "authors": "Alexander Jung",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>We present a model-agnostic federated learning method for decentralized data with an intrinsic network structure.The network structure reflects similarities between the (statistics of) local datasets and, in turn, their associated local models. Our method is an instance of empirical risk minimization, using a regularization term that is constructed from the network structure of data. In particular, we require well-connected local models, forming clusters, to yield similar predictions on a common test set. In principle our method can be applied to any collection of local models. The only restriction put on these local models is that they allow for efficient implementation of regularized empirical risk minimization (training). Such implementations might be available in the form of high-level programming frameworks such as scikit-learn, Keras or PyTorch.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.22058978.v1"
    },
    {
        "id": 17199,
        "title": "Few-shot deep model of waste classification based on model agnostic meta-learning",
        "authors": "Bo Feng, Ren Kun, Qingyang Tao, Han Honggui",
        "published": "2021-10-9",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2601132"
    },
    {
        "id": 17200,
        "title": "Cross Domain Adaptation of Crowd Counting with Model-Agnostic Meta-Learning",
        "authors": "Xiaoyu Hou, Jihui Xu, Jinming Wu, Huaiyu Xu",
        "published": "2021-12-17",
        "citations": 3,
        "abstract": "Counting people in crowd scenarios is extensively conducted in drone inspections, video surveillance, and public safety applications. Today, crowd count algorithms with supervised learning have improved significantly, but with a reliance on a large amount of manual annotation. However, in real world scenarios, different photo angles, exposures, location heights, complex backgrounds, and limited annotation data lead to supervised learning methods not working satisfactorily, plus many of them suffer from overfitting problems. To address the above issues, we focus on training synthetic crowd data and investigate how to transfer information to real-world datasets while reducing the need for manual annotation. CNN-based crowd-counting algorithms usually consist of feature extraction, density estimation, and count regression. To improve the domain adaptation in feature extraction, we propose an adaptive domain-invariant feature extracting module. Meanwhile, after taking inspiration from recent innovative meta-learning, we present a dynamic-β MAML algorithm to generate a density map in unseen novel scenes and render the density estimation model more universal. Finally, we use a counting map refiner to optimize the coarse density map transformation into a fine density map and then regress the crowd number. Extensive experiments show that our proposed domain adaptation- and model-generalization methods can effectively suppress domain gaps and produce elaborate density maps in cross-domain crowd-counting scenarios. We demonstrate that the proposals in our paper outperform current state-of-the-art techniques.",
        "link": "http://dx.doi.org/10.3390/app112412037"
    },
    {
        "id": 17201,
        "title": "Combining Model-Agnostic Meta-Learning and Transfer Learning for Regression",
        "authors": "Wahyu Fadli Satrya, Ji-Hoon Yun",
        "published": "2023-1-4",
        "citations": 6,
        "abstract": "For cases in which a machine learning model needs to be adapted to a new task, various approaches have been developed, including model-agnostic meta-learning (MAML) and transfer learning. In this paper, we investigate how the differences in the data distributions between the old tasks and the new target task impact performance in regression problems. By performing experiments, we discover that these differences greatly affect the relative performance of different adaptation methods. Based on this observation, we develop ensemble schemes combining multiple adaptation methods that can handle a wide range of data distribution differences between the old and new tasks, thus offering more stable performance for a wide range of tasks. For evaluation, we consider three regression problems of sinusoidal fitting, virtual reality motion prediction, and temperature forecasting. The evaluation results demonstrate that the proposed ensemble schemes achieve the best performance among the considered methods in most cases.",
        "link": "http://dx.doi.org/10.3390/s23020583"
    },
    {
        "id": 17202,
        "title": "Model-Agnostic Meta-Learning for Fault Diagnosis of Industrial Robots",
        "authors": "Yuxin Liu, Chong Chen, Tao Wang, Lianglun Cheng, Jian Qin",
        "published": "2023-8-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icac57885.2023.10275255"
    },
    {
        "id": 17203,
        "title": "Few-Shot Bearing Anomaly Detection via Model-Agnostic Meta-Learning",
        "authors": "Shen Zhang, Fei Ye, Bingnan Wang, Thomas G. Habetler",
        "published": "2020-11-24",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/icems50442.2020.9291099"
    },
    {
        "id": 17204,
        "title": "Crop Disease Recognition Based on Improved Model-Agnostic Meta-Learning",
        "authors": "Xiuli Si, Biao Hong, Yuanhui Hu, Lidong Chu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.32604/cmc.2023.036829"
    },
    {
        "id": 17205,
        "title": "Improving Generalization of Model-Agnostic Meta-Learning by Channel Exchanging",
        "authors": "Ce Zhang, Ruixuan Chen, Yifeng Zeng, Shaolong Ren, Qingshan Cui",
        "published": "2022-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icedcs57360.2022.00110"
    },
    {
        "id": 17206,
        "title": "Combatting out-of-distribution errors using model-agnostic meta-learning for digital pathology",
        "authors": "Freja Fagerblom, Karin Stacke, Jesper Molin",
        "published": "2021-2-15",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2579796"
    },
    {
        "id": 17207,
        "title": "B-Small: A Bayesian Neural Network Approach to Sparse Model-Agnostic Meta-Learning",
        "authors": "Anish Madan, Ranjitha Prasad",
        "published": "2021-6-6",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp39728.2021.9414437"
    },
    {
        "id": 17208,
        "title": "Kronecker-factored Approximate Curvature with adaptive learning rate for optimizing model-agnostic meta-learning",
        "authors": "Ce Zhang, Xiao Yao, Changfeng Shi, Min Gu",
        "published": "2023-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s00530-023-01159-x"
    },
    {
        "id": 17209,
        "title": "Dif-MAML: Decentralized Multi-Agent Meta-Learning",
        "authors": "Mert Kayaalp, Stefan Vlaski, Ali Sayed",
        "published": "2022",
        "citations": 13,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ojsp.2021.3140000"
    },
    {
        "id": 17210,
        "title": "Model-Agnostic Meta-Learning for EEG Motor Imagery Decoding in Brain-Computer-Interfacing",
        "authors": "Denghao Li, Pablo Ortega, Xiaoxi Wei, Aldo Faisal",
        "published": "2021-5-4",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ner49283.2021.9441077"
    },
    {
        "id": 17211,
        "title": "Few-Shot Network Intrusion Detection Based on Model-Agnostic Meta-Learning with L2F Method",
        "authors": "Zhixin Shi, Mengyan Xing, Jing Zhang, B Hao Wu",
        "published": "2023-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wcnc55385.2023.10118898"
    },
    {
        "id": 17212,
        "title": "Suppressed Macrophage Responses in Metastatic Merkel Cell Carcinoma: Mining of Core Expression Features by Meta-Analytic Machine Learning (MAML)",
        "authors": "Hyung Jin Hahn, Sung Young Kim",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.3790452"
    },
    {
        "id": 17213,
        "title": "The Research about Recurrent Model-Agnostic Meta Learning",
        "authors": " Shaodong Chen,  Ziyu Niu",
        "published": "2020-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3103/s1060992x20010075"
    },
    {
        "id": 17214,
        "title": "Model Agnostic Meta Learning for EEG Classification: Multitask Approach",
        "authors": "Muhammad Hanzla Javaid, Irfan Ali Shah, Muhammad Sharjeel Javaid, Usama Bin Irshad, Zahid Halim",
        "published": "2023-5-19",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/globconet56651.2023.10150186"
    },
    {
        "id": 17215,
        "title": "MetaForecast: Harnessing Model-Agnostic Meta-Learning Approach to Predict Key Metrics of Interconnected Network Topologies",
        "authors": "Shruti Jadon, Aryan Jadon",
        "published": "2023-7-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iaict59002.2023.10205730"
    },
    {
        "id": 17216,
        "title": "HetMAML",
        "authors": "Jiayi Chen, Aidong Zhang",
        "published": "2021-10-26",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3459637.3482262"
    },
    {
        "id": 17217,
        "title": "Architecture, Dataset and Model-Scale Agnostic Data-free Meta-Learning",
        "authors": "Zixuan Hu, Li Shen, Zhenyi Wang, Tongliang Liu, Chun Yuan, Dacheng Tao",
        "published": "2023-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr52729.2023.00747"
    },
    {
        "id": 17218,
        "title": "A Compressed Model-Agnostic Meta-Learning Model Based on Pruning for Disease Diagnosis",
        "authors": "Xiangjun Hu, Xiuxiu Ding, Dongpeng Bai, Qingchen Zhang",
        "published": "2023-1-30",
        "citations": 5,
        "abstract": " Meta-learning has been widely used in medical image analysis. However, it requires a large amount of storage space and computing resources to train and use neural networks, especially model-agnostic meta-learning (MAML) models, making networks difficult to deploy on embedded systems and low-power devices for smart healthcare. Aiming at this problem, we explore to compress a MAML model with pruning methods for disease diagnosis. First, for each task, we find unimportant and redundant connections in MAML for its classification, respectively. Next, we find common unimportant connections for most tasks with intersections. Finally, we prune the common unimportant connections of the initial network. We conduct some experiments to assess the proposed model by comparison with MAML on Omniglot dataset and MiniImagenet dataset. The results show that our method reduces 40% parameters of the raw models, without incurring accuracy loss, demonstrating the potential of the proposed method for disease diagnosis. ",
        "link": "http://dx.doi.org/10.1142/s0218126623500226"
    },
    {
        "id": 17219,
        "title": "Task Agnostic Meta-Learning for Few-Shot Learning",
        "authors": "Muhammad Abdullah Jamal, Guo-Jun Qi",
        "published": "2019-6",
        "citations": 224,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr.2019.01199"
    },
    {
        "id": 17220,
        "title": "NEURAL NETWORK WITH AGNOSTIC META-LEARNING MODEL FOR FACE-AGING RECOGNITION",
        "authors": "Rasha Ragheb Atallah, Amirrudin Kamsin, Maizatul Akmar Ismail, Ahmad Sami Al-Shamayleh",
        "published": "2022-1-31",
        "citations": 3,
        "abstract": "Face recognition is one of the most approachable and accessible authentication methods. It is also accepted by users, as it is non-invasive. However, aging results in changes in the texture and shape of a face. Hence, age is one of the factors that decreases the accuracy of face recognition. Face aging, or age progression, is thus a significant challenge in face recognition methods. This paper presents the use of artificial neural network with model-agnostic meta-learning (ANN-MAML) for face-aging recognition. Model-agnostic meta-learning (MAML) is a meta-learning method used to train a model using parameters obtained from identical tasks with certain updates. This study aims to design and model a framework to recognize face aging based on artificial neural network. In addition, the face-aging recognition framework is evaluated against previous frameworks. Furthermore, the performance and the accuracy of ANN-MAML was evaluated using the CALFW (Cross-Age LFW) dataset. A comparison with other methods showed superior performance by ANN-MAML.",
        "link": "http://dx.doi.org/10.22452/mjcs.vol35no1.4"
    },
    {
        "id": 17221,
        "title": "Multi-Agent Chronological Planning with Model-Agnostic Meta Reinforcement Learning",
        "authors": "Cong Hu, Kai Xu, Zhengqiu Zhu, Long Qin, Quanjun Yin",
        "published": "2023-8-11",
        "citations": 0,
        "abstract": "In this study, we propose an innovative approach to address a chronological planning problem involving the multiple agents required to complete tasks under precedence constraints. We model this problem as a stochastic game and solve it with multi-agent reinforcement learning algorithms. However, these algorithms necessitate relearning from scratch when confronted with changes in the chronological order of tasks, resulting in distinct stochastic games and consuming a substantial amount of time. To overcome this challenge, we present a novel framework that incorporates meta-learning into a multi-agent reinforcement learning algorithm. This approach enables the extraction of meta-parameters from past experiences, facilitating rapid adaptation to new tasks with altered chronological orders and circumventing the time-intensive nature of reinforcement learning. Then, the proposed framework is demonstrated through the implementation of a method named Reptile-MADDPG. The performance of the pre-trained model is evaluated using average rewards before and after fine-tuning. Our method, in two testing tasks, improves the average rewards from −44 to −37 through 10,000 steps of fine-tuning in two testing tasks, significantly surpassing the two baseline methods that only attained −51 and −44, respectively. The experimental results demonstrate the superior generalization capabilities of our method across various tasks, thus constituting a significant contribution towards the design of intelligent unmanned systems.",
        "link": "http://dx.doi.org/10.3390/app13169174"
    },
    {
        "id": 17222,
        "title": "Novel Cross-Domain Fault Diagnosis Method Based on Model-Agnostic Meta-Learning Embedded in Adaptive Threshold Network",
        "authors": "Chenglong Ye, Jinxi Wang, Chang Peng, Zengye Ju, Xiangyi Geng, Lei Zhang, Qingmei Sui, Mingshun Jiang, Faye Zhang",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4425775"
    },
    {
        "id": 17223,
        "title": "Evo-MAML: Meta-Learning with Evolving Gradient",
        "authors": "Jiaxing Chen, Weilin Yuan, Shaofei Chen, Zhenzhen Hu, Peng Li",
        "published": "2023-9-13",
        "citations": 2,
        "abstract": "How to rapidly adapt to new tasks and improve model generalization through few-shot learning remains a significant challenge in meta-learning. Model-Agnostic Meta-Learning (MAML) has become a powerful approach, with offers a simple framework with excellent generality. However, the requirement to compute second-order derivatives and retain a lengthy calculation graph poses considerable computational and memory burdens, limiting the practicality of MAML. To address this issue, we propose Evolving MAML (Evo-MAML), an optimization-based meta-learning method that incorporates evolving gradient within the inner loop. Evo-MAML avoids the second-order information, resulting in reduced computational complexity. Experimental results show that Evo-MAML exhibits higher generality and competitive performance when compared to existing first-order approximation approaches, making it suitable for both few-shot learning and meta-reinforcement learning settings.",
        "link": "http://dx.doi.org/10.3390/electronics12183865"
    },
    {
        "id": 17224,
        "title": "Model-agnostic multi-stage loss optimization meta learning",
        "authors": "Xiao Yao, Jianlong Zhu, Guanying Huo, Ning Xu, Xiaofeng Liu, Ce Zhang",
        "published": "2021-8",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s13042-021-01316-6"
    },
    {
        "id": 17225,
        "title": "A Design and Implementation of Bangla Next Word Predictor Based on Personalized Federated Learning Leveraging Model Agnostic Meta Learning and Semantic Analysis",
        "authors": "Mahfuzzur Rahman, Mahima Rabbi, Annajiat Alim Rasel, Md Tanzim Reza",
        "published": "2022-10-12",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iemcon56893.2022.9946584"
    },
    {
        "id": 17226,
        "title": "Attack-Model-Agnostic Defense Against Model Poisonings in Distributed Learning",
        "authors": "Hairuo Xu, Tao Shu",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartworld-uic-atc-scalcom-digitaltwin-pricomp-metaverse56740.2022.00354"
    },
    {
        "id": 17227,
        "title": "One-step model agnostic meta-learning using two-phase switching optimization strategy",
        "authors": "Saad Mahmud, King Hann Lim",
        "published": "2022-8",
        "citations": 6,
        "abstract": "AbstractConventional training mechanisms often encounter limited classification performance due to the need of large training samples. To counter such an issue, the field of meta-learning has shown great potential in fine tuning and generalizing to new tasks using mini dataset. As a variant derived from the concept of Model Agnostic Meta-Learning (MAML), an one-step MAML incorporated with the two-phase switching optimization strategy is proposed in this paper to improve performance using less iterations. One-step MAML uses two loops to conduct the training, known as the inner and the outer loop. During the inner loop, gradient update is performed only once per task. At the outer loop, gradient is updated based on losses accumulated by the evaluation set during each inner loop. Several experiments using the BERT-Tiny model are conducted to analyze and compare the performance of the one-step MAML with five benchmark datasets. The performance of evaluation shows that the best loss and accuracy can be achieved using one-step MAML that is coupled with the two-phase switching optimizer. It is also observed that this combination reaches its peak accuracy with the fewest number of steps.",
        "link": "http://dx.doi.org/10.1007/s00521-022-07160-1"
    },
    {
        "id": 17228,
        "title": "Few-Shot Bearing Fault Diagnosis Based on Model-Agnostic Meta-Learning",
        "authors": "Shen Zhang, Fei Ye, Bingnan Wang, Thomas Habetler",
        "published": "2021-9",
        "citations": 48,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tia.2021.3091958"
    },
    {
        "id": 17229,
        "title": "Personalized Meta-Learning for Domain Agnostic Learning from Demonstration",
        "authors": "Mariah L. Schrum, Erin Hedlund-Botti, Matthew C. Gombolay",
        "published": "2022-3-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/hri53351.2022.9889377"
    },
    {
        "id": 17230,
        "title": "COVID-19 diagnosis using model agnostic meta-learning on limited chest X-ray images",
        "authors": "Tarun Naren, Yuanda Zhu, May Dongmei Wang",
        "published": "2021-8",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3459930.3469517"
    },
    {
        "id": 17231,
        "title": "Model-Agnostic Meta-Learning Techniques: A State-of-The-Art Short Review",
        "authors": "Aikaterini I. Griva, Achilles D. Boursianis, Lazaros A. Iliadis, Panagiotis Sarigiannidis, George Karagiannidis, Sotirios K. Goudos",
        "published": "2023-6-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/mocast57943.2023.10176893"
    },
    {
        "id": 17232,
        "title": "A Task-Adaptive Parameter Transformation Scheme for Model-Agnostic-Meta-Learning-Based Few-Shot Animal Sound Classification",
        "authors": "Jaeuk Moon, Eunbeen Kim, Junha Hwang, Eenjun Hwang",
        "published": "2024-1-25",
        "citations": 0,
        "abstract": "Deep learning models that require vast amounts of training data struggle to achieve good animal sound classification (ASC) performance. Among recent few-shot ASC methods to address the data shortage problem regarding animals that are difficult to observe, model-agnostic meta-learning (MAML) has shown new possibilities by encoding common prior knowledge derived from different tasks into the model parameter initialization of target tasks. However, when the knowledge on animal sounds is difficult to generalize due to its diversity, MAML exhibits poor ASC performance due to the static initialization setting. In this paper, we propose a novel task-adaptive parameter transformation scheme called few-shot ASC. TAPT generates transformation variables while learning common knowledge and uses the variables to make parameters specific to the target task. Owing to this transformation, TAPT can reduce overfitting and enhance adaptability, training speed, and performance in heterogeneous tasks compared to MAML. In experiments on two public datasets on the same backbone network, we show that TAPT outperforms the existing few-shot ASC schemes in terms of classification accuracy, and in particular a performance improvement of 20.32% compared to the state-of-the-art scheme. In addition, we show that TAPT is robust to hyperparameters and efficient for training.",
        "link": "http://dx.doi.org/10.3390/app14031025"
    },
    {
        "id": 17233,
        "title": "Few-Shot Class-Adaptive Anomaly Detection with Model-Agnostic Meta-Learning",
        "authors": "Tongtong Feng, Qi Qi, Jingyu Wang, Jianxin Liao",
        "published": "2021-6-21",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/ifipnetworking52078.2021.9472814"
    },
    {
        "id": 17234,
        "title": "Model-Agnostic Framework for Evaluating the Reliability of Meta-Learner Algorithm Suggestions for Unsupervised Anomaly Detection",
        "authors": "Małgorzata Gutowska, Suzanne Little, Andrew McCarren",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4703446"
    },
    {
        "id": 17235,
        "title": "A novel cross-domain fault diagnosis method based on model agnostic meta-learning",
        "authors": "Tianyuan Yang, Tang Tang, Jingwei Wang, Chuanhang Qiu, Ming Chen",
        "published": "2022-8",
        "citations": 18,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.measurement.2022.111564"
    },
    {
        "id": 17236,
        "title": "Model-Agnostic Meta-Learning for Multilingual Hate Speech Detection",
        "authors": "Md Rabiul Awal, Roy Ka-Wei Lee, Eshaan Tanwar, Tanmay Garg, Tanmoy Chakraborty",
        "published": "2024-2",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tcss.2023.3252401"
    },
    {
        "id": 17237,
        "title": "Transferrable Model-Agnostic Meta-learning for Short-Term Household Load Forecasting With Limited Training Data",
        "authors": "Yu He, Fengji Luo, Gianluca Ranzi",
        "published": "2022-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tpwrs.2022.3169389"
    },
    {
        "id": 17238,
        "title": "Micro-Expression Recognition Based on MAML Meta-Learning Algorithm",
        "authors": "Bo Wan, Junjun Dang, Xuanxuan Liu, Qi Wang",
        "published": "2022-12",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/smartworld-uic-atc-scalcom-digitaltwin-pricomp-metaverse56740.2022.00191"
    },
    {
        "id": 17239,
        "title": "A model-agnostic meta-learning fault diagnosis method based on dynamic weighting",
        "authors": "Xingshu Huang, Funa Zhou, Chang Wang, Yi Yang",
        "published": "2023-8-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/syps59767.2023.10268220"
    },
    {
        "id": 17240,
        "title": "DAMSL: Domain Agnostic Meta Score-based Learning",
        "authors": "John Cai, Bill Cai, Shen Sheng Mei",
        "published": "2021-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvprw53098.2021.00292"
    },
    {
        "id": 17241,
        "title": "MAML-SR: Self-adaptive super-resolution networks via multi-scale optimized attention-aware meta-learning",
        "authors": "Debabrata Pal, Shirsha Bose, Deeptej More, Ankit Jha, Biplab Banerjee, Yogananda Jeppu",
        "published": "2023-9",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2023.08.004"
    },
    {
        "id": 17242,
        "title": "A Model-agnostic Approach for Generating Saliency Maps to Explain Inferred Decisions of Deep Learning Models",
        "authors": "Savvas Karatsiolis, Andreas Kamilaris",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011612400003417"
    },
    {
        "id": 17243,
        "title": "Few Shot Scene Classification in Remote Sensing using Meta-Agnostic Machine",
        "authors": "Dalal A. Alajaji, Haikel Alhichri",
        "published": "2020-3",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cdma47397.2020.00019"
    },
    {
        "id": 17244,
        "title": "A Few-Shot-Based Model-Agnostic Meta-Learning for Intrusion Detection in Security of Internet of Things",
        "authors": "Chaomeng Lu, Xufeng Wang, Aimin Yang, Yikai Liu, Ziao Dong",
        "published": "2023-12-15",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/jiot.2023.3283408"
    },
    {
        "id": 17245,
        "title": "Few-Shot HRRP Target Recognition Method Based on Gaussian Deep Belief Network and Model-Agnostic Meta-Learning",
        "authors": "Zuyu Ren, Weidong Jiang, Xinyu Zhang",
        "published": "2022-7-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsip55141.2022.9887225"
    },
    {
        "id": 17246,
        "title": "Few-shot RUL estimation based on model-agnostic meta-learning",
        "authors": "Yu Mo, Liang Li, Biqing Huang, Xiu Li",
        "published": "2023-6",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10845-022-01929-w"
    },
    {
        "id": 17247,
        "title": "Method Agnostic Model Class Reliance (MAMCR) Explanation of Multiple Machine Learning Models",
        "authors": "Abirami Gunasekaran",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4194128"
    },
    {
        "id": 17248,
        "title": "Model-Agnostic Federated Learning for Privacy-Preserving Systems",
        "authors": "Hussain M. J. Almohri, Layne T. Watson",
        "published": "2023-10-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/secdev56634.2023.00024"
    },
    {
        "id": 17249,
        "title": "Model-based meta-learning approaches",
        "authors": "Lan Zou",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/b978-0-323-89931-4.00006-7"
    },
    {
        "id": 17250,
        "title": "Leveraging Machine Learning and Model-Agnostic Explanations to Understand Automated Diagnosis of Cardiovascular Disease",
        "authors": "Christopher Sun, Jai Sharma, Milind Maiti",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe pervasiveness of cardiovascular disease and physician misdiagnosis creates the need for artificial intelligence models to improve diagnosis accuracy. The study trains machine learning models on publicly available data sets containing simple medical information of patients to diagnose cardiovascular disease. The Multilayer Perceptron (MLP) assembled for this task performed optimally with an F1 score of 0.8968. This prompts the creation of an automated open-source diagnosis tool powered by the MLP. Local Interpretable Model-Agnostic Explanations (LIME) are employed to understand the impact of different features on the model's diagnosis in the form of marginal probabilities. K-Means Clustering segments patients into ten clusters, after which each example is passed through LIME. The resulting histograms depict a complex relationship between feature, cluster, and impact on diagnosis. A series of P-values with contrasting orders of magnitude shows nuances in the MLP's understanding of patients from different clusters. LIME analysis reveals that the most important features for cardiovascular disease diagnosis are fasting blood sugar, type of chest pain, and ST segment slope. Future experiments should replicate this study's LIME methodology on data sets containing more specialized features in order to gain practical medical insights about the different types of cardiovascular disease represented by each cluster. Finally, feature engineering pathways should be explored with consideration of these results to create versatile diagnosis models adaptable to other diseases as well.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1810425/v2"
    },
    {
        "id": 17251,
        "title": "Enhancing Model Agnostic Meta-Learning via Gradient Similarity Loss",
        "authors": "Jae-Ho Tak, Byung-Woo Hong",
        "published": "2024-1-29",
        "citations": 0,
        "abstract": "Artificial intelligence (AI) technology has advanced significantly, now capable of performing tasks previously believed to be exclusive to skilled humans. However, AI models, in contrast to humans who can develop skills with relatively less data, often require substantial amounts of data to emulate human cognitive abilities in specific areas. In situations where adequate pre-training data is not available, meta-learning becomes a crucial method for enhancing generalization. The Model Agnostic Meta-Learning (MAML) algorithm, which employs second-order derivative calculations to fine-tune initial parameters for better starting points, plays a pivotal role in this area. However, the computational demand of this method can be challenging for modern models with a large number of parameters. The concept of the Approximate Hessian Effect is introduced in this context, examining the effectiveness of second-order derivatives in identifying initial parameters conducive to high generalization performance. The study suggests the use of cosine similarity and squared error (L2 loss) as a loss function within the Approximate Hessian Effect framework to modify gradient weights, aiming for more generalizable model parameters. Additionally, an algorithm that relies on first-order calculations is presented, designed to achieve performance levels comparable to MAML. This approach was tested and compared with traditional MAML methods using both the MiniImagenet dataset and a modified MNIST dataset. The results were analyzed to evaluate its efficiency. Compared to previous studies that achieved good performance using only the first derivative, this approach is more efficient because it does not require iterative loops to converge on additional loss functions. Additionally, there is potential for further performance enhancement through hyperparameter tuning.",
        "link": "http://dx.doi.org/10.3390/electronics13030535"
    },
    {
        "id": 17252,
        "title": "CSAC-Net: Fast Adaptive sEMG Recognition through Attention Convolution Network and Model-Agnostic Meta-Learning",
        "authors": "Xinchen Fan, Lancheng Zou, Ziwu Liu, Yanru He, Lian Zou, Ruan Chi",
        "published": "2022-5-11",
        "citations": 3,
        "abstract": "Gesture recognition through surface electromyography (sEMG) provides a new method for the control algorithm of bionic limbs, which is a promising technology in the field of human–computer interaction. However, subject specificity of sEMG along with the offset of the electrode makes it challenging to develop a model that can quickly adapt to new subjects. In view of this, we introduce a new deep neural network called CSAC-Net. Firstly, we extract the time-frequency feature from the raw signal, which contains rich information. Secondly, we design a convolutional neural network supplemented by an attention mechanism for further feature extraction. Additionally, we propose to utilize model-agnostic meta-learning to adapt to new subjects and this learning strategy achieves better results than the state-of-the-art methods. By the basic experiment on CapgMyo and three ablation studies, we demonstrate the advancement of CSAC-Net.",
        "link": "http://dx.doi.org/10.3390/s22103661"
    },
    {
        "id": 17253,
        "title": "Leveraging Machine Learning and Model-Agnostic Explanations to Understand Automated Diagnosis of Cardiovascular Disease",
        "authors": "Christopher Sun, Jai Sharma, Milind Maiti",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe pervasiveness of cardiovascular disease and physician misdiagnosis creates the urgent need for artificial intelligence models to improve diagnosis accuracy. The first objective of this study was to train machine learning models on publicly available data sets containing simple medical information of patients to diagnose cardiovascular disease. The Multilayer Perceptron (MLP) assembled for this task performed optimally with an F1 score of 0.8968. This prompted the creation of an open-source, automated cardiovascular disease diagnosis tool, powered by the MLP. The second objective of this study was to employ a meta-learning methodology called Local Interpretable Model-Agnostic Explanations (LIME) to understand the impact of different features on the model's diagnosis in the form of marginal probabilities. K-Means Clustering was employed to segment the data into ten clusters, after which each data example was passed through LIME. The resulting histograms depict the complex relationship between feature, cluster, and impact on diagnosis. A series of P-values with contrasting orders of magnitude shows the nuances in the MLP's understanding of patients from different clusters. The results of meta-learning analysis reveal that the most important features for cardiovascular disease diagnosis are fasting blood sugar, type of chest pain, and slope of the ST segment on an electrocardiogram. Future experiments should replicate the novel methodology introduced in this study on data sets containing more specialized medical features in order to gain practical medical insights about different types of cardiovascular disease represented by each cluster. Finally, feature engineering pathways should be explored with consideration of these results to create versatile diagnosis models not only for cardiovascular disease, but adaptable to other diseases as well.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-1810425/v1"
    },
    {
        "id": 17254,
        "title": "Towards Model-Agnostic Federated Learning over Networks",
        "authors": "A. Jung, S. Abdurakhmanova, O. Kuznetsova, Y. Sarcheshmehpour",
        "published": "2023-9-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.23919/eusipco58844.2023.10290116"
    },
    {
        "id": 17255,
        "title": "A Model-Agnostic Meta-Baseline Method for Few-Shot Fault Diagnosis of Wind Turbines",
        "authors": "Xiaobo Liu, Wei Teng, Yibing Liu",
        "published": "2022-4-25",
        "citations": 9,
        "abstract": "The technology of fault diagnosis is helpful to improve the reliability of wind turbines, and further reduce the operation and maintenance cost at wind farms. However, in reality, wind turbines are not allowed to operate with faults, so few fault samples could be obtained. With a small amount of training data, traditional fault diagnosis models that need huge samples under a deep learning framework are difficult to maintain with high accuracy and effectiveness. Few-shot learning can effectively solve the problem of overfitting caused by fewer fault samples in model training. In view of model-agnostic meta-learning (MAML), this paper proposes a model for few-shot fault diagnosis of the wind turbines drivetrain, which is named model-agnostic meta-baseline (MAMB). The training data is input to the base classification model for pre-training, then, some data is randomly selected from the training set to form multiple meta-learning tasks that are utilized to train the MAML to finally fine-tune the later layers of the model at a smaller learning rate. The proposed model was analyzed by the small samples of the bearing data from Case Western Reserve University (CWRU) data, the generator bearings, and gearboxes vibration data in wind turbines under randomly changing operating conditions. The results verified that the proposed method was superior in one-shot, five-shot, and ten-shot tasks of wind turbines.",
        "link": "http://dx.doi.org/10.3390/s22093288"
    },
    {
        "id": 17256,
        "title": "Few-shot Classification with First-order Task Agnostic Meta-learning",
        "authors": "Xiaoxiao Yang, Jungang Xu",
        "published": "2022-5-20",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvidliccea56201.2022.9824307"
    },
    {
        "id": 17257,
        "title": "mAML: an automated machine learning pipeline with a microbiome repository for human disease classification",
        "authors": "Fenglong Yang, Quan Zou",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractDue to the concerted efforts to utilize the microbial features to improve disease prediction capabilities, automated machine learning (AutoML) systems designed to get rid of the tediousness in manually performing ML tasks are in great demand. Here we developed mAML, an ML model-building pipeline, which can automatically and rapidly generate optimized and interpretable models for personalized microbial classification tasks in a reproducible way. The pipeline is deployed on a web-based platform and the server is user-friendly, flexible, and has been designed to be scalable according to the specific requirements. This pipeline exhibits high performance for 13 benchmark datasets including both binary and multi-class classification tasks. In addition, to facilitate the application of mAML and expand the human disease-related microbiome learning repository, we developed GMrepo ML repository (GMrepo Microbiome Learning repository) from the GMrepo database. The repository involves 120 microbial classification tasks for 85 human-disease phenotypes referring to 12,429 metagenomic samples and 38,643 amplicon samples. The mAML pipeline and the GMrepo ML repository are expected to be important resources for researches in microbiology and algorithm developments.Database URLhttp://39.100.246.211:8050/Home",
        "link": "http://dx.doi.org/10.1101/2020.02.11.943316"
    },
    {
        "id": 17258,
        "title": "Scenario-Agnostic Zero-Trust Defense with Explainable Threshold Policy: A Meta-Learning Approach",
        "authors": "Yunfei Ge, Tao Li, Quanyan Zhu",
        "published": "2023-5-20",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/infocomwkshps57453.2023.10225816"
    },
    {
        "id": 17259,
        "title": "iTAML: An Incremental Task-Agnostic Meta-learning Approach",
        "authors": "Jathushan Rajasegaran, Salman Khan, Munawar Hayat, Fahad Shahbaz Khan, Mubarak Shah",
        "published": "2020-6",
        "citations": 56,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cvpr42600.2020.01360"
    },
    {
        "id": 17260,
        "title": "Meta-learning with topic-agnostic representations for zero-shot stance detection",
        "authors": "Kyuri Choi, Youngjoong Ko",
        "published": "2023-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/j.patrec.2023.05.006"
    },
    {
        "id": 17261,
        "title": "Model agnostic interpretable machine learning for residential property valuation",
        "authors": "Tugba Gunes",
        "published": "2023-12-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/00396265.2023.2293366"
    },
    {
        "id": 17262,
        "title": "Specific Emitter Identification via Sparse Bayesian Learning Versus Model-Agnostic Meta-Learning",
        "authors": "Boxiang He, Fanggang Wang",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tifs.2023.3287073"
    },
    {
        "id": 17263,
        "title": "Few-Shot HRRP Target Recognition Based on Gramian Angular Field and Model-Agnostic Meta-Learning",
        "authors": "Qi Liu, Xinyu Zhang, Yongxiang Liu, Kai Huo, Weidong Jiang, Xiang Li",
        "published": "2021-10-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icsip52628.2021.9688842"
    },
    {
        "id": 17264,
        "title": "Fault diagnosis of suspension system of high-speed train based on model-agnostic meta-learning",
        "authors": "Funing Yang, Lumei Lv, Chunrong Hua, Libo Xiong, Dawei Dong",
        "published": "2022-10-13",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/phm-yantai55411.2022.9941960"
    },
    {
        "id": 17265,
        "title": "A Novel Fault Diagnosis Method Based on Feature Fusion and Model Agnostic Meta-Learning",
        "authors": "Pin Lyu, Xueqing Li, Wenbing Yu, Liqiao Xia, Chao Liu",
        "published": "2023-8-26",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/case56687.2023.10260347"
    },
    {
        "id": 17266,
        "title": "Meta Learning for Domain Agnostic Soft Prompt",
        "authors": "Ming-Yen Chen, Mahdin Rohmatillah, Ching-Hsien Lee, Jen-Tzung Chien",
        "published": "2023-6-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp49357.2023.10094860"
    },
    {
        "id": 17267,
        "title": "Leveraging Machine Learning and Model-Agnostic Explanations to Understand Automated Diagnosis of Cardiovascular Disease",
        "authors": "Christopher Sun, Jai Sharma, Milind Maiti",
        "published": "No Date",
        "citations": 0,
        "abstract": "The pervasiveness of cardiovascular disease and physician misdiagnosis creates the urgent need for artificial intelligence models to improve diagnosis accuracy. The first objective of this study was to train machine learning models on publicly available data sets containing simple medical information of patients to diagnose cardiovascular disease. The Multilayer Perceptron (MLP) assembled for this task performed optimally with an F1 score of 0.8968. This prompted the creation of an open-source, automated cardiovascular disease diagnosis tool, powered by the MLP. The second objective of this study was to employ a meta-learning methodology called Local Interpretable Model-Agnostic Explanations (LIME) to understand the impact of different features on the model's diagnosis in the form of marginal probabilities. K-Means Clustering was employed to segment the data into ten clusters, after which each data example was passed through LIME. The resulting histograms depict the complex relationship between feature, cluster, and impact on diagnosis. A series of P-values with contrasting orders of magnitude shows the nuances in the MLP's understanding of patients from different clusters. The results of meta-learning analysis reveal that the most important features for cardiovascular disease diagnosis are fasting blood sugar, type of chest pain, and slope of the ST segment on an electrocardiogram. Future experiments should replicate the novel methodology introduced in this study on data sets containing more specialized medical features in order to gain practical medical insights about different types of cardiovascular disease represented by each cluster. Finally, feature engineering pathways should be explored with consideration of these results to create versatile diagnosis models not only for cardiovascular disease, but adaptable to other diseases as well.",
        "link": "http://dx.doi.org/10.20944/preprints202207.0097.v1"
    },
    {
        "id": 17268,
        "title": "Responsible model deployment via model-agnostic uncertainty learning",
        "authors": "Preethi Lahoti, Krishna Gummadi, Gerhard Weikum",
        "published": "2023-3",
        "citations": 1,
        "abstract": "AbstractReliably predicting potential failure risks of machine learning (ML) systems when deployed with production data is a crucial aspect of trustworthy AI. This paper introduces the Risk Advisor, a novel post-hoc meta-learner for estimating failure risks and predictive uncertainties of any already-trained black-box classification model. In addition to providing a risk score, the Risk Advisor decomposes the uncertainty estimates into aleatoric and epistemic uncertainty components, thus giving informative insights into the sources of uncertainty inducing the failures. Consequently, Risk Advisor can distinguish between failures caused by data variability, data shifts and model limitations and provide useful guidance on appropriate risk mitigation actions (e.g., collecting more data to counter data shift). Extensive experiments on various families of black-box classification models and on real-world and synthetic datasets covering common ML failure scenarios show that the Risk Advisor reliably predicts deployment-time failure risks in all the scenarios, and outperforms strong baselines.",
        "link": "http://dx.doi.org/10.1007/s10994-022-06248-y"
    },
    {
        "id": 17269,
        "title": "MAML-SGD:A reliable airline reschedulingalgorithm for small-sample learning based onMAML and SGD",
        "authors": "Zhiyuan Shen, Qinshuai Zhao, Yiyang Liu",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nAirline rescheduling can be used to minimize the number of abnormal flightsduring the flight-plan execution process. This can improve the rate of normalflights and reduce the occurrence of flight delays and their subsequent adverseeffects. Airline rescheduling involves few samples and is also uncontrollable. Thesubjective manual reduction method has low efficiency and does not considerdaily major security and epidemic factors. Traditional machine learning methodsrequire massive data training and testing, and so are not applicable to the relativefew samples available for airline rescheduling. In this study we addressed theseproblems by establishing a set of airline rescheduling indicators by analyzing factors that influence airline rescheduling, and determined the inputs for an airlinerescheduling identification model based on a multilayer perceptron model. TheMAML (model-agnostic meta-learning)-SGD (stochastic gradient descent) airlinerescheduling algorithm was proposed to enable the identification model to learnand classify flights using few samples. By using historical data for GuangzhouBaiyun International Airport from May to September 2021 to train and testthe model, the airline rescheduling accuracy of the model reached 97% usingthis algorithm, which was markedly higher than that achievable using traditionalmachine-learning models such as SVM(support vector machines). Compared withthe identification model that uses an SGD algorithm to iteratively update parameters, this algorithm can maintain the stability of the gradient descent during thetraining and testing processes of the model.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3131203/v1"
    },
    {
        "id": 17270,
        "title": "Few-shot pump anomaly detection via Diff-WRN-based model-agnostic meta-learning strategy",
        "authors": "Fengqian Zou, Shengtian Sang, Ming Jiang, Xiaoming Li, Haifeng Zhang",
        "published": "2023-7",
        "citations": 2,
        "abstract": " As a critical component in agriculture, industry, and the military, pump anomaly detection has recently aroused wide attention, which requires deep and abundant development and application. Researchers emphasize deeper networks that are long vast computational resources despite insufficient training samples prepared. To break through this obstacle above, we propose a few-shot model-agnostic meta-learning strategy (MAMLS) model to mitigate the data scarcity problem. Inspired by the diffusive ordinary differential equations (ODEs) and Wide-Resnet (WRN), we made great strides by connecting diffusion (Diff) mechanism and self-adaptive Lr with MAMLS. We generate two classical synthetic datasets (circle and spiral) to clarify the diffusion algorithm’s capability to enhance the relationships and weaken the noise. The experimental results under synthetic data confirm that accuracy quickly reached 99% after several iterations. In an actual case anomaly detection study on the pumps simulation platform, the proposed Diff-WRN-MAMLS brings substantial advantages in saving hardware resources. Compared to current models, our model achieves 98% accuracy in 9-way 25-shot tasks. In the operating efficiency experiment, our algorithm only consumed 14.37 quality factors. The final experiment with four state-of-the-art model-agnostic meta-learning (MAML)-enhanced methods demonstrates the highest reliable test accuracy in different cases, reaching 98.5, 97.8, and 98.4%, respectively. Results showed that the proposed method will generalize surprisingly well in anomaly detection in future research. ",
        "link": "http://dx.doi.org/10.1177/14759217221132114"
    }
]