[
    {
        "id": 9208,
        "title": "Using BERT and XLNET for the Automatic Short Answer Grading Task",
        "authors": "Hadi Ghavidel, Amal Zouaq, Michel Desmarais",
        "published": "2020",
        "citations": 16,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0009422400580067"
    },
    {
        "id": 9209,
        "title": "ImpactCite: An XLNet-based Solution Enabling Qualitative Citation Impact Analysis Utilizing Sentiment and Intent",
        "authors": "Dominique Mercier, Syed Rizvi, Vikas Rajashekar, Andreas Dengel, Sheraz Ahmed",
        "published": "2021",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010235201590168"
    },
    {
        "id": 9210,
        "title": "Depression Detection in Social Media using XLNet with Topic Distributions",
        "authors": "Wang Gao Wang Gao, Baoping Yang Wang Gao, Yuwei Wang Baoping Yang, Yuan Fang Yuwei Wang",
        "published": "2022-8",
        "citations": 1,
        "abstract": "\n                        <p>Due to the complexity of depressive diseases, detecting depressed users on social media platforms is a challenging task. In recent years, with an increasing number of users of social media sites, this field of re-search has begun to develop rapidly. To improve the detection performance of traditional methods, two challenges need to be overcome. The first challenge is that textual content posted on social media plat-forms suffers from serious data sparseness. The second one is how to effectively use emotions, user in-formation, and behavior characteristics to predict potentially depressed users. In this paper, we propose a novel model called the Topic-enriched Depression Detection Model (TDDM), which combines topic in-formation and user behavior to predict depressed users on social media platforms. TDDM first employs a Conditional Random Field Regularized Topic Model (CRFTM) to extract the topic knowledge of user posts. XLNet is used to encode posts to further expand the semantic features of short texts. Finally, we integrate user behavior features into TDDM to improve the detection performance of the model. The ex-perimental results on a real-world Twitter dataset demonstrate that the proposed model performs better than baseline models in detecting depressed users at both pseudo-document level and user level.</p>\n<p>&nbsp;</p>\n                    ",
        "link": "http://dx.doi.org/10.53106/199115992022083304008"
    },
    {
        "id": 9211,
        "title": "Semantic Resume Evaluation: Leveraging XLnet for Efficient Candidate Screening",
        "authors": "Pratham Mehta, Ninad Mehendale",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4598735"
    },
    {
        "id": 9212,
        "title": "Speech-XLNet: Unsupervised Acoustic Model Pretraining for Self-Attention Networks",
        "authors": "Xingchen Song, Guangsen Wang, Yiheng Huang, Zhiyong Wu, Dan Su, Helen Meng",
        "published": "2020-10-25",
        "citations": 19,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2020-1511"
    },
    {
        "id": 9213,
        "title": "XLNet For Knowledge Graph Completion",
        "authors": "Jie Liu, Xitong Ning, Wansong Zhang",
        "published": "2021-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icekim52309.2021.00146"
    },
    {
        "id": 9214,
        "title": "XSS Attack Detection Methods Based on XLNet and GRU",
        "authors": "Jing Luo, Guoqing Xu",
        "published": "2021-11-4",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/rcae53607.2021.9638820"
    },
    {
        "id": 9215,
        "title": "ELECTRA ve XLNET Modellerini Kullanarak X Verilerinden İntihara Meyilli İçerikleri Tespit Etme",
        "authors": "Tolga Aydın, Muhammet Coşkun Irmak",
        "published": "2023-10-30",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.36287/setsci.6.1.019"
    },
    {
        "id": 9216,
        "title": "Named Entity Recognition Model of Chinese Clinical Electronic Medical Record Based on XLNet-BiLSTM",
        "authors": "Shen Zhou Feng, Su Qian Min, Guo Jing Lei",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nThe recognition of named entities in Chinese clinical electronic medical records is one of the basic tasks to realize smart medical care. Aiming at the insufficient text semantic representation of the traditional word vector model and the inability of the recurrent neural network (RNN) model to solve the problems of long-term dependence, a Chinese clinical electronic medical record named entity recognition model XLNet-BiLSTM-MHA-CRF based on XLNet is proposed. Use the XLNet pre-training language model as the embedding layer to vectorize the medical record text to solve the problem of ambiguity; use the bidirectional long and short-term memory network (BiLSTM) gate control unit to obtain the forward and backward semantic feature information of the sentence; Then input the feature sequence to the multi-head attention layer (multi-head attention, MHA), use MHA to obtain information represented by different subspaces of the feature sequence, enhance the relevance of context semantics and eliminate noise; finally, input the conditional random field CRF to identify the global maximum 优 sequence. The experimental results show that the XLNet-BiLSTM-Attention-CRF model has achieved good results on the CCKS-2017 named entity recognition data set.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-218833/v1"
    },
    {
        "id": 9217,
        "title": "Classification of Censored Tweets in Chinese Language using XLNet",
        "authors": "Shaikh Sahil Ahmed, Anand Kumar M.",
        "published": "2021",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.nlp4if-1.21"
    },
    {
        "id": 9218,
        "title": "Fake News Detection Using XLNet Fine-Tuning Model",
        "authors": "Ashok Kumar J, Tina Esther Trueman, Erik Cambria",
        "published": "2021-11-26",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccica52458.2021.9697269"
    },
    {
        "id": 9219,
        "title": "Analysis of People’s Opinions Based on the Vaccination Procedure and E-Commerce Product Reviews using XLNET Framework",
        "authors": "Mrs RITU PATIDAR patidar, SACHIN PATEL PATEL",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nMany people have been severely affected by the COVID-19 outbreak, which has left them anxious, terrified, and other difficult feelings. Since the introduction of coronavirus vaccinations, people’s emotional spectrum has broadened and become more sophisticated. We want to perceive and interpret their sentiments using deep learning techniques in this work. The most efficient way to convey one’s thoughts and feelings right now is via social media, and using Twitter may help one have a better knowledge of what is popular and what is going through other people’s minds.Analysing and visualisation of data plays a vital role in Data Science; as customers over e-commerce increase, feedback/reviews shared by them increase significantly, and decisions by a new customer to buy a product or not rely on these reviews; reviews might falsely be displayed which may be involving in controlling if any products demand and supply so, reviews analysing and visualisationto understand their genuinely play an important role over e-commerce nowadays. Our primary objective in conducting this study was to understand better the various perspectives held by individuals on the process of vaccination and reviews of products purchased online.The proposed work displayed the way to analyses and visualisation methodologies which give quick and faster grasping of the e-commerce data even with high dimensions, which gives a quicker conceptual understanding of the data.The proposed data was analysed based on various parameters, which gives a wholesome overview of the data, and the relationship of data with various other parameters; all correlation and non-correlation variables were mapped and analysed.The proposed work gives an idea about observations in sentiments over different arguments and which sentiments are related to each parameter; it creates the scope for modelling to extract some decision-making insights from the data to make application areas such as product quality and customer satisfaction efficient based on the results of modelling.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2573405/v1"
    },
    {
        "id": 9220,
        "title": "The performance of improved XLNet on text classification",
        "authors": "Chenglong Wang, Fenglei Zhang",
        "published": "2022-9-7",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2646785"
    },
    {
        "id": 9221,
        "title": "BERT, XLNet or RoBERTa: The Best Transfer Learning Model to Detect Clickbaits",
        "authors": "Praboda Rajapaksha, Reza Farahbakhsh, Noel Crespi",
        "published": "2021",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2021.3128742"
    },
    {
        "id": 9222,
        "title": "Text Classification Using XLNet with Infomap Automatic Labeling Process",
        "authors": "Triana Dewi Salma, Gusti Ayu Putri Saptawati, Yanti Rusmawati",
        "published": "2021-9-29",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaicta53211.2021.9640255"
    },
    {
        "id": 9223,
        "title": "XLNet-Caps: Personality Classification from Textual Posts",
        "authors": "Ying Wang, Jiazhuang Zheng, Qing Li, Chenglong Wang, Hanyun Zhang, Jibing Gong",
        "published": "2021-6-7",
        "citations": 7,
        "abstract": "Personality characteristics represent the behavioral characteristics of a class of people. Social networking sites have a multitude of users, and the text messages generated by them convey a person’s feelings, thoughts, and emotions at a particular time. These social texts indeed record the long-term psychological activities of users, which can be used for research on personality recognition. However, most of the existing deep learning models for multi-label text classification consider long-distance semantics or sequential semantics, but problems such as non-continuous semantics are rarely studied. This paper proposed a deep learning framework that combined XLNet and the capsule network for personality classification (XLNet-Caps) from textual posts. Our personality classification was based on the Big Five personality theory and used the text information generated by the same user at different times. First, we used the XLNet model to extract the emotional features from the text information at each time point, and then, the extracted features were passed through the capsule network to extract the personality features further. Experimental results showed that our model can effectively classify personality and achieve the lowest average prediction error.",
        "link": "http://dx.doi.org/10.3390/electronics10111360"
    },
    {
        "id": 9224,
        "title": "ThaparUni at #SMM4H 2023: Synergistic Ensemble of RoBERTa, XLNet, and ERNIE 2.0 for Enhanced Textual Analysis<sup>1</sup>",
        "authors": "Sharandeep Singh, Jatin Bedi",
        "published": "No Date",
        "citations": 0,
        "abstract": "AbstractThis paper presents the system developed by Team ThaparUni for the Social Media Mining for Health Applications (SMM4H) 2023 Shared Task 4. The task involved binary classification of English Reddit posts, focusing on self-reporting social anxiety disorder (SAD) diagnoses. The final system employed a combination of three models: RoBERTa, ERNIE, and XLNet, and results obtained from all three models were integrated. The results, specifically in the context of mental health-related content analysis on social media platforms, show the possibility and viability of using multiple models in binary classification tasks.",
        "link": "http://dx.doi.org/10.1101/2023.11.10.23298362"
    },
    {
        "id": 9225,
        "title": "Text Mining and Analysis Based on XLNet-BiLSTM Model",
        "authors": "Lingxuan Huang, Jin Hou, Yong Chen, Jie Yi, Jian Hu",
        "published": "2023-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/imbdkm57416.2023.00018"
    },
    {
        "id": 9226,
        "title": "A novel interpretable regularized cnn with a modified xlnet transformer for segmenting and classifying the ovarian cancer",
        "authors": "Vivekanand Aelgani, Dhanalaxmi Vadlakonda",
        "published": "2024-3-6",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-024-18106-1"
    },
    {
        "id": 9227,
        "title": "Comparing BERT and XLNet from the Perspective of Computational Characteristics",
        "authors": "Hailong Li, Jaewan Choi, Sunjung Lee, Jung Ho Ahn",
        "published": "2020-1",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iceic49074.2020.9051081"
    },
    {
        "id": 9228,
        "title": "Identifying Optimism and Pessimism in Twitter Messages Using XLNet and Deep Consensus",
        "authors": "Ali Alshahrani, Meysam Ghaffari, Kobra Amirizirtol, Xiuwen Liu",
        "published": "2020-7",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ijcnn48605.2020.9206948"
    },
    {
        "id": 9229,
        "title": "XLNet Transfer Learning Model for Sentimental Analysis",
        "authors": "C.R. Dhivyaa, K. Nithya, G. Sendooran, R. Sudhakar, K.Sathis Kumar, S.Santhosh Kumar",
        "published": "2023-6-14",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icscss57650.2023.10169445"
    },
    {
        "id": 9230,
        "title": "Roman Urdu Sentiment Analysis Using Pre-trained DistilBERT and XLNet",
        "authors": "Nikhar Azhar, Seemab Latif",
        "published": "2022-3",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/wids-psu54548.2022.00027"
    },
    {
        "id": 9231,
        "title": "Semantic Similarity Detection from text document using XLNet with a DKM-Clustered Bi-LSTM Model",
        "authors": "D. Viji, S. Revathy",
        "published": "2022-10-3",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccnt54827.2022.9984333"
    },
    {
        "id": 9232,
        "title": "Deep Learning For Knowledge Graph Completion With XLNET",
        "authors": "Mengmeng Su, Hongyi Su, Hong Zheng, Bo Yan",
        "published": "2021-7-23",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3480001.3480022"
    },
    {
        "id": 9233,
        "title": "Extractive Summarization and Multiple Choice Question Generation using XLNet",
        "authors": "Dhanamjaya Pochiraju, Abhinav Chakilam, Premchand Betham, Pranav Chimulla, S Govinda Rao",
        "published": "2023-5-17",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iciccs56967.2023.10142220"
    },
    {
        "id": 9234,
        "title": "Named Entity Recognition in XLNet Cyberspace Security Domain Based on Dictionary Embedding",
        "authors": "Danyang Yang, Fangjie Wan, Yonggan Zhang",
        "published": "2022-4-22",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ctisc54888.2022.9849830"
    },
    {
        "id": 9235,
        "title": "Twitter Fake News Detection by Using Xlnet Model",
        "authors": "Senthil Athithan, Savya Sachi, Ajay Kumar Singh, Arpit Jain,  Divya, Yogesh Kumar Sharma",
        "published": "2023-11-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictacs59847.2023.10389975"
    },
    {
        "id": 9236,
        "title": "Exploring Transformers models for Emotion Recognition: a comparision of BERT, DistilBERT, RoBERTa, XLNET and ELECTRA",
        "authors": "Diogo Cortiz",
        "published": "2022-8-26",
        "citations": 14,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3562007.3562051"
    },
    {
        "id": 9237,
        "title": "DEPRESSION DETECTION ON SOCIAL MEDIA TWITTER USING XLNET METHOD",
        "authors": "Fika Apriliani, Warih Maharani",
        "published": "2023-2-25",
        "citations": 0,
        "abstract": "Depression is a serious mental illness. Depression is usually characterized by feelings of sadness, hopelessness, anxiety, restlessness, and even loss of life. However, not everyone who experiences depression can get professional treatment. If depression is left unchecked, it can worsen the mental health conditions experienced by a person. Social media, one of which is the increasingly popular twitter can be utilized to help deal with the problem of undetected mental illness. Based on tweets made by a person twitter social media can be one of the sources to detect depression using the XLNet method. XLNet is one of the NLP (Natural Language Processing) techniques based on machine learning models on text. Based on several tests that have been carried out during the research such as testing various tuning hyper-parameters with different values on the XLNet model, it achieves a good performance value with an average accuracy value of 93.33%.",
        "link": "http://dx.doi.org/10.29100/jipi.v8i1.3345"
    },
    {
        "id": 9238,
        "title": "Xlnet Parallel Hybrid Network Sentiment Analysis Based on Sentiment Word Augmentation",
        "authors": "ZhiZhan Xu, YiKui Liao, SiQi Zhan",
        "published": "2022-4-22",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icccs55155.2022.9845940"
    },
    {
        "id": 9239,
        "title": "Comparison of BERT and XLNet accuracy with classical methods and algorithms in text classification",
        "authors": "Neli Arabadzhieva - Kalcheva, Ivelin Kovachev",
        "published": "2022-6-2",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/bia52594.2022.9831281"
    },
    {
        "id": 9240,
        "title": "Secure file transfer between multiple clients using bidirectional encoder representations from transformers (BERT) algorithm compared with XLnet algorithm",
        "authors": "Janaki Sasidhar, S. Christy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1063/5.0159812"
    },
    {
        "id": 9241,
        "title": "Research on Post Earthquake Public Opinion Analysis Based on XLNet-BiGRU-A Algorithm",
        "authors": "Li Chenxi, Feng Jilin, Huang Meng, Wang Zhonghao",
        "published": "2022-5-6",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ccai55564.2022.9807700"
    },
    {
        "id": 9242,
        "title": "Chinese Cyberbullying Detection Using XLNet and Deep Bi-LSTM Hybrid Model",
        "authors": "Shifeng Chen, Jialin Wang, Ketai He",
        "published": "2024-2-6",
        "citations": 0,
        "abstract": "The popularization of the internet and the widespread use of smartphones have led to a rapid growth in the number of social media users. While information technology has brought convenience to people, it has also given rise to cyberbullying, which has a serious negative impact. The identity of online users is hidden, and due to the lack of supervision and the imperfections of relevant laws and policies, cyberbullying occurs from time to time, bringing serious mental harm and psychological trauma to the victims. The pre-trained language model BERT (Bidirectional Encoder Representations from Transformers) has achieved good results in the field of natural language processing, which can be used for cyberbullying detection. In this research, we construct a variety of traditional machine learning, deep learning and Chinese pre-trained language models as a baseline, and propose a hybrid model based on a variant of BERT: XLNet, and deep Bi-LSTM for Chinese cyberbullying detection. In addition, real cyber bullying remarks are collected to expand the Chinese offensive language dataset COLDATASET. The performance of the proposed model outperforms all baseline models on this dataset, improving 4.29% compared to SVM—the best performing method in traditional machine learning, 1.49% compared to GRU—the best performing method in deep learning, and 1.13% compared to BERT.",
        "link": "http://dx.doi.org/10.3390/info15020093"
    },
    {
        "id": 9243,
        "title": "Multimodal music emotion recognition in Indonesian songs based on CNN-LSTM, XLNet transformers",
        "authors": "Andrew Steven Sams, Amalia Zahra",
        "published": "2023-2-1",
        "citations": 9,
        "abstract": "Music carries emotional information and allows the listener to feel the emotions contained in the music. This study proposes a multimodal music emotion recognition (MER) system using Indonesian song and lyrics data. In the proposed multimodal system, the audio data will use the mel spectrogram feature, and the lyrics feature will be extracted by going through the tokenizing process from XLNet. Convolutional long short term memory network (CNN-LSTM) performs the audio classification task, while XLNet transformers performs the lyrics classification task. The outputs of the two classification tasks are probability weight and actual prediction with the value of positive, neutral, and negative emotions, which are then combined using the stacking ensemble method. The combined output will be trained into an artificial neural network (ANN) model to get the best probability weight output. The multimodal system achieves the best performance with an accuracy of 80.56%. The results showed that the multimodal method of recognizing musical emotions gave better performance than the single modal method. In addition, hyperparameter tuning can affect the performance of multimodal systems.",
        "link": "http://dx.doi.org/10.11591/eei.v12i1.4231"
    },
    {
        "id": 9244,
        "title": "Show Me How To Revise: Improving Lexically Constrained Sentence Generation with XLNet",
        "authors": "Xingwei He, Victor O.K. Li",
        "published": "2021-5-18",
        "citations": 4,
        "abstract": "Lexically constrained sentence generation allows the incorporation of prior knowledge such as lexical constraints into the output. This technique has been applied to machine translation, and dialog response generation. Previous work usually used Markov Chain Monte Carlo (MCMC) sampling to generate lexically constrained sentences, but they randomly determined the position to be edited and the action to be taken, resulting in many invalid refinements. To overcome this challenge, we used a classifier to instruct the MCMC-based models where and how to refine the candidate sentences. First, we developed two methods to create synthetic data on which the pre-trained model is fine-tuned to obtain a reliable classifier. Next, we proposed a two-step approach, “Predict and Revise”, for constrained sentence generation. During the predict step, we leveraged the classifier to compute the learned prior for the candidate sentence. During the revise step, we resorted to MCMC sampling to revise the candidate sentence by conducting a sampled action at a sampled position drawn from the learned prior. We compared our proposed models with many strong baselines on two tasks, generating sentences with lexical constraints and text infilling. Experimental results have demonstrated that our proposed model performs much better than the previous work in terms of sentence fluency and diversity. Our code, pre-trained models and Appendix are available at https://github.com/NLPCode/MCMCXLNet.",
        "link": "http://dx.doi.org/10.1609/aaai.v35i14.17536"
    },
    {
        "id": 9245,
        "title": "A hybrid neural network based on XLNet for rumor detection",
        "authors": "Shunzhi Xiang, Fangmin Dong, Shouzhi Xu",
        "published": "2022-1-21",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icpeca53709.2022.9718824"
    },
    {
        "id": 9246,
        "title": "XLNet-Based Prediction Model for CVSS Metric Values",
        "authors": "Fan Shi, Shaofeng Kai, Jinghua Zheng, Yao Zhong",
        "published": "2022-9-7",
        "citations": 3,
        "abstract": "A plethora of software vulnerabilities are exposed daily, posing a severe threat to the Internet. It is almost impossible for security experts or software developers to deal with all vulnerabilities. Therefore, it is imperative to rapidly assess the severity of the vulnerability to be able to select which one should be given preferential attention. CVSS is now the industry’s de facto evaluation standard, which is calculated with a quantitative formula to measure the severity of a vulnerability. The CVSS formula consists of several metrics related to the vulnerability’s features. Security experts need to determine the values of each metric, which is tedious and time-consuming, therefore hindering the efficiency of severity assessment. To address this problem, in this paper, we propose a method based on a pre-trained model for the prediction of CVSS metric values. More specifically, this method utilizes the XLNet model that is fine-tuned with a self-built corpus to predict the metric values from the vulnerability description text, thus reducing the burden of the assessment procedure. To verify the performance of our method, we compare the XLNet model with other pre-trained models and conventional machine learning techniques. The experimental results show that the method outperforms these models on evaluation metrics, reaching state-of-the-art performance levels.",
        "link": "http://dx.doi.org/10.3390/app12188983"
    },
    {
        "id": 9247,
        "title": "Comparative Analyses of Bert, Roberta, Distilbert, and Xlnet for Text-Based Emotion Recognition",
        "authors": "Acheampong Francisca Adoma, Nunoo-Mensah Henry, Wenyu Chen",
        "published": "2020-12-18",
        "citations": 55,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/iccwamtip51612.2020.9317379"
    },
    {
        "id": 9248,
        "title": "Fusion of XLNet and BiLSTM-TextCNN for Weibo Sentiment Analysis in Spark Big Data Environment",
        "authors": "Aichuan Li, Tian Li",
        "published": "2023-10-9",
        "citations": 0,
        "abstract": "This article proposes a Weibo sentiment analysis method to improve traditional algorithms' analysis efficiency and accuracy. The proposed algorithm uses deep learning in the Spark big data environment. First, the input data are converted into dynamic word vector representations using the Chinese version of the XLNet model. Then, dual-channel feature extraction is performed on the data using TextCNN and BiLSTM. The proposed algorithm uses an attention mechanism to allocate computing resources efficiently and realizes feature fusion and data classification. Comparative experiments are conducted on two public datasets under identical experimental conditions. In the NLPCC2014 and NLPCC2015 datasets, the proposed model improves the precision and F1 metrics by at least 4.26% and 2.64%, respectively. In the weibo_senti_100k dataset, the proposed model improves the precision and F1 metrics by at least 4.66% and 2.69%, respectively. The results indicate that the proposed method has better sentiment analysis and prediction abilities than existing methods.",
        "link": "http://dx.doi.org/10.4018/ijaci.331744"
    },
    {
        "id": 9249,
        "title": "Sentiment analysis of food safety internet public opinion based on XLNet",
        "authors": "Hu Wang, Chaofan Jiang, Changbin Jiang, Di Li",
        "published": "2023-5-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1117/12.2674590"
    },
    {
        "id": 9250,
        "title": "Clinical XLNet: Modeling Sequential Clinical Notes and Predicting Prolonged Mechanical Ventilation",
        "authors": "Kexin Huang, Abhishek Singh, Sitong Chen, Edward Moseley, Chih-Ying Deng, Naomi George, Charolotta Lindvall",
        "published": "2020",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.clinicalnlp-1.11"
    },
    {
        "id": 9251,
        "title": "Combination of GRU and CNN Deep Learning Models for Sentiment Analysis on French Customer Reviews Using XLNet Model",
        "authors": "Nassera Habbat, Houda Anoun, Larbi Hassouni",
        "published": "2023-3-1",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/emr.2022.3208818"
    },
    {
        "id": 9252,
        "title": "DialogXL: All-in-One XLNet for Multi-Party Conversation Emotion Recognition",
        "authors": "Weizhou Shen, Junqing Chen, Xiaojun Quan, Zhixian Xie",
        "published": "2021-5-18",
        "citations": 60,
        "abstract": "This paper presents our pioneering effort for emotion recognition in conversation (ERC) with pre-trained language models. Unlike regular documents, conversational utterances appear alternately from different parties and are usually organized as hierarchical structures in previous work. Such structures are not conducive to the application of pre-trained language models such as XLNet. To address this issue, we propose an all-in-one XLNet model, namely DialogXL, with enhanced memory to store longer historical context and dialog-aware self-attention to deal with the multi-party structures. Specifically, we first modify the recurrence mechanism of XLNet from segment-level to utterance-level in order to better model the conversational data. Second, we introduce dialog-aware self-attention in replacement of the vanilla self-attention in XLNet to capture useful intra- and inter-speaker dependencies. Extensive experiments are conducted on four ERC benchmarks with mainstream models presented for comparison. The experimental results show that the proposed model outperforms the baselines on all the datasets. Several other experiments such as ablation study and error analysis are also conducted and the results confirm the role of the critical modules of DialogXL.",
        "link": "http://dx.doi.org/10.1609/aaai.v35i15.17625"
    },
    {
        "id": 9253,
        "title": "XG-DTA: Drug-Target Affinity Prediction Based on Drug Molecular Graph and Protein Sequence combined with XLNet",
        "authors": "Han Zhou, Xiumin Shi, Yuxiang Wang, Ziyang Wen, Jiaqi Peng",
        "published": "2023-11-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/medai59581.2023.00031"
    },
    {
        "id": 9254,
        "title": "Proposing sentiment analysis model based on BERT and XLNet for movie reviews",
        "authors": "Mian Muhammad Danyal, Sarwar Shah Khan, Muzammil Khan, Subhan Ullah, Faheem Mehmood, Ijaz Ali",
        "published": "2024-1-15",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-024-18156-5"
    },
    {
        "id": 9255,
        "title": "Analysis of people’s opinions based on the vaccination procedure and e-commerce product reviews using XLnet framework",
        "authors": "Ritu Patidar, Sachin Patel",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Many people have been severely affected by the COVID-19 outbreak, which has left them anxious, terrified, and other difficult feelings. Since the introduction of coronavirus vaccinations, people’s emotional spectrum has broadened and become more sophisticated.We want to observe and interpret their sentiments using deep learning techniques in this work. The most efficient way to convey one’s thoughts and feelings right now is via social media, and using Twitter may help one better understand what is popular and what is going through other people’s minds. Analyzing and visualization of data play a vital role in Data Science; as customers over e-commerce increase, feedback/reviews shared by them increase significantly, and decisions by a new customer to buy a product or not rely on these reviews; reviews might falsely be displayed which may be involving in controlling if any products demand and supply so, reviews analyzing and visualizationto understand they are genuinely playing an important role over e-commerce nowadays. Our primary objective in conducting this study was to understand better the various perspectives individuals held on the vaccination process and reviews of products purchased online. As shown by the presented study, analysis and visualization approaches may be used to facilitate rapid and easy comprehension of e-commerce data, despite its high dimensionality.All correlation and non-correlation factors were mapped and examined, providing a comprehensive picture of the proposed data and its connection to other parameters.The proposed work provides an overview of sentiment observations across arguments and the relationships between parameters; it opens the door for modeling to extract some decision-making insights from the data, which can be used to improve the efficiency of application areas like product quality and customer satisfaction.",
        "link": "http://dx.doi.org/10.3233/jifs-230662"
    },
    {
        "id": 9256,
        "title": "Sentence-Level Aspect-Based Sentiment Analysis for Classifying Adverse Drug Reactions (ADRs) Using Hybrid Ontology-XLNet Transfer Learning",
        "authors": "Asmaa Hashem Sweidan, Nashwa El-Bendary, Haytham Al-Feel",
        "published": "2021",
        "citations": 31,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2021.3091394"
    },
    {
        "id": 9257,
        "title": "Sam Miller at SemEval-2023 Task 5: Classification and Type-specific Spoiler Extraction Using XLNET and Other Transformer Models",
        "authors": "Pia Störmer, Tobias Esser, Patrick Thomasius",
        "published": "2023",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.169"
    },
    {
        "id": 9258,
        "title": "Design and Implementation of Web Page Classification Method Based on XLNet Fusing Hierarchical Attention and CNN",
        "authors": "Zhuang Su, Runyuan Sun, Zhifeng Liang",
        "published": "2022-9-23",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3565291.3565300"
    },
    {
        "id": 9259,
        "title": "McRock at SemEval-2022 Task 4: Patronizing and Condescending Language Detection using Multi-Channel CNN, Hybrid LSTM, DistilBERT and XLNet",
        "authors": "Marco Siino, Marco Cascia, Ilenia Tinnirello",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.semeval-1.55"
    },
    {
        "id": 9260,
        "title": "Text-based personality prediction using XLNet",
        "authors": "Ashok Kumar Jayaraman, Gayathri Ananthakrishnan, Tina Esther Trueman, Erik Cambria",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1016/bs.adcom.2023.08.002"
    },
    {
        "id": 9261,
        "title": "Clinical XLNet-based End-to-End Knowledge Discovery on Clinical Text Data using Natural Language Processing",
        "authors": "Naveen S Pagad, Pradeep N, Tulika Chakrabarti, Prasun Chakrabarti, Ahmed A. Elngar, Martin Margala, Mohammad Nami, Neha Sharma, Samuel Frimpong",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nA modern framework for assessing patient histories and conducting clinical research has been developed as the number of clinical narratives evolves. To discover the knowledge from such clinical narratives, clinical entity recognition and relation extraction tasks were performed subsequently in existing approaches, which resulted in error propagation. Therefore, a novel end-to-end clinical knowledge discovery strategy has been proposed in this paper. The clinical XLNet was used as a base model for handling the discrepancy issue. To predict the dependent clinical relation association, the multinomial Naïve Bayes probability function has been incorporated. In order to improve the performance of the proposed strategy, it takes into account entity pairs presented consecutively through the multi-head attention layer. Tests have been conducted using the N2C2 corpus, and the proposed methodology achieves a greater than 20% improvement in accuracy over existing neural network-based and transformer-based methods.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2069629/v2"
    },
    {
        "id": 9262,
        "title": "Clinical XLNet-based End-to-End Knowledge Discovery on Clinical Text Data using Natural Language Processing",
        "authors": "Naveen S Pagad, Pradeep N, Tulika Chakrabarti, Prasun Chakrabarti, Ahmed A. Elngar, Martin Margala, Mohammad Nami, Neha Sharma, Samuel Frimpong",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nA modern framework for assessing patient histories and conducting clinical research has been developed as the number of clinical narratives evolves. To discover the knowledge from such clinical narratives, clinical entity recognition and relation extraction tasks were performed subsequently in existing approaches, which resulted in error propagation. Therefore, a novel end-to-end clinical knowledge discovery strategy has been proposed in this paper. The clinical XLNet was used as a base model for handling the discrepancy issue. To predict the dependent clinical relation association, the multinomial Naïve Bayes probability function has been incorporated. In order to improve the performance of the proposed strategy, it takes into account entity pairs presented consecutively through the multi-head attention layer. Tests have been conducted using the N2C2 corpus, and the proposed methodology achieves a greater than 20% improvement in accuracy over existing neural network-based and transformer-based methods.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2069629/v1"
    },
    {
        "id": 9263,
        "title": "Multilevel Electricity Text Named Entity Classification Based on Enhanced XLNet Algorithm",
        "authors": "Zhihua Cheng, Chunlei Zhou, Ye Du, Wensi Liu, Donghai Xuan, Jingjing Zeng",
        "published": "2023-7-28",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icdsns58469.2023.10245815"
    },
    {
        "id": 9264,
        "title": "Phân Loại Tên Chương Trình Truyền Hình Theo Chủ Đề Phát sóng  Sử Dụng Mô Hình XLNet",
        "authors": "Quang Long Võ, Ngọc Hùng Anh Nguyễn, Minh Sơn Trần, Thu Hà Trần",
        "published": "2022-4-28",
        "citations": 0,
        "abstract": "Bài báo giới thiệu một dịch vụ mới trong truyền hình số dựa trên trải nghiệm thực tế khách hàng khi xem truyền hình. Mục đích chính của khán giả truyền hình là xem nội dung truyền tải về các chủ đề mà minh có nhu cầu. Để tạo điều kiện cho việc chọn lựa nội dung truyền hình muốn xem một cách nhanh chóng, nhóm nghiên cứu đã  đề xuất giải pháp sắp xếp phân loại chương trình truyền hình  theo chủ đề nội dung đang phát của kênh giúp người xem chọn được và xem được chủ đề truyền hình quan tâm, không phải tìm kiếm giữa nhiều kênh đang truyền (số thứ tự kênh ) không có gợi ý về nội dung đang phát trực tiếp. Để phân loại tất cả tên các chương trình phát sóng, bài báo đã ứng dụng mô hình XLNet chuyển đổi giữa các câu văn (sequence-to-sequence Model) để sắp xếp các chương trình này vào một trong năm chủ đề được định nghĩa trước: phim truyện, thời sự, ca nhạc, thể thao, tổng hợp,... Các kênh truyền hình đang phát chương trình có chủ đề được chọn sẽ được hiển thị để người xem có thể nhanh chóng xem được đúng nội dung cần tìm.",
        "link": "http://dx.doi.org/10.54644/jte.69.2022.1146"
    },
    {
        "id": 9265,
        "title": "Text Emotion Recognition Based on XLNet-BiGRU-Att",
        "authors": "Tian Han, Zhu Zhang, Mingyuan Ren, Changchun Dong, Xiaolin Jiang, Quansheng Zhuang",
        "published": "2023-6-16",
        "citations": 0,
        "abstract": "Text emotion recognition (TER) is an important natural language processing (NLP) task which is widely used in human–computer interaction, public opinion analysis, mental health analysis, and social network analysis. In this paper, a deep learning model based on XLNet with bidirectional recurrent unit and attention mechanism (XLNet-BiGRU-Att) is proposed in order to improve TER performance. XLNet is used to build bidirectional language models which can learn contextual information simultaneously, while the bidirectional gated recurrent unit (BiGRU) helps to extract more effective features which can pay attention to current and previous states using hidden layers and the attention mechanism (Att) provides different weights to enhance the ’attention’ paid to important information, thereby improving the quality of word vectors and the accuracy of sentiment analysis model judgments. The proposed model composed of XLNet, BiGRU, and Att improves performance on the whole TER task. Experiments on the Interactive Emotional Dyadic Motion Capture (IEMOCAP) database and the Chinese Academy of Sciences Institute of Automation (CASIA) dataset were carried out to compare XLNet-BiGRU-Att, XLNet, BERT, and BERT-BiLSTM, and the results show that the model proposed in this paper has superior performance compared to the others.",
        "link": "http://dx.doi.org/10.3390/electronics12122704"
    },
    {
        "id": 9266,
        "title": "An Emotion Cause Detection Method Based on XLNet and Contrastive Learning",
        "authors": "Hai Feng Zhang, Cheng Zeng, Peng He",
        "published": "2022-7-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18293/seke2022-093"
    },
    {
        "id": 9267,
        "title": "Analisis Sentimen Masyarakat terhadap Brand Lokal di E-Commerce dengan Pendekatan Deep Learning Menggunakan Metode XLNet",
        "authors": "I Gusti Made Diva Widia Wiartha, I Made Agus Dwi Suarjaya, Ni Kadek Dwi Rusjayanthi",
        "published": "2023-8-24",
        "citations": 0,
        "abstract": "Pertumbuhan perekonomian Indonesia dapat didongkrak dengan meningkatkan minat masyarakat untuk membeli produk brand lokal. Brand awareness, brand image, dan kualitas produk yang baik dapat memengaruhi minat masyarakat dalam membeli produk lokal. Teknologi Big Data dapat dimanfaatkan untuk menganalisis sentimen masyarakat melalui data review produk brand lokal untuk mengetahui citra dan kualitas produk brand lokal. Penelitian yang dilakukan oleh penulis bertujuan untuk mengetahui sentimen masyarakat terhadap brand lokal berdasarkan data review produknya di situs e-commerce Tokopedia, Shopee, Blibli, Bukalapak, Lazada, dan Zalora. Metode yang digunakan pada penelitian yaitu XLNet. Penelitian yang dilakukan oleh penulis memperoleh data review sebanyak 16.663.045 review dengan jumlah data yang telah diproses sebanyak 4.110.012 review serta dataset training sebanyak 11.606 review yang terdiri dari 5803 data review positif dan 5803 data review negatif. Hasil analisis sentimen terhadap produk brand lokal di situs e-commerce menunjukkan bahwa data review positif lebih dominan (87,82%) dibandingkan data review negatif (12,18%) sehingga dapat disimpulkan bahwa masyarakat Indonesia cenderung puas dan menyukai produk brand lokal yang tersedia di e-commerce. Hasil performa metode XLNet menunjukkan nilai accuracy sebesar 95,6%; precision sebesar 95,06%; recall sebesar 96,21%; dan f1-score sebesar 95,63%.",
        "link": "http://dx.doi.org/10.24843/jtrti.2023.v04.i02.p24"
    },
    {
        "id": 9268,
        "title": "Document-level Stance Detection Method for Specific Targets Based on XLNet",
        "authors": "Yuwei Fang, Lei Zhang, Fei Yang, Xiaoming Zhao, Xueqiang Song, Dong Li, Hong Li, Haizhou Wang",
        "published": "2022-4-1",
        "citations": 0,
        "abstract": "Abstract\nSocial media and slef-media platforms are increasingly being used to discuss topics of varying polarities where different people take different stances. As far as we know, most of the current research focuses on short texts. However, there are relatively few studies on how to collect and extract people’s opinions and stances from long texts such as review articles. This paper proposed a target-specific hierarchical attention model based on the XLNet pre-training model, named XLNet-THAN. The attention mechanism and topic embedding are utilized to obtain the semantic representation of the document. After contrast experiments with other popular text classification models, the result shows that the model proposed in this paper can process document-level text well, and achieves great performance in the task of document-level stance detection.",
        "link": "http://dx.doi.org/10.1088/1742-6596/2258/1/012045"
    },
    {
        "id": 9269,
        "title": "A Multimodal Retrieval and Ranking Method for Scientific Documents Based on HFS and XLNet",
        "authors": "Meichao Yan, Yu Wen, Qingxuan Shi, Xuedong Tian",
        "published": "2022-1-4",
        "citations": 0,
        "abstract": "Aiming at the defects of traditional full-text retrieval models in dealing with mathematical expressions, which are special objects different from ordinary texts, a multimodal retrieval and ranking method for scientific documents based on hesitant fuzzy sets (HFS) and XLNet is proposed. This method integrates multimodal information, such as mathematical expression images and context text, as keywords to realize the retrieval of scientific documents. In the image modal, the images of mathematical expressions are recognized, and the hesitancy fuzzy set theory is introduced to calculate the hesitancy fuzzy similarity between mathematical query expressions and the mathematical expressions in candidate scientific documents. Meanwhile, in the text mode, XLNet is used to generate word vectors of the mathematical expression context to obtain the similarity between the query text and the mathematical expression context of the candidate scientific documents. Finally, the multimodal evaluation is integrated, and the hesitation fuzzy set is constructed at the document level to obtain the final scores of the scientific documents and corresponding ranked output. The experimental results show that the recall and precision of this method are 0.774 and 0.663 on the NTCIR dataset, respectively, and the average normalized discounted cumulative gain (NDCG) value of the top-10 ranking results is 0.880 on the Chinese scientific document (CSD) dataset.",
        "link": "http://dx.doi.org/10.1155/2022/5373531"
    },
    {
        "id": 9270,
        "title": "A Study on Sentiment Analysis of Online Course Review Information Based on XLNet-BiGRU",
        "authors": "Jianxin Xiao, Zengzhen Shao, Shuai Han, Zhuangzhuang Li",
        "published": "2022-11",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/itme56794.2022.00081"
    },
    {
        "id": 9271,
        "title": "XLNet-CNN-GRU dual-channel aspect-level review text sentiment classification method",
        "authors": "Di Wu, Ziyu Wang, Weichao Zhao",
        "published": "2024-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11042-023-15026-4"
    },
    {
        "id": 9272,
        "title": "Classification of Helpful and Unhelpful Online Customer Reviews Using XLNet and BERT Variants",
        "authors": "Muhammad Bilal, Muhammad Haseeb Arshad, Muhammad Ramzan",
        "published": "2024",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-9833-3_18"
    },
    {
        "id": 9273,
        "title": "Fine-Tuned XLNet: A Transfer Learning Model for MOOCs Evaluation Using Forum Posts",
        "authors": "Munigadapa Purnachary, T. Adilakshmi",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2746-3_34"
    },
    {
        "id": 9274,
        "title": "Research on Aspect-based Sentiment Analysis Based on XLNet-GCN",
        "authors": "Shenxing Xu, Yangli Jia, Zhenling Zhang, Yuyuan Xiang",
        "published": "2023-10-27",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3633637.3633714"
    },
    {
        "id": 9275,
        "title": "Privacy Policy Classification with XLNet (Short Paper)",
        "authors": "Majd Mustapha, Katsiaryna Krasnashchok, Anas Al Bassit, Sabri Skhiri",
        "published": "2020",
        "citations": 5,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-66172-4_16"
    },
    {
        "id": 9276,
        "title": "Fake News Detection System Using XLNet Model with Topic Distributions: CONSTRAINT@AAAI2021 Shared Task",
        "authors": "Akansha Gautam, V. Venktesh, Sarah Masud",
        "published": "2021",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-73696-5_18"
    },
    {
        "id": 9277,
        "title": "AB-XLNet: Named Entity Recognition Tool for Health Information Technology Standardization",
        "authors": "Kyoungsu Oh, Min Kang, SeoHyun Oh, Do-hyoung Kim, Seok-hwan Kang, Youngho Lee",
        "published": "2022-10-19",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/ictc55196.2022.9952819"
    },
    {
        "id": 9278,
        "title": "Covid-19 Vaccine Sentiment Analysis During Second Wave in India by Transfer Learning Using XLNet",
        "authors": "Anmol Bansal, Seba Susan, Arjun Choudhry, Anubhav Sharma",
        "published": "2022",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-09282-4_37"
    },
    {
        "id": 9279,
        "title": "Multi-Label Classification of Chinese Rural Poverty Governance Texts Based on XLNet and Bi-LSTM Fused Hierarchical Attention Mechanism",
        "authors": "Xin Wang, Leifeng Guo",
        "published": "2023-6-21",
        "citations": 2,
        "abstract": "Hierarchical multi-label text classification (HMTC) is a highly relevant and widely discussed topic in the era of big data, particularly for efficiently classifying extensive amounts of text data. This study proposes the HTMC-PGT framework for poverty governance’s single-path hierarchical multi-label classification problem. The framework simplifies the HMTC problem into training and combination problems of multi-class classifiers in the classifier tree. Each independent classifier in this framework uses an XLNet pretrained model to extract char-level semantic embeddings of text and employs a hierarchical attention mechanism integrated with Bi-LSTM (BiLSTM + HA) to extract semantic embeddings at the document level for classification purposes. Simultaneously, this study proposes that the structure uses transfer learning (TL) between classifiers in the classifier tree. The experimental results show that the proposed XLNet + BiLSTM + HA + FC + TL model achieves micro-P, micro-R, and micro-F1 values of 96.1%, which is 7.5~38.1% higher than those of other baseline models. The HTMC-PGT framework based on XLNet, BiLSTM + HA, and transfer learning (TL) between classifier tree nodes proposed in this study solves the hierarchical multi-label classification problem of poverty governance text (PGT). It provides a new idea for solving the traditional HMTC problem.",
        "link": "http://dx.doi.org/10.3390/app13137377"
    },
    {
        "id": 9280,
        "title": "Low-Resource Neural Machine Translation Using XLNet Pre-training Model",
        "authors": "Nier Wu, Hongxu Hou, Ziyue Guo, Wei Zheng",
        "published": "2021",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-030-86383-8_40"
    },
    {
        "id": 9281,
        "title": "Noise Reduction Learning based on XLNet-CRF for Biomedical Named Entity Recognition",
        "authors": "Zhaoying Chai, Han Jin, Shenghui Shi, Siyan Zhan, Lin Zhuo, Yu Yang, Qi Lian",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/tcbb.2022.3157630"
    },
    {
        "id": 9282,
        "title": "Named Entity Recognition by Using XLNet-BiLSTM-CRF",
        "authors": "Rongen Yan, Xue Jiang, Depeng Dang",
        "published": "2021-10",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11063-021-10547-1"
    },
    {
        "id": 9283,
        "title": "Natural Language Processing (NLP) Techniques for Air Traffic Management Planning",
        "authors": "",
        "published": "2021-8-2",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2021-2322.vid"
    }
]