[
    {
        "id": 11671,
        "title": "Disease Named Entity Recognition (D-NER) Evaluation",
        "authors": "Xie-Yuan Xie",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nNamed Entity Recognition (NER) is a key task in Natural Language Processing (NLP). In medical domain, NER is very important phase in all end-to-end systems. In this paper, we investigate the performance of NER for disease (D-NER). TaggerOne was evaluated on 52 cardiovascular-related clinical case reports against hand annotation for diseases. Different training sets have been used to evaluate the performance of TaggerOne as a famous tool for NER in biomedical domain.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-911654/v1"
    },
    {
        "id": 11672,
        "title": "CRW-NER: Exploiting Multiple Embeddings for Chinese Named Entity Recognition",
        "authors": "Aiguo Chen, Chenglong Yin",
        "published": "2021-5-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaibd51990.2021.9458993"
    },
    {
        "id": 11673,
        "title": "Named Entity Recognition (NER) for Tibetan and Mongolian Newspapers",
        "authors": "Robert Barnett, Christian Faggionato, Marieke Meelen, Sargai Yunshaab, Tsering Samdrup, Nathan Hill, Hildegard Diemberger",
        "published": "No Date",
        "citations": 0,
        "abstract": "Modern Tibetan and Vertical (Traditional) Mongolian are scripts used by c.11m people, mostly within the People’s Republic of China. In terms of publicly available tools for NLP, these languages and their scripts are extremely low-resourced and under-researched. We set out firstly to survey the state of NLP for these languages, and secondly to facilitate research by historians and policy analysts working on Tibetan newspapers. Their primary need is to be able to carry out Named Entity Recognition (NER) in Modern Tibetan, a script which has no word or sentence boundaries and for which no segmenters have been developed. Working on LightTag, an online tagger using character-based modelling, we were able to produce gold-standard training data for NER for use with Modern Tibetan.",
        "link": "http://dx.doi.org/10.33774/coe-2021-xhw9l-v2"
    },
    {
        "id": 11674,
        "title": "Named Entity Recognition (NER) for Hindi",
        "authors": "Prince Rana, Sunil Kumar Gupta, Kamlesh Dutta",
        "published": "2018-7-31",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.26438/ijcse/v6i7.856859"
    },
    {
        "id": 11675,
        "title": "Chinese Medical Named Entity Recognition using CRF-MT-Adapt and NER-MRC",
        "authors": "Hengyi Zheng, Bin Qin, Ming Xu",
        "published": "2021-1",
        "citations": 7,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/cds52072.2021.00068"
    },
    {
        "id": 11676,
        "title": "A Deep Learning Model of Spatial Distance and Named Entity Recognition (SD-NER) for Flood Mark Text Classification",
        "authors": "Robert Szczepanek",
        "published": "2023-3-20",
        "citations": 5,
        "abstract": "Information on historical flood levels can be communicated verbally, in documents, or in the form of flood marks. The latter are the most useful from the point of view of public awareness building and mathematical modeling of floods. Information about flood marks can be found in documents, but nowadays, they are starting to appear more often on the Internet. The only problem is finding them. The aim of the presented work is to create a new model for classifying Internet sources using advanced text analysis (including named entity recognition), deep neural networks, and spatial analysis. As a novelty in models of this type, it was proposed to use a matrix of minimum distances between toponyms (rivers and towns/villages) found in the text. The resulting distance matrix for Poland was published as open data. Each of the methods used is well known, but so far, no one has combined them into one ensemble machine learning model in such a way. The proposed SD-NER model achieved an F1 score of 0.920 for the binary classification task, improving the model without this spatial module by 17%. The proposed model can be successfully implemented after minor modifications for other classification tasks where spatial information about toponyms is important.",
        "link": "http://dx.doi.org/10.3390/w15061197"
    },
    {
        "id": 11677,
        "title": "Extracting flood locations from news media data by the named entity recognition (NER) model to assess urban flood susceptibility",
        "authors": "Shengnan Fu, Heng Lyu, Ze Wang, Xin Hao",
        "published": "No Date",
        "citations": 0,
        "abstract": "Flood susceptibility assessment for identifying flood-prone areas plays a significant role in flood hazard mitigation. Machine learning is an optional assessment method because of its high objectivity and computational efficiency, but how to get enough and accurate information of historical flood locations to train the machine learning models has been a key problem. In recent years, news media data from both news websites and social media authentication accounts has emerged as a promising source for natural science studies. However, the application of news media data in urban flood susceptibility assessment is still inadequate. This study proposed an approach of three tasks to use news media data on this topic. Firstly, flood locations were extracted from news media data based on a named entity recognition (NER) model. Then, a frequency or distance-based data quality control method was employed to improve the representativeness of the extracted flooded locations. Finally, flood conditioning factors with information of historical flood locations were input into a Support Vector Machine (SVM) model for flood susceptibility assessment. We took the central city of Dalian, China, as a case study. The results show that there was no significant difference of a T-test between the distributions of most flood conditioning factors at the flood locations from the news media data and the official planning report. In the obtained flood susceptibility map, the high flood susceptibility areas got a recall of 90% compared with the high flood hazard areas in the planning report. Performing data quality control in the frequency-based method can improve the precision of the flood susceptibility map by up to 5%, while the distance-based method is ineffective. This study provides an example and offers the value of applying new data sources and modern deep learning techniques for urban flood management.&#160;",
        "link": "http://dx.doi.org/10.5194/egusphere-egu23-3286"
    },
    {
        "id": 11678,
        "title": "E-NER — An Annotated Named Entity Recognition Corpus of Legal Text",
        "authors": "Ting Wai Terence Au, Vasileios Lampos, Ingemar Cox",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.nllp-1.22"
    },
    {
        "id": 11679,
        "title": "Research on the Role of Pronunciation laws in Chinese Named Entity Recognition(NER)",
        "authors": "Wei Hu, Wenlong Zhao, Zhimin Yuan",
        "published": "2022-7",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/gcrait55928.2022.00149"
    },
    {
        "id": 11680,
        "title": "SKD-NER: Continual Named Entity Recognition via Span-based Knowledge Distillation with Reinforcement Learning",
        "authors": "Yi Chen, Liang He",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.emnlp-main.413"
    },
    {
        "id": 11681,
        "title": "Split-NER: Named Entity Recognition via Two Question-Answering-based Classifications",
        "authors": "Jatin Arora, Youngja Park",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-short.36"
    },
    {
        "id": 11682,
        "title": "Question Classification of University Admission using Named-Entity Recognition (NER)",
        "authors": "Emny Harna Yossy, Derwin Suhartono, Agung Trisetyarso, Widodo Budiharto",
        "published": "2023-8-31",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icitacee58587.2023.10276823"
    },
    {
        "id": 11683,
        "title": "Using Stanford NER and Illinois NER to Detect Malay Named Entity Recognition",
        "authors": "S. Sulaiman,  , R. Abdul Wahid, S. Sarkawi, N. Omar",
        "published": "2017",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7763/ijcte.2017.v9.1128"
    },
    {
        "id": 11684,
        "title": "Web Scraping Using Summarization and Named Entity Recognition (NER)",
        "authors": "Bhavya Bhardwaj, Syed Ishtiyaq Ahmed, J Jaiharie, R Sorabh Dadhich, M Ganesan",
        "published": "2021-3-19",
        "citations": 10,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icaccs51430.2021.9441888"
    },
    {
        "id": 11685,
        "title": "Ensemble Named Entity Recognition (NER): Evaluating NER Tools in the Identification of Place Names in Historical Corpora",
        "authors": "Miguel Won, Patricia Murrieta-Flores, Bruno Martins",
        "published": "2018-3-9",
        "citations": 27,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.3389/fdigh.2018.00002"
    },
    {
        "id": 11686,
        "title": "AdaK-NER: An Adaptive Top-K Approach for Named Entity Recognition with Incomplete Annotations",
        "authors": "Hongtao Ruan, Liying Zheng, Peixian Hu",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.finnlp-1.26"
    },
    {
        "id": 11687,
        "title": "NER - VLSP 2021: Two Stage Model for Nested Named Entity Recognition",
        "authors": "Quan Chu Quoc, Vi Ngo Van",
        "published": "2022-6-30",
        "citations": 0,
        "abstract": "Named entity recognition (NER) is a widely studied task in natural language processing. Recently, a growing number of studies have focused on the nested NER. The span-based methods consider the named entity recognition as span classification task, can deal with nested entities naturally. But they suffer from class imbalance problem because the number of non-entity spans accounts for the majority of total spans. To address this issue, we propose a two stage model for nested NER. We utilize an entity proposal module to filter an easy non-entity spans for efficient training. In addition, we combine all variants of the model to improve overall accuracy of our system. Our method achieves 1st place on the Vietnamese NER shared task at the 8th International Workshop on Vietnamese Language and Speech Processing (VLSP) with F1-score of 62.71 on the private test dataset. For research purposes, our source code is available at https://github.com/quancq/VLSP2021_NER",
        "link": "http://dx.doi.org/10.25073/2588-1086/vnucsce.368"
    },
    {
        "id": 11688,
        "title": "AISHELL-NER: Named Entity Recognition from Chinese Speech",
        "authors": "Boli Chen, Guangwei Xu, Xiaobin Wang, Pengjun Xie, Meishan Zhang, Fei Huang",
        "published": "2022-5-23",
        "citations": 9,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/icassp43922.2022.9746955"
    },
    {
        "id": 11689,
        "title": "WNUT 2020 Shared Task-1: Conditional Random Field(CRF) based Named Entity Recognition(NER) for Wet Lab Protocols",
        "authors": "Kaushik Acharya",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2020.wnut-1.37"
    },
    {
        "id": 11690,
        "title": "A Feature-Based Model for Nested Named-Entity Recognition at VLSP-2018 NER Evaluation Campaign",
        "authors": "Minh Quang Nhat Pham",
        "published": "2019-1-30",
        "citations": 2,
        "abstract": "In this report, we describe our participant named-entity recognition system at VLSP 2018 evaluation campaign. We formalized the task as a sequence labeling problem using BIO encoding scheme. We applied a feature-based model which combines word, word-shape features, Brown-cluster-based features, and word-embedding-based features. We compare several methods to deal with nested entities in the dataset. We showed that combining tags of entities at all levels for training a sequence labeling model (joint-tag model) improved the accuracy of nested named-entity recognition.",
        "link": "http://dx.doi.org/10.15625/1813-9663/34/4/13163"
    },
    {
        "id": 11691,
        "title": "South China Sea Conflicts Classification Using Named Entity Recognition (NER) and Part-of-Speech (POS) Tagging",
        "authors": "Nur Rafeeqkha Sulaiman, Maheyzah Md Siraj",
        "published": "2020-5-20",
        "citations": 0,
        "abstract": "Internet connects everyone to everything globally. The existence of Internet eases people in completing daily tasks. Thanks to Internet, information is being digitalized and spread openly to the public. Online news articles not only provide us with useful and reliable information and reports, it also eases information extraction and gathering for research purposes especially in Natural Language Processing (NLP) and Machine Learning (ML). The topics regarding the South China Sea have been popular lately due to the rise of conflicts between several countries claim on the islands in the sea. Gathering data through Internet and online sources proves to be easy, but to process a huge amount data and to identify only useful information manually takes a longer time to complete. Extracting important features from a text document can be done by using one or a combination of feature extraction methods. Relevant information and the classification of news articles in relation to the conflicts in South China Sea need to be done. In this paper, a model is proposed to use Named Entity Recognition (NER) that search for and classifies important information regarding to the conflicts. In order to do that, a combination of Part-of-Speech (POS) and NER are needed to extract type of conflicts from the news.  This study also claims to classify news by using Conditional Random Field (CRF) algorithm and Multinomial Naïve Bayes (MNB) as classification methods by training and testing the data. ",
        "link": "http://dx.doi.org/10.11113/ijic.v10n1.255"
    },
    {
        "id": 11692,
        "title": "T-NER: An All-Round Python Library for Transformer-based Named Entity Recognition",
        "authors": "Asahi Ushio, Jose Camacho-Collados",
        "published": "2021",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2021.eacl-demos.7"
    },
    {
        "id": 11693,
        "title": "VTCC-NER at SemEval-2023 Task 6: An Ensemble Pre-trained Language Models for Named Entity Recognition",
        "authors": "Quang-Minh Tran, Xuan-Dung Doan",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.56"
    },
    {
        "id": 11694,
        "title": "TL-NER: A Transfer Learning Model for Chinese Named Entity Recognition",
        "authors": "DunLu Peng, YinRui Wang, Cong Liu, Zhang Chen",
        "published": "2020-12",
        "citations": 21,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s10796-019-09932-y"
    },
    {
        "id": 11695,
        "title": "DeepSpacy-NER: an efficient deep learning model for named entity recognition for Punjabi language",
        "authors": "Navdeep Singh, Munish Kumar, Bavalpreet Singh, Jaskaran Singh",
        "published": "2023-8",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s12530-022-09453-1"
    },
    {
        "id": 11696,
        "title": "Rule-based Named Entity Recognition (NER) to Determine Time Expression for Balinese Text Document",
        "authors": "Ni Made Sinta Wahyuni, Ngurah Agus Sanjaya ER",
        "published": "2021-5-29",
        "citations": 1,
        "abstract": "Named Entity Recognition (NER) is a process to identify words or phrases as a named entity, such as a person, location, time expression, or organization. In this research, we are interested in developing a NER which able to identify the time expression entity in Balinese text documents. The time expression entity becomes an important component in the text because it is usually followed by important facts and information. NER was built using a rules-based approach. The rules are built based on direct observation of documents and pay attention to the morphological and contextual structures. Based on the experiments conducted, the average results of the precision, recall, and f-measure values were 0.85, 0.87, and 0.85.",
        "link": "http://dx.doi.org/10.24843/jlk.2021.v09.i04.p14"
    },
    {
        "id": 11697,
        "title": "Analisis Pola Kecelakaan Lalu Lintas Menggunakan Algoritma Decision Tree Berdasarkan Ekstraksi Informasi dari Berita Online Menggunakan Named Entity Recognition (NER)",
        "authors": "Hardi Dwi Susanto, Budi Yuniarto",
        "published": "2023-10-4",
        "citations": 0,
        "abstract": "Jalan tol sebagai jalan bebas hambatan tidak membuat jalan tol terbebas dari kecelakaan lalu lintas. Di Provinsi Jawa Barat, terdapat total 20 ruas tol dengan panjang ruas tol mencapai 521,15 km pada 2020. Tol Cipali adalah salah satu ruas dengan fatalitas tertinggi di dunia. Penanggulangan kecelakaan lalu lintas penting dilakukan sebagai upaya untuk mengurangi kejadian kecelakaan lalu lintas. Namun, data official mengenai kecelakaan lalu lintas di jalan tol oleh lembaga resmi tidak tersedia secara rinci, sehingga digunakan sumber data alternatif seperti berita online. NER dengan Bi-LSTM-CNN dimanfaatkan untuk melakukan ekstraksi data kecelakaan. Hasil dari ekstraksi berita dianalisis dengan membuat aturan keputusan untuk mengetahui pola kecelakaan yang terjadi. Aturan keputusan ini berupa decision tree dengan dataset yang menggunakan data tiga tol dengan fatalitas tertinggi dengan fitur imputasi mode by concept sebagai metode penanganan missing value dan jalan tol sebagai atribut, menghasilkan nilai f1-score sebesar 67,76% dan nilai akurasi sebesar 75,49%.",
        "link": "http://dx.doi.org/10.34123/semnasoffstat.v2023i1.1751"
    },
    {
        "id": 11698,
        "title": "Medical Named Entity Recognition Models with the Attention Distraction Mechanism",
        "authors": "Shuli Guo, Lina Han, Wentao Yang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2665-7_3"
    },
    {
        "id": 11699,
        "title": "E-NER: Evidential Deep Learning for Trustworthy Named Entity Recognition",
        "authors": "Zhen Zhang, Mengting Hu, Shiwan Zhao, Minlie Huang, Haotian Wang, Lemao Liu, Zhirui Zhang, Zhe Liu, Bingzhe Wu",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.findings-acl.103"
    },
    {
        "id": 11700,
        "title": "aeroBERT-NER: Named-Entity Recognition for Aerospace Requirements Engineering using BERT",
        "authors": "Archana Tikayat Ray, Olivia J. Pinon-Fischer, Dimitri N. Mavris, Ryan T. White, Bjorn F. Cole",
        "published": "2023-1-23",
        "citations": 8,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2514/6.2023-2583"
    },
    {
        "id": 11701,
        "title": "Medical Named Entity Recognition Modelling Based on Remote Monitoring and Denoising",
        "authors": "Shuli Guo, Lina Han, Wentao Yang",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-981-99-2665-7_5"
    },
    {
        "id": 11702,
        "title": "BCC-NER: bidirectional, contextual clues named entity tagger for gene/protein mention recognition",
        "authors": "Gurusamy Murugesan, Sabenabanu Abdulkadhar, Balu Bhasuran, Jeyakumar Natarajan",
        "published": "2017-12",
        "citations": 15,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1186/s13637-017-0060-6"
    },
    {
        "id": 11703,
        "title": "TMD-NER: Turkish multi-domain named entity recognition for informal texts",
        "authors": "Selim F. Yilmaz, Furkan B. Mutlu, Ismail Balaban, Suleyman S. Kozat",
        "published": "2024-4",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/s11760-023-02898-0"
    },
    {
        "id": 11704,
        "title": "MCA-NER: Multi-Contextualized Adversarial-Based Attentional Deep Neural Network for Named Entity Recognition",
        "authors": "Shufeng He, Peng Zhu, Yanxia Zhao, Dianqi Sun",
        "published": "2023-9-30",
        "citations": 0,
        "abstract": " Multi-contextualized representations learning is vital for named entity recognition (NER), which is a fundamental task for effectively extracting structured information from unstructured text, and forming knowledge bases. This task is particularly challenging when dealing with Chinese text given the absence of evident word boundaries. Chinese word segmentation (CWS) can be leveraged to recognize word boundaries, but named entities often encompass multiple segmented words, making it crucial to use boundary information to correctly recognize and distinguish the relationships between these words. In this paper, we propose MCA-NER, a multi-contextualized adversarial-based attentional deep learning approach for Chinese NER, which combines CWS and part-of-speech (POS) tagging information with the classic BiLSTM-CRF NER model, using adversarial multi-task learning. The model incorporates several self-attention components for adversarial and multi-task learning, effectively synthesizing task-specific and common information attribution while improving performance across all three tasks. Experimental results on the three datasets provide compelling evidence that supports the effectiveness and performance of our model. ",
        "link": "http://dx.doi.org/10.1142/s0218001423500283"
    },
    {
        "id": 11705,
        "title": "German BERT Model for Legal Named Entity Recognition",
        "authors": "Harshil Darji, Jelena Mitrović, Michael Granitzer",
        "published": "2023",
        "citations": 3,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011749400003393"
    },
    {
        "id": 11706,
        "title": "Bio-NER: Biomedical Named Entity Recognition using Rule-Based and Statistical Learners",
        "authors": "Pir Dino, Sanotsh Kumar, Banbhrani -, Arsalan Ali, Hans Raj",
        "published": "2017",
        "citations": 6,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.14569/ijacsa.2017.081220"
    },
    {
        "id": 11707,
        "title": "S-NER: A Concise and Efficient Span-Based Model for Named Entity Recognition",
        "authors": "Jie Yu, Bin Ji, Shasha Li, Jun Ma, Huijun Liu, Hao Xu",
        "published": "2022-4-8",
        "citations": 2,
        "abstract": "Named entity recognition (NER) is a task that seeks to recognize entities in raw texts and is a precondition for a series of downstream NLP tasks. Traditionally, prior NER models use the sequence labeling mechanism which requires label dependency captured by the conditional random fields (CRFs). However, these models are prone to cascade label misclassifications since a misclassified label results in incorrect label dependency, and so some following labels may also be misclassified. To address the above issue, we propose S-NER, a span-based NER model. To be specific, S-NER first splits raw texts into text spans and regards them as candidate entities; it then directly obtains the types of spans by conducting entity type classifications on span semantic representations, which eliminates the requirement for label dependency. Moreover, S-NER has a concise neural architecture in which it directly uses BERT as its encoder and a feed-forward network as its decoder. We evaluate S-NER on several benchmark datasets across three domains. Experimental results demonstrate that S-NER consistently outperforms the strongest baselines in terms of F1-score. Extensive analyses further confirm the efficacy of S-NER.",
        "link": "http://dx.doi.org/10.3390/s22082852"
    },
    {
        "id": 11708,
        "title": "D2KLab at SemEval-2023 Task 2: Leveraging T-NER to Develop a Fine-Tuned Multilingual Model for Complex Named Entity Recognition",
        "authors": "Thibault Ehrhart, Julien Plu, Raphael Troncy",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.semeval-1.115"
    },
    {
        "id": 11709,
        "title": "Named Entity Recognition Approaches and Their Comparison for Custom NER Model",
        "authors": "Hemlata Shelar, Gagandeep Kaur, Neha Heda, Poorva Agrawal",
        "published": "2020-7-2",
        "citations": 38,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1080/0194262x.2020.1759479"
    },
    {
        "id": 11710,
        "title": "Phishing Email Detection based on Named Entity Recognition",
        "authors": "Vít Listík, Šimon Let, Jan Šedivý, Václav Hlaváč",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007314202520256"
    },
    {
        "id": 11711,
        "title": "VLSP 2021 - NER Challenge: Named Entity Recognition for Vietnamese",
        "authors": "Ha My Linh, Do Duy Dao, Nguyen Thi Minh Huyen, Ngo The Quyen, Doan Xuan Dung",
        "published": "2022-6-30",
        "citations": 0,
        "abstract": "Named entities (NE) are phrases that contain the names of persons, organizations, locations, times, quantities, email, phone number, etc., in a document. Named Entity Recognition (NER) is a fundamental task that is useful in many applications, especially in information extraction and question answering. Shared tasks on NER provides several reference datasets in many languages. In the 2016 and 2018 editions of the VLSP workshop series, reference NER datasets have been published with only three main entity categories: person, organization and location. At the VLSP 2021 workshop, another challenge on NER is organized for dealing with an extended set of 14 main entity types and 26 sub-entity types. This paper describes the published datasets and the evaluated systems in the framework of the VLSP 2021 evaluation campaign.",
        "link": "http://dx.doi.org/10.25073/2588-1086/vnucsce.362"
    },
    {
        "id": 11712,
        "title": "NER-MQMRC: Formulating Named Entity Recognition as Multi Question Machine Reading Comprehension",
        "authors": "Anubhav Shrimal, Avi Jain, Kartik Mehta, Promod Yenigalla",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.naacl-industry.26"
    },
    {
        "id": 11713,
        "title": "B-NER: A Novel Bangla Named Entity Recognition Dataset With Largest Entities and Its Baseline Evaluation",
        "authors": "Md. Zahidul Haque, Sakib Zaman, Jillur Rahman Saurav, Summit Haque, Md. Saiful Islam, Mohammad Ruhul Amin",
        "published": "2023",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1109/access.2023.3267746"
    },
    {
        "id": 11714,
        "title": "ROSE-NER: Robust Semi-supervised Named Entity Recognition on Insufficient Labeled Data",
        "authors": "Haiyan Chen, Shuwei Yuan, Xiang Zhang",
        "published": "2021-12-6",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3502223.3502228"
    },
    {
        "id": 11715,
        "title": "Chinese Named Entity Recognition Based on Bi-directional Quasi-Recurrent Neural Networks improved with BERT",
        "authors": "Kang Liu, Qingsong Yu, Shanhao Zhong",
        "published": "2021-3-5",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1145/3461353.3461380"
    },
    {
        "id": 11716,
        "title": "Tagger: BeCalm API for rapid named entity recognition",
        "authors": "Lars Juhl Jensen",
        "published": "No Date",
        "citations": 2,
        "abstract": "AbstractMost BioCreative tasks to date have focused on assessing the quality of text-mining annotations in terms of precision of recall. Interoperability, speed, and stability are, however, other important factors to consider for practical applications of text mining. The new BioCreative/BeCalm TIPS task focuses purely on these. To participate in this task, I implemented a BeCalm API within the real-time tagging server also used by the Reflect and EXTRACT tools. In addition to retrieval of patent abstracts, PubMed abstracts, and Pub-Med Central open-access articles as required in the TIPS task, the BeCalm API implementation facilitates retrieval of documents from other sources specified as custom request parameters. As in earlier tests, the tagger proved to be both highly efficient and stable, being able to consistently process requests of 5000 abstracts in less than half a minute including retrieval of the document text.",
        "link": "http://dx.doi.org/10.1101/115022"
    },
    {
        "id": 11717,
        "title": "Active learning for Named Entity Recognition in Kannada",
        "authors": "Aparna M, Srinath Srinivasa",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Named Entity Recognition (NER) task aims at automatically recognising and classifying named entities in a given natural language input. Majority of the studies related to Named Entity Recognition are focused on English language. Named Entity Recognition in Indian languages is challenging due to the complex grammar and morphology of Indian languages and the scarcity of good quality labelled data. The dissimilarity between the literary and spoken versions of these languages is also a big challenge regarding usability of NER models. Kannada is such an Indian language for which the task of NER is still an active area of research. Usage of Deep learning, especially Transfer learning using Transformer models has drastically improved performance of many NLP tasks at scale. However, Transfer learning still requires considerable amount of data for the required task. In case of low resource language like Kannada, very few labelled datasets are available publicly and creating one from scratch is expensive in terms of time and labor. Active learning (AL) aims to tackle the labelled data acquisition problem by having the learning model and an Oracle to cooperate. Active Learning iteratively builds an optimally labelled and sufficiently large dataset.  This study focuses on Named Entity Recognition in Kannada language. We explore the application of Active Learning technique to Named Entity Recognition problem in the low-resource language Kannada. Results show that AL can be used to boost a multilingual models performance in fine-tuning for NER. We also try to mitigate the gap between formal and colloquial dialects of Kannada in NER datasets.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24580582.v1"
    },
    {
        "id": 11718,
        "title": "Active learning for Named Entity Recognition in Kannada",
        "authors": "Aparna M, Srinath Srinivasa",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Named Entity Recognition (NER) task aims at automatically recognising and classifying named entities in a given natural language input. Majority of the studies related to Named Entity Recognition are focused on English language. Named Entity Recognition in Indian languages is challenging due to the complex grammar and morphology of Indian languages and the scarcity of good quality labelled data. The dissimilarity between the literary and spoken versions of these languages is also a big challenge regarding usability of NER models. Kannada is such an Indian language for which the task of NER is still an active area of research. Usage of Deep learning, especially Transfer learning using Transformer models has drastically improved performance of many NLP tasks at scale. However, Transfer learning still requires considerable amount of data for the required task. In case of low resource language like Kannada, very few labelled datasets are available publicly and creating one from scratch is expensive in terms of time and labor. Active learning (AL) aims to tackle the labelled data acquisition problem by having the learning model and an Oracle to cooperate. Active Learning iteratively builds an optimally labelled and sufficiently large dataset.  This study focuses on Named Entity Recognition in Kannada language. We explore the application of Active Learning technique to Named Entity Recognition problem in the low-resource language Kannada. Results show that AL can be used to boost a multilingual models performance in fine-tuning for NER. We also try to mitigate the gap between formal and colloquial dialects of Kannada in NER datasets.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.24580582"
    },
    {
        "id": 11719,
        "title": "FoodIE: A Rule-based Named-entity Recognition Method for Food Information Extraction",
        "authors": "Gorjan Popovski, Stefan Kochev, Barbara Seljak, Tome Eftimov",
        "published": "2019",
        "citations": 29,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0007686309150922"
    },
    {
        "id": 11720,
        "title": "Biomedical Named Entity Recognition - a swift review",
        "authors": "S. Vijaya,  ",
        "published": "2017-6-1",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18535/ijecs/v6i5.57"
    },
    {
        "id": 11721,
        "title": "Responsive Chatbot Using Named Entity Recognition and Cosine Similarity",
        "authors": "Entin Kusumaningtyas, Ekky Laurentino, Ali Barakbah",
        "published": "2022",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0011756300003575"
    },
    {
        "id": 11722,
        "title": "MCL-NER: Cross-Lingual Named Entity Recognition via Multi-View Contrastive Learning",
        "authors": "Ying Mo, Jian Yang, Jiahao Liu, Qifan Wang, Ruoyu Chen, Jingang Wang, Zhoujun Li",
        "published": "2024-3-24",
        "citations": 0,
        "abstract": "Cross-lingual named entity recognition (CrossNER) faces challenges stemming from uneven performance due to the scarcity of multilingual corpora, especially for non-English\ndata. While prior efforts mainly focus on data-driven transfer methods, a significant aspect that has not been fully explored is aligning both semantic and token-level representations across diverse languages. In this paper, we propose Multi-view Contrastive Learning for Cross-lingual Named\nEntity Recognition (MCL-NER). Specifically, we reframe the CrossNER task into a problem of recognizing relationships between pairs of tokens. This approach taps into the\ninherent contextual nuances of token-to-token connections within entities, allowing us to align representations across\ndifferent languages. A multi-view contrastive learning framework is introduced to encompass semantic contrasts between\nsource, codeswitched, and target sentences, as well as contrasts among token-to-token relations. By enforcing agreement within both semantic and relational spaces, we minimize the gap between source sentences and their counterparts of both codeswitched and target sentences. This alignment\nextends to the relationships between diverse tokens, enhancing the projection of entities across languages. We further\naugment CrossNER by combining self-training with labeled source data and unlabeled target data. Our experiments on\nthe XTREME benchmark, spanning 40 languages, demonstrate the superiority of MCL-NER over prior data-driven\nand model-based approaches. It achieves a substantial increase of nearly +2.0 F1 scores across a broad spectrum and\nestablishes itself as the new state-of-the-art performer.",
        "link": "http://dx.doi.org/10.1609/aaai.v38i17.29843"
    },
    {
        "id": 11723,
        "title": "Neural Named Entity Recognition from Subword Units",
        "authors": "Abdalghani Abujabal, Judith Gaspers",
        "published": "2019-9-15",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.21437/interspeech.2019-1305"
    },
    {
        "id": 11724,
        "title": "NER - VLSP 2021: A Span-Based Model for Named Entity Recognition Task with Co-teaching+ Training Strategy",
        "authors": "Pham Hoai Phu Thinh, Vu Tran Duy, Do Tran Anh Duc",
        "published": "2022-6-30",
        "citations": 0,
        "abstract": "Named entities containing other named entities inside are referred to as nested entities, which commonly exist in news articles and other documents. However, most studies in the field of Vietnamese named entity recognition entirely ignore nested entities. In this report, we describe our system at VLSP 2021 evaluation campaign, adopting the technique from dependency parsing to tackle the problem of nested entities. We also apply Coteaching+ technique to enhance the overall performance and propose an ensemble algorithm to combine predictions. Experimental results show that the ensemble method achieves the best F1 score on the test set at VLSP 2021.",
        "link": "http://dx.doi.org/10.25073/2588-1086/vnucsce.328"
    },
    {
        "id": 11725,
        "title": "Emerging Named Entity Recognition in a Medical Knowledge Management Ecosystem",
        "authors": "Christian Nawroth, Felix Engel, Matthias Hemmje",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010061200290041"
    },
    {
        "id": 11726,
        "title": "Towards reliable named entity recognition in the biomedical domain",
        "authors": "John Giorgi, Gary Bader",
        "published": "No Date",
        "citations": 2,
        "abstract": "Motivation: Automatic biomedical named entity recognition (BioNER) is a key task in biomedical information extraction (IE). For some time, state-of-the-art BioNER has been dominated by machine learning methods, particularly conditional random fields (CRFs), with a recent focus on deep learning. However, recent work has suggested that the high performance of CRFs for BioNER may not generalize to corpora other than the one it was trained on. In our analysis, we find that a popular deep learning-based approach to BioNER, known as bidirectional long short-term memory network-conditional random field (BiLSTM-CRF), is correspondingly poor at generalizing - often dramatically overfitting the corpus it was trained on. To address this, we evaluate three modifications of BiLSTM-CRF for BioNER to alleviate overfitting and improve generalization: improved regularization via variational dropout, transfer learning, and multi-task learning.\nResults: We measure the effect that each strategy has when training/testing on the same corpus (\"in-corpus\" performance) and when training on one corpus and evaluating on another (\"out-of-corpus\" performance), our measure of the models ability to generalize. We found that variational dropout improves out-of-corpus performance by an average of 4.62%, transfer learning by 6.48% and multi-task learning by 8.42%. The maximal increase we identified combines multi-task learning and variational dropout, which boosts out-of-corpus performance by 10.75%. Furthermore, we make available a new open-source tool, called Saber, that implements our best BioNER models.\nAvailability: Source code for our biomedical IE tool is available at https://github.com/BaderLab/saber. Corpora and other resources used in this study are available at https://github.com/BaderLab/Towards- reliable-BioNER.",
        "link": "http://dx.doi.org/10.1101/526244"
    },
    {
        "id": 11727,
        "title": "Proactive Learning for Named Entity Recognition",
        "authors": "Maolin Li, Nhung Nguyen, Sophia Ananiadou",
        "published": "2017",
        "citations": 12,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/w17-2314"
    },
    {
        "id": 11728,
        "title": "Conditional Random Fields for Biomedical Named Entity Recognition Revisited",
        "authors": "Xie-Yuan Xie",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nNamed Entity Recognition (NER) is a key task which automatically extracts Named Entities (NE) from the text. Names of persons, places, date and time are examples of NEs. We are applying Conditional Random Fields (CRFs) for NER in biomedical domain. Examples of NEs in biomedical texts are gene, proteins. We used a minimal set of features to train CRF algorithm and obtained a good results for biomedical texts.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-36431/v1"
    },
    {
        "id": 11729,
        "title": "Chemical Named Entity Recognition with Deep Contextualized Neural Embeddings",
        "authors": "Zainab Awan, Tim Kahlke, Peter Ralph, Paul Kennedy",
        "published": "2019",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008163501350144"
    },
    {
        "id": 11730,
        "title": "SLBERT: An Improved FLAT-BERT for Named Entity Recognition",
        "authors": "Yuefan Fei, Xiaolong Xu",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4266054"
    },
    {
        "id": 11731,
        "title": "Customer Satisfaction With a Named Entity Recognition (NER) Store-Based Management System Using Computer-Mediated Communication",
        "authors": "Le Thi Hong Vo, Thien Tuan Hang, Ayman Youssef Nassif",
        "published": "2023-3-17",
        "citations": 0,
        "abstract": "With the rise of the popularity of e-commerce, it is evident that the service retail industries aim to reduce inventory and increase sales and profit margins. To achieve this, it is of paramount importance to establish excellent and effective interaction between customers and customer support.  When a customer orders a product online, it is essential that the store demonstrates whether the products are in stock and the nearest stores to where the customers are.  Currently, the needs of the customers are unlikely to be effectively met.  Hence, the stores are unlikely to provide desirable products to customers even with high inventory. This paper investigates this issue at a typical and popular retail store in Vietnam. The authors present an investigation of this issue through two main stages. Corpus analysis for a set of collected text messages posted on the stores' websites for customer support was first carried out to explore the lexical patterns that indicate the customers' needs.  This analysis revealed the frequency of customers' requests for the stores' locations where they can buy the goods and/or whether they are in stock. In the second stage of the investigation, the valuable findings from the corpus analysis were used for data extraction based on Named Entity Recognition (NER) software. The NER recognizes entities, including locations and names.",
        "link": "http://dx.doi.org/10.4018/978-1-6684-7034-3.ch013"
    },
    {
        "id": 11732,
        "title": "Why Aren’t We NER Yet? Artifacts of ASR Errors in Named Entity Recognition in Spontaneous Speech Transcripts",
        "authors": "Piotr Szymański, Lukasz Augustyniak, Mikolaj Morzy, Adrian Szymczak, Krzysztof Surdyk, Piotr Żelasko",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2023.acl-long.98"
    },
    {
        "id": 11733,
        "title": "LADA-Trans-NER: Adaptive Efficient Transformer for Chinese Named Entity Recognition Using Lexicon-Attention and Data-Augmentation",
        "authors": "Jiguo Liu, Chao Liu, Nan Li, Shihao Gao, Mingqi Liu, Dali Zhu",
        "published": "2023-6-26",
        "citations": 1,
        "abstract": "Recently, word enhancement has become very popular for Chinese Named Entity Recognition (NER), reducing segmentation errors and increasing the semantic and boundary information of Chinese words. However, these methods tend to ignore the semantic relationship before and after the sentence after integrating lexical information. Therefore, the regularity of word length information has not been fully explored in various word-character fusion methods. In this work, we propose a Lexicon-Attention and Data-Augmentation (LADA) method for Chinese NER. We discuss the challenges of using existing methods in incorporating word information for NER and show how our proposed methods could be leveraged to overcome those challenges. LADA is based on a Transformer Encoder that utilizes lexicon to construct a directed graph and fuses word information through updating the optimal edge of the graph. Specially, we introduce the advanced data augmentation method to obtain the optimal representation for the NER task. Experimental results show that the augmentation done using LADA can considerably boost the performance of our NER system and achieve significantly better results than previous state-of-the-art methods and variant models in the literature on four publicly available NER datasets, namely Resume, MSRA, Weibo, and OntoNotes v4. We also observe better generalization and application to a real-world setting from LADA on multi-source complex entities.",
        "link": "http://dx.doi.org/10.1609/aaai.v37i11.26554"
    },
    {
        "id": 11734,
        "title": "Developing classification-based named entity recognizers (NER) for Sambalpuri and Odia applying support vector machines (SVM)",
        "authors": "Pitambar Behera, Sharmin Muzaffar",
        "published": "2018-11-1",
        "citations": 1,
        "abstract": "This paper demonstrates the development of named Entity Recognizers (NER) applying Support Vector Machines (SVM) for Sambalpuri and Odia. The Sambalpuri corpus amounts to 112k word tokens out of which 5,887 are named entities. On the contrary, 250k ILCI corpus has been applied for Odia out of which 18,447 tokens are named entities. The former accurately recognizes 96.72% whereas the latter provides 98.10% accuracy.",
        "link": "http://dx.doi.org/10.3126/nl.v33i1.41066"
    },
    {
        "id": 11735,
        "title": "Anyuak Language Named Entity Recognition Using Deep Learning Approach",
        "authors": "Birhanu Gardie,  , Smegnew Asemie, Kassahun Azezew",
        "published": "2021-9-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17485/ijst/v14i39.1163"
    },
    {
        "id": 11736,
        "title": "Crowdsourcing Named Entity Recognition and Entity Linking Corpora",
        "authors": "Kalina Bontcheva, Leon Derczynski, Ian Roberts",
        "published": "2017",
        "citations": 11,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-94-024-0881-2_32"
    },
    {
        "id": 11737,
        "title": "Comparison of Word Embedding Techniques in Text Classification Using Named Entity Recognition",
        "authors": "Güncel Sarıman",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4605930"
    },
    {
        "id": 11738,
        "title": "<scp>NER‐RAKE</scp>: An improved rapid automatic keyword extraction method for scientific literatures based on named entity recognition",
        "authors": "Han Huang, Xiaoguang Wang, Hongyu Wang",
        "published": "2020-10",
        "citations": 9,
        "abstract": "AbstractThe proposing of an accurate and efficient model for automatic keyword extraction of scientific literature is conducive to promoting the development of academic text mining research, such as literature retrieval optimization, research topic discovery, topic evolution analysis, emerging trend detection and so on, with the continuous expansion of digital academic resources. A keyword extraction method is proposed called NER‐RAKE which combines Named Entity Recognition (NER) process with Rapid automatic keyword extraction (RAKE), Bidirectional Long Short‐Term Memory Network Conditional Random Field (BiLSTM‐CRF) is used to recognize the domain entities in the scientific literature so as to enrich the list of candidate keywords divided by RAKE, and the frequency threshold is set to ensure the validity of candidate keywords. NER‐RAKE is better than RAKE in accuracy and recall rate through the keyword extraction experiment in the computer science field. It is effective to combine the process of NER with RAKE, which can improve the efficiency of keyword extraction.",
        "link": "http://dx.doi.org/10.1002/pra2.374"
    },
    {
        "id": 11739,
        "title": "Model-Based Design of User Story Using Named Entity Recognition (NER)",
        "authors": " Aszani, Sri Mulyana",
        "published": "2023",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-031-50327-6_15"
    },
    {
        "id": 11740,
        "title": "Named Entity Recognition (NER) in Low Resource Languages of Ho",
        "authors": "Satya Ranjan Dash, Bikram Biruli, Yasobanta Das, Prosper Abel Mgimwa, Muhammed Abdur Rahmaan Kamaldeen, Aloka Fernando",
        "published": "2024-2-27",
        "citations": 0,
        "abstract": "The Ho tribe is an indigenous community that primarily inhabits the Indian states of Odisha, Jharkhand, West Bengal, Assam, and Chhattisgarh. The Ho language, which belongs to the Austroasiatic language of Munda family, is their primary means of communication. Warang Chiti is the script for writing Ho language. Creating user-friendly tools, applications, and resources that support Ho language users in various aspects, such as typing, spell-checking, dictionary lookup, text conversion between UNICODE and 8-bit encodings, speech-to-text, and text-to-speech translation, this chapter discusses data augmentation techniques, transfer learning methods, domain adaptation strategies, and the importance of resource creation. It also emphasizes the need for collaborative efforts and community-driven initiatives to advance NER research in low resource language settings.",
        "link": "http://dx.doi.org/10.4018/979-8-3693-0728-1.ch008"
    },
    {
        "id": 11741,
        "title": "Named-Entity-Recognition (NER) for Tamil Language Using Margin-Infused Relaxed Algorithm (MIRA)",
        "authors": "Pranavan Theivendiram, Megala Uthayakumar, Nilusija Nadarasamoorthy, Mokanarangan Thayaparan, Sanath Jayasena, Gihan Dias, Surangika Ranathunga",
        "published": "2018",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.1007/978-3-319-75477-2_33"
    },
    {
        "id": 11742,
        "title": "Named Entity Recognition for Sheko Language Using Bidirectional LSTM",
        "authors": "Desalegn Ashebir,  , Prabhakar Gantela",
        "published": "2022-6-21",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17485/ijst/v15i23.642"
    },
    {
        "id": 11743,
        "title": "Using Domain Knowledge for Low Resource Named Entity Recognition",
        "authors": "Yuan Shi",
        "published": "2022-3-26",
        "citations": 0,
        "abstract": "In recent years, named entity recognition has always been a popular research in the field of natural language processing, while traditional deep learning methods require a large amount of labeled data for model training, which makes them not suitable for areas where labeling resources are scarce. In addition, the existing cross-domain knowledge transfer methods need to adjust the entity labels for different fields, so as to increase the training cost.  To solve these problems, enlightened by a processing method of Chinese named entity recognition, we propose to use domain knowledge to improve the performance of named entity recognition in areas with low resources. The domain knowledge mainly applied by us is domain dictionary and domain labeled data. We use dictionary information for each word to strengthen its word embedding and domain labeled data to reinforce the recognition effect. The proposed model avoids large-scale data adjustments in different domains while handling named entities recognition with low resources. Experiments demonstrate the effectiveness of our method, which has achieved impressive results on the data set in the field of scientific and technological equipment, and the F1 score has been significantly improved compared with many other baseline methods.",
        "link": "http://dx.doi.org/10.5121/csit.2022.120625"
    },
    {
        "id": 11744,
        "title": "Evaluating Named-Entity Recognition approaches in plant molecular biology",
        "authors": "Huy Do, Khoat Than, Pierre Larmande",
        "published": "No Date",
        "citations": 4,
        "abstract": "AbstractText mining research is becoming an important topic in biology with the aim to extract biological entities from scientific papers in order to extend the biological knowledge. However, few thorough studies on text mining and applications are developed for plant molecular biology data, especially rice, thus resulting a lack of datasets available to train models able to detect entities such as genes, proteins and phenotypic traits. Since there is rare benchmarks for rice, we have to face various difficulties in exploiting advanced machine learning methods for accurate analysis of rice bibliography. In this article, we developed a new training datasets (Oryzabase) as the benchmark. Then, we evaluated the performance of several current approaches to find a methodology with the best results and assigned it as the state of the art method for our own technique in the future. We applied Name Entities Recognition (NER) tagger, which is built from a Long Short Term Memory (LSTM) model, and combined with Conditional Random Fields (CRFs) to extract information of rice genes and proteins. We analyzed the performance of LSTM-CRF when applying to the Oryzabase dataset and improved the results up to 86% in F1. We found that on average, the result from LSTM-CRF is more exploitable with the new benchmark.",
        "link": "http://dx.doi.org/10.1101/360966"
    },
    {
        "id": 11745,
        "title": "Chinese Named Entity Recognition based on Knowledge-Based Question",
        "authors": "Arvind Chandrasekaran",
        "published": "2023-10-28",
        "citations": 0,
        "abstract": "The knowledge-Based Question Answering (KBQA) system is an essential part of the customer service system aiming to answer natural language questions by recovering the structured data stored under the knowledge base. KBQA answers the natural language questions by recovering the structured data stored under the knowledge base.KBQA receives the user’s query and first needs to recognize the topic for the query entities like the location, name,organization, etc., The process is Named Entity Recognition (NER) using the Bidirectional Long Short-Term Memory Conditional Random Field model, and the SoftLexicon method is introduced as the Chinese NER tasks. A fuzzy matching module is proposed to analyze the application scenario characteristics using multiple methods. The module efficiently modifies the error recognition results, improving entity recognition performance. The fuzzy matching and the NER model are combined into the NER system. The power grid-related original data is collected to improvise the system following the power grid data characteristics.",
        "link": "http://dx.doi.org/10.5121/csit.2023.131910"
    },
    {
        "id": 11746,
        "title": "Recent Advance in Semi-Supervised Learning for Named Entity Recognition and Potential Clinical Applications",
        "authors": "Chengjing Luo",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Named entity recognition (NER) is an important task for clinical knowledge discovery from electronic health records (EHRs). However, to protect the patient privacy, we want to minimizethe annotation needs for NER system development. Therefore, advanced semi-supervised learning algorithms are required. In this paper, we reviewed the recent advance in semi-supervised learning for named entity recognition and discussed the possibility of application in the clinical NER system. We hope our discussions help the development or improvementfor the clinical NER applications for other researchers.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21406224"
    },
    {
        "id": 11747,
        "title": "Python Source Code Vulnerability Detection with Named Entity Recognition",
        "authors": "Melanie Ehrenberg, Shahram Sarkani, Thomas Mazzuchi",
        "published": "No Date",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.2139/ssrn.4582919"
    },
    {
        "id": 11748,
        "title": "RULE BASED KANNADA NAMED ENTITY RECOGNITION",
        "authors": "",
        "published": "2020-2-1",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31838/jcr.07.04.47"
    },
    {
        "id": 11749,
        "title": "Peer Review #1 of \"Comparing general and specialized word embeddings for biomedical named entity recognition (v0.1)\"",
        "authors": "",
        "published": "2021-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.384v0.1/reviews/1"
    },
    {
        "id": 11750,
        "title": "Peer Review #3 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.2)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.2/reviews/3"
    },
    {
        "id": 11751,
        "title": "Peer Review #3 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.3)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.3/reviews/3"
    },
    {
        "id": 11752,
        "title": "Afan-Oromo Named Entity Recognition Using Bidirectional RNN",
        "authors": "Birhanu Gardie,  , Zemedkun Solomon",
        "published": "2022-4-27",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.17485/ijst/v15i16.123"
    },
    {
        "id": 11753,
        "title": "Recent Advance in Semi-Supervised Learning for Named Entity Recognition and Potential Clinical Applications",
        "authors": "Chengjing Luo",
        "published": "No Date",
        "citations": 0,
        "abstract": "<p>Named entity recognition (NER) is an important task for clinical knowledge discovery from electronic health records (EHRs). However, to protect the patient privacy, we want to minimizethe annotation needs for NER system development. Therefore, advanced semi-supervised learning algorithms are required. In this paper, we reviewed the recent advance in semi-supervised learning for named entity recognition and discussed the possibility of application in the clinical NER system. We hope our discussions help the development or improvementfor the clinical NER applications for other researchers.</p>",
        "link": "http://dx.doi.org/10.36227/techrxiv.21406224.v1"
    },
    {
        "id": 11754,
        "title": "Namescape: Named Entity Recognition from a Literary Perspective",
        "authors": "",
        "published": "2017-12-28",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5334/bbi.30"
    },
    {
        "id": 11755,
        "title": "Peer Review #2 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.3)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.3/reviews/2"
    },
    {
        "id": 11756,
        "title": "Peer Review #1 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.3)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.3/reviews/1"
    },
    {
        "id": 11757,
        "title": "Peer Review #1 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.2)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.2/reviews/1"
    },
    {
        "id": 11758,
        "title": "Chinese medical named entity recognition of long text based on deep learning",
        "authors": "Zhang Feng",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nIn the era of information technology, the electronic medical system generates vast and diverse data on a daily basis. Maximizing the utilization of this data will have a profound impact on clinical decision-making and public health. Currently, named entity recognition technology has reached maturity in the field of English. However, due to the scarcity of corpus and the complexity of semantic boundary recognition, Chinese named entity recognition remains an area that warrants further research efforts. Based on the classical model of ALBERT-BiLSTM-Self-Attention-CRF, we propose a named entity recognition model named DWI-Pos which integrates the Pos (position information) of entity words and the features of POS (part of speech), and use a DWI (Dynamic Windows Interception mechanism). Subsequently, two comparative experiments were conducted on the BERT-CRF and LSTM-CRF models, and their effectiveness was validated by the results obtained. Furthermore, the entity word position information designed in this study played a significant role in improving the performance of the proposed model. The dataset employed in this study was derived from the sub-tasks of CCKS2019, which includes named entity recognition of Chinese electronic medical records. This task encompasses two sub-tasks, namely medical named entity recognition and medical entity and attribute extraction. The focus of this research was on medical named entity recognition, where the achieved F1 value was 0.95, surpassing the F1 value of the ELMo-ET-CRF model by 0.09.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-2796269/v1"
    },
    {
        "id": 11759,
        "title": "Myanmar Named Entity Recognition with Hidden Markov Model",
        "authors": "Khin Khin Lay,  , Aung Cho",
        "published": "2019-6-30",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.31142/ijtsrd24012"
    },
    {
        "id": 11760,
        "title": "Quantifying the Significance of Cybersecurity Text through Semantic Similarity and Named Entity Recognition",
        "authors": "Otgonpurev Mendsaikhan, Hirokazu Hasegawa, Yamaguchi Yukiko, Hajime Shimada",
        "published": "2020",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0008913003250332"
    },
    {
        "id": 11761,
        "title": "Peer Review #2 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.2)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.2/reviews/2"
    },
    {
        "id": 11762,
        "title": "Peer Review #3 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.1)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.1/reviews/3"
    },
    {
        "id": 11763,
        "title": "Peer Review #2 of \"Comparing general and specialized word embeddings for biomedical named entity recognition (v0.1)\"",
        "authors": "",
        "published": "2021-2-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.384v0.1/reviews/2"
    },
    {
        "id": 11764,
        "title": "SatelliteNER: An Effective Named Entity Recognition Model for the Satellite Domain",
        "authors": "Omid Jafari, Parth Nagarkar, Bhagwan Thatte, Carl Ingram",
        "published": "2020",
        "citations": 4,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010147401000107"
    },
    {
        "id": 11765,
        "title": "Peer Review #1 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.1)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.1/reviews/1"
    },
    {
        "id": 11766,
        "title": "Peer Review #2 of \"Evaluating named entity recognition tools for extracting social networks from novels (v0.1)\"",
        "authors": "",
        "published": "2019-4-18",
        "citations": 0,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.7287/peerj-cs.189v0.1/reviews/2"
    },
    {
        "id": 11767,
        "title": "A Levitated Control Attention for Named Entity Recognition",
        "authors": "Rong Huang, YanPing Chen, Ruizhang Huang",
        "published": "No Date",
        "citations": 0,
        "abstract": "Abstract\nControlled attention is a mechanism developed in cognitive neuroscience. It has been successfully applied to support named entity recognition, where the start and end boundaries of a possible named entity are marked by two specific tokens to indicate its position in a sentence. Then, it is fed into a deep network for classification. The entity boundary markers enable a deep neural network to be aware of entity boundaries and to build the contextual dependency of a sentence relevant to a possible named entity. The problem is that every possible named entity should be evaluated independently. This leads to very high computational complexity and cannot construct the semantic dependency between different named entities. In this paper, a levitated control attention mechanism is presented for named entity recognition. The levitated control attention is composed of a separable matrix, which enables the weighting of discriminative contextual features relevant to each specific entity. All possible named entities are together fed into a deep network for one-pass classification, which can establish the semantic dependency between contextual features and possible named entities. The levitated control attention is evaluated on four public datasets. Experiments show that it not only considerably reduces the computational complexity but also improves performance.",
        "link": "http://dx.doi.org/10.21203/rs.3.rs-3814586/v1"
    },
    {
        "id": 11768,
        "title": "Myanmar named entity corpus and its use in syllable-based neural named entity recognition",
        "authors": "Hsu Myat Mo, Khin Mar Soe",
        "published": "2020-4-1",
        "citations": 1,
        "abstract": "Myanmar language is a low-resource language and this is one of the main reasons why Myanmar Natural Language Processing lagged behind compared to other languages. Currently, there is no publicly available named entity corpus for Myanmar language. As part of this work, a very first manually annotated Named Entity tagged corpus for Myanmar language was developed and proposed to support the evaluation of named entity extraction. At present, our named entity corpus contains approximately 170,000 name entities and 60,000 sentences. This work also contributes the first evaluation of various deep neural network architectures on Myanmar Named Entity Recognition. Experimental results of the 10-fold cross validation revealed that syllable-based neural sequence models without additional feature engineering can give better results compared to baseline CRF model. This work also aims to discover the effectiveness of neural network approaches to textual processing for Myanmar language as well as to promote future research works on this understudied language.",
        "link": "http://dx.doi.org/10.11591/ijece.v10i2.pp1544-1551"
    },
    {
        "id": 11769,
        "title": "SetGNER: General Named Entity Recognition as Entity Set Generation",
        "authors": "Yuxin He, Buzhou Tang",
        "published": "2022",
        "citations": 2,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.18653/v1/2022.emnlp-main.200"
    },
    {
        "id": 11770,
        "title": "Assessing the Effectiveness of Multilingual Transformer-based Text Embeddings for Named Entity Recognition in Portuguese",
        "authors": "Diego Santos, Frederico Dutra, Fernando Parreiras, Wladmir Brandão",
        "published": "2021",
        "citations": 1,
        "abstract": "No Abstract or Keywords available",
        "link": "http://dx.doi.org/10.5220/0010443204730483"
    }
]